     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : CLEARD                                     *
     A*    PROGRAM NAME : 上線前清檔                               *
     A*    AUTHOR       : A1034   STEPHANIE                          *
     A*    CREATE DATE  : 1992.11.25                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 泛太總帳                                 *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(GLFLIB/GLRF)
     A                                      PRINT
     A          R DSPD1
     A                                      CA03(03)
     A  98                                  FRCDTA
     A  98                                  LOCK
     A                                  1  2'<CLEAR.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 70EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 28'總帳系統上線前檔案整理'
     A                                      DSPATR(RI)
     A                                  6 25'01.傳票資料'
     A                                  8 25'02.資料設定'
     A                                  8 39'傳票資料'
     A                                 10 25'03.基本資料'
     A                                 10 39'資料設定'
     A                                 10 50'傳票資料'
     A                                 12 25'04.支援系統'
     A                                 12 39'基本資料'
     A                                 12 50'資料設定'
     A                                 12 61'傳票資料'
     A                                 14 25'05.預算資料'
     A*
     A                                 20 33'請輸入選擇項目:'
     A            DOPID          2A  B 20 51DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      VALUES('01' '02' '03' '04' '05')
     A  98        ERR1          70A  O 22  2MSGID(UPT 2130 PTMF)
     A                                      DSPATR(HI BL)
     A  97        ERR2          70A  O 22  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A                                 23  3'執行'
     A                                 23 11'PF3 =回主畫面'
     A                                 24 67'【泛太資訊】'
