     A                                      REF(GAWF04)
     A          R PH1                       SKIPB(2)
     A            #B03      R              1REFFLD(#B03 PTRF)
     A                                      SPACEA(2)
     A                                     1'傳票流水編號檢核表'
     A                                      SPACEA(2)
     A                                    46'日期:'
     A            PDATE          6  0     54EDTCDE(Y)
     A                                    63'頁次:'
     A                                    71PAGNBR
     A                                      EDTCDE(4)
     A                                      SPACEA(1)
     A                                    46'時間:'
     A                                    54TIME
     A                                      EDTWRD('  :  :  ')
     A                                    65'<GAR103P>'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'公司'
     A                                    11'傳票日期'
     A                                    30'傳票號碼ＡＨ'
     A                                    60'傳票流水號ＡＢ'
     A                                      SPACEA(1)
     A                                     1'------------------------------+
     A                                       ------------------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A          R PD1                       SPACEA(1)
     A            WF0401    R              2
     A            WF0402    R             11
     A                                      EDTWRD('    /  /  ')
     A            WF0403    R             35EDTCDE(1)
     A            WF0404    R             65EDTCDE(1)
     A*
     A          R PT1                       SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ===================='
     A*
     A          R PE9                       SPACEA(1)
     A                                    16'無符合列印範圍之資料'
