     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : GAR301P                                    *
     A*    AUTHOR       : MERCURY                                    *
     A*    CREATE DATE  : 83/01/19                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : GAR301                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :總帳系統                                  *
     A*    REMARK       :會計期間列印                              *
     A****************************************************************
     A                                      REF(GLRF)
     A          R PH1                       SKIPB(2)
     A                                    26MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    33'會計期間列印'
     A                                      SPACEA(1)
     A                                     1'公司別:'
     A            DAC01S    R        O    13REFFLD(AC01)
     A                                    17'-'
     A            DAC01E    R        O    19REFFLD(AC01)
     A                                    54'日期:'
     A            $EGMDY         6  0O    62EDTCDE(Y)
     A                                    70'頁次:'
     A                                    78PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'年　度:'
     A            DAC02S         4   O    13
     A                                    19'-'
     A            DAC02E         4   O    21
     A                                    54'時間:'
     A                                    62TIME
     A                                      SPACEA(1)
     A                                     1'公司別:'
     A            AC01      R        O    13REFFLD(AC01)
     A            #B02      R        O    20REFFLD(#B02 PTRF)
     A                                    54' USER :'
     A            $USER         10   O    62
     A                                    72'<GAR301>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======================'
     A                                      SPACEA(1)
     A                                     1'年度　　　　－－－期+
     A                                       　　間－－－　　結帳+
     A                                       　　　　　　－－－期+
                                             　　間－－－　　結帳'
     A                                      SPACEA(1)
     A                                     1'　　　期間　'
     A                                    16'起　　－　　訖'
     A                                    37'(Y/  )'
     A                                    47'期間'
     A                                    56'起　　－　　訖'
     A                                    77'(Y/  )'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ----------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            AC02      R              2
     A                                     8'01'
     A            D01S           6  0     13EDTWRD('  /  /  ')
     A            D01E           6  0     25EDTWRD('  /  /  ')
     A            AC03      R             39
     A                                    48'02'
     A            D02S           6  0     53
     A                                      EDTWRD('  /  /  ')
     A            D02E           6  0     65EDTWRD('  /  /  ')
     A            AC04      R             79
     A                                      SPACEA(1)
     A*****
     A                                     8'03'
     A            D03S           6  0     13
     A                                      EDTWRD('  /  /  ')
     A            D03E           6  0     25EDTWRD('  /  /  ')
     A            AC05      R             39
     A                                    48'04'
     A            D04S           6  0     53
     A                                      EDTWRD('  /  /  ')
     A            D04E           6  0     65EDTWRD('  /  /  ')
     A            AC06      R             79
     A                                      SPACEA(1)
     A*****
     A                                     8'05'
     A            D05S           6  0     13
     A                                      EDTWRD('  /  /  ')
     A            D05E           6  0     25EDTWRD('  /  /  ')
     A            AC07      R             39
     A                                    48'06'
     A            D06S           6  0     53
     A                                      EDTWRD('  /  /  ')
     A            D06E           6  0     65EDTWRD('  /  /  ')
     A            AC08      R             79
     A                                      SPACEA(1)
     A*****
     A                                     8'07'
     A            D07S           6  0     13
     A                                      EDTWRD('  /  /  ')
     A            D07E           6  0     25EDTWRD('  /  /  ')
     A            AC09      R             39
     A                                    48'08'
     A            D08S           6  0     53
     A                                      EDTWRD('  /  /  ')
     A            D08E           6  0     65EDTWRD('  /  /  ')
     A            AC10      R             79
     A                                      SPACEA(1)
     A*****
     A                                     8'09'
     A            D09S           6  0     13
     A                                      EDTWRD('  /  /  ')
     A            D09E           6  0     25EDTWRD('  /  /  ')
     A            AC11      R             39
     A                                    48'10'
     A            D10S           6  0     53
     A                                      EDTWRD('  /  /  ')
     A            D10E           6  0     65EDTWRD('  /  /  ')
     A            AC12      R             79
     A                                      SPACEA(1)
     A*****
     A                                     8'11'
     A            D11S           6  0     13
     A                                      EDTWRD('  /  /  ')
     A            D11E           6  0     25EDTWRD('  /  /  ')
     A            AC13      R             39
     A                                    48'12'
     A            D12S           6  0     53
     A                                      EDTWRD('  /  /  ')
     A            D12E           6  0     65EDTWRD('  /  /  ')
     A            AC14      R             79
     A                                      SPACEA(2)
     A*****
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======================'
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======================'
     A                                      SPACEA(1)
     A                                     2'<<GAR301>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
