     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : GLA170                                     *
     A*    PROGRAM NAME : 過帳作業                                 *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    CREATE DATE  : 1992.11.06                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 泛太總帳                                 *
     A****************************************************************
     A                                      REF(GLRF)
     A          R PH1                       SKIPB(2)
     A            #B03      R              1REFFLD(#B03 PTRF)
     A                                      SPACEA(2)
     A                                     1'過帳作業'
     A                                      SPACEA(2)
     A                                     1'傳票日期:'
     A            DAH10     R   -1        13REFFLD(AH10)
     A                                      EDTWRD('   /  /  ')
     A                                    22'以前'
     A                                    51'日期:'
     A            PDATE          6  0     59EDTCDE(Y)
     A                                    68'頁次:'
     A                                    76PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'傳票來源:'
     A            DAH17     R             13REFFLD(AH17)
     A                                    16'(空白表示*ALL )'
     A                                    51'時間:'
     A                                    59TIME
     A                                      EDTWRD('  :  :  ')
     A                                    69'<GLA170P>'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     6'No傳票號碼'
     A                                    26'No傳票號碼'
     A                                    46'No傳票號碼'
     A                                    66'No傳票號碼'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ===================='
     A*
     A          R PD1                       SPACEB(1)
     A            NO01           5  0      3EDTCDE(4)
     A            PAH021    R              9REFFLD(AH02)
     A            NO02           5  0     23EDTCDE(4)
     A            PAH022    R             29REFFLD(AH02)
     A            NO03           5  0     43EDTCDE(4)
     A            PAH023    R             49REFFLD(AH02)
     A            NO04           5  0     63EDTCDE(4)
     A            PAH024    R             69REFFLD(AH02)
     A*
     A          R PE1                       SPACEB(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ===================='
     A*
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
