     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : GLA350                                     *
     A*    PROGRAM NAME :報表格式設定                              *
     A*    AUTHOR       : A1149  MAY                                 *
     A*    CREATE DATE  : 1992.10.29                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 泛太總帳                                 *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/GLRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A                                      CSRLOC(#LIN       #COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF18(18)
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<GLA350.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 71EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 33'報表格式設定'
     A                                      DSPATR(RI)
     A                                  4  2'公司別　　:'
     A            DAR01     R        B  4 16REFFLD(AR01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                  5  2'報表代碼　:'
     A                                      DSPATR(HI)
     A            DAR02     R        B  5 16REFFLD(AR02)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A N61                                  DSPATR(HI)
     A            DAR03     R        B  5 19REFFLD(AR03)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  5 23'(拷貝:'
     A            DAR01C    R        B  5 32REFFLD(AR01)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A            DAR02C    R        O  5 35REFFLD(AR02)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A            DAR03C    R        B  5 38REFFLD(AR03)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                  5 42')'
     A                                  6  2'作業選擇　:'
     A            DOPT           1Y 0B  6 16VALUES(1 2 4 5)
     A                                      EDTCDE(4)
     A                                  6 23'( 1.新增'
     A                                  6 34'2.修改'
     A                                  6 43'4.刪除'
     A                                  6 52'5.查詢)'
     A                                  7  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A*
     A            ERRID          7   H
     A            ERRF          10   H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'PF3 =回主畫面'
     A                                    +2'PF4 =欄位查詢'
     A                                    +2'PF18=全頁查詢'
     A                                 24 67'【泛太資訊】'
