     A*%%TS  SD  19921207  095651  TSPGMR      REL-V2R1M1  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : GLA520D                                    *
     A*    PROGRAM NAME :年底結轉　　　　                          *
     A*    AUTHOR       : A1150                                      *
     A*    CREATE DATE  : 81/12/07                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/GLRF)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19921202  133954  HBPGMR      REL-V2R1M1  5738-PW1
     A                                      CA03(03)
     A                                      CF14(14)
     A  98                                  FRCDTA
     A  98                                  LOCK
     A                                  1  2'<GLA520.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A                                  2 35'年底結轉'
     A                                      DSPATR(RI)
     A            $USERN        10A  O  2  2
     A                                  6 31'公司別　:'
     A            DAI01     R        B  6 43REFFLD(AI01)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  8 31'結轉年度:'
     A            DAI02          3Y 0B  8 43EDTCDE(1)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                 11 31'上次年結:'
     A            DAK13          3Y 0O 11 43EDTCDE(1)
     A*
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A  98                                  DSPATR(BL)
     A                                 23  3'執行'
     A                                    +2'PF3 =回主畫面'
     A                                    +2'PF14 =處理作業'
     A                                 24 67'【泛太資訊】'
