     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : GLA510P                                    *
     A*    PROGRAM NAME :月底結轉　　　　                          *
     A*    AUTHOR       : A1150                                      *
     A*    CREATE DATE  : 81/12/02                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A                                      REF(GLRF)
     A          R PH1                       SKIPB(2)
     A            #B16      R             24REFFLD(#B16 PTRF)
     A                                      SPACEA(2)
     A                                    29'月底結轉錯誤報表列印'
     A                                      SPACEA(2)
     A                                    29'會計年度:'
     A            DFLD1          3  0     41EDTCDE(1)
     A                                      SPACEA(1)
     A                                    29'會計期間:'
     A            DFLD2          2  0     41EDTCDE(1)
     A                                    44'('
     A            GLS1F          7  0     46EDTWRD('   /  /  ')
     A                                    56'-'
     A            GLS1T          7  0     58EDTWRD('   /  /  ')
     A                                    68')'
     A                                      SPACEA(2)
     A                                    48'日期:'
     A            PDATE          6  0     56EDTCDE(Y)
     A                                    65'頁次:'
     A                                    73PAGNBR
     A                                      EDTCDE(4)
     A                                      SPACEA(1)
     A                                    48'時間:'
     A                                    56TIME
     A                                      EDTWRD('  :  :  ')
     A                                    68'<GLA510P>'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ================='
     A                                      SPACEA(1)
     A                                     8'傳票號碼'
     A                                    21'傳票日期'
     A                                    33'製票人'
     A                                    58'製票日期'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ================='
     A*
     A          R PD1                       SPACEB(1)
     A            AH02      R              9REFFLD(AH02)
     A            PAH10     R   -1        21REFFLD(AH10)
     A                                      EDTWRD('   /  /  ')
     A            AH26      R             34REFFLD(AH26)
     A            PSU02         10        45
     A            PAH25     R   -1        58REFFLD(AH25)
     A                                      EDTWRD('   /  /  ')
     A*
     A          R PE1                       SPACEB(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ================='
