     A*%%TS  SD  19940219  095259  D910121     REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     A*
     A*    PROGRAM-ID   : GLA780
     A*    PROGRAM NAME : 過帳還原作業
     A*    AUTHOR       : A1087  JOYCE
     A*    CREATE DATE  : 1992.11.06
     A*    UPDATE DATE  :
     A*    SYSTEM       : 泛太總帳
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/GLRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19940219  095259  D910121     REL-V2R2M0  5738-PW1
     A                                      CSRLOC(#LIN       #COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF14(14)
     A  28                                  FRCDTA
     A  28                                  LOCK
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<GLA780.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 35'過帳還原作業'
     A                                      DSPATR(RI)
     A                                  6 28'公司別　:'
     A            DAH01     R        B  6 40REFFLD(AH01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                  8 28'傳票號碼:'
     A            DAH02     R        B  8 40REFFLD(AH02)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                 10 24'迴轉傳票號碼:'
     A            DAG03     R        O 10 40REFFLD(AG03)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'PF3 =回主畫面'
     A                                 23 27'PF14=處理作業'
     A                                 24 67'【泛太資訊】'
     A*================================================================
