     H***************************************************************/
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     H*                                                             */
     H*    PROGRAM ID   : GLB910C                                   */
     H*    PROGRAM NAME :總帳Ｖ１－＞Ｖ２                         */
     H*    AUTHOR       : A1034  STEPHANIE                          */
     H*    CREATE DATE  : 1993.07.27                                */
     H*    UPDATE DATE  :                                           */
     H*    SYSTEM       : 泛太總帳                                */
     H***************************************************************/
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/GLRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A*----------------------------------------------------------------
     A          R DSPD1
     A                                      CA03(03)
     A                                      CF10(10)
     A                                  1  2'<GLA910.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 29'總帳版本更新資料整理'
     A                                      DSPATR(RI)
     A                                  5 29'LIBRARY   :'
     A            LIB           10   B    +2
     A                                  7 29'累積盈虧:'
     A            AK04P     R        B    +2REFFLD(AK04)
     A                                  9 29'資金來源:'
     A            AK07P     R        B    +2REFFLD(AK07)
     A                                 11 29'資金用途:'
     A            AK08P     R        B    +2REFFLD(AK08)
     A*
     A  99        ERR01         50     22  2MSGID(UPT0043 PTMF)
     A  98        ERR02         50     22  2MSGID(UPT2142 PTMF)
     A                                 23  2'執行'
     A                                    +2'PF3 =回主畫面'
     A                                    +2'PF10=作業處理'
     A                                 24 67'【泛太資訊】'
