     A*%%TS  SD  19921125  131512  TSPGMR      REL-V2R1M1  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : GLIIC0                                     *
     A*    PROGRAM NAME : 分類帳查詢                               *
     A*    AUTHOR       : A1149   MAY                                *
     A*    CREATE DATE  : 1992.11.10                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 泛太總帳                                 *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(GLFLIB/GLRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R SFLSR                     SFL
     A*%%TS  SD  19921125  131512  TSPGMR      REL-V2R1M1  5738-PW1
     A            RRN            3S 0H
     A            DOPT           1A  B 11  2VALUES(' ' '5')
     A N99                                  DSPATR(CS)
     A N99                                  DSPATR(PC)
     A N99                                  DSPATR(HI)
     A            SAH10          7Y 0O 11  4EDTWRD('   /  /  ')
     A            AH02      R        O 11 14
     A            AH12      R        O 11 24EDTCDE(2)
     A            AH13      R        O 11 42EDTCDE(2)
     A            C             13Y 2O 11 60EDTWRD('  ,   ,   ,   .  -')
     A            DAH18          2   O 11 79
     A            AH16      R        O 12 24
     A            AH17      R        O 12 79
     A*----------------------------------------------------------------
     A          R SFLCR                     SFLCTL(SFLSR)
     A*%%TS  SD  19921125  131512  TSPGMR      REL-V2R1M1  5738-PW1
     A                                      SFLSIZ(0060)
     A                                      SFLPAG(0005)
     A                                      SFLDROP(CF02)
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      ROLLUP(25)
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  96                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A                                      CSRLOC(#LIN       #COL)
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A            DRRN           3S 0H      SFLRCDNBR
     A                                  1  2'<GLI1C0.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 34'分類帳查詢'
     A                                      DSPATR(RI)
     A                                  3  2'公司別　  :'
     A            DAH01     R        B  3 16REFFLD(AH01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            #B02      R        O  3 25REFFLD(#B02 *LIBL/PTRF)
     A                                  4  2'會計科目  :'
     A                                      DSPATR(HI)
     A            DAH04     R        B  4 16REFFLD(AH04)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A N61                                  DSPATR(HI)
     A            AF03      R        O  4 25
     A                                  5  2'傳票日期  :'
     A            DAH10     R   -1   B  5 16REFFLD(AH10)
     A                                      EDTWRD('   /  /  ')
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  5 27'起'
     A                                  6  2'選擇內容  :'
     A            A              1A  B  6 16VALUES('1' '2' '3')
     A                                  6 19'(1.已過帳 2.已核准 3.全部)'
     A                                  7  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  8  2'S (=作業) : 5-傳票查詢'
     A                                  8 35'P : V-已過帳'
     A                                  8 57'A : V-已核准'
     A                                  9  2'S 傳票日期　傳票號碼     借方+
     A                                      金額        貸方金額           -
     A                                       餘額    PA'
     A                                      DSPATR(UL)
     A                                 10  6'ももも　上期餘額　ももも'
     A            B             13Y 2O 10 59EDTWRD('  ,   ,   ,  $0.  -')
     A*----------------------------------------------------------------
     A          R DSPC1
     A*
     A                                 21  2'---------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A            ERRID          7   H
     A            ERRF          10   H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  3'執行'
     A                                 23 10'PF2 =明細顯示'
     A                                 23 27'PF3 =回主畫面'
     A                                 23 44'PF4 =欄位查詢'
     A                                 23 61'PA1 =下一頁'
     A                                 24 10'PA2 =上一頁'
     A                                 24 67'【泛太資訊】'
