     A*%%TS  SD  19940629  112429  D910121     REL-V2R2M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(GLFLIB/GLRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19940629  111623  D910121     REL-V2R2M0  5738-PW1
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF04(04)
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<GLI1L0.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 34'明細分類帳查詢'
     A                                      DSPATR(RI)
     A                                  3  2'公司別　  :'
     A            DAH01     R        B  3 16REFFLD(AH01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                  4  2'會計科目  :'
     A                                      DSPATR(HI)
     A            DAH04     R        B  4 16REFFLD(AH04)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A N61                                  DSPATR(HI)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  3'執行'
     A                                 23 11'PF3 =回主畫面'
     A                                 23 27'PF4 =欄位查詢'
     A                                 24 67'【泛太資訊】'
     A          R DSPD2
     A*%%TS  SD  19940629  112429  D910121     REL-V2R2M0  5738-PW1
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF12(12)
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<GLI1L0.2>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 34'明細分類帳查詢'
     A                                      DSPATR(RI)
     A                                  3  2'公司別　  :'
     A            DAH01     R        O  3 16REFFLD(AH01)
     A            #B02      R        O  3 25REFFLD(#B02 *LIBL/PTRF)
     A                                  4  2'會計科目  :'
     A                                      DSPATR(HI)
     A            DAH04     R        O  4 16REFFLD(AH04)
     A            AF03      R        O  4 25
     A                                  5  2'傳票日期  :'
     A            DAH10     R   -1   B  5 16REFFLD(AH10)
     A                                      EDTWRD('   /  /  ')
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  5 27'起'
     A                                  6  2'選擇內容  :'
     A            A              1A  B  6 16VALUES('1' '2' '3')
     A                                  6 19'(1.已過帳 2.已核准 3.全部)'
     A                                  7  1'--------------------   ------------
     A                                      -----------'
     A                                  8  1'輸入欄位           :'
     A                                  9  1'--------------------   ------------
     A                                      -----------'
     A            DAA031    R        O 10  1REFFLD(AA03)
     A N36                                  DSPATR(HI)
     A                                 10 22':'
     A N36                                  DSPATR(HI)
     A  31                                  DSPATR(ND)
     A            DAH05     R        B 10 24REFFLD(AH05)
     A N36N99                               DSPATR(HI)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A  31                                  DSPATR(ND)
     A            DAA032    R        O 11  1REFFLD(AA03)
     A N37                                  DSPATR(HI)
     A                                 11 22':'
     A N37                                  DSPATR(HI)
     A  32                                  DSPATR(ND)
     A            DAH06     R        B 11 24REFFLD(AH06)
     A N37N99                               DSPATR(HI)
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A  32                                  DSPATR(PR)
     A  32                                  DSPATR(ND)
     A            DAA033    R        O 12  1REFFLD(AA03)
     A N38                                  DSPATR(HI)
     A                                 12 22':'
     A N38                                  DSPATR(HI)
     A  33                                  DSPATR(ND)
     A            DAH07     R        B 12 24REFFLD(AH07)
     A N38N99                               DSPATR(HI)
     A  66                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A  33                                  DSPATR(PR)
     A  33                                  DSPATR(ND)
     A            DAA034    R        O 13  1REFFLD(AA03)
     A N39                                  DSPATR(HI)
     A                                 13 22':'
     A N39                                  DSPATR(HI)
     A  34                                  DSPATR(ND)
     A            DAH08     R        B 13 24REFFLD(AH08)
     A N39N99                               DSPATR(HI)
     A  67                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A  34                                  DSPATR(PR)
     A  34                                  DSPATR(ND)
     A            DAA035    R        O 14  1REFFLD(AA03)
     A                                 14 22':'
     A  35                                  DSPATR(ND)
     A            DAH09     R   -1   B 14 24REFFLD(AH09)
     A                                      EDTWRD('   /  /  ')
     A  68                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A  35                                  DSPATR(PR)
     A  35                                  DSPATR(ND)
     A                                 15  1'--------------------   ------------
     A                                      -----------'
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  3'執行'
     A                                 23 11'PF3 =回主畫面'
     A                                 23 27'PF4 =欄位查詢'
     A                                 23 44'PF12=回前畫面'
     A                                 24 67'【泛太資訊】'
     A                                  8 28'挑選值'
     A*----------------------------------------------------------------
     A          R SFLSR                     SFL
     A*%%TS  SD  19921125  131512  TSPGMR      REL-V2R1M1  5738-PW1
     A            RRN            3S 0H
     A            DOPT           1A  B 11  2VALUES(' ' '5')
     A N99                                  DSPATR(CS)
     A N99                                  DSPATR(PC)
     A N99                                  DSPATR(HI)
     A            SAH10          7Y 0O 11  4EDTWRD('   /  /  ')
     A            AH02      R        O 11 14
     A            AH12      R        O 11 24EDTCDE(2)
     A            AH13      R        O 11 42EDTCDE(2)
     A            C             13Y 2O 11 60EDTWRD('  ,   ,   ,   .  -')
     A            DAH18          2   O 11 79
     A            AH16      R        O 12 24
     A*----------------------------------------------------------------
     A          R SFLCR                     SFLCTL(SFLSR)
     A*%%TS  SD  19921125  131512  TSPGMR      REL-V2R1M1  5738-PW1
     A                                      SFLSIZ(0060)
     A                                      SFLPAG(0005)
     A                                      SFLDROP(CF02)
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF12(12)
     A                                      ROLLUP(25)
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A* 96                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A                                      CSRLOC(#LIN       #COL)
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A            DRRN           3S 0H      SFLRCDNBR
     A                                  1  2'<GLI1L0.3>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 34'明細分類帳查詢'
     A                                      DSPATR(RI)
     A                                  3  2'公司別　  :'
     A            DAH01     R        O  3 16REFFLD(AH01)
     A            #B02      R        O  3 25REFFLD(#B02 *LIBL/PTRF)
     A                                  4  2'會計科目  :'
     A            DAH04     R        O  4 16REFFLD(AH04)
     A            AF03      R        O  4 25
     A                                  5  2'傳票日期  :'
     A            DAH10     R   -1   O  5 16REFFLD(AH10)
     A                                      EDTWRD('   /  /  ')
     A                                  5 27'起'
     A                                  6  2'選擇內容  :'
     A            A              1A  O  6 16
     A                                  6 19'(1.已過帳 2.已核准 3.全部)'
     A                                  7  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  8  2'S (=作業) : 5-傳票查詢'
     A                                  8 35'P : V-已過帳'
     A                                  8 57'A : V-已核准'
     A                                  9  2'S 傳票日期　傳票號碼     借方+
     A                                      金額        貸方金額           -
     A                                       餘額    PA'
     A                                      DSPATR(UL)
     A                                 10  6'ももも　上期餘額　ももも'
     A            B             13Y 2O 10 59EDTWRD('  ,   ,   ,  $0.  -')
     A*----------------------------------------------------------------
     A          R DSPC1
     A*
     A                                 21  2'---------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A            ERRID          7   H
     A            ERRF          10   H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  3'執行'
     A                                 23 10'PF2 =明細顯示'
     A                                 23 27'PF3 =回主畫面'
     A                                 23 44'PF4 =欄位查詢'
     A                                 23 61'PA1 =下一頁'
     A                                 24 10'PA2 =上一頁'
     A                                 24 67'【泛太資訊】'
