     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : GLM000D                                    *
     A*    AUTHOR       : A1034   STEPHANIE                          *
     A*    CREATE DATE  : 81/11/15                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : GLM000                                     *
     A*    SYSTEM       :財務系統                                  *
     A*    SUBSYSTEM    :總帳系統                                  *
     A*    REMARK       :總帳管理選擇畫面                          *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A                                  1  2'<GLM000.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 31'總帳管理選擇畫面'
     A                                      DSPATR(RI)
     A                                  6 30'01.日常帳務'
     A                                      DSPATR(UL)
     A                                  7 30'02.管理報表'
     A                                      DSPATR(UL)
     A                                  8 30'03.資料設定'
     A                                      DSPATR(UL)
     A                                  9 30'04.基本資料'
     A                                      DSPATR(UL)
     A                                 10 30'05.結帳處理'
     A                                      DSPATR(UL)
     A                                 11 30'06.預算資料'
     A                                      DSPATR(UL)
     A                                 14 30'71.支援管理系統'
     A                                      DSPATR(UL)
     A                                 15 30'72.程式安全管制系統'
     A                                      DSPATR(UL)
     A                                 18 30'90.結束'
     A                                      DSPATR(UL)
     A                                 20 33'請輸入選擇項目:'
     A            DOPID          2A  B 20 51DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      VALUES('01' '02' '03' '04' '05' '06+
     A                                      ' '71' '72' '90')
     A  98        ERR1          70A  O 22  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 67'【泛太資訊】'
