     A*%%TS  SD  19940705  083522  D910121     REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : GLM100D                                    *
     A*    AUTHOR       : A1034   STEPHANIE                          *
     A*    CREATE DATE  : 81/11/15                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : GLM100                                     *
     A*    SYSTEM       :財務系統                                  *
     A*    SUBSYSTEM    :總帳系統                                  *
     A*    REMARK       :日常帳務選擇畫面                          *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19940705  083522  D910121     REL-V2R2M0  5738-PW1
     A                                  1  2'<GLM100.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 31'日常帳務選擇畫面'
     A                                      DSPATR(RI)
     A                                  5  9'維護作業'
     A                                  5 36'查詢作業'
     A                                  5 63'報表作業'
     A                                  6  2'************************'
     A                                  6 29'************************'
     A                                  6 56'************************'
     A                                  7  3'11.傳票登錄'
     A                                      DSPATR(UL)
     A                                  7 30'31.傳票查詢－單筆'
     A                                      DSPATR(UL)
     A                                  7 57'51.日計表'
     A                                      DSPATR(UL)
     A                                  8  3'12.常用傳票登錄'
     A                                      DSPATR(UL)
     A                                  8 30'32.傳票查詢－區間'
     A                                      DSPATR(UL)
     A                                  8 57'52.日記帳'
     A                                      DSPATR(UL)
     A                                  9  3'13.傳票更正'
     A                                      DSPATR(UL)
     A                                  9 30'33.分類帳查詢'
     A                                      DSPATR(UL)
     A                                  9 57'53.傳票核對表'
     A                                      DSPATR(UL)
     A                                 10  3'14.核准作業'
     A                                      DSPATR(UL)
     A                                 10 30'34.內設資料值查詢'
     A                                      DSPATR(UL)
     A                                 10 57'54.傳票列印'
     A                                      DSPATR(UL)
     A                                 11  3'15.取消核准'
     A                                      DSPATR(UL)
     A                                 12  3'16.過帳作業'
     A                                      DSPATR(UL)
     A                                 17  3'21.追溯分攤'
     A                                      DSPATR(UL)
     A                                 18  3'22.過帳處理控制'
     A                                      DSPATR(UL)
     A                                 18 30'90.結束'
     A                                      DSPATR(UL)
     A                                 20 33'請輸入選擇項目:'
     A            DOPID          2A  B 20 51DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      VALUES('11' '12' '13' '14' '15' '16+
     A                                      ' '17' '21' '22' '31' '32' '33' '34+
     A                                      ' '35' '51' '52' '53' '54' '61' '62+
     A                                      ' '90' '18' '36' '55')
     A  98        ERR1          70A  O 22  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 67'【泛太資訊】'
     A                                 13  3'17.過帳還原作業'
     A                                      DSPATR(UL)
     A                                 14  3'18.憑證補登'
     A                                      DSPATR(UL)
     A                                 17 57'61.傳票核對表－傳票號碼'
     A                                      DSPATR(UL)
     A                                 18 57'62.傳票號碼核對表　　　'
     A                                      DSPATR(UL)
     A                                 11 30'35.明細分類帳查詢'
     A                                      DSPATR(UL)
     A                                 12 30'36.憑證未到資料查詢'
     A                                      DSPATR(UL)
     A                                 11 57'55.憑證未到資料列印'
     A                                      DSPATR(UL)
