     A*%%TS  SD  19940204  175821  D910121     REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : GLM200D                                    *
     A*    AUTHOR       : A1034   STEPHANIE                          *
     A*    CREATE DATE  : 81/11/15                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : GLM200                                     *
     A*    SYSTEM       :財務系統                                  *
     A*    SUBSYSTEM    :總帳系統                                  *
     A*    REMARK       :管理報表選擇畫面                          *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19940204  175821  D910121     REL-V2R2M0  5738-PW1
     A                                  1  2'<GLM300.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 31'資料設定選擇畫面'
     A                                      DSPATR(RI)
     A                                  5  9'維護作業'
     A                                  5 36'查詢作業'
     A                                  5 63'報表作業'
     A                                  6  2'************************'
     A                                  6 29'************************'
     A                                  6 56'************************'
     A                                  7  3'11.常用傳票設定'
     A                                      DSPATR(UL)
     A                                  7 57'51.常用傳票設定列印'
     A                                      DSPATR(UL)
     A                                  8  3'12.常用傳票更正'
     A                                      DSPATR(UL)
     A                                  8 57'52.費用分攤設定列印'
     A                                      DSPATR(UL)
     A                                  9  3'13.費用分攤設定'
     A                                      DSPATR(UL)
     A                                 10  3'14.費用分攤更正'
     A                                      DSPATR(UL)
     A                                 11  3'15.報表格式設定'
     A                                      DSPATR(UL)
     A                                 12  3'16.會計期間設定'
     A                                      DSPATR(UL)
     A                                 13  3'17.公司結構設定'
     A                                      DSPATR(UL)
     A                                 14  3'18.成本中心結構設定'
     A                                      DSPATR(UL)
     A                                 18 30'90.結束'
     A                                      DSPATR(UL)
     A                                 20 33'請輸入選擇項目:'
     A                                      DSPATR(UL)
     A            DOPID          2A  B 20 51DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      VALUES('11' '12' '13' '14' '15' '16+
     A                                      ' '17' '18' '51' '52' '55' '56' '57+
     A                                      ' '58' '90')
     A  98        ERR1          70A  O 22  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 67'【泛太資訊】'
     A                                 12 57'56.會計期間列印　　'
     A                                      DSPATR(UL)
     A                                 14 57'58.成本中心結構列印'
     A                                      DSPATR(UL)
     A                                 13 57'57.公司結構列印　　'
     A                                      DSPATR(UL)
     A                                 11 57'55.報表格式列印　　'
     A                                      DSPATR(UL)
