     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : GLM400D                                    *
     A*    AUTHOR       : A1034   STEPHANIE                          *
     A*    CREATE DATE  : 81/11/15                                   *
     A*    SYSTEM       :財務系統                                  *
     A*    SUBSYSTEM    :總帳系統                                  *
     A*    REMARK       :基本資料選擇畫面                          *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A                                  1  2'<GLM400.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 31'基本資料選擇畫面'
     A                                      DSPATR(RI)
     A                                  5  9'維護作業'
     A                                  5 36'拷貝作業'
     A                                  5 63'報表作業'
     A                                  6  2'************************'
     A                                  6 29'************************'
     A                                  6 56'************************'
     A                                  7  3'11.會計科目資料維護'
     A                                      DSPATR(UL)
     A                                  7 30'31.會計科目資料拷貝'
     A                                      DSPATR(UL)
     A                                  7 57'51.會計科目資料列印'
     A                                      DSPATR(UL)
     A                                  8  3'12.欄位名稱資料維護'
     A                                      DSPATR(UL)
     A                                  8 30'32.欄位名稱資料拷貝'
     A                                      DSPATR(UL)
     A                                  8 57'52.欄位名稱資料列印'
     A                                      DSPATR(UL)
     A                                  9  3'13.沖帳組合資料維護'
     A                                      DSPATR(UL)
     A                                  9 30'33.沖帳組合資料拷貝'
     A                                      DSPATR(UL)
     A                                  9 57'53.沖帳組合資料列印'
     A                                      DSPATR(UL)
     A                                 10  3'14.資金代碼資料維護'
     A                                      DSPATR(UL)
     A                                 10 30'34.資金代碼資料拷貝'
     A                                      DSPATR(UL)
     A                                 10 57'54.資金代碼資料列印'
     A                                      DSPATR(UL)
     A                                 11  3'15.分類帳碼資料維護'
     A                                      DSPATR(UL)
     A                                 11 57'55.分類帳碼資料列印'
     A                                      DSPATR(UL)
     A                                 12  3'16.內設資料值維護'
     A                                      DSPATR(UL)
     A                                 18 30'90.結束'
     A                                      DSPATR(UL)
     A                                 20 33'請輸入選擇項目:'
     A            DOPID          2A  B 20 51DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      VALUES('11' '12' '13' '14' '15' '16+
     A                                      ' '31' '32' '33' '34' '51' '52' '53+
     A                                      ' '54' '55' '90')
     A  98        ERR1          70A  O 22  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 67'【泛太資訊】'
