     A*%%TS  SD  19930108  103640  TSPGMR      REL-V2R1M1  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : GLM600D                                    *
     A*    AUTHOR       : A1034   STEPHANIE                          *
     A*    CREATE DATE  : 81/11/15                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : GLM600                                     *
     A*    SYSTEM       :財務系統                                  *
     A*    SUBSYSTEM    :總帳系統                                  *
     A*    REMARK       :預算資料選擇畫面                          *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19930108  103640  TSPGMR      REL-V2R1M1  5738-PW1
     A                                  1  2'<GLM600.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 31'預算資料選擇畫面'
     A                                      DSPATR(RI)
     A                                  5  9'維護作業'
     A                                  5 36'拷貝作業'
     A                                  5 63'報表作業'
     A                                  6  2'************************'
     A                                  6 29'************************'
     A                                  6 56'************************'
     A                                  7  3'11.預算資料維護'
     A                                      DSPATR(UL)
     A                                  7 30'31.預算資料拷貝－實績'
     A                                      DSPATR(UL)
     A                                  7 57'51.年度預算明細表'
     A                                      DSPATR(UL)
     A                                  8  3'12.資金預算資料維護'
     A                                      DSPATR(UL)
     A                                  8 30'32.預算資料拷貝－預算'
     A                                      DSPATR(UL)
     A                                  8 57'52.年度資金預算明細表'
     A                                      DSPATR(UL)
     A                                  9  3'13.分攤比率碼維護'
     A                                      DSPATR(UL)
     A                                  9 57'53.損益表'
     A                                      DSPATR(UL)
     A                                 10 57'54.成本中心損益表'
     A                                      DSPATR(UL)
     A                                 11 57'55.資產負債表'
     A                                      DSPATR(UL)
     A                                 12 57'56.比較報表'
     A                                      DSPATR(UL)
     A                                 13 57'57.科目比較表－成本中心'
     A                                      DSPATR(UL)
     A                                 14 57'58.現金流量表'
     A                                      DSPATR(UL)
     A                                 18 30'90.結束'
     A                                      DSPATR(UL)
     A                                 20 33'請輸入選擇項目:'
     A            DOPID          2A  B 20 51DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      VALUES('11' '12' '13' '31' '32' '51+
     A                                      ' '52' '53' '54' '55' '56' '57' '58+
     A                                      ' '90')
     A  98        ERR1          70A  O 22  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 67'【泛太資訊】'
