     A*%%TS  SD  19921111  095016  TSPGMR      REL-V2R1M1  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : GLR1H0D                                    *
     A*    PROGRAM NAME :日記帳列印　　　                          *
     A*    AUTHOR       : A1150                                      *
     A*    CREATE DATE  : 81/11/11                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/GLRF)
     A                                      PRINT
     A          R DSPD1                     CSRLOC(#LIN #COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF14(14)
     A  28                                  FRCDTA
     A  28                                  LOCK
     A            #LIN           3  0H
     A            #COL           3  0H
     A                                  1  2'<GLR1H0.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6  0O  1 72EDTCDE(Y)
     A                                  2 36'日記帳'
     A                                      DSPATR(RI)
     A            $USERN        10A  O  2  2
     A*
     A                                  5 28'公司別　:'
     A            DAH01     R        B  5 40REFFLD(AH01)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  7 28'日期　　:'
     A            D10F      R   -1   B  7 40REFFLD(AH10)
     A                                      EDTWRD('   /  /  ')
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  7 50'-'
     A            D10T      R   -1   B  7 52REFFLD(AH10)
     A                                      EDTWRD('   /  /  ')
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                  8 28'選擇內容:'
     A            DFLD           1   B  8 40
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                  8 43'( 1.己過帳 2.己核准 3.全部)'
     A*
     A                                 15 28'執行環境:'
     A            $PENV          1   B 15 40VALUES('0' '1' '2')
     A                                 15 46'(0-查詢 1-即時 2-批次)'
     A                                 16 28'列印份數:'
     A            $CPY           3Y 0B 16 40EDTCDE(3)
     A                                      CHECK(RB)
     A                                 17 28'列表機　:'
     A                                      DSPATR(HI)
     A            $PRTCD         2   B 17 40
     A N99                                  DSPATR(HI)
     A  27                             21 28'**請準備１３２行報表紙**'
     A                                      DSPATR(RI)
     A  28                             21 28'報表處理中，請稍候'
     A                                      DSPATR(RI BL)
     A
     A*
     A            ERRID          7   H
     A            ERRF          10   H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  3'執行'
     A                                    +2'PF3 =回主畫面'
     A                                    +2'PF4 =欄位查詢'
     A                                    +2'PF14 =處理作業'
     A                                 24 67'【泛太資訊】'
