     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : GLR1G0P                                    *
     A*    PROGRAM NAME :日計表　　　　　                          *
     A*    AUTHOR       : A1150                                      *
     A*    CREATE DATE  : 81/11/20                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A                                      REF(GLRF)
     A          R PH1                       SKIPB(2)
     A            #B16      R             35REFFLD(#B16 PTRF)
     A                                      SPACEA(2)
     A                                    47'日計表'
     A                                      SPACEA(2)
     A                                    42'日期:'
     A            PAH10     R   -1        50REFFLD(AH10)
     A                                      EDTWRD('   /  /  ')
     A                                      SPACEA(1)
     A                                     2'選擇內容:'
     A            DFLD           1        +1
     A            PFLD           8        +1
     A                                      SPACEA(1)
     A  30                                 1'傳票號碼　起:'
     A  30        P02F      R             17REFFLD(AH02)
     A                                    70'日期:'
     A            PDATE          6  0     78EDTCDE(Y)
     A                                    87'頁次:'
     A                                    95PAGNBR
     A                                      EDTCDE(4)
     A                                      SPACEA(1)
     A  30                                 1'　　　　　迄:'
     A  30        P02T      R             17REFFLD(AH02)
     A                                    70'時間:'
     A                                    78TIME
     A                                      EDTWRD('  :  :  ')
     A                                    90'<GLR1G0P>'
     A                                      SPACEA(1)
     A                                     1'=================================+
     A                                       =================================+
     A                                       ================================='
     A                                      SPACEA(1)
     A                                    47'---------借方--------'
     A                                    76'---------貸方--------'
     A                                      SPACEA(1)
     A                                     1'會計科目　科目名稱'
     A                                    56'金額'
     A                                    65'筆數'
     A                                    85'金額'
     A                                    94'筆數'
     A                                      SPACEA(1)
     A                                     1'=================================+
     A                                       =================================+
     A                                       ================================='
     A*
     A          R PD1                       SPACEB(1)
     A            AH04      R              2
     A            PAF03         32        11
     A            PAH12     R             47REFFLD(AH12)
     A                                      EDTCDE(2)
     A            CNT12          3  0     67EDTCDE(4)
     A            PAH13     R             75REFFLD(AH13)
     A                                      EDTCDE(2)
     A            CNT13          3  0     95EDTCDE(4)
     A*
     A          R PT1                       SPACEB(1)
     A                                     1'---------------------------------+
     A                                       ---------------------------------+
     A                                       ---------------------------------'
     A                                      SPACEA(1)
     A                                    15'合　計'
     A            TOT12     R   +2        44REFFLD(AH12)
     A                                      EDTCDE(2)
     A            TCNT2          3  0     67EDTCDE(4)
     A            TOT13     R   +2        72REFFLD(AH13)
     A                                      EDTCDE(2)
     A            TCNT3          3  0     95EDTCDE(4)
     A                                      SPACEA(1)
     A                                     1'=================================+
     A                                       =================================+
     A                                       ================================='
     A                                      SPACEA(1)
     A            P8O1          99         1
     A                                      SPACEA(1)
     A            P8O2          99         1
     A*
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
