     A                                      REF(*LIBL/GLRF)
     A          R PH1                       SKIPB(3)
     A  21                                 2'V'
     A                                   100' '
     A                                      SPACEA(1)
     A            AH02      R            109
     A                                      SPACEA(1)
     A  22                                 2'V'
     A            PAG            2  0    110EDTCDE(Z)
     A                                   112'/'
     A            TOTPAG         2  0    113EDTCDE(Z)
     A                                      SPACEA(1)
     A          R PH2
     A            PAH25     R   -1       109REFFLD(AH25)
     A                                      EDTWRD('   /  /  ')
     A                                      SPACEA(1)
     A  23                                 2'V'
     A            DDLT           6        45
     A            PAH10     R   -1        65REFFLD(AH10)
     A                                      EDTWRD('   &&&&  &&&&  ')
     A                                      SPACEA(3)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            DAH04         10         2
     A  30        PAF03D    R             11REFFLD(AF03)
     A N30        PAF03C    R             11REFFLD(AF03)
     A            PTXT          50O       44
     A            AH12      R             90
     A                                      EDTCDE(2)
     A*+ 96/04/04 EASON
     A            AH13      R            104
     A                                      EDTCDE(2)
     A                                      SPACEA(1)
     A            AH16      R             44
     A*----------------------------------------------------------------
     A          R PE1
     A                                      SKIPB(26)
     A                                    49'續    下    頁'
     A          R PE2
     A                                      SKIPB(26)
     A                                    50'合          計'
     A            PAH12T    R   +2        87REFFLD(AH12)
     A                                      EDTCDE(2)
     A*+ 96/04/04 EASON
     A            PAH13T    R   +2       101REFFLD(AH13)
     A                                      EDTCDE(2)
     A          R PE3
     A                                      SKIPB(29)
     A*製票人
     A            SU02      R            110REFFLD(SU02 S#RF)
