     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PRTF   -ID   : GLR2C0P                                    *
     A*    PROGRAM-ID   : GLR2C0                                     *
     A*    PROGRAM NAME : 現金流量表－英文格式                     *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    CREATE DATE  : 1993.01.09                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 泛太總帳                                 *
     A****************************************************************
     A                                      REF(GLRF)
     A          R PH1                       SKIPB(2)
     A            P#B16     R             25REFFLD(#B16 PTRF)
     A                                      SPACEA(2)
     A                                    36'Cash Flow'
     A                                      SPACEA(1)
     A            PDA01          8        37
     A                                      SPACEA(1)
     A  30                                20'Profit Center :'
     A  30        DAH05     R             36REFFLD(AP04)
     A  30        P#A02         32        43
     A  30                                  SPACEA(1)
     A                                    20'Fiscal Period :'
     A            DAH10S    R   -1        36REFFLD(AH10)
     A                                      EDTWRD('   /  /  ')
     A                                    46'-'
     A            DAH10E    R   -1        48REFFLD(AH10)
     A                                      EDTWRD('   /  /  ')
     A                                      SPACEA(2)
     A                                    51'DATE :'
     A            PDATE          6  0     58EDTWRD('  /  /  ')
     A                                    68'PAGE :'
     A                                    75PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                    51'TIME :'
     A                                    58TIME
     A                                      EDTWRD('  :  :  ')
     A                                    68'<GLR2C0P>'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     5'Title'
     A                                    68'Amount'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ===================='
     A*
     A          R PD1                       SPACEB(1)
     A            P0303         34         3
     A  61                                38'('
     A            P0304         13  2     39EDTCDE(2)
     A  61                                56')'
     A  62                                58'('
     A  63        P0305         13  2     59EDTWRD('  ,   ,   ,  $0.  ')
     A  62                                77')'
     A          R PD1A                      SPACEB(1)
     A*虛線行....
     A N80                                38'------------------------------+
     A                                       ----------'
     A  80                                 1'==============================+
     A                                       ==============================+
     A                                       ===================='
     A*
     A*說明行....
     A          R PD1B                      SPACEB(1)
     A  81        P0303         34         3
     A N81                                 3' '
     A*
     A          R PT1                       SPACEB(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ===================='
     A                                      SPACEA(1)
     A            PSIGN1        80         1
     A                                      SPACEA(1)
     A            PSIGN2        80         1
     A*
     A          R PE1                       SPACEB(1)
     A                                    16'*** NO DATA FOR PRINTING ***'
