     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PRTF   -ID   : GLR2J1P                                    *
     A*    PROGRAM-ID   : GLR2J0                                     *
     A*    PROGRAM NAME : 科目明細表－中文格式                     *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    CREATE DATE  : 1992.12.14                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 泛太總帳                                 *
     A****************************************************************
     A                                      REF(GLRF)
     A          R PH1                       SKIPB(2)
     A            P#B16     R             25REFFLD(#B16 PTRF)
     A                                      SPACEA(2)
     A                                    35'Detail  Report'
     A                                      SPACEA(1)
     A            PDA01          8        37
     A                                      SPACEA(1)
     A            P0303         34        25
     A                                      SPACEA(1)
     A                                    34'As of'
     A            DAK12     R   -1        40REFFLD(AK12)
     A                                      EDTWRD('   /  /  ')
     A                                      SPACEA(2)
     A                                    50'DATE :'
     A            PDATE          6  0     58EDTWRD('  /  /  ')
     A                                    67'PAGE :'
     A                                    75PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                    50'TIME :'
     A                                    58TIME
     A                                      EDTWRD('  :  :  ')
     A                                    68'<GLR2J1P>'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     5'Account Titles'
     A                                    51'Amounts'
     A                                    72'％'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ===================='
     A*
     A          R PD1                       SPACEB(1)
     A            P0402         34         3
     A  51                                42'('
     A            P0404         13  2     44EDTCDE(1)
     A  51                                61')'
     A  52                                71'('
     A  53        P04B           5  2     72EDTCDE(3)
     A N53                                72'*****'
     A  52                                78')'
     A*
     A          R PT1                       SPACEB(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     5'Totals :'
     A  54                                42'('
     A            T0404         13  2     43EDTWRD('  ,   ,   ,  $0.  ')
     A  54                                61')'
     A                                    72'100.00'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ===================='
     A                                      SPACEA(1)
     A            PNAME1        80         1
     A                                      SPACEA(1)
     A            PNAME2        80         1
     A*
