     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PRTF   -ID   : GLR2G0P2                                   *
     A*    PROGRAM-ID   : GLR2G0                                     *
     A*    PROGRAM NAME : 比較損益表－期間－英文                   *
     A*    AUTHOR       :  A1149   HUANG-SHU.MEI                     *
     A*    CREATE DATE  :  1992.12.17                                *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 泛太總帳                                 *
     A****************************************************************
     A                                      REF(GLRF)
     A          R PH1                       SKIPB(2)
     A            P#B16     R             83REFFLD(#B16 PTRF)
     A                                      SPACEA(2)
     A                                    90' Income Statament '
     A                                      SPACEA(1)
     A            PDA01          8        95
     A                                      SPACEA(1)
     A  30                                81'Profit Center :'
     A  30        D#A01          6        97
     A  30        P#A02         32       104
     A  30                                  SPACEA(1)
     A                                    81'Fiscal Year   :'
     A            DYEAR          3  0     97EDTCDE(4)
     A                                      SPACEA(1)
     A                                    81'Fiscal period :'
     A            DMM            2  0     97EDTCDE(4)
     A                                      SPACEA(1)
     A                                   169'DATE :'
     A            PDATE          6  0    176EDTWRD('  /  /  ')
     A                                   186'PAGE :'
     A                                   193PAGNBR
     A                                      EDTCDE(4)
     A                                      SPACEA(1)
     A                                   169'TIME :'
     A                                   176TIME
     A                                      EDTWRD('  :  :  ')
     A                                   187'<GLR2G0P>'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ================'
     A                                      SPACEA(1)
     A            PYEAR1         3  0     46EDTCDE(4)
     A                                    49'-'
     A            PMM1           2  0     50EDTCDE(4)
     A*
     A            PYEAR2         3  0     73EDTCDE(4)
     A                                    76'-'
     A            PMM2           2  0     77EDTCDE(4)
     A*
     A            PYEAR3         3  0    100EDTCDE(4)
     A                                   103'-'
     A            PMM3           2  0    104EDTCDE(4)
     A*
     A            PYEAR4         3  0    127EDTCDE(4)
     A                                   130'-'
     A            PMM4           2  0    131EDTCDE(4)
     A*
     A            PYEAR5         3  0    154EDTCDE(4)
     A                                   157'-'
     A            PMM5           2  0    158EDTCDE(4)
     A*
     A            PYEAR6         3  0    181EDTCDE(4)
     A                                   184'-'
     A            PMM6           2  0    185EDTCDE(4)
     A*
     A                                      SPACEA(1)
     A                                    36'--------'
     A            PYYMM1         6  0     45EDTWRD('    /  ')
     A                                    53'--------'
     A*
     A                                    63'--------'
     A            PYYMM2         6  0     72EDTWRD('    /  ')
     A                                    80'--------'
     A*
     A                                    90'--------'
     A            PYYMM3         6  0     99EDTWRD('    /  ')
     A                                   107'--------'
     A*
     A                                   117'--------'
     A            PYYMM4         6  0    126EDTWRD('    /  ')
     A                                   134'--------'
     A*
     A                                   144'--------'
     A            PYYMM5         6  0    153EDTWRD('    /  ')
     A                                   161'--------'
     A*
     A                                   171'--------'
     A            PYYMM6         6  0    180EDTWRD('    /  ')
     A                                   188'--------'
     A*
     A                                      SPACEA(1)
     A                                     2'Account Titles'
     A                                    45'Amounts'
     A                                    57'％'
     A                                    72'Amounts'
     A                                    84'％'
     A                                    99'Amounts'
     A                                   111'％'
     A                                   126'Amounts'
     A                                   138'％'
     A                                   153'Amounts'
     A                                   165'％'
     A                                   180'Amounts'
     A                                   192'％'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ================'
     A*
     A          R PD1                       SPACEB(1)
     A            P0303         34         1
     A  12                                35'('
     A  31        P0304         13  2     37EDTCDE(1)
     A N31        P0304@        13  2     36EDTWRD('  ,   ,   ,  $0.  ')
     A  12                                54')'
     A  13                                56'('
     A  24        PR0304         3  0     57EDTCDE(1)
     A N24                                57'***'
     A  13                                60')'
     A*
     A  14                                62'('
     A  31        P0305         13  2     64EDTCDE(1)
     A N31        P0305@        13  2     63EDTWRD('  ,   ,   ,  $0.  ')
     A  14                                81')'
     A  15                                83'('
     A  25        PR0305         3  0     84EDTCDE(1)
     A N25                                84'***'
     A  15                                87')'
     A*
     A  16                                89'('
     A  31        P0306         13  2     91EDTCDE(1)
     A N31        P0306@        13  2     90EDTWRD('  ,   ,   ,  $0.  ')
     A  16                               108')'
     A  17                               110'('
     A  26        PR0306         3  0    111EDTCDE(1)
     A N26                               111'***'
     A  17                               114')'
     A*
     A  18                               116'('
     A  31        P0307         13  2    118EDTCDE(1)
     A N31        P0307@        13  2    117EDTWRD('  ,   ,   ,  $0.  ')
     A  18                               135')'
     A  19                               137'('
     A  27        PR0307         3  0    138EDTCDE(1)
     A N27                               138'***'
     A  19                               141')'
     A*
     A  20                               143'('
     A  31        P0308         13  2    145EDTCDE(1)
     A N31        P0308@        13  2    144EDTWRD('  ,   ,   ,  $0.  ')
     A  20                               162')'
     A  21                               164'('
     A  28        PR0308         3  0    165EDTCDE(1)
     A N28                               165'***'
     A  21                               168')'
     A*
     A  22                               170'('
     A  31        P0309         13  2    172EDTCDE(1)
     A N31        P0309@        13  2    171EDTWRD('  ,   ,   ,  $0.  ')
     A  22                               189')'
     A  23                               191'('
     A  29        PR0309         3  0    192EDTCDE(1)
     A N29                               192'***'
     A  23                               195')'
     A*說明行
     A          R PD1@                      SPACEB(1)
     A            P0303         34         1
     A*虛線行....
     A          R PD2                       SPACEB(1)
     A                                    36'-------------------------'
     A                                    63'-------------------------'
     A                                    90'-------------------------'
     A                                   117'-------------------------'
     A                                   144'-------------------------'
     A                                   171'-------------------------'
     A*空白行....
     A          R PD3                       SPACEB(1)
     A                                    36'                             '
     A*簽名行....
     A          R PT1                       SPACEB(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ================'
     A                                      SPACEA(1)
     A            PSIGN1       198         1
     A                                      SPACEA(1)
     A            PSIGN2       198         1
     A*
     A          R PE9                       SPACEB(1)
     A                                    16'*** NO DATA FOR PRINTING ***'
