     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PRTF   -ID   : GLR2D0P2                                   *
     A*    PROGRAM-ID   : GLR2D0                                     *
     A*    PROGRAM NAME : 損益表-英文                            *
     A*    AUTHOR       :  A1149    MAY                              *
     A*    CREATE DATE  :  1992.11.26                                *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 泛太總帳                                 *
     A****************************************************************
     A                                      REF(GLRF)
     A          R PH01                      SKIPB(2)
     A            P#B16     R             26REFFLD(#B16 PTRF)
     A                                      SPACEA(2)
     A                                    34'Incomes Statement'
     A                                      SPACEA(1)
     A            PDA01          8        38
     A                                      SPACEA(1)
     A  31                                20'Profit Center :'
     A  31        D#A01          6        36
     A  31        P#A02         32        43
     A  31                                  SPACEA(1)
     A                                    20'Fiscal Period :'
     A            DAY#S          7  0     36EDTWRD('   /  /  ')
     A                                    46'-'
     A            DAY#E          7  0     48EDTWRD('   /  /  ')
     A                                      SPACEA(1)
     A                                    58'DATE :'
     A            PDATE          6  0     65EDTWRD('  /  /  ')
     A                                    75'PAGE :'
     A                                    82PAGNBR
     A                                      EDTCDE(4)
     A                                      SPACEA(1)
     A                                    58'TIME :'
     A                                    65TIME
     A                                      EDTWRD('  :  :  ')
     A                                    75'<GLR2D0P>'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==========================='
     A                                      SPACEA(1)
     A                                     6'Account Titles'
     A                                    46'Amounts'
     A                                    68'Totals'
     A                                    80'％'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==========================='
     A*
     A          R PD01                      SPACEB(1)
     A            P0303         34         3
     A  32                                38'('
     A            P0304         13  2     39EDTCDE(2)
     A  32                                56')'
     A  33                                58'('
     A  29        P0305         13  2     59EDTWRD('  ,   ,   ,  $0.  ')
     A N29                                59'                          '
     A  33                                77')'
     A  34                                79'('
     A  30        P100           5  2     80EDTCDE(3)
     A N30                                80' ****'
     A  34                                86')'
     A*說明行....
     A          R PD01@                     SPACEB(1)
     A            P0303         34         3
     A*虛線行....
     A          R PD02                      SPACEB(1)
     A                                    59'-----------------------------'
     A*空白行....
     A          R PD03                      SPACEB(1)
     A                                    59'                             '
     A*簽名行....
     A          R PT01                      SPACEB(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==========================='
     A                                      SPACEA(1)
     A            PSIGN1        87         1
     A                                      SPACEA(1)
     A            PSIGN2        87         1
     A*
     A          R PE01                      SPACEB(1)
     A                                    16'*** NO DATA FOR PRINTING ***'
