     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : GLR2R0P                                    *
     A*    PROGRAM NAME :傳票刪除清單列印                          *
     A*    AUTHOR       : A1150                                      *
     A*    CREATE DATE  : 81/11/26                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A                                      REF(GLRF)
     A          R PH1                       SKIPB(2)
     A            #B16      R             24REFFLD(#B16 PTRF)
     A                                      SPACEA(2)
     A                                    33'傳票刪除統計'
     A                                      SPACEA(1)
     A            PFLD           8        36
     A                                      SPACEA(1)
     A                                    30'會計年度:'
     A            WYEAR          3  0     42EDTCDE(1)
     A                                      SPACEA(1)
     A                                    30'會計期間:'
     A            WPERD          2  0     42EDTCDE(1)
     A                                    46'('
     A            PAH10F    R   -1        48REFFLD(AH10)
     A                                      EDTWRD('   /  /  ')
     A                                    58'-'
     A            PAH10T    R   -1        60REFFLD(AH10)
     A                                      EDTWRD('   /  /  ')
     A                                    70')'
     A                                      SPACEA(2)
     A                                    50'日期:'
     A            PDATE          6  0     58EDTCDE(Y)
     A                                    67'頁次:'
     A                                    75PAGNBR
     A                                      EDTCDE(4)
     A                                      SPACEA(1)
     A                                    50'時間:'
     A                                    58TIME
     A                                      EDTWRD('  :  :  ')
     A                                    68'<GLR2R0P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==================='
     A                                      SPACEA(1)
     A                                    20'傳票號碼'
     A                                    36'傳票日期'
     A                                    50'刪除日期'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==================='
     A*
     A          R PD1                       SPACEB(1)
     A            AH02      R             21
     A            PAH10     R   -1        36REFFLD(AH10)
     A                                      EDTWRD('   /  /  ')
     A            PAH98     R   -1        50REFFLD(AH98)
     A                                      EDTWRD('   /  /  ')
     A*
     A          R PT1                       SPACEB(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==================='
     A                                      SPACEA(1)
     A                                    19'傳票刪除筆數'
     A            TTL            3  0     36EDTCDE(4)
     A*
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
