     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : GLR4E0P                                    *
     A*    PROGRAM NAME :資金代碼資料列印                          *
     A*    AUTHOR       : A1150                                      *
     A*    CREATE DATE  : 81/10/29                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A                                      REF(GLRF)
     A          R PH1                       SKIPB(2)
     A                                     1MSGCON(040 US#9002 *LIBL/S#MF)
     A                                      SPACEA(2)
     A                                     1'資金代碼資料列印'
     A                                      SPACEA(2)
     A                                     1'公司別　:'
     A            PAD01     R             13REFFLD(AD01)
     A            #B02      R             16REFFLD(#B02 PTRF)
     A                                    51'日期:'
     A            PDATE          6  0     59EDTCDE(Y)
     A                                    68'頁次:'
     A                                    76PAGNBR
     A                                      EDTCDE(4)
     A                                      SPACEA(1)
     A                                     1'資金代碼:'
     A            DAD02F    R             13REFFLD(AD02)
     A                                    22'-'
     A            DAD02T    R             24REFFLD(AD02)
     A                                    51'時間:'
     A                                    59TIME
     A                                      EDTWRD('  :  :  ')
     A                                    70'<GLR4E0P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     5'資金代碼'
     A                                    18'說明'
     A                                    51'類別'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A*
     A          R PD1                       SPACEB(1)
     A            AD02      R              6REFFLD(AD02)
     A            AD03      R             18REFFLD(AD03)
     A            PFLD1          6        51
     A*
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
