     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : GLR4D0P                                    *
     A*    PROGRAM NAME :沖帳組合資料列印                          *
     A*    AUTHOR       : A1150                                      *
     A*    CREATE DATE  : 81/10/30                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A                                      REF(GLRF)
     A          R PH1                       SKIPB(2)
     A                                     1MSGCON(040 US#9002 *LIBL/S#MF)
     A                                      SPACEA(2)
     A                                     1'沖帳組合資料列印'
     A                                      SPACEA(2)
     A                                     1'公司別　:'
     A            PAE01     R             13REFFLD(AE01)
     A            #B02      R             16REFFLD(#B02 PTRF)
     A                                    94'日期:'
     A            PDATE          6  0    102EDTCDE(Y)
     A                                   111'頁次:'
     A                                   119PAGNBR
     A                                      EDTCDE(4)
     A                                      SPACEA(1)
     A                                     1'沖帳代碼:'
     A            DAE02F    R             13REFFLD(AE02)
     A                                    16'-'
     A            DAE02T    R             18REFFLD(AE02)
     A                                    94'時間:'
     A                                   102TIME
     A                                      EDTWRD('  :  :  ')
     A                                   113'<GLR4D0P>'
     A                                      SPACEA(1)
     A                                     1'===============================+
     A                                       ===============================+
     A                                       ===============================+
     A                                       =============================='
     A                                      SPACEA(1)
     A                                     1'沖帳代碼'
     A                                    12'成本中心'
     A                                    25'對象別'
     A                                    35'相關號碼１'
     A                                    48'相關號碼２'
     A                                    63'日期'
     A                                    72'說明'
     A                                      SPACEA(1)
     A                                     1'===============================+
     A                                       ===============================+
     A                                       ===============================+
     A                                       =============================='
     A*
     A          R PD1                       SPACEB(1)
     A            AE02      R              5REFFLD(AE02)
     A            P411           1  0     15EDTCDE(4)
     A            P511           1        17
     A            P421           1  0     27EDTCDE(4)
     A            P521           1        29
     A            P431           1  0     39EDTCDE(4)
     A            P531           1        41
     A            P441           1  0     52EDTCDE(4)
     A            P541           1        54
     A            P451           1  0     64EDTCDE(4)
     A            P551           1        66
     A            AE03      R             72REFFLD(AE03)
     A*
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
