     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : GLR4C0P                                    *
     A*    PROGRAM NAME :欄位名稱資料列印                          *
     A*    AUTHOR       : A1150                                      *
     A*    CREATE DATE  : 81/10/28                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A                                      REF(GLRF)
     A          R PH1                       SKIPB(2)
     A                                     1MSGCON(040 US#9002 *LIBL/S#MF)
     A                                      SPACEA(2)
     A                                     1'欄位名稱資料列印'
     A                                      SPACEA(2)
     A                                     1'公司別　:'
     A            PAA01     R             13REFFLD(AA01)
     A            #B02      R             16REFFLD(#B02 PTRF)
     A                                    62'日期:'
     A            PDATE          6  0     70EDTCDE(Y)
     A                                    79'頁次:'
     A                                    87PAGNBR
     A                                      EDTCDE(4)
     A                                      SPACEA(1)
     A                                     1'欄位代碼:'
     A            DAA02F    R             13REFFLD(AA02)
     A                                    16'-'
     A            DAA02T    R             18REFFLD(AA02)
     A                                    62'時間:'
     A                                    70TIME
     A                                      EDTWRD('  :  :  ')
     A                                    81'<GLR4C0P>'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================='
     A                                      SPACEA(1)
     A                                     1'欄位代號／名稱'
     A                                    34'檢核程式'
     A                                    80'參數'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================='
     A*
     A          R PD1                       SPACEB(1)
     A            AA02      R              5REFFLD(AA02)
     A            AA03      R             11REFFLD(AA03)
     A            AA04      R             35REFFLD(AA04)
     A            P#Y03         32        47
     A            AA05      R             81REFFLD(AA05)
     A*
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
