     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PRTF   -ID   : GLR6G0P                                    *
     A*    PROGRAM-ID   : GLR6G0                                     *
     A*    PROGRAM NAME : 現金流量表－預算比較－英文格式           *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    CREATE DATE  : 1993.01.11                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 泛太總帳                                 *
     A****************************************************************
     A                                      REF(GLRF)
     A          R PH01                      SKIPB(2)
     A            P#B16     R             46REFFLD(#B16 PTRF)
     A                                      SPACEA(2)
     A                                    51'Comparative Cash Flow'
     A                                      SPACEA(1)
     A            PDA01          8        58
     A                                      SPACEA(1)
     A  30                                42'Profit Center :'
     A  30        DAH05     R             58REFFLD(AP04)
     A  30        P#A02         32        65
     A  30                                  SPACEA(1)
     A                                    42'Fiscal Period :'
     A            DAH10S         7  0     58
     A                                      EDTWRD('   /  /  ')
     A                                    68'-'
     A            DAH10E         7  0     70
     A                                      EDTWRD('   /  /  ')
     A                                      SPACEA(1)
     A                                    51'Ver. :'
     A            DAU03     R             58REFFLD(AU03)
     A                                      SPACEA(2)
     A                                    92'Date :'
     A            PDATE          6  0    100EDTWRD('  /  /  ')
     A                                   109'Page :'
     A                                   117PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                    92'Time :'
     A                                   100TIME
     A                                      EDTWRD('  :  :  ')
     A                                   110'<GLR6G0P>'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       =============================='
     A                                      SPACEA(1)
     A                                    49'Actual'
     A                                    74'Budget'
     A                                   100'Difference'
     A                                      SPACEA(1)
     A                                    42'-------------------'
     A                                    67'-------------------'
     A                                    92'---------------------------'
     A                                      SPACEA(1)
     A                                     4'Titles'
     A                                    52'Amount'
     A                                    77'Amount'
     A                                   102'Amount'
     A                                   114'％'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       =============================='
     A          R PD01                      SPACEB(1)
     A            P0303         34         2
     A  61                                41'('
     A N81        P0304A        13  2     43EDTCDE(1)
     A  81        P0304B        13  2     42EDTWRD('  ,   ,   ,  $0.  ')
     A  61                                60')'
     A  62                                66'('
     A N82        P0305A        13  2     68EDTCDE(1)
     A  82        P0305B        13  2     67EDTWRD('  ,   ,   ,  $0.  ')
     A  62                                85')'
     A  63                                91'('
     A N83        P0345A        13  2     93EDTCDE(1)
     A  83        P0345B        13  2     92EDTWRD('  ,   ,   ,  $0.  ')
     A  63                               110')'
     A  64                               112'('
     A N84        P03B           5  2    113EDTCDE(3)
     A  84                               114'*****'
     A  64                               119')'
     A*
     A*虛線行....
     A          R PD01A                     SPACEB(1)
     A N80                                40'------------------------------+
     A                                       ------------------------------+
     A                                       --------------------'
     A  80                                 1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       =============================='
     A*
     A*說明行....
     A          R PD01B                     SPACEB(1)
     A  85        P0303         34         2
     A*
     A*簽名行....
     A          R PT02                      SPACEB(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       =============================='
     A                                      SPACEA(1)
     A            PSIGN1       127         1
     A                                      SPACEA(1)
     A            PSIGN2       127         1
     A*
     A          R PE01                      SPACEB(1)
     A                                    16'*** NO DATA FOR PRINTING ***'
