     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : GLS003                                     *
     A*    PROGRAM NAME : 資金金額計算　　                         *
     A*    AUTHOR       : A1034  STEPHANIE                           *
     A*    CREATE DATE  : 1992.11.17                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 泛太總帳                                 *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/GLRF)
     A                                      MSGLOC(22)
     A*----------------------------------------------------------------
     A          R SFLSRD                    SFL
     A                                      SFLNXTCHG
     A            RRND           3Y 0O  3  4EDTCDE(4)
     A            DAH12     R        O    +1REFFLD(AH12)
     A            DAH03     R        O    +1REFFLD(AH03)
     A            DAH22     R        O    +1REFFLD(AH22)
     A*----------------------------------------------------------------
     A          R SFLCRD                    SFLCTL(SFLSRD)
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0018)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A*----------------------------------------------------------------
     A          R SFLSRC                    SFL
     A                                      SFLNXTCHG
     A            RRNC           3Y 0O  3  4EDTCDE(4)
     A            DAH12     R        O    +1REFFLD(AH12)
     A            DAH03     R        O    +1REFFLD(AH03)
     A            DAH22     R        O    +1REFFLD(AH22)
     A*----------------------------------------------------------------
     A          R SFLCRC                    SFLCTL(SFLSRC)
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0018)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
