     A*%%TS  SD  19921117  162812  TSPGMR      REL-V2R1M1  5738-PW1
     A****************************************************************
     A*   獂び戈癟м秨祇Τそ⌒舦┮Τ    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : GLS004                                     *
     A*    PROGRAM NAME :肚布ㄓ方跌怠琩高                          *
     A*    AUTHOR       : A1034 STEPHANIE                            *
     A*    CREATE DATE  : 81/11/17                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PTRF)
     A                                      PRINT
     A          R DSPC0
     A                                      ASSUME
     A                                  2  2' '
     A          R DSPD1
     A*%%TS  SD  19921117  162812  TSPGMR      REL-V2R1M1  5738-PW1
     A                                      CA03(03)
     A                                      CA12(12)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      OVERLAY
     A                                      PROTECT
     A                                      CLRL(*NO)
     A                                  5 50'      肚布ㄓ方跌怠琩高      '
     A                                      DSPATR(RI)
     A                                  6 50' '
     A                                      DSPATR(RI)
     A            D#B02         12A  O  6 52
     A                                  6 65' '
     A            DAK12          7Y 0O  6 67EDTWRD('   /  /  ')
     A                                  6 77' '
     A                                  6 79' '
     A                                      DSPATR(RI)
     A                                  7 50' '
     A                                      DSPATR(RI)
     A                                  7 53'S'
     A                                      DSPATR(UL)
     A                                  7 55'肚布ㄓ方  筁眀ら'
     A                                      DSPATR(UL)
     A                                  7 79' '
     A                                      DSPATR(RI)
     A                                  8 50' '
     A                                      DSPATR(RI)
     A                                  8 52'   '
     A            DA502          2A  B  8 56DSPATR(CS)
     A                                  8 59'                   '
     A                                  8 79' '
     A                                      DSPATR(RI)
     A                                  9 50' '
     A                                      DSPATR(RI)
     A            DSEL1          1A  B  9 53
     A N61                                  DSPATR(ND)
     A N61                                  DSPATR(PR)
     A  61                                  DSPATR(CS)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(HI)
     A            DA5021         2A  O  9 56
     A            D#Y031         6A  O  9 59
     A            DA5031         7Y 0O  9 67EDTWRD('   /  /  ')
     A                                  9 77' '
     A                                  9 79' '
     A                                      DSPATR(RI)
     A                                 10 50' '
     A                                      DSPATR(RI)
     A            DSEL2          1A  B 10 53
     A N62                                  DSPATR(ND)
     A N62                                  DSPATR(PR)
     A  62                                  DSPATR(CS)
     A  62                                  DSPATR(HI)
     A            DA5022         2A  O 10 56
     A            D#Y032         6A  O 10 59
     A            DA5032         7Y 0O 10 67EDTWRD('   /  /  ')
     A                                 10 77' '
     A                                 10 79' '
     A                                      DSPATR(RI)
     A                                 11 50' '
     A                                      DSPATR(RI)
     A            DSEL3          1A  B 11 53
     A N63                                  DSPATR(ND)
     A N63                                  DSPATR(PR)
     A  63                                  DSPATR(CS)
     A  63                                  DSPATR(HI)
     A            DA5023         2A  O 11 56
     A            D#Y033         6A  O 11 59
     A            DA5033         7Y 0O 11 67EDTWRD('   /  /  ')
     A                                 11 77' '
     A                                 11 79' '
     A                                      DSPATR(RI)
     A                                 12 50' '
     A                                      DSPATR(RI)
     A            DSEL4          1A  B 12 53
     A N64                                  DSPATR(ND)
     A N64                                  DSPATR(PR)
     A  64                                  DSPATR(CS)
     A  64                                  DSPATR(HI)
     A            DA5024         2A  O 12 56
     A            D#Y034         6A  O 12 59
     A            DA5034         7Y 0O 12 67EDTWRD('   /  /  ')
     A                                 12 77' '
     A                                 12 79' '
     A                                      DSPATR(RI)
     A                                 13 50' '
     A                                      DSPATR(RI)
     A            DSEL5          1A  B 13 53
     A N65                                  DSPATR(ND)
     A N65                                  DSPATR(PR)
     A  65                                  DSPATR(CS)
     A  65                                  DSPATR(HI)
     A            DA5025         2A  O 13 56
     A            D#Y035         6A  O 13 59
     A            DA5035         7Y 0O 13 67EDTWRD('   /  /  ')
     A                                 13 77' '
     A                                 13 79' '
     A                                      DSPATR(RI)
     A                                 14 50' '
     A                                      DSPATR(RI)
     A            DSEL6          1A  B 14 53
     A N66                                  DSPATR(ND)
     A N66                                  DSPATR(PR)
     A  66                                  DSPATR(CS)
     A  66                                  DSPATR(HI)
     A            DA5026         2A  O 14 56
     A            D#Y036         6A  O 14 59
     A            DA5036         7Y 0O 14 67EDTWRD('   /  /  ')
     A                                 14 77' '
     A                                 14 79' '
     A                                      DSPATR(RI)
     A                                 15 50' '
     A                                      DSPATR(RI)
     A            DSEL7          1A  B 15 53
     A N67                                  DSPATR(ND)
     A N67                                  DSPATR(PR)
     A  67                                  DSPATR(CS)
     A  67                                  DSPATR(HI)
     A            DA5027         2A  O 15 56
     A            D#Y037         6A  O 15 59
     A            DA5037         7Y 0O 15 67EDTWRD('   /  /  ')
     A                                 15 77' '
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 16 50' '
     A                                      DSPATR(RI)
     A            DSEL8          1A  B 16 53
     A N68                                  DSPATR(ND)
     A N68                                  DSPATR(PR)
     A  68                                  DSPATR(CS)
     A  68                                  DSPATR(HI)
     A            DA5028         2A  O 16 56
     A            D#Y038         6A  O 16 59
     A            DA5038         7Y 0O 16 67EDTWRD('   /  /  ')
     A                                 16 77' '
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 17 50' '
     A                                      DSPATR(RI)
     A                                 17 52'                          '
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 18 50'  F12 =玡礶             '
     A                                      DSPATR(RI)
