     A****************************************************************
     A*   人頭馬寰盛洋酒股份有限公司－版權所有    TEL:8773-9099    *
     A*                                                              *
     A*    PROGRAM-ID   : NPA008                                     *
     A*    PROGRAM NAME : 產生新年度A&P CODE代碼                 *
     A*    AUTHOR       : MICHELLE                                   *
     A*    CREATE DATE  : 2002.03.01                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 產品促銷預算                             *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(GLALIB/NPRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A**                                    CSRLOC(#LIN #COL)
     A                                      CA03(03)
     A                                      CF14(14)
     A                                  1  2'<NPA006.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 30'產生新年度A&P CODE '
     A                                      DSPATR(RI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5  7'預算年度:'
     A            DNA01     R        B  5 19REFFLD(NA01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                  7  7'代碼類別:'
     A            DNA04     R        B  7 19REFFLD(NA04)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                    +2'(T=合計D=明細N=新建明細)'
     A                                 15  2'選擇內容     :'
     A            DOPT           1Y 0B 15 19EDTCDE(4)
     A                                      VALUES(1 2 3)
     A                                 15 23'1.已存在者'
     A                                 15 36'放棄拷貝'
     A                                 16 23'2.已存在者'
     A                                 16 36'全部覆蓋無須確認'
     A                                 17 23'3.已存在者'
     A                                 17 36'逐筆確認是否覆蓋'
     A*
     A            ERRID          7   H
     A            ERRF          10   H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'PF3 =回主畫面'
     A                                 23 27'PF14=處理作業'
     A                                 24 64'【人頭馬寰盛】'
     A                                      DSPATR(HI)
     A*----------------------------------------------------------------
     A
     A          R DSPD2
     A*                                     ALWROL
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                 13  3'                                 -
     A                                                                        '
     A                                      DSPATR(RI)
     A                                 14  3' '
     A                                      DSPATR(RI)
     A                                 14 69' '
     A                                      DSPATR(RI)
     A                                 15  3' '
     A                                      DSPATR(RI)
     A                                 15  5' <NPA006.2> '
     A                                    +2'                                 '
     A                                 15 69' '
     A                                      DSPATR(RI)
     A                                 16  3' '
     A                                      DSPATR(RI)
     A                                    +2'                                -
                                                           '
     A                                 16 69' '
     A                                      DSPATR(RI)
     A                                 17  3' '
     A                                      DSPATR(RI)
     A                                 17  5'該年度A&P :'
     A            DCAT          10A  O    +2
     A                                    +2'已存在'
     A                                    +2'                '
     A                                 17 69' '
     A                                      DSPATR(RI)
     A                                 18  3' '
     A                                      DSPATR(RI)
     A                                    +2'                                '
     A                                 18 69' '
     A                                      DSPATR(RI)
     A                                 19  3' '
     A                                      DSPATR(RI)
     A                                 19  5'是否覆蓋:'
     A            COVE           1   B 19 17VALUES('Y' 'N')
     A                                 19 22'(Y/N)'
     A                                    +5'全部覆蓋:'
     A            CALL           1   B    +1VALUES(' ' 'Y')
     A                                    +2'(Y)'
     A                                    +2'            '
     A                                 19 69' '
     A                                      DSPATR(RI)
     A                                 20  3' '
     A                                      DSPATR(RI)
     A                                 20 69' '
     A                                      DSPATR(RI)
     A                                 21  3'                                 -
     A                                                                        '
     A                                      DSPATR(RI)
