     A*%%TS  SD  19940702  092140  D910121     REL-V2R2M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/NPRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19940702  092140  D910121     REL-V2R2M0  5738-PW1
     A                                      CSRLOC(#LIN       #COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF18(18)
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<NPA004.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 30'合併品牌維護'
     A                                      DSPATR(RI)
     A                                  2 72TIME
     A                                  3  2'產品組別:'
     A            DNC01     R        B  3 14REFFLD(NC01)
     A                                      VALUES('  ' '10' '20' '30')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                  4  2'品牌    :'
     A            DNC02     R        B  4 14REFFLD(NC02)
     A N61                                  DSPATR(HI)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  4 23'(拷貝:'
     A            DNC01C    R        B  4 32REFFLD(NC01)
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A            DNC02C    R        B  4 35REFFLD(NC02)
     A N65                                  DSPATR(HI)
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A                                  4 38')'
     A                                  5  2'作業選擇:'
     A            DOPT           1Y 0B  5 14VALUES(1 4 5)
     A                                      EDTCDE(4)
     A                                  5 23'( 1.新增'
     A                                  5 34'4.刪除'
     A                                  5 43'5.查詢)'
     A                                  6  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'PF3 =回主畫面'
     A                                 23 27'PF4 =欄位查詢'
     A                                 23 44'PF18=全頁查詢'
     A                                 24 65'【人頭馬匯東】'
     A                                  3 18'(10=白蘭地 20=威士忌 30=葡萄+
     A                                      酒)'
     A*----------------------------------------------------------------
     A          R DSPD2
     A*%%TS  SD  19940702  092140  D910121     REL-V2R2M0  5738-PW1
     A                                      CA03(03)
     A                                      CF05(05)
     A                                      CF12(12)
     A                                  1  2'<NPA004.2>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 30'合併品牌維護'
     A                                      DSPATR(RI)
     A                                  2 72TIME
     A                                  3  2'產品組別:'
     A            DNC01     R        O  3 14REFFLD(NC01)
     A            NC01D         10A  O  3 17
     A                                  4  2'品牌    :'
     A            DNC02     R        O  4 14REFFLD(NC02)
     A            #A03      R        O  4 17REFFLD(#A03 *LIBL/RERF)
     A                                  5  2'作業選擇:'
     A            DOPT           1Y 0O  5 14EDTCDE(4)
     A                                  5 23'( 1.新增'
     A                                  5 34'4.刪除'
     A                                  5 43'5.查詢)'
     A                                  6  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'PF3 =回主畫面'
     A                                 23 27'PF5 =參考資料'
     A                                 23 44'PF12=回前畫面'
     A                                 24 65'【人頭馬匯東】'
