     A*%%TS  SD  19940704  101559  D910121     REL-V2R2M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/NPRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19940704  101559  D910121     REL-V2R2M0  5738-PW1
     A                                      CSRLOC(#LIN       #COL)
     A                                      CA03(03)
     A                                      CF18(18)
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<NPA0011.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 27'4,5月產品促銷實績維護'
     A                                      DSPATR(RI)
     A                                  2 72TIME
     A                                  3  2'公司別  :'
     A            DND01     R        B  3 14REFFLD(ND01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                  3 34'年度    :'
     A            DND02          3Y 0O  3 46EDTCDE(3)
     A                                  4  2'產品組別:'
     A            DND03     R        B  4 14REFFLD(ND03)
     A                                      VALUES('  ' '10' '20' '30')
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  4 34'品牌代碼:'
     A            DND04     R        B  4 46REFFLD(ND04)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                  3 53'(注意: 99=合併品牌)'
     A                                  5  3'A&P CODE :'
     A            DND05     R        B  5 14REFFLD(ND05)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                  6  2'作業選擇:'
     A            DOPT           1Y 0B  6 14VALUES(2 5)
     A                                      EDTCDE(4)
     A                                  6 19'( 2.修改'
     A                                  6 30'5.查詢)'
     A                                  7  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'PF3 =回主畫面'
     A                                 23 28'PF18=全頁查詢'
     A                                 24 65'【人頭馬匯東】'
     A*----------------------------------------------------------------
     A          R DSPD2
     A*%%TS  SD  19940702  093157  D910121     REL-V2R2M0  5738-PW1
     A                                      CA03(03)
     A                                      CF05(05)
     A                                      CF12(12)
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 27'4,5月產品促銷實績維護'
     A                                      DSPATR(RI)
     A                                  2 72TIME
     A                                  3  2'公司別  :'
     A            DND01     R        O  3 14REFFLD(ND01)
     A            #B02      R        O  3 17REFFLD(#B02 *LIBL/PT#BPF)
     A                                  3 34'年度    :'
     A            DND02          3Y 0O  3 46EDTCDE(3)
     A                                  3 53'(注意: 99=合併品牌)'
     A                                  4  2'產品組別:'
     A            DND03     R        O  4 14REFFLD(ND03)
     A            PND03          8O  O  4 17
     A                                  4 34'品牌代碼:'
     A            DND04     R        O  4 46REFFLD(ND04)
     A            #A03      R        O  4 49REFFLD(#A03 *LIBL/RERF)
     A                                  5  3'A&P CODE :'
     A            DND05     R        O  5 14REFFLD(ND05)
     A            NA03      R        O  5 18REFFLD(NA03)
     A                                  6  2'作業選擇:'
     A            DOPT           1Y 0O  6 14EDTCDE(4)
     A                                  6 19'( 2.修改'
     A                                  6 30'5.查詢)'
     A                                  7  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  8  2'會計期間　　　　　　　金額 '
     A                                      DSPATR(UL)
     A                                  8 37'會計期間　　　　　　　金額 '
     A                                      DSPATR(UL)
     A                                  9  6'01'
     A                                  9 41'02'
     A            DND06A    R        B  9 14REFFLD(ND06B)
     A                                      EDTCDE(J)
     A  71                                  DSPATR(PC)
     A  71                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DND07A    R        B  9 49REFFLD(ND07B)
     A                                      EDTCDE(J)
     A  72                                  DSPATR(PC)
     A  72                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 17 37'合　　計'
     A            DTOT1         13Y 2O 17 48EDTWRD('  ,   ,   ,  $0.  -')
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'PF3 =回主畫面'
     A                                 23 27'PF5 =參考資料'
     A                                 23 44'PF12=回前畫面'
     A                                 24 65'【人頭馬匯東】'
