     A*%%TS  SD  19940611  091326  D910121     REL-V2R2M0  5738-PW1
     A*%%EC
     A                                      REF(*LIBL/GLRF)
     A          R PH1
     A*%%TS  SD  19940611  091326  D910121     REL-V2R2M0  5738-PW1
     A                                  1  2'<NPB021.1>'
     A                                  1 25MSGCON(032 US#9001 *LIBL/S#MF)
     A            DDATE          6  0O  1 69EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 30'產品促銷科目餘額批次'
     A                                  2 69TIME
     A                                  5 29'公司別　:'
     A            DAI01     R        O  5 41REFFLD(AI01 GLAIPF)
     A                                  7 29'會計年度:'
     A            DYEAR          3  0O  7 41EDTCDE(4)
     A                                  8 29'會計期間:'
     A            DMM            2  0O  8 41EDTCDE(4)
     A            DYMDS          8  0O    +1EDTWRD('    /  /  ')
     A                                    +1'-'
     A            DYMDE          8  0O    +1EDTWRD('    /  /  ')
     A  28                             21 29'***批次處理中，請稍候***'
     A                                 23  2'執行'
     A                                 23 10'PF3 =回主畫面'
     A                                 23 27'PF4 =欄位查詢'
     A                                 23 44'PF14=處理作業'
     A                                 24 65'【人頭馬寰盛】'
