     A*================================================================
     A* MODI CODE | AUTHOR |  DATE  | DESCRIPTION
     A*----------------------------------------------------------------
     A*  M001     |MICHELLE|01.08.03| A&P增加種類代碼及容量選項
     A*----------------------------------------------------------------
     A*================================================================
     A*%%TS  SD  19940701  083710  D910121     REL-V2R2M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/NPRF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*--------------------------------------------------------------*
     A          R SFLSR1                    SFL
     A*%%TS  SD  19940627  165615  D910121     REL-V2R2M0  5738-PW1
     A  54                                  SFLNXTCHG
     A            RRN1           4S 0H
     A            DOPT1          1A  B 10  2VALUES(' ' '5')
     A            ND01      R        O 10  4
     A            ND02      R        O 10  7EDTCDE(3)
     A            ND03      R        O 10 13
     A            ND04      R        O 10 18
     A*M001D      D#A03         22A  O 10 21
M001MA*           ND05      R        O 10 44
M001MA*           NA03      R        O 10 48
M001MA            ND05      R        O 10 25
M001MA            NA03      R        O 10 29
M001AA            ND19           2   O 10 60
M001AA            ND20           1   O 10 65
     A*--------------------------------------------------------------*
     A          R SFLCR1                    SFLCTL(SFLSR1)
     A*%%TS  SD  19940627  170043  D910121     REL-V2R2M0  5738-PW1
     A                                      SFLSIZ(0060)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(25 '下一頁')
     A                                      CA03(03)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN1          4S 0H      SFLRCDNBR
     A                                  1  2'NPI011'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 29'產品促銷預算實績查詢'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5  2'輸入作業選擇:'
     A                                  6  6'5=查詢'
     A                                  7  3'公年'
M001MA*                                 8  2'S司度 別 品牌／說明       -
M001MA*                                             A&P CODE／說明           -
M001MA*                                            '
M001MA                                  8  2'S司度 別 品牌-
M001MA                                       A&P CODE／說明             -
M001MA                                        種類　容量 '
     A                                      DSPATR(UL)
     A            DBGN11    R        B  9  4REFFLD(ND01)
     A            DBGN12    R        B  9  7REFFLD(ND02)
     A                                      EDTCDE(4)
     A            DBGN13    R        B  9 13REFFLD(ND03)
     A            DBGN14    R        B  9 18REFFLD(ND04)
M001MA*           DBGN15    R        B  9 44REFFLD(ND05)
M001MA            DBGN15    R        B  9 25REFFLD(ND05)
     A                                  7 12'組'
     A*--------------------------------------------------------------*
     A          R DSPC1
     A*%%TS  SD  19940513  102536  D910121     REL-V2R2M0  5738-PW1
     A                                 22  2'執行'
     A                                 22 11'F3 =回主畫面'
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        50A  O 24  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 24 64MSGCON(016 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
     A*--------------------------------------------------------------*
     A          R DSPD2
     A*%%TS  SD  19940701  083710  D910121     REL-V2R2M0  5738-PW1
     A                                      CA03(03)
     A                                      CF12(12)
     A                                      OVERLAY
     A                                  1  2'NPI011'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR002'
     A                                  2 29'產品促銷預算實績查詢'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  3  2'公司別:'
     A            ND01      R        O  3 14REFFLD(ND01)
     A            #B02      R        O  3 17REFFLD(#B02 *LIBL/PT#BPF)
     A                                  3 40'預算年度:'
     A            ND02      R        O    +1EDTCDE(4)
     A                                  4  2'產品組別:'
     A            ND03      R        O  4 14REFFLD(ND03)
     A            PND03          8O  O  4 17
     A                                  4 40'品牌代碼:'
     A            ND04      R        O    +1REFFLD(ND04)
     A            D#A03         22A  O    +1
     A                                  5  3'A&P CODE :'
     A            ND05      R        O  5 14REFFLD(ND05)
     A            NA03      R        O  5 18REFFLD(NA03)
M001AA                                  6  2'產品種類:'
M001AA            ND19           2   O    +1
M001AA            D#703         22A  O    +1
M001AA                                  6 40'容量代碼:'
M001AA            ND20           1   O    +1
M001AA            D#A032        22A  O    +1
M001AA*第７行～第２０行往下移一行
     A*
     A                                  8  7'01'
     A                                 10  7'03'
     A                                 12  7'05'
     A                                 14  7'07'
     A                                 16  7'09'
     A                                 18  7'11'
     A                                 20  7'13'
     A  59                                  DSPATR(ND)
     A                                  9  7'02'
     A                                 11  7'04'
     A                                 13  7'06'
     A                                 15  7'08'
     A                                 17  7'10'
     A                                 19  7'12'
     A            ND06B     R        O  8 14REFFLD(ND06B)
     A                                      EDTCDE(J)
     A            ND07B     R        O  9 14REFFLD(ND07B)
     A                                      EDTCDE(J)
     A            ND08B     R        O 10 14REFFLD(ND08B)
     A                                      EDTCDE(J)
     A            ND09B     R        O 11 14REFFLD(ND09B)
     A                                      EDTCDE(J)
     A            ND10B     R        O 12 14REFFLD(ND10B)
     A                                      EDTCDE(J)
     A            ND11B     R        O 13 14REFFLD(ND11B)
     A                                      EDTCDE(J)
     A            ND12B     R        O 14 14REFFLD(ND12B)
     A                                      EDTCDE(J)
     A            ND13B     R        O 15 14REFFLD(ND13B)
     A                                      EDTCDE(J)
     A            ND14B     R        O 16 14REFFLD(ND14B)
     A                                      EDTCDE(J)
     A            ND15B     R        O 17 14REFFLD(ND15B)
     A                                      EDTCDE(J)
     A            ND16B     R        O 18 14REFFLD(ND16B)
     A                                      EDTCDE(J)
     A            ND17B     R        O 19 14REFFLD(ND17B)
     A                                      EDTCDE(J)
     A            ND18B     R        O 20 14REFFLD(ND18B)
     A                                      EDTCDE(J)
     A  59                                  DSPATR(ND)
     A                                 21  2'合　　計'
     A            DTOT1         13Y 2O 21 13EDTWRD('  ,   ,   ,  $0.  -')
     A                                 23  2'執行'
     A                                 23 11'F3 =回主畫面'
     A                                 23 27'F12=回前畫面'
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        50A  O 24  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 24 64MSGCON(016 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
M001AA*第７行～第２０行往下移一行
     A            ND06A     R        O  8 49REFFLD(ND06B)
     A                                      EDTCDE(J)
     A            ND07A     R        O  9 49REFFLD(ND07B)
     A                                      EDTCDE(J)
     A            ND08A     R        O 10 49REFFLD(ND08B)
     A                                      EDTCDE(J)
     A            ND09A     R        O 11 49REFFLD(ND09B)
     A                                      EDTCDE(J)
     A            ND10A     R        O 12 49REFFLD(ND10B)
     A                                      EDTCDE(J)
     A            ND11A     R        O 13 49REFFLD(ND11B)
     A                                      EDTCDE(J)
     A            ND12A     R        O 14 49REFFLD(ND12B)
     A                                      EDTCDE(J)
     A            ND13A     R        O 15 49REFFLD(ND13B)
     A                                      EDTCDE(J)
     A            ND14A     R        O 16 49REFFLD(ND14B)
     A                                      EDTCDE(J)
     A            ND15A     R        O 17 49REFFLD(ND15B)
     A                                      EDTCDE(J)
     A            ND16A     R        O 18 49REFFLD(ND16B)
     A                                      EDTCDE(J)
     A            ND17A     R        O 19 49REFFLD(ND17B)
     A                                      EDTCDE(J)
     A                                 20 42'd3'
     A  59                                  DSPATR(ND)
     A            ND18A     R        O 21 49REFFLD(ND18B)
     A                                      EDTCDE(J)
     A  59                                  DSPATR(ND)
     A            DTOT2         13Y 2O 21 48EDTWRD('  ,   ,   ,  $0.  -')
M001MA*                                 6  2'會計期間          預算金額    -
M001MA                                  7  2'會計期間          預算金額    -
     A                                                           實績金額'
     A                                      DSPATR(UL)
