     A*%%TS  SD  19960830  145309  D910454     REL-V3R1M0  5763-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CA03(03)
     A*  80/11/15  13:50:09    REPGMR      REL-R03M00  5728-PW1
     A          R DSPC1
     A*%%TS  SD  19960830  145309  D910454     REL-V3R1M0  5763-PW1
     A                                      OVERLAY
     A                                  1  2'NPM100'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 28'產品促銷預算比較主畫面'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                      DSPATR(UL)
     A                                  4  7'資料維護'
     A                                  4 32'查詢作業'
     A                                  4 59'報表列印'
     A                                  5  3'************************'
     A                                  5 28'**************************'
     A                                  5 55'*************************'
     A                                  6  3'01.產品促銷預算維護'
     A                                      DSPATR(UL)
     A                                  6 28'11.產品促銷預算實績查詢'
     A                                      DSPATR(UL)
     A                                  6 55'41.品牌促銷實績金額明細表'
     A                                      DSPATR(UL)
     A                                  7  3'02. A&P CODE維護'
     A                                      DSPATR(UL)
     A                                  7 55'42.產品促銷預算支出預估表'
     A                                      DSPATR(UL)
     A                                  8  3'03.預算會計科目維護     '
     A                                      DSPATR(UL)
     A                                  8 55'47.品牌促銷實績金額彙總表'
     A                                      DSPATR(UL)
                                       10 55'48.試飲費用成本差異表'
     A                                      DSPATR(UL)
     A                                  9  3'04.合併品牌維護'
     A                                      DSPATR(UL)
     A                                 10  3'05.產品促銷科目餘額批次'
     A                                      DSPATR(UL)
     A                                 12  3'00.4,5月產品促銷實績維護'
     A                                      DSPATR(UL)
     A                                 18 34'90.結束'
     A                                      DSPATR(UL)
     A                                 21 30'請輸入選擇項目:'
     A            DOPID          2A  B 21 48DSPATR(UL)
     A                                      VALUES('00' '  ' '01' '02' '03' '04-
     A                                      ' '05' '11' '41' '42' '47' '48'   -
                                            '90')
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 64MSGCON(016 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
