     A*%%TS  SD  19940725  154838  D910121     REL-V2R2M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CA03(03)
     A*  80/11/15  13:50:09    REPGMR      REL-R03M00  5728-PW1
     A          R DSPC1
     A*%%TS  SD  19940725  154838  D910121     REL-V2R2M0  5738-PW1
     A                                      OVERLAY
     A                                  1  2'NPM200'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 30'產品促銷實績主畫面'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  7'資料維護'
     A                                 21 30'請輸入選擇項目:'
     A            DOPID          2A  B 21 48DSPATR(UL)
     A                                      VALUES('  ' '90' '01' '02' '41' '42+
     A                                      ' '43' '44')
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 64MSGCON(016 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  6  3'01.實績會計科目維護'
     A                                      DSPATR(UL)
     A                                  4 46'報表列印'
     A                                  7  3'02.產品促銷傳票彙總批次'
     A                                      DSPATR(UL)
     A                                 14  7'查詢作業'
     A                                  5  3'************************'
     A                                 15  3'**************************'
     A                                  5 43'*************************'
     A                                 18 34'90.結束'
     A                                      DSPATR(UL)
     A                                  6 43'41.客戶產品促銷月/YTD明細表'
     A                                      DSPATR(UL)
     A                                  7 43'42.員工產品促銷月/YTD明細表'
     A                                      DSPATR(UL)
     A                                  8 43'43.客戶產品促銷年統計表'
     A                                      DSPATR(UL)
     A                                  9 43'44.員工產品促銷年統計表'
     A                                      DSPATR(UL)
