     A*%%TS  SD  19940620  111721  D910121     REL-V2R2M0  5738-PW1
     A*%%EC
     A                                      REF(*LIBL/NPRF)
     A          R PH1
     A*%%TS  SD  19940620  111721  D910121     REL-V2R2M0  5738-PW1
     A                                  1  2'<NPR041.1>'
     A                                  1 25MSGCON(032 US#9001 *LIBL/S#MF)
     A            DDATE          6  0O  1 69EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 29'產品促銷預算比較表'
     A                                  5 29'公司別　:'
     A            DND01     R        O  5 41REFFLD(AI01 GLAIPF)
     A                                  8 29'年度　　:'
     A            DYEAR          3  0O  8 41EDTCDE(4)
     A                                  9 29'會計期間:'
     A            DMM            2  0O  9 41EDTCDE(4)
     A            DYMDS          8  0O  9 45EDTWRD('    /  /  ')
     A                                  9 56'-'
     A            DYMDE          8  0O  9 58EDTWRD('    /  /  ')
     A                                 10 29'產品組別:'
     A            DND03     R        O 10 41REFFLD(ND03)
     A                                 11 29'品牌　　:'
     A            DND04S    R        O 11 41REFFLD(ND04)
     A            DND04E    R        O 11 46REFFLD(ND04)
     A                                 15 29'執行環境:'
     A            $PENV          1A  O 15 41
     A                                 15 49'(0-查詢 1-即時 2-批次)'
     A                                 16 29'列印份數:'
     A            $CPY           3  0O 16 41EDTCDE(3)
     A                                 17 29'列表機　:'
     A            $PRTCD         2A  O 17 41
     A  27                             21 30'***請準備１３２行報表紙***'
     A  28                             21 30'***報表處理中，請稍候***'
     A                                 23  2'執行'
     A                                 23 10'PF3 =回主畫面'
     A                                 23 27'PF4 =欄位查詢'
     A                                 23 44'PF14=處理作業'
     A                                 24 65'【人頭馬匯東】'
     A                                 11 44'-'
     A                                 10 44'(空白=*ALL )'
