     A                                      REF(NPRF)
     A          R PH1                       SKIPB(2)
     A                                     2'FISCAL YEAR :'
     A            DYEAR          3  0     16EDTCDE(2)
     A                                    +0'/'
     A            DYEAR1         3  0     +0EDTCDE(2)
     A                                      SPACEA(1)
     A                                     2'DIVISION    : APA'
     A                                      SPACEA(1)
     A                                     2'BRAND       :'
     A            #A03      R             16REFFLD(#A03 *LIBL/RERF)
     A                                      SPACEA(2)
     A                                     2'A&P'
     A                                      SPACEA(1)
     A                                     2'CODE'
     A                                     7'HEADING'
     A                                    43'BUDGET TOTAL'
     A                                    65'ACTUAL'
     A                                    85'COMMITMENT'
     A                                   108'BAL'
     A                                      SPACEA(1)
     A                                     2'----'
     A                                     7'-------'
     A                                    37'-------------------'
     A                                    58'-------------------'
     A                                    78'-------------------'
     A                                    98'-------------------'
     A                                      SPACEA(1)
      *================================================================
     A          R PD1                       SPACEA(1)
     A            WF0302    R              2REFFLD(ND05)
     A            NA03      R              6
     A  21                                37'('
     A            WF0303    R             38REFFLD(ND06B)
     A                                      EDTCDE(2)
     A  21                                55')'
     A  22                                58'('
     A            WF0304    R             59REFFLD(ND06B)
     A                                      EDTCDE(2)
     A  22                                76')'
     A  23                                78'('
     A            WF0305    R             79REFFLD(ND06B)
     A                                      EDTCDE(2)
     A  23                                96')'
     A  24                                98'('
     A            TVAR      R             99REFFLD(ND06B)
     A                                      EDTCDE(2)
     A  24                               116')'
      *================================================================
     A          R PT1                       SPACEA(1)
     A                                    37'-------------------'
     A                                    58'-------------------'
     A                                    78'-------------------'
     A                                    98'-------------------'
     A                                      SPACEA(1)
     A            T1ND05    R              2REFFLD(ND05)
     A            NA03      R              6
     A  21                                37'('
     A            T1TBUG    R             38REFFLD(ND06B)
     A                                      EDTCDE(1)
     A  21                                55')'
     A  22                                58'('
     A            T1TACT    R             59REFFLD(ND06B)
     A                                      EDTCDE(1)
     A  22                                76')'
     A  23                                78'('
     A            T1COMM    R             79REFFLD(ND06B)
     A                                      EDTCDE(1)
     A  23                                96')'
     A  24                                98'('
     A            T1TVAR    R             99REFFLD(ND06B)
     A                                      EDTCDE(1)
     A  24                               116')'
     A                                     1' '
     A                                      SPACEA(1)
     A                                     7'-------------------------------+
     A                                      ------------------'
     A                                    58'-------------------'
     A                                    78'-------------------'
     A                                    98'-------------------'
      *================================================================
     A          R PT2                       SPACEA(1)
     A                                     6'TOTAL-->'
     A  21                                37'('
     A            T2TBUG    R             38REFFLD(ND06B)
     A                                      EDTCDE(1)
     A  21                                55')'
     A  22                                58'('
     A            T2TACT    R             59REFFLD(ND06B)
     A                                      EDTCDE(1)
     A  22                                76')'
     A  23                                78'('
     A            T2COMM    R             79REFFLD(ND06B)
     A                                      EDTCDE(1)
     A  23                                96')'
     A  24                                98'('
     A            T2TVAR    R             99REFFLD(ND06B)
     A                                      EDTCDE(1)
     A  24                               116')'
     A                                     1' '
     A                                      SPACEA(1)
     A                                     7'-------------------------------+
     A                                      ------------------'
     A                                    58'-------------------'
     A                                    78'-------------------'
     A                                    98'-------------------'
     A          R PE9                       SPACEA(1)
     A                                    16'*** NO DATA FOR PRINTING ***'
