     A*%%TS  SD  19940712  110509  D910121     REL-V2R2M0  5738-PW1
     A*%%EC
     A                                      REF(*LIBL/NPRF)
     A          R PH1
     A*%%TS  SD  19940712  110509  D910121     REL-V2R2M0  5738-PW1
     A                                  1  2'<NPR042.1>'
     A                                  1 25MSGCON(032 US#9001 *LIBL/S#MF)
     A            DDATE          6  0   1 69EDTCDE(Y)
     A            $USERN        10A     2  2
     A                                  2 29'客戶產品促銷月／ＹＴＤ明細表'
     A                                  4 29'公司別　:'
     A            DNF01     R           4 41REFFLD(NF01)
     A                                  5 29'年度　　:'
     A            DYEAR          3  0   5 41EDTCDE(4)
     A                                  6 29'會計期間:'
     A            DMM            2  0   6 41EDTCDE(4)
     A            DMDYS          7  0   6 45EDTWRD('   /  /  ')
     A                                  6 56'-'
     A            DMDYE          7  0   6 58EDTWRD('   /  /  ')
     A                                  8 29'辦事處　:'
     A            DNF06S    R           8 41REFFLD(NF06A)
     A            DNF06E    R           8 46REFFLD(NF06A)
     A                                  9 29'客戶代號:'
     A            DNF07S    R           9 41REFFLD(NF07)
     A            DNF07E    R           9 50REFFLD(NF07)
     A                                 10 30'A&P CODE :'
     A            DNF05S    R          10 41REFFLD(NF05)
     A                                 10 48'-'
     A            DNF05E    R          10 50REFFLD(NF05)
     A                                 12 29'產品組別:'
     A            DNF03     R        O 12 41REFFLD(ND03)
     A                                 12 44'(10-BRANDY 20-WHISKY 30-WINE)'
     A                                 13 44'(99-OTHERS " "-*ALL)'
     A                                 15 29'執行環境:'
     A            $PENV          1A    15 41
     A                                 15 49'(0-查詢 1-即時 2-批次)'
     A                                 16 29'列印份數:'
     A            $CPY           3  0O 16 41EDTCDE(3)
     A                                 17 29'列表機　:'
     A            $PRTCD         2A  O 17 41
     A  27                             21 30'***請準備　８０行報表紙***'
     A  28                             21 30'***報表處理中，請稍候***'
     A                                 23  2'執行'
     A                                 23 10'PF3 =回主畫面'
     A                                 23 27'PF4 =欄位查詢'
     A                                 23 44'PF14=處理作業'
     A                                 24 65'【人頭馬匯東】'
     A                                 11 44'-'
     A                                 12 48'-'
     A                                  8 45'(YY)'
