     A*%%TS  SD  19940624  112712  D910121     REL-V2R2M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/NPRF)
     A                                      PRINT
     A*----------------------------------------------------------------
     A          R DSPC0                     ASSUME
     A                                  2  2' '
     A*----------------------------------------------------------------
     A******
     A          R SFLSR                     SFL
     A*%%TS  SD  19940510  175210  D910121     REL-V2R2M0  5738-PW1
     A            RRN            3S 0H
     A            DOPT           1A  B  5  2
     A            NG02           6   O    +1
     A            NG03          30   O    +1
     A******
     A          R SFLCR                     SFLCTL(SFLSR)
     A*%%TS  SD  19940624  112712  D910121     REL-V2R2M0  5738-PW1
     A                                      SFLSIZ(0010)
     A                                      SFLPAG(0010)
     A                                      WINDOW(DSPC1)
     A                                      USRRSTDSP
     A                                      CA03(03)
     A                                      ROLLUP(25 '下一頁')
     A                                      ROLLDOWN(26 '上一頁')
     A*                                     OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A                                  1 11'ＡＭＰ查詢'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  3  2'/ AMP說明                       -
     A                                        '
     A                                      DSPATR(UL)
     A            DBGN1          6   B  4  4
     A          R DSPC1
     A*%%TS  SD  19940510  175210  D910121     REL-V2R2M0  5738-PW1
     A                                      WINDOW(3 35 16 40)
      *                                     3  : STR ROW
      *                                     35 : STR COL
      *                                     16 : ROWS
      *                                     40 : WIDTH
      *
     A                                      WDWBORDER((*DSPATR RI))
     A                                      WDWBORDER((*CHAR '        '))
     A                                 15  2'執行  F3 =退出'
