     A*%%TS  SD  19940216  140739  D910074     REL-V2R2M0  5738-PW1
     A****************************************************************
     A*                                                              *
     A*    PROGRAM-ID   : PCD008                                     *
     A*    PROGRAM NAME : 零用金常用傳票登錄                       *
     A*    AUTHOR       : TINA                                       *
     A*    CREATE DATE  : 1994.02.20                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 零用金系統                               *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/GLRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A                                      CSRLOC(#LIN #COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A            #LIN           3  0H
     A            #COL           3  0H
     A                                  1  2'<PCD008.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 30'零用金常用傳票登錄'
     A                                      DSPATR(RI)
     A                                  4  2'公司別　　:'
     A            DCD01     R        B  4 16REFFLD(AN01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            #B02      R        O  4 19REFFLD(#B02 PTRF)
     A                                  4 37'辦事處:'
     A            DCD17          1A  B  4 48VALUES('1' '2' '3')
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  4 51'(1=台北2=台中3=高雄)'
     A                                  5  2'傳票代碼　:'
     A                                      DSPATR(HI)
     A            DCD02S    R        B  5 16REFFLD(AN02)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  5 26'-'
     A            DCD02E    R        B  5 28REFFLD(AN02)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                  6  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  7  2'登帳日期　:'
     A            DCD10     R   -1   B  7 16REFFLD(AH10)
     A                                      EDTWRD('   /  /  ')
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                  7 26'(MM/DD/YY)'
     A*
     A            ERRID          7   H
     A            ERRF          10   H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A  98        DMSG          78A  O 22  2DSPATR(HI)
     A                                 23  2'執行'
     A                                    +2'PF3 =回主畫面'
     A                                    +2'PF4 =欄位查詢'
     A                                 24 65'【人頭馬匯東】'
     A*----------------------------------------------------------------
     A          R SFLSR                     SFL
     A  54                                  SFLNXTCHG
     A            RRN            3Y 0O  9  4EDTCDE(4)
     A            SCD02     R        O  9  8REFFLD(AN02)
     A            SCD10     R   -1   B  9 23REFFLD(AH10)
     A                                      EDTWRD('   /  /  ')
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A N31                                  DSPATR(UL)
     A  31                                  DSPATR(PR)
     A            DCA28          6   B  9 34
     A  66                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A N31                                  DSPATR(UL)
     A  31                                  DSPATR(PR)
     A            MC02      R        O  9 41REFFLD(MC02 RERF)
     A            DCA02     R        O  9 67REFFLD(AH02)
     A            DCD03     R        O 10  8REFFLD(AN03)
     A*----------------------------------------------------------------
     A          R SFLCR                     SFLCTL(SFLSR)
     A                                      SFLSIZ(0110)
     A                                      SFLPAG(0006)
     A                                      SFLDROP(CF02)
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF12(12)
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  96                                  SFLMSGID(CPF5203 PTMF)
     A**
     A            DRRN           3S 0H      SFLRCDNBR
     A                                  1  2'<PCD008.2>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 30'零用金常用傳票登錄'
     A                                      DSPATR(RI)
     A                                  4  2'公司別　　:'
     A            DCD01     R        O  4 16REFFLD(AN01)
     A            #B02      R        O  4 19REFFLD(#B02 PTRF)
     A                                  4 37'辦事處:'
     A            DCD17          1A  O  4 48
     A                                  5  2'傳票代碼　:'
     A            DCD02S    R        O  5 16REFFLD(AN02)
     A                                  5 26'-'
     A            DCD02E    R        O  5 28REFFLD(AN02)
     A                                  6  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  8  2'   No傳票代碼／備註+
     A                                      　登帳日期　申請員工／姓名　　　+
     A                                      　　　　　　零用金號碼'
     A                                      DSPATR(UL)
     A*----------------------------------------------------------------
     A          R DSPC2
     A*
     A            ERRID          7   H
     A            ERRF          10   H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A  98        DMSG          78A  O 22  2DSPATR(HI)
     A                                 23  2'執行'
     A                                    +2'PF2 =備註顯示'
     A                                    +2'PF3 =回主畫面'
     A                                    +2'PF12=回前畫面'
     A                                 24 65'【人頭馬匯東】'
     A*================================================================
     A          R SFLSRD                    SFL
     A            RRND           3Y 0   9  2
     A            DAH12D    R        H      REFFLD(AH12)
     A            DAH13D    R        H      REFFLD(AH13)
     A            DAH04D    R        H      REFFLD(AH04)
     A            DAH05D    R        H      REFFLD(AH05)
     A            DAH05A    R        H      REFFLD(AH05A)
     A            DAH06D    R        H      REFFLD(AH06)
     A            DAH06A    R        H      REFFLD(AH06A)
     A            DAH07D    R        H      REFFLD(AH07)
     A            DAH07A    R        H      REFFLD(AH07A)
     A            DAH08D    R        H      REFFLD(AH08)
     A            DAH08A    R        H      REFFLD(AH08A)
     A            DAH09D    R        H      REFFLD(AH09)
     A            DAH09A    R        H      REFFLD(AH09A)
     A            DAH11D         1   H
     A            DAH14D    R        H      REFFLD(AH14)
     A            DAH14A    R        H      REFFLD(AH14A)
     A            DAH15D    R        H      REFFLD(AH15)
     A            DAH15A    R        H      REFFLD(AH15A)
     A            DAH16D    R        H      REFFLD(AH16)
     A            DAH22D    R        H      REFFLD(AH22)
     A            DAH24D    R        H      REFFLD(AH24)
     A            DLTCOD         1   H
     A*----------------------------------------------------------------
     A          R SFLCRD                    SFLCTL(SFLSRD)
     A                                      SFLSIZ(0060)
     A                                      SFLPAG(0010)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A*================================================================
     A          R SFLSRC                    SFL
     A            RRNC           3Y 0   9  2
     A            DAH12D    R        H      REFFLD(AH12)
     A            DAH13D    R        H      REFFLD(AH13)
     A            DAH04D    R        H      REFFLD(AH04)
     A            DAH05D    R        H      REFFLD(AH05)
     A            DAH05A    R        H      REFFLD(AH05A)
     A            DAH06D    R        H      REFFLD(AH06)
     A            DAH06A    R        H      REFFLD(AH06A)
     A            DAH07D    R        H      REFFLD(AH07)
     A            DAH07A    R        H      REFFLD(AH07A)
     A            DAH08D    R        H      REFFLD(AH08)
     A            DAH08A    R        H      REFFLD(AH08A)
     A            DAH09D    R        H      REFFLD(AH09)
     A            DAH09A    R        H      REFFLD(AH09A)
     A            DAH11D         1   H
     A            DAH14D    R        H      REFFLD(AH14)
     A            DAH14A    R        H      REFFLD(AH14A)
     A            DAH15D    R        H      REFFLD(AH15)
     A            DAH15A    R        H      REFFLD(AH15A)
     A            DAH16D    R        H      REFFLD(AH16)
     A            DAH22D    R        H      REFFLD(AH22)
     A            DAH24D    R        H      REFFLD(AH24)
     A            DLTCOD         1   H
     A*----------------------------------------------------------------
     A          R SFLCRC                    SFLCTL(SFLSRC)
     A                                      SFLSIZ(0060)
     A                                      SFLPAG(0010)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
