     A*%%TS  SD  19940223  164312  D910121     REL-V2R2M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PCCAPF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R SFLSR                     SFL
     A*%%TS  SD  19940223  164312  D910121     REL-V2R2M0  5738-PW1
     A            RRN            3Y 0O 10  2EDTCDE(4)
     A            CA04      R        O 10  6
     A            DAF03         22A  O 10 23
     A            CA12      R        O 10 49EDTCDE(K)
     A            CA16      R        O 11 23
     A*----------------------------------------------------------------
     A**                                    CSRLOC(#LIN #COL)
     A          R SFLCR                     SFLCTL(SFLSR)
     A*%%TS  SD  19940223  164312  D910121     REL-V2R2M0  5738-PW1
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0005)
     A                                      SFLDROP(CF02)
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF12(12)
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  96                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN           3S 0H      SFLRCDNBR
     A                                  1  2'<PCI001>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 35'零用金查詢'
     A                                      DSPATR(RI)
     A                                  4  2'公司別　  :'
     A            CA01      R        O  4 16REFFLD(CA01)
     A            D#B02         12A  O  4 19
     A                                  4 57'製票者　:'
     A            DSU02         10A  O  4 69
     A                                  5  2'零用金號碼:'
     A            CA02      R        O  5 16REFFLD(CA02)
     A                                  4 33'支付日期:'
     A            DCA11          6Y 0O  4 45EDTWRD('  /  /  ')
     A                                  5 57'製票日期:'
     A            DCA25          6Y 0O  5 69EDTWRD('  /  /  ')
     A                                  6 33'過帳'
     A            CA18      R        O  6 41REFFLD(CA18)
     A                                  8  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  9  2' NO科目　　　　　  科目名稱／+
     A                                      摘　　要              借方金額 -
     A                                           '
     A                                      DSPATR(UL)
     A                                  5 33'撥補日期:'
     A            DCA29          6Y 0O  5 45EDTWRD('  /  /  ')
     A                                  6  2'登帳日期　:'
     A            DCA10          6Y 0O  6 16EDTWRD('  /  /  ')
     A                                  6 57'作廢'
     A            CA20      R        O  6 65REFFLD(CA18)
     A                                  7  2'申請員工　:'
     A            CA28           6   O  7 16
     A            MC02      R        O    +1REFFLD(MC02 RERF)
     A*----------------------------------------------------------------
     A          R DSPC1
     A*%%TS  SD  19931007  170259  D910121     REL-V2R2M0  5738-PW1
     A                                 20  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                 21 37'合計:'
     A            TCA12         13Y 2O 21 49EDTCDE(J)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  3'執行'
     A                                 23 11'PF2 =明細顯示'
     A                                 23 28'PF3 =回主畫面'
     A                                 23 45'PF12=回前畫面'
     A                                 24 11'PA1 =下一頁'
     A                                 24 28'PA2 =上一頁'
     A                                 24 64MSGCON(016 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
