     A*%%TS  SD  19940223  164246  D910121     REL-V2R2M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PCCAPF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A                                      CA03(03)
     A          R DSPD1
     A*%%TS  SD  19940223  163953  D910121     REL-V2R2M0  5738-PW1
     A                                  1  2'<PCI002.1>'
     A            CONAME        40A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 32'零用金查詢－區間'
     A                                      DSPATR(RI)
     A                                  4  2'公司別　　:'
     A            DCA01     R        B  4 16REFFLD(CA01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                  4 19'( RE/WL/CN )'
     A                                  5  2'辦事處　　:'
     A            DCA17     R        B  5 16REFFLD(CA17)
     A                                      VALUES(' ' '1' '2' '3')
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  5 19'( 1=台北  2=台中  3=高雄)'
     A                                  6  2'零用金號碼:'
     A            DCA02S    R        B  6 16REFFLD(CA02)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  6 26'-'
     A            DCA02E    R        B  6 28REFFLD(CA02)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                  7  2'申請員工　:'
     A            DCA28S    R        B  7 16REFFLD(CA28)
     A  72                                  DSPATR(PC)
     A  72                                  DSPATR(RI)
     A                                  7 26'-'
     A            DCA28E    R        B  7 28REFFLD(CA28)
     A  73                                  DSPATR(PC)
     A  73                                  DSPATR(RI)
     A                                  8  2'-----------------------------------
     A                                      ------------------------------------
     A                                      --------'
     A                                  9  4'製票日期:'
     A            DCA25S    R   -1   B  9 16REFFLD(CA25)
     A                                      EDTWRD('   /  /  ')
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                  9 26'-'
     A            DCA25E    R   -1   B  9 28REFFLD(CA25)
     A                                      EDTWRD('   /  /  ')
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A                                 10  4'登帳日期:'
     A            DCA10S    R   -1   B 10 16REFFLD(CA10)
     A                                      EDTWRD('   /  /  ')
     A  66                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A                                 10 26'-'
     A            DCA10E    R   -1   B 10 28REFFLD(CA10)
     A                                      EDTWRD('   /  /  ')
     A  67                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A                                 11  4'支付日期:'
     A            DCA11S    R   -1   B 11 16REFFLD(CA10)
     A                                      EDTWRD('   /  /  ')
     A  68                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A                                 11 26'-'
     A            DCA11E    R   -1   B 11 28REFFLD(CA10)
     A                                      EDTWRD('   /  /  ')
     A  69                                  DSPATR(PC)
     A  69                                  DSPATR(RI)
     A                                 12  4'撥補日期:'
     A            DCA29S    R   -1   B 12 16REFFLD(CA10)
     A                                      EDTWRD('   /  /  ')
     A  70                                  DSPATR(PC)
     A  70                                  DSPATR(RI)
     A                                 12 26'-'
     A            DCA29E    R   -1   B 12 28REFFLD(CA10)
     A                                      EDTWRD('   /  /  ')
     A  71                                  DSPATR(PC)
     A  71                                  DSPATR(RI)
     A                                 13  4'製票者　:'
     A            DCA26     R        B 13 16REFFLD(CA26)
     A                                 13 28'(空白表示*ALL)'
     A                                 14  4'過帳　　:'
     A            DCA18     R        B 14 16REFFLD(CA18)
     A                                      VALUES('1' '2' '3')
     A                                 14 19'( 1.已過帳　2.未過帳　3.全部-
     A                                      )'
     A                                 15  4'作廢　　:'
     A            DCA20     R        B 15 16REFFLD(CA18)
     A                                      VALUES('1' '2' '3')
     A                                 15 19'( 1.已作廢　2.未作廢　3.全部-
     A                                      )'
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'PF3 =回主畫面'
     A                                 24 64MSGCON(016 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  9 39'( MM/DD/YY )'
     A                                 10 39'( MM/DD/YY )'
     A                                 11 39'( MM/DD/YY )'
     A                                 12 39'( MM/DD/YY )'
     A          R SFLSR                     SFL
     A*%%TS  SD  19940223  163953  D910121     REL-V2R2M0  5738-PW1
     A            DOPT           1A  B 11  2DSPATR(CS)
     A                                      DSPATR(PC)
     A                                      DSPATR(HI)
     A                                      VALUES('5' ' ')
     A            RRN            3S 0H
     A            CA10      R        H
     A            CA11      R        H
     A            CA29      R        H
     A            CA25      R        H
     A            CA02      R        O 11  4
     A            DCA10     R   -1   O 11 16REFFLD(CA10)
     A                                      EDTWRD('   /  /  ')
     A            DCA11     R   -1   O 11 26REFFLD(CA11)
     A                                      EDTWRD('   /  /  ')
     A            DCA29     R   -1   O 11 36REFFLD(CA29)
     A                                      EDTWRD('   /  /  ')
     A            CA18      R        O 11 47
     A            CA20      R        O 11 51
     A            SU02      R        O 11 70REFFLD(SU02 S#SUPF)
     A            DCA12         11Y 2O 11 54EDTCDE(J)
     A*  90/12/25  18:11:10    SSPGMR      REL-R02M00  5728-PW1
     A          R SFLCR                     SFLCTL(SFLSR)
     A*%%TS  SD  19940122  084529  D910121     REL-V2R2M0  5738-PW1
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(25)
     A                                      CF12(12)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  96                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN           3S 0H      SFLRCDNBR
     A                                  1  2'<PCI002.2>'
     A            CONAME        40A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 32'傳票查詢－區間'
     A                                      DSPATR(RI)
     A                                  4  2'公司別　　:'
     A            DCA01     R        O  4 16REFFLD(CA01)
     A            #B02      R        O  4 19REFFLD(#B02 PT#BPF)
     A                                  5  2'辦事處　　:'
     A            DCA17     R        O  5 16REFFLD(CA17)
     A            DESC           6O  O  5 19
     A                                  6  2'零用金號碼:'
     A            DCA02S    R        O  6 16REFFLD(CA02)
     A                                  6 27'-'
     A            DCA02E    R        O  6 29REFFLD(CA02)
     A                                  7  2'-----------------------------------
     A                                      ------------------------------------
     A                                      --------'
     A                                  8  2'S (=作業): 5-傳票查詢'
     A                                  9  2'S零用金號碼登帳日期支付日期 -
     A                                      撥補日期帳廢         金額 +
     A                                      製票者'
     A                                  8 46'過作'
     A            D02S      R        B 10  4REFFLD(CA02)
     A                                      DSPATR(CS)
     A*
     A          R DSPC1
     A            ERRID          7   H
     A            ERRF          10   H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                    +2'PF3 =回主畫面'
     A                                    +2'PF12 =回前畫面'
     A                                 24 64MSGCON(016 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
