     A*%%TS  SD  19940224  091913  D910121     REL-V2R2M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CA03(03)
     A*  80/11/15  13:50:09    REPGMR      REL-R03M00  5728-PW1
     A          R DSPC1
     A*%%TS  SD  19940224  091913  D910121     REL-V2R2M0  5738-PW1
     A                                      OVERLAY
     A                                  1  2'PCM000'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 30'零用金系統主畫面'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5  2'              '
     A                                      DSPATR(RI)
     A                                  5 42'              '
     A                                      DSPATR(RI)
     A                                  6  2' '
     A                                      DSPATR(RI)
     A                                  6  4'資料維護'
     A                                  6 15' '
     A                                      DSPATR(RI)
     A                                  6 42' '
     A                                      DSPATR(RI)
     A                                  6 44'報表列印'
     A                                  6 55' '
     A                                      DSPATR(RI)
     A                                  7  2'              '
     A                                      DSPATR(RI)
     A                                  7 42'              '
     A                                      DSPATR(RI)
     A                                  5 17'01.零用金傳票登錄　　'
     A                                      DSPATR(UL)
     A                                  5 57'41.零用金明細表　　'
     A                                      DSPATR(UL)
     A                                  6 57'42.科目彙總表　　　'
     A                                      DSPATR(UL)
     A                                 21 30'請輸入選擇項目:'
     A            DOPID          2A  B 21 48DSPATR(UL)
     A                                      VALUES('  ' '01' '02' '03' '04' '05+
     A                                      ' '06' '07' '21' '41' '42' '43' '44+
     A                                      ' '45')
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 64MSGCON(016 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  6 17'02.零用金傳票更正　　'
     A                                      DSPATR(UL)
     A                                  7 17'03.作廢／取消作業　　'
     A                                      DSPATR(UL)
     A                                  8 17'04.支付撥補／取消作業'
     A                                      DSPATR(UL)
     A                                 16 17'21.零用金查詢　　　　'
     A                                      DSPATR(UL)
     A                                 16  2'              '
     A                                      DSPATR(RI)
     A                                 17  2' '
     A                                      DSPATR(RI)
     A                                 17  4'資料查詢'
     A                                 17 15' '
     A                                      DSPATR(RI)
     A                                 18  2'              '
     A                                      DSPATR(RI)
     A                                 11 17'07.摘要資料維護　　　'
     A                                      DSPATR(UL)
     A                                  7 57'43.成本中心彙總表　　'
     A                                      DSPATR(UL)
     A                                  8 57'44.零用金專案明細表　'
     A                                      DSPATR(UL)
     A                                  9 17'05.零用金傳票批次－未撥　'
     A                                      DSPATR(UL)
     A                                 10 17'06.零用金傳票批次－撥補　'
     A                                      DSPATR(UL)
     A                                  9 57'45.科目成本中心統計表　　'
     A                                      DSPATR(UL)
