     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : PCR045P                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 02/21/94                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : PCR045                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :零用金系統                                *
     A*    REMARK       :科目成本中心統計表　　　                  *
     A****************************************************************
     A                                      REF(PCCAPF)
     A          R PH1                       SKIPB(2)
     A                                    73MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    77'科目成本中心統計表'
     A                                      SPACEA(1)
     A  20                                83'己撥補'
     A                                      SPACEA(1)
     A  21                                83'未撥補'
     A                                      SPACEA(1)
     A  22                                79'全部（撥補別）'
     A                                      SPACEA(1)
     A  23                                83'己支付'
     A                                      SPACEA(1)
     A  24                                83'未支付'
     A                                      SPACEA(1)
     A  25                                79'全部（支付別）'
     A                                      SPACEA(1)
     A                                     1'　公　司　:'
     A            CA01      R             +1REFFLD(CA01)
     A            #B02      R             +1REFFLD(#B02 PTRF)
     A                                      SPACEA(1)
     A                                     1'　辦事處　:'
     A            CA17      R             +1REFFLD(CA17)
     A            TEXT          10A       +1
     A                                      SPACEA(1)
     A                                     1'　登帳日期:'
     A            DCA10S         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    +1'-'
     A            DCA10E         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                   138'日期:'
     A            $EGMDY         6  0O   145EDTCDE(Y)
     A                                   155'頁次:'
     A                                   163PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'　支付日期:'
     A            DCA11S         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    +1'-'
     A            DCA11E         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                   138'時間:'
     A                                   145TIME
     A                                      SPACEA(1)
     A                                     1'零用金號碼:'
     A            DCA02S    R             +1REFFLD(CA02)
     A                                    +1'-'
     A            DCA02E    R             +1REFFLD(CA02)
     A                                   138' USER :'
     A            $USER         10   O   145
     A                                   156'<PCR045P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============'
     A                                      SPACEA(1)
     A                                     1'會計科目'
     A                                    15'科目簡稱'
     A                                    48'成本中心'
     A                                    69'對象別'
     A                                    96'相關號碼１'
     A                                   116'相關號碼２'
     A                                   136'日　期'
     A                                   157'金　額'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A N31                                 1' '
     A                                      SPACEA(1)
     A N30        CA04      R              2
     A N30        AF03      R             15REFFLD(AF03 GLRF)
     A            CA05      R             48
     A            CA06      R             69
     A            CA06N         12        75
     A            CA07      R             91
     A            CA08      R            113
     A            CA09      R            135EDTWRD('    /  /  ')
     A            T0T1          13  2    147
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A            CA05L          3        48
     A                                    +1'成本中心小計'
     A                                    +1'-------------------+
     A                                       -------------------+
     A                                       -------------------+
     A                                       -------------------+
     A                                       -->'
     A            T1TOT1        13  2    147
     A                                      EDTCDE(J)
     A                                   165'も'
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A            CA04L          4A        2
     A                                    +1'科目小計'
     A                                    +1'-------------------+
     A                                       -------------------+
     A                                       -------------------+
     A                                       -------------------+
     A                                       -------------------+
     A                                       -------------------+
     A                                       ------------->'
     A            T2TOT1        13  2    147
     A                                      EDTCDE(J)
     A                                   165'も'
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ------------'
     A                                      SPACEA(1)
     A                                    15'合　　計'
     A            T3TOT1        13  2    147
     A                                      EDTCDE(J)
     A                                   165'もも'
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==========='
     A                                      SPACEA(1)
     A                                     2'<<PCR045>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
