     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : PCR014AP                                   *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 10/23/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : PCR014AP                                   *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :零用金系統                                *
     A*    REMARK       :零用金明細表                              *
     A****************************************************************
     A                                      REF(PCCAPF)
     A          R PH1                       SKIPB(2)
     A                                    58MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    65'零用金明細表'
     A                                      SPACEA(2)
     A                                     1'公　司:'
     A            CA01      R             +1REFFLD(CA01)
     A            #B02      R             +1REFFLD(#B02 PTRF)
     A            TEXT1          8        68
     A                                      SPACEA(1)
     A                                     1'辦事處:'
     A            CA17      R             +1REFFLD(CA17)
     A            TEXT          10A       +1
     A            TEXT2          8        68
     A                                      SPACEA(1)
     A                                     1'登帳日期:'
     A            DCA10S         6  0     12EDTWRD('  /  /  ')
     A                                    21'-'
     A            DCA10E         6  0     23EDTWRD('  /  /  ')
     A                                      SPACEA(1)
     A                                     1'支付日期:'
     A            DCA11S         6  0     12EDTWRD('  /  /  ')
     A                                    21'-'
     A            DCA11E         6  0     23EDTWRD('  /  /  ')
     A                                   136'日期:'
     A            $EGMDY         6  0O   143EDTCDE(Y)
     A                                   155'頁次:'
     A                                   163PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'零用金號碼:'
     A            DCA02S    R             +1REFFLD(CA02)
     A                                    +1'-'
     A            DCA02E    R             +1REFFLD(CA02)
     A                                   136'時間:'
     A                                   143TIME
     A                                      SPACEA(1)
     A                                     1'請款人　　:'
     A            DCA28S    R             +1REFFLD(CA28)
     A                                    +1'-'
     A            DCA28E    R             +1REFFLD(CA28)
     A                                   136' USER :'
     A            $USER         10   O   143
     A                                   155'<PCR041BP>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======='
     A                                      SPACEA(1)
     A                                     1'零用金號碼'
     A                                    13'申請員工／姓名'
     A                                    32'登帳日期'
     A                                    42'支付日期'
     A                                    52'撥補日期'
     A                                    62'作廢註記'
     A                                    72'過帳註記'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -------'
     A                                      SPACEA(1)
     A                                    13'會計科目／科目名稱'
     A                                    62'金　　額'
     A                                    72'成本中心'
     A                                    94'相關號碼１'
     A                                   115'摘　　要'
     A                                      SPACEA(1)
     A                                    72'對象別'
     A                                    94'相關號碼２'
     A                                   115'日　　期'
     A                                   130'數　　量'
     A                                   143'其　　他'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A N30        CA02      R              2
     A N30        CA28      R             14
     A N30        MC02      R             20REFFLD(MC02 RERF)
     A            DCA10          6  0     33EDTWRD('  /  /  ')
     A            DCA11          6  0     43EDTWRD('  /  /  ')
     A            DCA29          6  0     53EDTWRD('  /  /  ')
     A            CA20      R             66
     A            CA18      R             76
     A                                      SPACEA(1)
     A                                    14'-------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -------'
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
     A            CA04      R             14
     A            AF03      R             22REFFLD(AF03 GLRF)
     A            CA12          13  2     54EDTCDE(J)
     A            CA05      R             73
     A            CA07      R             95
     A            CA16      R            116
     A*----------------------------------------------------------------
     A          R PD3                       SPACEA(1)
     A            CA06      R             73
     A            CA08      R             95
     A            CA09      R            116EDTWRD('    /  /  ')
     A            CA14      R            125EDTCDE(2)
     A            CA15      R            144
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    22'單據小計'
     A                                    +1'------------------->'
     A            SUM           13  2     54EDTCDE(J)
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======='
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    22'辦事處小計'
     A                                    +1'----------------->'
     A            SUM1          13  2     54EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                    22'公司合計'
     A                                    +1'------------------->'
     A            SUM2          13  2     54EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A  30                                 1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======='
     A                                      SPACEA(1)
     A                                     2'<<PCR041BP>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
