     A*%%TS  SD  19940204  174909  D910121     REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     A*
     A*    PROGRAM-ID   : PCR044D
     A*    PROGRAM NAME : 零用金專案明細表
     A*    CREATE DATE  : 1992.12.28
     A*    UPDATE DATE  :
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PCCAPF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A*----------------------------------------------------------------
     A          R DSPD1
     A*%%TS  SD  19940204  174909  D910121     REL-V2R2M0  5738-PW1
     A                                      CSRLOC(#LIN       #COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF14(14)
     A  28                                  FRCDTA
     A  28                                  LOCK
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<PCR044.1>'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            DDATE          6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2 31'零用金專案明細表'
     A                                      DSPATR(RI)
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'公司別:'
     A            DCA01     R        B  4 12REFFLD(CA01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                  4 15'會計科目:'
     A            DCA04S    R        B  4 27REFFLD(CA04)
     A  76                                  DSPATR(PC)
     A  76                                  DSPATR(RI)
     A                                  4 36'-'
     A            DCA04E    R        B  4 38REFFLD(CA04)
     A  77                                  DSPATR(PC)
     A  77                                  DSPATR(RI)
     A                                  5  2'日　　期:'
     A            DCA10S    R   -1   B  5 14REFFLD(CA10)
     A                                      EDTWRD('   /  /  ')
     A  78                                  DSPATR(PC)
     A  78                                  DSPATR(RI)
     A                                  5 24'-'
     A            DCA10E    R   -1   B  5 26REFFLD(CA10)
     A                                      EDTWRD('   /  /  ')
     A  79                                  DSPATR(PC)
     A  79                                  DSPATR(RI)
     A                                  4 49'辦事處:'
     A            DCA17          1A  B  4 59VALUES(' ' '1' '2' '3')
     A                                  4 62'空白表全部'
     A            DOP            1A  B  5 39VALUES('1' '2' '3')
     A                                  5 41'( 1=登帳 2=支付 3=撥補 )'
     A            DCA02S         9A  B  6 16
     A  80                                  DSPATR(PC)
     A  80                                  DSPATR(RI)
     A                                  6 26'-'
     A            DCA02E         9A  B  6 28
     A  81                                  DSPATR(PC)
     A  81                                  DSPATR(RI)
     A                                  7  2'-------------------------- --------
     A                                      -------------   --------------------
     A                                      - --  --'
     A                                  8  2'輸入欄位                :'
     A                                  8 37'起'
     A                                  8 60'訖'
     A                                  8 72'排　小'
     A                                  9  2'-------------------------- --------
     A                                      -------------   --------------------
     A                                      - --  --'
     A                                 10  2'1.'
     A            DCA05A    R        B 10  5REFFLD(CA05A)
     A N99                                  DSPATR(HI)
     A  81                                  DSPATR(PC)
     A  81                                  DSPATR(RI)
     A            DAA031    R        O 10  8REFFLD(AA03 GLRF)
     A            DCA05S    R        B 10 29REFFLD(CA05)
     A N99                                  DSPATR(HI)
     A  86                                  DSPATR(PC)
     A  86                                  DSPATR(RI)
     A                                 10 50'-'
     A            DCA05E    R        B 10 52REFFLD(CA05)
     A N99                                  DSPATR(HI)
     A  87                                  DSPATR(PC)
     A  87                                  DSPATR(RI)
     A            DS1            1Y 0B 10 74EDTCDE(Z)
     A                                      RANGE(1 5)
     A  71                                  DSPATR(PC)
     A  71                                  DSPATR(RI)
     A            DL1            1A  B 10 77VALUES(' ' 'V')
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                 11  2'2.'
     A            DCA06A    R        B 11  5REFFLD(CA06A)
     A N99                                  DSPATR(HI)
     A  82                                  DSPATR(PC)
     A  82                                  DSPATR(RI)
     A            DAA032    R        O 11  8REFFLD(AA03 GLRF)
     A            DCA06S    R        B 11 29REFFLD(CA06)
     A N99                                  DSPATR(HI)
     A  88                                  DSPATR(PC)
     A  88                                  DSPATR(RI)
     A                                 11 50'-'
     A            DCA06E    R        B 11 52REFFLD(CA06)
     A N99                                  DSPATR(HI)
     A  89                                  DSPATR(PC)
     A  89                                  DSPATR(RI)
     A            DS2            1Y 0B 11 74EDTCDE(Z)
     A                                      RANGE(1 5)
     A  72                                  DSPATR(PC)
     A  72                                  DSPATR(RI)
     A            DL2            1A  B 11 77VALUES(' ' 'V')
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                 12  2'3.'
     A            DCA07A    R        B 12  5REFFLD(CA07A)
     A N99                                  DSPATR(HI)
     A  83                                  DSPATR(PC)
     A  83                                  DSPATR(RI)
     A            DAA033    R        O 12  8REFFLD(AA03 GLRF)
     A            DCA07S    R        B 12 29REFFLD(CA07)
     A N99                                  DSPATR(HI)
     A  90                                  DSPATR(PC)
     A  90                                  DSPATR(RI)
     A                                 12 50'-'
     A            DCA07E    R        B 12 52REFFLD(CA07)
     A N99                                  DSPATR(HI)
     A  91                                  DSPATR(PC)
     A  91                                  DSPATR(RI)
     A            DS3            1Y 0B 12 74EDTCDE(Z)
     A                                      RANGE(1 5)
     A  73                                  DSPATR(PC)
     A  73                                  DSPATR(RI)
     A            DL3            1A  B 12 77VALUES(' ' 'V')
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                 13  2'4.'
     A            DCA08A    R        B 13  5REFFLD(CA08A)
     A N99                                  DSPATR(HI)
     A  84                                  DSPATR(PC)
     A  84                                  DSPATR(RI)
     A            DAA034    R        O 13  8REFFLD(AA03 GLRF)
     A            DCA08S    R        B 13 29REFFLD(CA08)
     A N99                                  DSPATR(HI)
     A  92                                  DSPATR(PC)
     A  92                                  DSPATR(RI)
     A                                 13 50'-'
     A            DCA08E    R        B 13 52REFFLD(CA08)
     A N99                                  DSPATR(HI)
     A  93                                  DSPATR(PC)
     A  93                                  DSPATR(RI)
     A            DS4            1Y 0B 13 74EDTCDE(Z)
     A                                      RANGE(1 5)
     A  74                                  DSPATR(PC)
     A  74                                  DSPATR(RI)
     A            DL4            1A  B 13 77VALUES(' ' 'V')
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                 14  2'5.'
     A            DCA09A    R        B 14  5REFFLD(CA09A)
     A N99                                  DSPATR(HI)
     A  85                                  DSPATR(PC)
     A  85                                  DSPATR(RI)
     A            DAA035    R        O 14  8REFFLD(AA03 GLRF)
     A            DCA09S    R   -1   B 14 29REFFLD(CA09)
     A                                      EDTWRD('   /  /  ')
     A  94                                  DSPATR(PC)
     A  94                                  DSPATR(RI)
     A                                 14 50'-'
     A            DCA09E    R   -1   B 14 52REFFLD(CA09)
     A                                      EDTWRD('   /  /  ')
     A  95                                  DSPATR(PC)
     A  95                                  DSPATR(RI)
     A            DS5            1Y 0B 14 74EDTCDE(Z)
     A                                      RANGE(1 5)
     A  75                                  DSPATR(PC)
     A  75                                  DSPATR(RI)
     A            DL5            1A  B 14 77VALUES(' ' 'V')
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A                                 15  2'-------------------------- --------
     A                                      -------------   --------------------
     A                                      - --'
     A                                 16 28'選擇內容:'
     A            DSORT          1A  B 16 40VALUES('1' '2')
     A                                 16 46'1.會計科目　排序'
     A            DL6            1A  B 16 74VALUES(' ' 'V')
     A                                 17 46'2.日　　期　排序'
     A            DL7            1A  B 17 74VALUES(' ' 'V')
     A                                 18 28'執行環境:'
     A            $PENV          1A  B 18 40VALUES('0' '1' '2')
     A                                 18 43'(0-查詢 1-即時 2-批次)'
     A                                 19 28'列印份數:'
     A            $CPY           3Y 0B 19 40EDTCDE(3)
     A                                      CHECK(RB)
     A                                 20 28'列表機　:'
     A                                      DSPATR(HI)
     A            $PRTCD         2A  B 20 40DSPATR(HI)
     A  27                             21 29'***請準備１３２行報表紙***'
     A                                      DSPATR(RI)
     A  28                             21 29'報表處理中，請稍候'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'PF3 =回主畫面'
     A                                 23 27'PF4 =欄位查詢'
     A                                 23 44'PF14=處理作業'
     A                                 24 64MSGCON(016 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  6  2'零用金號碼:'
