     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : PCR041AP                                   *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 10/23/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : PCR041AP                                   *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :零用金系統                                *
     A*    REMARK       :零用金明細表                              *
     A****************************************************************
     A                                      REF(PCCAPF)
     A          R PH1                       SKIPB(2)
     A                                    38MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    45'零用金明細表'
     A                                      SPACEA(2)
     A                                     1'公　司:'
     A            CA01      R             +1REFFLD(CA01)
     A            #B02      R             +1REFFLD(#B02 PTRF)
     A            TEXT1          8        48
     A                                      SPACEA(1)
     A                                     1'辦事處:'
     A            CA17      R             +1REFFLD(CA17)
     A            TEXT          10A       +1
     A            TEXT2          8        48
     A                                      SPACEA(1)
     A                                     1'登帳日期:'
     A            DCA10S         6  0     12EDTWRD('  /  /  ')
     A                                    21'-'
     A            DCA10E         6  0     23EDTWRD('  /  /  ')
     A                                      SPACEA(1)
     A                                     1'支付日期:'
     A            DCA11S         6  0     12EDTWRD('  /  /  ')
     A                                    21'-'
     A            DCA11E         6  0     23EDTWRD('  /  /  ')
     A                                    86'日期:'
     A            $EGMDY         6  0O    93EDTCDE(Y)
     A                                   103'頁次:'
     A                                   111PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'零用金號碼:'
     A            DCA02S    R             +1REFFLD(CA02)
     A                                    +1'-'
     A            DCA02E    R             +1REFFLD(CA02)
     A                                    86'時間:'
     A                                    93TIME
     A                                      SPACEA(1)
     A                                     1'請款人　　:'
     A            DCA28S    R             +1REFFLD(CA28)
     A                                    +1'-'
     A            DCA28E    R             +1REFFLD(CA28)
     A                                    86' USER :'
     A            $USER         10   O    93
     A                                   108'<PCR041AP>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     1'零用金號碼'
     A                                    13'申請員工／姓名'
     A                                    32'會計科目／科目名稱'
     A                                    81'金　額'
     A                                    91'支付日期'
     A                                   101'撥補日期'
     A                                   111'作廢'
     A                                      SPACEA(1)
     A                                    32'摘要說明'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A N30        CA02      R              2
     A N30        CA28      R             14
     A N30        MC02      R             20REFFLD(MC02 RERF)
     A            CA04      R             33
     A            AF03      R             41REFFLD(AF03 GLRF)
     A            CA12          13  2     73EDTCDE(J)
     A            DCA11          6  0     92EDTWRD('  /  /  ')
     A            DCA29          6  0    102EDTWRD('  /  /  ')
     A            CA20      R            114
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
     A            CA16      R             33
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    33'單據小計'
     A                                    +1'---------------------------->'
     A            SUM           13  2     73EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    33'辦事處小計'
     A                                    +1'-------------------------->'
     A            SUM1          13  2     73EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ------------------'
     A                                      SPACEA(1)
     A                                    33'公司合計'
     A                                    +1'---------------------------->'
     A            SUM2          13  2     73EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     2'<<PCR041AP>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
