     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : PCR043P                                    *
     A*    AUTHOR       : AN MAIN HSIA                               *
     A*    CREATE DATE  : 01/22/94                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : PCR043                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :零用金系統                                *
     A*    REMARK       :成本中心彙總表                            *
     A****************************************************************
     A                                      REF(PCCAPF)
     A          R PH1                       SKIPB(2)
     A                                    27MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    33'成本中心彙總表'
     A                                      SPACEA(1)
     A  21                                37'己撥補'
     A                                      SPACEA(1)
     A  22                                37'未撥補'
     A                                      SPACEA(1)
     A  23                                33'全部（撥補別）'
     A                                      SPACEA(1)
     A  24                                37'己支付'
     A                                      SPACEA(1)
     A  25                                37'未支付'
     A                                      SPACEA(1)
     A  26                                33'全部（支付別）'
     A                                      SPACEA(1)
     A                                     1'　公　司　:'
     A            CA01      R             +1REFFLD(CA01)
     A            #B02      R             +1REFFLD(#B02 PTRF)
     A                                      SPACEA(1)
     A                                     1'　辦事處　:'
     A            CA17      R             +1REFFLD(CA17)
     A            TEXT          10A       +1
     A                                      SPACEA(1)
     A                                     1'　登帳日期:'
     A            DCA10S         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    +1'-'
     A            DCA10E         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    53'日期:'
     A            $EGMDY         6  0O    60EDTCDE(Y)
     A                                    70'頁次:'
     A                                    78PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'　支付日期:'
     A            DCA11S         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    +1'-'
     A            DCA11E         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    53'時間:'
     A                                    60TIME
     A                                      SPACEA(1)
     A                                     1'零用金號碼:'
     A            DCA02S    R             +1REFFLD(CA02)
     A                                    +1'-'
     A            DCA02E    R             +1REFFLD(CA02)
     A                                    53' USER :'
     A            $USER         10   O    60
     A                                    71'<PCR043P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ========================'
     A                                      SPACEA(1)
     A                                     1'成本中心'
     A                                    24'會計科目'
     A                                    67'金　額'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ------------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A N20                                 2' '
     A N20                                  SPACEA(1)
     A N30        CA05      R              2
     A N30        #A02          14   O    10
     A            CA04      R             25
     A            AF03      R             34REFFLD(AF03 GLRF)
     A            SUM           13  2     62EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    34'成本中心'
     A            CA05L          3   O    +0
     A                                    +1'------------>'
     A            T1TOT1        13  2     62
     A                                      EDTCDE(J)
     A                                    +0'も'
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ------------------------'
     A                                      SPACEA(1)
     A                                    34'辦事處合計-------------->'
     A            T2TOT1        13  2     62
     A                                      EDTCDE(J)
     A                                    +0'も'
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ========================'
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ========================'
     A                                      SPACEA(1)
     A                                     2'<<PCR043>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
