     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : PTM000D                                    *
     A*    AUTHOR       : A1034   STEPHANIE                          *
     A*    CREATE DATE  : 81/11/15                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : PTM000                                     *
     A*    SYSTEM       :支援系統                                  *
     A*    REMARK       :支援管理選擇畫面                          *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A                                  1  2'<PTM000.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 31'支援管理選擇畫面'
     A                                      DSPATR(RI)
     A                                  5  9'維護作業'
     A                                  5 36'查詢作業'
     A                                  5 63'報表作業'
     A                                  6  2'************************'
     A                                  6 29'************************'
     A                                  6 56'************************'
     A                                  7  3'11.代碼欄位資料維護'
     A                                      DSPATR(UL)
     A                                  7 57'51.代碼規則清冊'
     A                                      DSPATR(UL)
     A                                  8  3'12.代碼規則資料維護'
     A                                      DSPATR(UL)
     A                                  9  3'13.公司基本資料維護'
     A                                      DSPATR(UL)
     A                                 10  3'14.成本中心資料維護'
     A                                      DSPATR(UL)
     A                                 10 57'54.成本中心明細表'
     A                                      DSPATR(UL)
     A                                 11  3'15.費用廠商資料維護'
     A                                      DSPATR(UL)
     A                                 11 57'55.費用廠商清冊'
     A                                      DSPATR(UL)
     A                                 18 30'90.結束'
     A                                 20 33'請輸入選擇項目:'
     A            DOPID          2A  B 20 51DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      VALUES('11' '12' '13' '14' '51' '90+
     A                                      ' '15' '54' '55')
     A  98        ERR1          70A  O 22  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 67'【泛太資訊】'
