     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : PTS000D                                    *
     A*    AUTHOR       : A1034  STEPHANIE                           *
     A*    CREATE DATE  : 79/07/04                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : PTS111,BAS141                              *
     A*    SYSTEM       :                                            *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :(WINDOW)                                    *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PTRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPC1
     A                                      TEXT('PTS111')
     A                                      CA03(03)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      OVERLAY
     A                                      PROTECT
     A                                      CLRL(*NO)
     A N99                              4 50'                              '
     A                                      DSPATR(RI)
     A N99                              5 50' '
     A                                      DSPATR(RI)
     A N99        #Z02      R        O  5 52DSPATR(HI)
     A                                  5 73'     '
     A N99                              5 79' '
     A                                      DSPATR(RI)
     A N99                              6 50' '
     A                                      DSPATR(RI)
     A N99                              6 52'OP : 1 -挑選            '
     A N99                              6 79' '
     A                                      DSPATR(RI)
     A N99                              7 50' '
     A                                      DSPATR(RI)
     A N99                              7 52'OP代碼內容 代碼說明   '
     A                                      DSPATR(UL)
     A N99                              7 79' '
     A                                      DSPATR(RI)
     A N99                              8 50' '
     A                                      DSPATR(RI)
     A N99        D1011          1A  B  8 52VALUES('1' ' ')
     A  61                                  DSPATR(ND)
     A  61                                  DSPATR(PR)
     A N99        D1012         23A  O  8 55
     A N99                              8 79' '
     A                                      DSPATR(RI)
     A N99                              9 50' '
     A                                      DSPATR(RI)
     A N99        D1021          1A  B  9 52VALUES('1' ' ')
     A  62                                  DSPATR(ND)
     A  62                                  DSPATR(PR)
     A N99        D1022         23A  O  9 55
     A N99                              9 79' '
     A                                      DSPATR(RI)
     A N99                             10 50' '
     A                                      DSPATR(RI)
     A N99        D1031          1A  B 10 52VALUES('1' ' ')
     A  63                                  DSPATR(ND)
     A  63                                  DSPATR(PR)
     A N99        D1032         23A  O 10 55
     A N99                             10 79' '
     A                                      DSPATR(RI)
     A N99                             11 50' '
     A                                      DSPATR(RI)
     A N99        D1041          1A  B 11 52VALUES('1' ' ')
     A  64                                  DSPATR(ND)
     A  64                                  DSPATR(PR)
     A N99        D1042         23A  O 11 55
     A N99                             11 79' '
     A                                      DSPATR(RI)
     A N99                             12 50' '
     A                                      DSPATR(RI)
     A N99        D1051          1A  B 12 52VALUES('1' ' ')
     A  65                                  DSPATR(ND)
     A  65                                  DSPATR(PR)
     A N99        D1052         23A  O 12 55
     A N99                             12 79' '
     A                                      DSPATR(RI)
     A N99                             13 50' '
     A                                      DSPATR(RI)
     A N99        D1061          1A  B 13 52VALUES('1' ' ')
     A  66                                  DSPATR(ND)
     A  66                                  DSPATR(PR)
     A N99        D1062         23A  O 13 55
     A N99                             13 79' '
     A                                      DSPATR(RI)
     A N99                             14 50' '
     A                                      DSPATR(RI)
     A                                 14 52'                          '
     A N99                             14 79' '
     A                                      DSPATR(RI)
     A N99                             15 50' '
     A                                      DSPATR(RI)
     A N99                             15 52'PF3 =回主畫面           '
     A N99                             15 79' '
     A                                      DSPATR(RI)
     A N99                             16 50'                              '
     A                                      DSPATR(RI)
