     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     /*                                                              */
     /*    PROGRAM-ID   : HRBKUPC                                    */
     /*    PROGRAM NAME :人事薪資管理系統備份作業                  */
     /*    AUTHOR       : A1269 JADI                                 */
     /*    CREATE DATE  : 90/05/18                                   */
     /*    UPDATE DATE  :                                            */
     /*    SYSTEM       :人事薪資管理系統　　　　　　　　　　　    */
     /****************************************************************/
             PGM
             DCL        VAR(&RESP) TYPE(*CHAR) LEN(1)
             SNDUSRMSG  MSG('確定：１．磁帶已備妥，置入磁帶機．　+
                          ２．要進行備份作業了．請確定(Y/N)?') +
                          VALUES(Y N) TOMSGQ(*EXT) MSGRPY(&RESP)
             IF         COND(&RESP *EQ Y) THEN(DO)
    /*       SBMJOB     CMD(INZTAP DEV(TAP01) NEWVOL(YAMAHA) +
                          NEWOWNID(PPSPGMREL) CHECK(*NO) +
                          DENSITY(*QIC5010))                 */

             SBMJOB     CMD(SAVLIB LIB(PYFLIBYK PYPLIBYK +
                           PYSLIBYK S#LIBV31 +
                          PTPLIB PTFLIB) DEV(TAP01))
             SNDUSRMSG  MSG('備份作業已送出執行！') MSGTYPE(*INFO)
             ENDDO
             IF         COND(&RESP *EQ N) THEN(DO)
             SNDUSRMSG  MSG('備份作業已取消！') MSGTYPE(*INFO)
             ENDDO
             ENDPGM
