     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : PTR1A01C                                  */
     /*    PROGRAM NAME :代碼規則清冊                             */
     /*    AUTHOR       : A1150                                     */
     /*    CREATE DATE  : 81/10/28                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&D#Z01F)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&D#Z01T)   TYPE(*CHAR) LEN(10)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&D#Z01F)   VALUE(%SST(*LDA 501 10))
             CHGVAR     VAR(&D#Z01T)   VALUE(%SST(*LDA 511 10))

             OVRDBF     FILE(PT#ZPF) SHARE(*YES)
             OPNQRYF    FILE((PT#ZPF)) QRYSLT(' #Z01 *EQ %RANGE("' +
                          *CAT &D#Z01F *CAT '" "' *CAT &D#Z01T *CAT +
                          '") ') KEYFLD(*FILE)

     /*      OVRPRTF    FILE(PTR110P) PAGESIZE(*N 198) CPI(15)    */
             CALL       PTR1A01
             CLOF       OPNID(PT#ZPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PTR1A0P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
