             PGM

             DCL        VAR(&DT602)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DT601)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&WDT601)   TYPE(*CHAR) LEN(8)

             CHGVAR     VAR(&DT602)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DT601)    VALUE(%SST(*LDA 520 7))
             CHGVAR     VAR(&WDT601)   VALUE(%SST(*LDA 509 8))

             OVRDBF     FILE(PYT6PF) SHARE(*YES)
             OPNQRYF    FILE((PYT6PF)) OPTION(*ALL) QRYSLT(' +
                          T601C *LE "' *CAT &WDT601 *CAT '" +
                          & T696 *EQ 0 +
                          & T602 *EQ "' *CAT &DT602 *CAT '"  ') +
                          KEYFLD((T602) (T603) (T601)) +
                          MAPFLD((T601C T601 *CHAR 8))

             CALL       PYA2161
             CLOF       OPNID(PYT6PF)
             DLTOVR     FILE(*ALL)

             ENDPGM
