     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     /*                                                              */
     /*    PROGRAM-ID   : PYA3041C                                   */
     /*    PROGRAM NAME :員工調薪試算作業　                        */
     /*    AUTHOR       : A1274 EVA                                  */
     /*    CREATE DATE  : 90/07/26                                   */
     /*    UPDATE DATE  :                                            */
     /*    SYSTEM       :人事薪資管理系統                          */
     /****************************************************************/
             PGM
             DCL        VAR(&DRV01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DRV03)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&WRV03)    TYPE(*CHAR) LEN(8)
             DCL        VAR(&DYMD)     TYPE(*CHAR) LEN(6)
             DCL        VAR(&WYMD)     TYPE(*CHAR) LEN(8)
             DCL        VAR(&DRV04)    TYPE(*CHAR) LEN(2)

             CHGVAR     VAR(&DRV01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DRV03)    VALUE(%SST(*LDA 503 6))
             CHGVAR     VAR(&WRV03)    VALUE(%SST(*LDA 509 4))
             CHGVAR     VAR(&DYMD)     VALUE(%SST(*LDA 517 6))
             CHGVAR     VAR(&WYMD)     VALUE(%SST(*LDA 525 8))
             CHGVAR     VAR(&DRV04)    VALUE(%SST(*LDA 601 2))

             OVRDBF     FILE(PYEMPF) SHARE(*YES)
             OPNQRYF    FILE((PYEMPF)) QRYSLT(' +
                            EM01 *EQ "' *CAT &DRV01 *CAT '" +
                         & EM11 *EQ " " ')

             CALL       PYA3041
             CLOF       OPNID(PYEMPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
