             PGM
             DCL        VAR(&DSH01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSH03)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&WSH03)    TYPE(*CHAR) LEN(8)

             CHGVAR     VAR(&DSH01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DSH03)    VALUE(%SST(*LDA 503 7))
             CHGVAR     VAR(&WSH03)    VALUE(%SST(*LDA 510 8))

             OVRDBF     FILE(PYSHPF) SHARE(*YES)
             OPNQRYF    FILE((PYSHPF)) OPTION(*ALL) QRYSLT('SH01 *EQ +
                          "' *CAT &DSH01 *CAT '" & SH06 *EQ 0 & +
                          SH03C *EQ "' *CAT &WSH03 *CAT '"') +
                          KEYFLD((SH01) (SH02) (SH03)) +
                          MAPFLD((SH03C SH03 *CHAR 8))

             CALL       PYA3031
             CLOF       OPNID(PYSHPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
