             PGM
             DCL        VAR(&DWD01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DWD03)    TYPE(*CHAR) LEN(5)
             DCL        VAR(&WWD03)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&DWD04)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&DWD05)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DDS04)    TYPE(*CHAR) LEN(5)
             DCL        VAR(&DDS043)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&DDS044)    TYPE(*CHAR) LEN(4)
             CHGVAR     VAR(&DWD01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DWD05)    VALUE(%SST(*LDA 503 2))
             CHGVAR     VAR(&DWD03)    VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&WWD03)    VALUE(%SST(*LDA 511 6))
             CHGVAR     VAR(&DWD04)    VALUE(%SST(*LDA 606 1))
             CHGVAR     VAR(&DDS043)    VALUE(%SST(*LDA 555 1))
             CHGVAR     VAR(&DDS044)    VALUE(%SST(*LDA 551 4))
             CHGVAR     VAR(&DDS04)    VALUE(%SST(*LDA 551 5))

             OVRDBF     FILE(PYWDPF) SHARE(*YES)

             OPNQRYF    FILE((PYWDPF)) QRYSLT('WD01 *EQ "' *CAT +
                          &DWD01 *CAT '" & WD03C *EQ "' *CAT &WWD03 +
                          *CAT '" & WD04 *EQ "' *CAT &DWD04 *CAT '" +
                          & WD05 *EQ "' *CAT &DWD05 *CAT '"') +
                          KEYFLD(*FILE) MAPFLD((WD03C WD03 *CHAR 6))

             CALL       PYA3142
             CLOF       OPNID(PYWDPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
