             PGM
             DCL        VAR(&DPW01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DPW03)    TYPE(*CHAR) LEN(5)
             DCL        VAR(&WPW03)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&DPW04)    TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DPW01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DPW03)    VALUE(%SST(*LDA 603 5))
             CHGVAR     VAR(&WPW03)    VALUE(%SST(*LDA 511 6))
             CHGVAR     VAR(&DPW04)    VALUE(%SST(*LDA 507 1))

             OVRDBF     FILE(PYPHLF01) SHARE(*YES)
             OPNQRYF    FILE((PYPHLF01)) OPTION(*ALL) QRYSLT('PH01 +
                          *EQ "' *CAT &DPW01 *CAT '" & PH03C *EQ "' +
                          *CAT &WPW03 *CAT '" & PH04 *EQ "' *CAT +
                          &DPW04 *CAT '"') KEYFLD(*FILE) +
                          MAPFLD((PH03C PH03 *CHAR 6))

             CALL       PYA3151
             CLOF       OPNID(PYPHLF01)
             DLTOVR     FILE(*ALL)

             ENDPGM
