             PGM
             DCL        VAR(&DSH01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WSH06)    TYPE(*CHAR) LEN(8)
             DCL        VAR(&DRATE)    TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DSH01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&WSH06)    VALUE(%SST(*LDA 509 8))
             CHGVAR     VAR(&DRATE)    VALUE(%SST(*LDA 517 6))

             OVRDBF     FILE(PYEMPF) SHARE(*YES)
             OPNQRYF    FILE((PYEMPF)) QRYSLT(' +
                          EM01 *EQ "' *CAT &DSH01 *CAT '"') +
                          KEYFLD((EM01) (EM02))

             CALL       PYA3312
             CLOF       OPNID(PYEMPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
