     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     /*                                                              */
     /*    PROGRAM-ID   : PYA3101C                                   */
     /*    PROGRAM NAME :員工晉升試算作業　                        */
     /*    AUTHOR       : A1336 KLAUS                                */
     /*    CREATE DATE  : 91/09/26                                   */
     /*    UPDATE DATE  :                                            */
     /*    SYSTEM       :人事薪資管理系統                          */
     /****************************************************************/
             PGM
             DCL        VAR(&DT801)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DT802)    TYPE(*CHAR) LEN(8)
             DCL        VAR(&DT804)    TYPE(*CHAR) LEN(7)
             DCL        VAR(&WT804)    TYPE(*CHAR) LEN(8)
             DCL        VAR(&DTT1)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&DTT2)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&DSH05)    TYPE(*CHAR) LEN(14)

             CHGVAR     VAR(&DT801)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DT802)    VALUE(%SST(*LDA 503 8))
             CHGVAR     VAR(&DT804)    VALUE(%SST(*LDA 511 7))
             CHGVAR     VAR(&WT804)    VALUE(%SST(*LDA 518 8))
             CHGVAR     VAR(&DTT1)     VALUE(%SST(*LDA 526 2))
             CHGVAR     VAR(&DTT2)     VALUE(%SST(*LDA 528 3))
             CHGVAR     VAR(&DSH05)    VALUE(%SST(*LDA 531 14))

             IF         COND(&DT802 *EQ ' ') THEN(DO)
             OVRDBF     FILE(PYEMPF) SHARE(*YES)
             OPNQRYF    FILE((PYEMPF)) QRYSLT(' +
                           EM01 *EQ "' *CAT &DT801 *CAT '" +
                         & EM11 *EQ " " ')
             ENDDO

             IF         COND(&DT802 *NE ' ') THEN(DO)
             OVRDBF     FILE(PYEMPF) SHARE(*YES)
             OPNQRYF    FILE((PYEMPF)) QRYSLT(' +
                           EM01 *EQ "' *CAT &DT801 *CAT '" +
                         & EM02 *EQ "' *CAT &DT802 *CAT '" +
                         & EM11 *EQ " " ')
             ENDDO

             CALL       PYA3101
             CLOF       OPNID(PYEMPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
