     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYA413                                    */
     /*    PROGRAM NAME : 特休結算批次處理　　　　　　            */
     /*    AUTHOR       :                                           */
     /*    CREATE DATE  : 91/11/18                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DYY)      TYPE(*CHAR) LEN(3)
             DCL        VAR(&WYY)      TYPE(*CHAR) LEN(4)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DYY)      VALUE(%SST(*LDA 503 3))
             CHGVAR     VAR(&WYY)      VALUE(%SST(*LDA 506 4))

             OVRDBF     FILE(PYEMPF) SHARE(*YES)

       /* 以特休基準月為計算基礎 */
             OPNQRYF    FILE((PYEMPF)) QRYSLT('  +
                           EM01 *EQ "' *CAT &DEM01 *CAT '"  +
                         & EM19 *EQ 0 ') +
                          KEYFLD((EM01) (EM02))

/*           CLRPFM     FILE(PYFLIBYH/PY2HPF)                   */

             CALL       PYA4131
             CLOF       OPNID(PYEMPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
