     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYA418                                    */
     /*    PROGRAM NAME :員工出勤結算作業　　　　　　             */
     /*    AUTHOR       : SHARON                                    */
     /*    CREATE DATE  : 94/01/14                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DYEAR)    TYPE(*CHAR) LEN(3)
             DCL        VAR(&WYEAR)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&WYMF)     TYPE(*CHAR) LEN(6)
             DCL        VAR(&WYMT)     TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DYEAR)    VALUE(%SST(*LDA 503 3))
             CHGVAR     VAR(&WYEAR)    VALUE(%SST(*LDA 506 4))
             CHGVAR     VAR(&WYMF)     VALUE(%SST(*LDA 510 6))
             CHGVAR     VAR(&WYMT)     VALUE(%SST(*LDA 516 6))

             OVRDBF     FILE(PYEMPF) SHARE(*YES)

       /* 以特休基準月為計算基礎 */
             OPNQRYF    FILE((PYEMPF)) QRYSLT('EM01 *EQ "' *CAT +
                          &DEM01 *CAT '"') KEYFLD((EM01) (EM02))

             CALL       PYA4181
             CLOF       OPNID(PYEMPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
