     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYA4212C                                  */
     /*    PROGRAM NAME : 公司獎金資料建立　　　　　              */
     /*    AUTHOR       : A1070 CHOIE                               */
     /*    CREATE DATE  : 79/07/21                                  */
     /*    UPDATE DATE  : 89/02/17 A1274 EVA                        */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM
             DCL        VAR(&DPB01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WPB03)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&WPB04)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WPB05)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&WPB05D)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&WDEPT1)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&WDEPT2)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DDAYS)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&WRATS)    TYPE(*CHAR) LEN(7)
             DCL        VAR(&WRATE)    TYPE(*CHAR) LEN(7)
             DCL        VAR(&DOPT)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&DAMTS)    TYPE(*CHAR) LEN(8)

             MONMSG     MSGID(CPF0000)
             CHGVAR     VAR(&DPB01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&WPB03)    VALUE(%SST(*LDA 503 4))
             CHGVAR     VAR(&WPB04)    VALUE(%SST(*LDA 507 2))
             CHGVAR     VAR(&WPB05)    VALUE(%SST(*LDA 509 6))
             CHGVAR     VAR(&WPB05D)   VALUE(%SST(*LDA 515 2))
             CHGVAR     VAR(&WDEPT1)   VALUE(%SST(*LDA 601 7))
             CHGVAR     VAR(&WDEPT2)   VALUE(%SST(*LDA 608 7))
             CHGVAR     VAR(&DDAYS)    VALUE(%SST(*LDA 567 4))
             CHGVAR     VAR(&WRATS)    VALUE(%SST(*LDA 571 7))
             CHGVAR     VAR(&WRATE)    VALUE(%SST(*LDA 578 7))
             CHGVAR     VAR(&DOPT)     VALUE(%SST(*LDA 585 1))
             CHGVAR     VAR(&DAMTS)    VALUE(%SST(*LDA 617 8))

             OVRDBF     FILE(PYEMPF) SHARE(*YES)
             OPNQRYF    FILE((PYEMPF)) QRYSLT(' +
                           EM01 *EQ "' *CAT &DPB01 *CAT '" +
                         & EM11 *NE "Y" & EM11 *NE "*" +
                         & CEM04 *EQ %RANGE("' *CAT &WDEPT1 *CAT '" +
                                           "' *CAT &WDEPT2 *CAT '")') +
                        KEYFLD(*FILE) +
                        MAPFLD((CEM04 'EM041 *CAT EM042 *CAT +
                                       EM043 *CAT EM044'))

             CALL       PYA4212
             CLOF       OPNID(PYEMPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
