     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYA418                                    */
     /*    PROGRAM NAME :產生排班資料  　　　　　　             */
     /*    AUTHOR       : SHARON                                    */
     /*    CREATE DATE  : 94/01/14                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WYM)      TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&WYM)     VALUE(%SST(*LDA 508 6))

             OVRDBF     FILE(PYT2PF) SHARE(*YES)

       /* 以特休基準月為計算基礎 */
             OPNQRYF    FILE((PYT2PF)) QRYSLT('T201 *EQ "' *CAT +
                          &DEM01 *CAT '" &    T203C *EQ "' *CAT +
                          &WYM   *CAT '"') KEYFLD((T201) (T202)) +
                         MAPFLD((T203C T203 *CHAR 6))

             CALL       PYA4201
             CLOF       OPNID(PYT2PF)
             DLTOVR     FILE(*ALL)

             ENDPGM
