     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYA4082C                                  */
     /*    PROGRAM NAME :褔利獎金資料建立　　　　　               */
     /*    AUTHOR       : A1326 SANTOS                              */
     /*    CREATE DATE  : 90/02/21                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM
             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WYEAR)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&WTYPE)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WYMD)     TYPE(*CHAR) LEN(8)
             DCL        VAR(&WPB05)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&WPB05D)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&WEM04S)   TYPE(*CHAR) LEN(5)
             DCL        VAR(&WEM04E)   TYPE(*CHAR) LEN(5)
             DCL        VAR(&DMNY)     TYPE(*CHAR) LEN(7)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&WYEAR)    VALUE(%SST(*LDA 503 4))
             CHGVAR     VAR(&WTYPE)    VALUE(%SST(*LDA 507 2))
             CHGVAR     VAR(&WYMD)     VALUE(%SST(*LDA 509 8))
             CHGVAR     VAR(&WPB05)    VALUE(%SST(*LDA 509 6))
             CHGVAR     VAR(&WPB05D)   VALUE(%SST(*LDA 515 2))
             CHGVAR     VAR(&WEM04S)   VALUE(%SST(*LDA 541 5))
             CHGVAR     VAR(&WEM04E)   VALUE(%SST(*LDA 546 5))
             CHGVAR     VAR(&DMNY)     VALUE(%SST(*LDA 560 7))



 /* 固定金額 */
             OVRDBF     FILE(PYEMPF) SHARE(*YES)
             OPNQRYF    FILE((PYEMPF)) QRYSLT(' +
                           EM01 *EQ "' *CAT &DEM01 *CAT '" +
                         & EM11 *NE "Y" *AND EM11 *NE "*" +
                         & CEM04 *EQ %RANGE("' *CAT &WEM04S *CAT '" +
                                           "' *CAT &WEM04E *CAT '")') +
                        KEYFLD(*FILE) +
                        MAPFLD((CEM04 'EM041 *CAT EM042 *CAT +
                                       EM043 *CAT EM044'))

             CALL       PYA4082
             CLOF       OPNID(PYEMPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
