     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYA414                                    */
     /*    PROGRAM NAME : 特休代金批次處理　  　　　            */
     /*    AUTHOR       :                                           */
     /*    CREATE DATE  : 89/11/29                                  */
     /*    UPDATE DATE  : 90/05/28 A1274 EVA                        */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DYM)      TYPE(*CHAR) LEN(5)
             DCL        VAR(&WYM)      TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DYM)      VALUE(%SST(*LDA 503 5))
             CHGVAR     VAR(&WYM)      VALUE(%SST(*LDA 508 6))

             OVRDBF     FILE(PYEMPF) SHARE(*YES)
             OPNQRYF    FILE((PYEMPF)) QRYSLT('  +
                           EM01 *EQ "' *CAT &DEM01 *CAT '"  +
                         & EM19 *EQ 0 ') +
                          KEYFLD((EM01) (EM02)) +
                          MAPFLD((EM113A EM113 *ZONED 8) +
                          (EM113C EM113A *CHAR 8))

  /*         CLRPFM     FILE(PYFLIBYH/PY2HPF)                 */

             CALL       PYA4141
             CLOF       OPNID(PYEMPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
