     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYA419                                    */
     /*    PROGRAM NAME :年休補發結算作業　　　　　　             */
     /*    AUTHOR       : SHARON                                    */
     /*    CREATE DATE  : 94/01/20                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DYY)      TYPE(*CHAR) LEN(3)
             DCL        VAR(&WYY)      TYPE(*CHAR) LEN(4)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DYY)      VALUE(%SST(*LDA 503 3))
             CHGVAR     VAR(&WYY)      VALUE(%SST(*LDA 506 4))

             OVRDBF     FILE(PYLUPF) SHARE(*YES)

             OPNQRYF    FILE((PYLUPF)) QRYSLT('LU01 *EQ "' *CAT +
                          &DEM01 *CAT '" & LU03C *EQ "' *CAT &WYY +
                          *CAT '"') KEYFLD(*FILE) MAPFLD((LU03C +
                          LU03 *CHAR 4))

             CALL       PYA4191
             CLOF       OPNID(PYLUPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
