             PGM
             DCL        VAR(&DCM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WDYMD)    TYPE(*CHAR) LEN(8)
             DCL        VAR(&WDYM)     TYPE(*CHAR) LEN(6)
             DCL        VAR(&WDY)      TYPE(*CHAR) LEN(4)
             DCL        VAR(&TDEV)     TYPE(*CHAR) LEN(10)

             CHGVAR     VAR(&DCM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&WDYMD)    VALUE(%SST(*LDA 521 8))
             CHGVAR     VAR(&WDYM)     VALUE(%SST(*LDA 521 6))
             CHGVAR     VAR(&WDY)      VALUE(%SST(*LDA 521 4))
             CHGVAR     VAR(&TDEV)     VALUE(%SST(*LDA 509 10))

             DLTF       FILE(QTEMP/PY*)
             MONMSG     MSGID(CPF2125)

             CPYF       FROMFILE(PYEDPF) TOFILE(QTEMP/PYEDPFS) +
                        MBROPT(*REPLACE) CRTFILE(*YES) +
                        INCREL((*IF ED01 *EQ &DCM01) +
                               (*AND ED03 *LE &WDYMD))

             CPYF       FROMFILE(PYOVPF) TOFILE(QTEMP/PYOVPFS) +
                        MBROPT(*REPLACE) CRTFILE(*YES) +
                        INCREL((*IF OV01 *EQ &DCM01) +
                               (*AND OV03 *LE &WDYMD))

             CPYF       FROMFILE(PYLVPF) TOFILE(QTEMP/PYLVPFS) +
                        MBROPT(*REPLACE) CRTFILE(*YES) +
                        INCREL((*IF LV01 *EQ &DCM01) +
                               (*AND LV03 *LE &WDYMD))

             CPYF       FROMFILE(PYOSPF) TOFILE(QTEMP/PYOSPFS) +
                        MBROPT(*REPLACE) CRTFILE(*YES) +
                        INCREL((*IF OS01 *EQ &DCM01) +
                               (*AND OS03 *LE &WDYM))

             CPYF       FROMFILE(PYPWPF) TOFILE(QTEMP/PYPWPFS) +
                        MBROPT(*REPLACE) CRTFILE(*YES) +
                        INCREL((*IF PW01 *EQ &DCM01) +
                               (*AND PW03 *LE &WDYM))

             CPYF       FROMFILE(PYWDPF) TOFILE(QTEMP/PYWDPFS) +
                        MBROPT(*REPLACE) CRTFILE(*YES) +
                        INCREL((*IF WD01 *EQ &DCM01) +
                               (*AND WD03 *LE &WDYM))

             CPYF       FROMFILE(PYPHPF) TOFILE(QTEMP/PYPHPFS) +
                        MBROPT(*REPLACE) CRTFILE(*YES) +
                        INCREL((*IF PH01 *EQ &DCM01) +
                               (*AND PH03 *LE &WDYM))

             CPYF       FROMFILE(PYHDPF) TOFILE(QTEMP/PYHDPFS) +
                        MBROPT(*REPLACE) CRTFILE(*YES) +
                        INCREL((*IF HD01 *EQ &DCM01) +
                               (*AND HD03 *LE &WDYM))

             CPYF       FROMFILE(PYPBPF) TOFILE(QTEMP/PYPBPFS) +
                        MBROPT(*REPLACE) CRTFILE(*YES) +
                        INCREL((*IF PB01 *EQ &DCM01) +
                               (*AND PB05 *LE &WDYM))

             CPYF       FROMFILE(PYBTPF) TOFILE(QTEMP/PYBTPFS) +
                        MBROPT(*REPLACE) CRTFILE(*YES) +
                        INCREL((*IF BT01 *EQ &DCM01) +
                               (*AND BT05 *LE &WDYM))

             CPYF       FROMFILE(PYCHPF) TOFILE(QTEMP/PYCHPFS) +
                        MBROPT(*REPLACE) CRTFILE(*YES) +
                        INCREL((*IF CH01 *EQ &DCM01) +
                               (*AND CH03 *LE &WDYM))

             CPYF       FROMFILE(PYCDPF) TOFILE(QTEMP/PYCDPFS) +
                        MBROPT(*REPLACE) CRTFILE(*YES) +
                        INCREL((*IF CD01 *EQ &DCM01) +
                               (*AND CD03 *LE &WDYM))

             CPYF       FROMFILE(PYPCPF) TOFILE(QTEMP/PYPCPFS) +
                        MBROPT(*REPLACE) CRTFILE(*YES) +
                        INCREL((*IF PC01 *EQ &DCM01) +
                               (*AND PC05 *LE &WDYM))

             INZTAP     DEV(&TDEV) NEWVOL(PY) NEWOWNID(PAYROLL) +
                          CHECK(*NO) DENSITY(6250)

             SAVOBJ     OBJ(PY*) LIB(QTEMP) DEV(&TDEV) OBJTYPE(*FILE)

             ENDPGM
