
             PGM
             DCL        VAR(&IN03) TYPE(*LGL) LEN(1)
             DCL        VAR(&DPW01) TYPE(*CHAR) LEN(2)
             DCL        VAR(&WPW03) TYPE(*DEC) LEN(6 0)
START:
     CALL PGM(PYA540)


     IF COND(&IN03) THEN(DO)
             GOTO       CMDLBL(END)
     ENDDO

END:
             ENDPGM
