     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYA6051C                                  */
     /*    PROGRAM NAME :福委會收支轉檔作業　　　　　             */
     /*    AUTHOR       :                                           */
     /*    CREATE DATE  : 88/10/26                                  */
     /*    UPDATE DATE  : 90/02/20 A1274 EVA                        */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DER01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WER03)    TYPE(*CHAR) LEN(6)
             MONMSG     MSGID(CPF0000)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DER01)    VALUE(%SST(*LDA 508 2))
             CHGVAR     VAR(&WER03)    VALUE(%SST(*LDA 511 6))

             OVRDBF     FILE(PYHDPF) SHARE(*YES)

  /*******************************************************************/
  /*公司別為ＹＭ時．福委會是ＦＭ．福利金'84'  */
             IF         COND(&DEM01 *EQ "YM") THEN(DO)
             OPNQRYF    FILE((PYHDPF)) QRYSLT(' +
                            HD01 *EQ ("' *CAT &DEM01 *CAT '") +
                          & CHD03 *EQ ("' *CAT &WER03 *CAT '") +
                          & HD04 *EQ "1" +
                          & HD05 *EQ "84" ') +
                          KEYFLD(*FILE) +
                          MAPFLD((CHD03 HD03 *CHAR 6))
             ENDDO


  /*******************************************************************/
  /*公司別為ＹＨ時．福委會是ＦＨ．福利金'56'  */
             IF         COND(&DEM01 *EQ "YH") THEN(DO)
             OPNQRYF    FILE((PYHDPF)) QRYSLT(' +
                            HD01 *EQ ("' *CAT &DEM01 *CAT '") +
                          & CHD03 *EQ ("' *CAT &WER03 *CAT '") +
                          & HD04 *EQ "1" +
                          & HD05 *EQ "56" ') +
                          KEYFLD(*FILE) +
                          MAPFLD((CHD03 HD03 *CHAR 6))
             ENDDO


  /*******************************************************************/

             CALL       PYA6051
             CLOF       OPNID(PYHDPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
