     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYA605                                    */
     /*    PROGRAM NAME : 福委會所得轉檔作業　　　　　            */
     /*    AUTHOR       : A1269 EVA                                 */
     /*    CREATE DATE  : 88/10/26                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DHD01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WHD01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WHD05)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WHD03) TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DHD01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&WHD03) VALUE(%SST(*LDA 511 6))
             CHGVAR     VAR(&WHD01) VALUE('SQ')
             CHGVAR     VAR(&WHD05) VALUE('35')

             CALL PYT118
             CALL PYT1181

             OVRDBF     FILE(PYHDPF) SHARE(*YES)
             OPNQRYF    FILE((PYHDPF)) QRYSLT(' HD01 *EQ ("' *CAT +
                          &WHD01 *CAT '") & CHD03 *EQ ("' *CAT +
                          &WHD03 *CAT '") & HD05 *EQ ("' *CAT +
                          &WHD05 *CAT '")') KEYFLD(*FILE) +
                          MAPFLD((CHD03 HD03 *CHAR 6))
             CALL       PYA6051
             CLOF       OPNID(PYHDPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
