     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYA6111C                                  */
     /*    PROGRAM NAME :福委會獎金轉檔作業　　　　　             */
     /*    AUTHOR       : A1274 EVA                                 */
     /*    CREATE DATE  : 90/02/21                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DER01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WPB03)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&WPB05)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&DPB04)    TYPE(*CHAR) LEN(2)

             CHGVAR     VAR(&DER01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&WPB03)    VALUE(%SST(*LDA 503 4))
             CHGVAR     VAR(&WPB05)    VALUE(%SST(*LDA 507 6))
             CHGVAR     VAR(&DPB04)    VALUE(%SST(*LDA 513 2))

  /*******************************************************************/
  /*公司別為ＹＭ時．福委會是ＦＭ  */
  /*公司別為ＹＨ時．福委會是ＦＨ  */

             OVRDBF     FILE(PYPBPF) SHARE(*YES)
             OPNQRYF    FILE((PYPBPF)) QRYSLT(' +
                            PB01 *EQ ("' *CAT &DER01 *CAT '") +
                          & CPB03 *EQ ("' *CAT &WPB03 *CAT '") +
                          & CPB05 *EQ ("' *CAT &WPB05 *CAT '") +
                          & PB04 *EQ ("' *CAT &DPB04 *CAT '")') +
                          KEYFLD(*FILE) +
                          MAPFLD((CPB03 PB03 *CHAR 4) +
                                 (CPB05 PB05 *CHAR 6))

  /*******************************************************************/

             CALL       PYA6111
             CLOF       OPNID(PYPBPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
