     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYA603                                    */
     /*    PROGRAM NAME : 福委會所得扣繳申報作業　　　            */
     /*    AUTHOR       : A1274 EVA                                 */
     /*    CREATE DATE  : 88/01/26                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DTD02)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&DTD01)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&DOPT)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&KCM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DATES)    TYPE(*CHAR) LEN(7)
             DCL        VAR(&DATEF)    TYPE(*CHAR) LEN(7)
             DCL        VAR(&WDATES)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WDATEF)   TYPE(*CHAR) LEN(8)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DTD02)    VALUE(%SST(*LDA 501 4))
             CHGVAR     VAR(&DTD01)    VALUE(%SST(*LDA 505 4))
             CHGVAR     VAR(&DOPT)     VALUE(%SST(*LDA 509 1))
             CHGVAR     VAR(&KCM01)    VALUE(%SST(*LDA 510 2))
             CHGVAR     VAR(&DATES)    VALUE(%SST(*LDA 512 7))
             CHGVAR     VAR(&DATEF)    VALUE(%SST(*LDA 520 7))
             CHGVAR     VAR(&WDATES)   VALUE(%SST(*LDA 601 8))
             CHGVAR     VAR(&WDATEF)   VALUE(%SST(*LDA 609 8))

/*ER01=公司ER03=收支日期                                         */
             OVRDBF     FILE(PYERPF) SHARE(*YES)
             OPNQRYF    FILE((PYERPF)) QRYSLT(' ER01 *EQ +
                          ("' *CAT &KCM01 *CAT '") & +
                          SER03 *EQ %RANGE("' *CAT &WDATES *CAT '" +
                          "' *CAT &WDATEF *CAT '")') +
                          KEYFLD((ER01) (ER02) (ER03)) +
                          MAPFLD((WER03 ER03 *ZONED 8) +
                          (SER03 WER03 *CHAR 8))

         /*  CALL       PYA6032   HANK 900104 NO USE PGM */
             CALL       PYA6033
             CLOF       OPNID(PYERPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
