             PGM
             DCL        VAR(&DTD01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DTD02)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&DTAP)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&WTD01)    TYPE(*CHAR) LEN(4)
             CHGVAR     VAR(&DTD01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DTD02)    VALUE(%SST(*LDA 551 4))
             CHGVAR     VAR(&DTAP)     VALUE(%SST(*LDA 507 10))
             CHGVAR     VAR(&WTD01)    VALUE(%SST(*LDA 556 4))

             CLRPFM     FILE(*LIBL/PYTUPF)
   /*        CLRPFM     FILE(*LIBL/PYTVPF)      */

             OVRDBF     FILE(PYTDPF) SHARE(*YES)
             OPNQRYF    FILE((PYTDPF)) OPTION(*INP) QRYSLT(' CTD01 +
                          *EQ "' *CAT &WTD01 *CAT '" & TD02 *EQ "' +
                          *CAT &DTD02 *CAT '" & TD96 *NE 0 ') +
                          KEYFLD((TD03)) +
                          MAPFLD((CTD01 TD01 *CHAR 4))

             CALL       PYA7043
             CLOF       OPNID(PYTDPF)
             DLTOVR     FILE(*ALL)

    /*       IF         COND(&DTAP *NE ' ') THEN(DO)            */
    /*         INZTAP   DEV(&DTAP) NEWVOL(PY) NEWOWNID(PAYROLL) +  */
    /*                  CHECK(*NO) DENSITY(6250)                */
    /*         OVRTAPF  FILE(QTAPE) DEV(&DTAP) REELS(*SL) RCDLEN(100) +
    /*                  BLKLEN(4000)                               */
    /*         CPYTOTAP FROMFILE(*LIBL/PYTVPF) TOFILE(QTAPE) +      */
    /*                  TOREELS(*SL) TORCDLEN(100) TOBLKLEN(4000) + */
    /*                  TORCDBLK(*F)                                */
    /*         DLTOVR   FILE(QTAPE)                                 */
    /*       ENDDO                                                  */

             ENDPGM
