             PGM
             DCL        VAR(&DTD02)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&DTD11)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&DTAP)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&WTD01)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&WTD16)    TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DTD11)    VALUE(%SST(*LDA 600 2))
             CHGVAR     VAR(&DTD02)    VALUE(%SST(*LDA 541 4))
             CHGVAR     VAR(&DTAP)     VALUE(%SST(*LDA 507 10))
             CHGVAR     VAR(&WTD01)    VALUE(%SST(*LDA 545 4))
             CHGVAR     VAR(&WTD16)    VALUE(%SST(*LDA 549 6))

             CLRPFM     FILE(*LIBL/PYTTPF)
             OVRDBF     FILE(PYTTPF) SHARE(*YES)

             OVRDBF     FILE(PYTDPF) SHARE(*YES)
             OPNQRYF    FILE((PYTDPF)) OPTION(*ALL) QRYSLT(' +
                            CTD01 *EQ "' *CAT &WTD01 *CAT '" +
                          & TD02 *EQ "' *CAT &DTD02 *CAT '" +
                          & TD11 = "' || &DTD11 || '"       +
                          & TD96 *NE 0 ') +
                          KEYFLD((TD03)) +
                          MAPFLD((CTD01 TD01 *CHAR 4) +
                                 (CTD16 TD16 *CHAR 6))

             CALL       PYA7042
             CLOF       OPNID(PYTDPF)
             DLTOVR     FILE(*ALL)

  /*         IF         COND(&DTAP *NE ' ') THEN(DO)            */
  /*         INZTAP     DEV(&DTAP) NEWVOL(PY) NEWOWNID(PAYROLL) +
                        CHECK(*NO) DENSITY(6250)                */
  /*         OVRTAPF    FILE(QTAPE) DEV(&DTAP) REELS(*SL) RCDLEN(80) +
                        BLKLEN(4000)                            */
  /*         CPYTOTAP   FROMFILE(*LIBL/PYTTPF) TOFILE(QTAPE) +
                        TOREELS(*SL) TORCDLEN(80) TOBLKLEN(4000) +
                        TORCDBLK(*F)                            */
  /*         DLTOVR     FILE(QTAPE)     */
  /*         ENDDO                       */

             ENDPGM
