             PGM
             DCL        VAR(&DTD11)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WTD01)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&DTD02)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&WTD16)    TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&WTD01)    VALUE(%SST(*LDA 545 4))
             CHGVAR     VAR(&DTD02)    VALUE(%SST(*LDA 541 4))
             CHGVAR     VAR(&WTD16)    VALUE(%SST(*LDA 549 6))
             CHGVAR     VAR(&DTD11)    VALUE(%SST(*LDA 600 2))

       /*    CALL PYT125    */

             OVRDBF     FILE(PYTDPF) SHARE(*YES)
             OPNQRYF    FILE((PYTDPF)) OPTION(*ALL) QRYSLT(' +
                            CTD01 *EQ "' *CAT &WTD01 *CAT '" +
                          & TD02 *EQ "' *CAT &DTD02 *CAT '" +
                          & TD11 *EQ "' || &DTD11 || '"      ') +
                          KEYFLD((TD04) (TD99) (TD12)) +
                          MAPFLD((CTD01 TD01 *CHAR 4) +
                                 (CTD16 TD16 *CHAR 6))

             CALL       PYA7041
             CLOF       OPNID(PYTDPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
