             PGM
             DCL        VAR(&DPY01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DBT061)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&DBT03)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&WBT04)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&WPB03)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&DPB04)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DPH03)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&WPH03)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&DBT04)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&DBT05)    TYPE(*CHAR) LEN(2)

             CHGVAR     VAR(&DPY01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DBT061)   VALUE(%SST(*LDA 503 3))
             CHGVAR     VAR(&DBT03)    VALUE(%SST(*LDA 522 1))
             CHGVAR     VAR(&WBT04)    VALUE(%SST(*LDA 571 6))
             CHGVAR     VAR(&WPB03)    VALUE(%SST(*LDA 577 4))
             CHGVAR     VAR(&DPB04)    VALUE(%SST(*LDA 581 2))
             CHGVAR     VAR(&DPH03)    VALUE(%SST(*LDA 601 4))
             CHGVAR     VAR(&WPH03)    VALUE(%SST(*LDA 606 6))
             CHGVAR     VAR(&DBT05)    VALUE(%SST(*LDA 627 2))
             CHGVAR     VAR(&DBT04)    VALUE(%SST(*LDA 623 4))

             OVRDBF     FILE(PYPYJF03) SHARE(*YES)
             OPNQRYF    FILE((PYPYJF03)) QRYSLT('PY01 *EQ "' *CAT +
                          &DPY01 *CAT '" & PY04 *EQ "' *CAT &DBT061 +
                          *CAT '" ') KEYFLD(*FILE)

             CALL       PYA7011
             CLOF       OPNID(PYPYJF03)
             DLTOVR     FILE(*ALL)

             ENDPGM
