             PGM

             DCL        VAR(&DBT01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DBT03)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBT04)    TYPE(*CHAR) LEN(5)
             DCL        VAR(&DBT05)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DBT061)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&WBT04)    TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DBT01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DBT03)    VALUE(%SST(*LDA 522 1))
             CHGVAR     VAR(&DBT04)    VALUE(%SST(*LDA 623 4))
             CHGVAR     VAR(&DBT05)    VALUE(%SST(*LDA 627 2))
             CHGVAR     VAR(&DBT061)   VALUE(%SST(*LDA 503 3))
             CHGVAR     VAR(&WBT04)    VALUE(%SST(*LDA 571 6))

             OVRDBF     FILE(PYBTPF) SHARE(*YES)
             OPNQRYF    FILE((PYBTPF)) QRYSLT('BT01 *EQ "' *CAT +
                          &DBT01 *CAT '" & BT04C *EQ "' *CAT &WBT04 +
                          *CAT '" & BT05C *EQ "' *CAT &DBT05 *CAT +
                          '" & BT03 *EQ "' *CAT &DBT03 *CAT '" & +
                          BT061 *EQ "' *CAT &DBT061 *CAT '"') +
                          KEYFLD((BT061) (BT062) (BT07))              +
                          MAPFLD((BT04C BT04 *CHAR 6) +
                          (BT05C BT05 *CHAR 2))

             CLRPFM     FILE(PYB6PF)

             CALL       PYA7013
             CLOF       OPNID(PYBTPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
