             PGM
             DCL        VAR(&WTD01)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&WTD11)    TYPE(*CHAR) LEN(2)
             CHGVAR     VAR(&WTD01)    VALUE(%SST(*LDA 571 4))
             CHGVAR     VAR(&WTD11)    VALUE(%SST(*LDA 507 2))

             OVRDBF     FILE(PYPBPF) SHARE(*YES)
             OPNQRYF    FILE((PYPBPF)) QRYSLT(' PB01 *EQ "' *CAT +
                          &WTD11 *CAT '" & CPB05 *EQ "' *CAT &WTD01 +
                          *CAT '" & PB96 *NE 0 ') KEYFLD(*FILE) +
                          MAPFLD((WPB05 PB05 *CHAR 6) (CPB05 +
                          '%SST(WPB05 1 4)' *CHAR 4))

             CALL       PYA7022
             CLOF       OPNID(PYPBPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
