     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYA7019C                                  */
     /*    PROGRAM NAME : 薪資銀行媒體轉存磁片：萬泰商銀          */
     /*    AUTHOR       : A1274 EVA                                 */
     /*    CREATE DATE  : 88/09/16                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM
             DCL        VAR(&DBT01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DBT03)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&WBT04)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&DBT05)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DBT06F)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&DBT06T)   TYPE(*CHAR) LEN(3)

             CHGVAR     VAR(&DBT01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DBT03)    VALUE(%SST(*LDA 522 1))
             CHGVAR     VAR(&WBT04)    VALUE(%SST(*LDA 571 6))
             CHGVAR     VAR(&DBT05)    VALUE(%SST(*LDA 527 2))
             CHGVAR     VAR(&DBT06F)   VALUE(%SST(*LDA 503 3))
             CHGVAR     VAR(&DBT06T)   VALUE(%SST(*LDA 506 3))

             OVRDBF     FILE(PYBTPF) SHARE(*YES)
             OPNQRYF    FILE((PYBTPF)) QRYSLT(' BT01 *EQ "' *CAT +
                          &DBT01 *CAT '" & BT04C *EQ "' *CAT &WBT04 +
                          *CAT '" & BT05C *EQ "' *CAT &DBT05 *CAT +
                          '" & BT03 *EQ "' *CAT &DBT03 *CAT '" & +
                          BT061 *EQ RANGE("' *CAT &DBT06F *CAT '" +
                          "' *CAT &DBT06T *CAT '"') KEYFLD(*FILE) +
                          MAPFLD((BT04C BT04 *CHAR 6) (BT05C BT05 +
                          *CHAR 2))

             CLRPFM     FILE(PYB8PF)

             CALL       PYA7019
             CLOF       OPNID(PYBTPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
