             PGM
             DCL        VAR(&WTD01)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&WTD11)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WFYM)     TYPE(*CHAR) LEN(8)
             DCL        VAR(&WTYM)     TYPE(*CHAR) LEN(8)
             DCL        VAR(&SYM)      TYPE(*CHAR) LEN(6)
             DCL        VAR(&EYM)      TYPE(*CHAR) LEN(6)
             CHGVAR     VAR(&WTD01)    VALUE(%SST(*LDA 571 4))
             CHGVAR     VAR(&WTD11)    VALUE(%SST(*LDA 507 2))
             CHGVAR     VAR(&WFYM)     VALUE(%SST(*LDA 517 8))
             CHGVAR     VAR(&WTYM)     VALUE(%SST(*LDA 525 8))
             CHGVAR     VAR(&SYM)      VALUE(%SST(*LDA 517 6))
             CHGVAR     VAR(&EYM)      VALUE(%SST(*LDA 525 6))

             OVRDBF     FILE(PYPHPF) SHARE(*YES)
             OPNQRYF    FILE((PYPHPF)) QRYSLT('                  +
                          PH01 = "' || &WTD11 || '"              +
                        & CPH96 = %RANGE("' || &WFYM || '"       +
                           "' || &WTYM || '")')                  +
                          KEYFLD(*FILE)                          +
                        MAPFLD((CPH96 PH96 *CHAR 8))
             CALL       PYA7021
             CLOF       OPNID(PYPHPF)
             DLTOVR     FILE(*ALL)

             OVRDBF     FILE(PYPTPF) SHARE(*YES)
             OPNQRYF    FILE((PYPTPF)) QRYSLT('                  +
                          PT01 = "' || &WTD11 || '"              +
                        & CPT04 = %RANGE("' || &SYM || '"        +
                           "' || &EYM || '")')                   +
                          KEYFLD(*FILE)                          +
                        MAPFLD((CPT04 PT04 *CHAR 6))
             CALL       PYA70211
             CLOF       OPNID(PYPTPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
