             PGM

             DCLF       FILE(PYWWPF)

             DCL        VAR(&CMDTXT)   TYPE(*CHAR) LEN(160)
             DCL        VAR(&CMDLEN)   TYPE(*DEC)  LEN(15 5)

             DCL        VAR(&DBT01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DBT03)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBT04)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&WBT04)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&DBT05)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DBT06F)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&DBT06T)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&FBT01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&EBT01)    TYPE(*CHAR) LEN(2)
             CHGVAR     VAR(&DBT01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DBT03)    VALUE(%SST(*LDA 522 1))
             CHGVAR     VAR(&DBT04)    VALUE(%SST(*LDA 523 4))
             CHGVAR     VAR(&WBT04)    VALUE(%SST(*LDA 571 6))
             CHGVAR     VAR(&DBT05)    VALUE(%SST(*LDA 577 2))
             CHGVAR     VAR(&DBT06F)   VALUE(%SST(*LDA 503 3))
             CHGVAR     VAR(&DBT06T)   VALUE(%SST(*LDA 503 3))
             CHGVAR     VAR(&FBT01)    VALUE(%SST(*LDA 629 2))
             CHGVAR     VAR(&EBT01)    VALUE(%SST(*LDA 631 2))

             OVRDBF     FILE(PYBTPF) SHARE(*YES)
             OPNQRYF    FILE((PYBTPF)) QRYSLT('                    +
                          BT01 *EQ "' *CAT &FBT01 *CAT '"         +
                        & BT04C *EQ "' *CAT &WBT04 *CAT '"         +
                        & BT05C *EQ "' *CAT &DBT05 *CAT '"         +
                        & BT03  *EQ "' *CAT &DBT03 *CAT '"         +
                        & BT061 *EQ %RANGE("' *CAT &DBT06F *CAT '" +
                                          "' *CAT &DBT06T *CAT '") +
                        | BT01 *EQ "' *CAT &EBT01 *CAT '"        +
                        & BT04C *EQ "' *CAT &WBT04 *CAT '"         +
                        & BT05C *EQ "' *CAT &DBT05 *CAT '"         +
                        & BT03  *EQ "' *CAT &DBT03 *CAT '"         +
                        & BT061 *EQ %RANGE("' *CAT &DBT06F *CAT '" +
                                          "' *CAT &DBT06T *CAT '") +
                                                               ')  +
                          KEYFLD(*FILE)                            +
                          MAPFLD((BT04C BT04 *CHAR 6)              +
                                 (BT05C BT05 *CHAR 2))

             CLRPFM     FILE(PYG5PF)

             CALL       PYA7016

    READF:
             RCVF
             IF         COND(&FBT01 *NE &WW01) THEN(GOTO CMDLBL(READF))

             CHGVAR     VAR(&CMDTXT) VALUE('STRPCCMD PCCMD('||+
             &WW02)
             CHGVAR     VAR(&CMDLEN) VALUE(160)
   /*©I¥sPCµ{¦¡*/
             STRPCO
             MONMSG     MSGID(IWS4010)
             CALL       PGM(QCMDEXC) PARM(&CMDTXT &CMDLEN)

             CLOF       OPNID(PYBTPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
