             PGM

             DCL        VAR(&DBT01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DPY09)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBT061)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&DBT062)   TYPE(*CHAR) LEN(4)
             DCL        VAR(&DBT09)    TYPE(*CHAR) LEN(12)
             DCL        VAR(&DBT03)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&WBT04)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&DBT05)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DPB041)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DPB042)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DOPT)     TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DBT01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DPY09)    VALUE(%SST(*LDA 567 1))
             CHGVAR     VAR(&DBT061)   VALUE(%SST(*LDA 503 3))
             CHGVAR     VAR(&DBT062)   VALUE(%SST(*LDA 506 4))
             CHGVAR     VAR(&DBT09)    VALUE(%SST(*LDA 510 12))
             CHGVAR     VAR(&DBT03)    VALUE(%SST(*LDA 522 1))
             CHGVAR     VAR(&WBT04)    VALUE(%SST(*LDA 571 6))
             CHGVAR     VAR(&DBT05)    VALUE(%SST(*LDA 527 2))
             CHGVAR     VAR(&DPB041)   VALUE(%SST(*LDA 529 2))
             CHGVAR     VAR(&DPB042)   VALUE(%SST(*LDA 531 2))
             CHGVAR     VAR(&DOPT)     VALUE(%SST(*LDA 533 1))

             OVRDBF     FILE(PYBTPF) SHARE(*YES)
             OPNQRYF    FILE((PYBTPF)) QRYSLT(' +
                          BT01 *EQ "' *CAT &DBT01 *CAT '" & +
                          BT04C *EQ "' *CAT &WBT04 *CAT '" & +
                          BT05C *EQ "' *CAT &DBT05 *CAT '" & +
                          BT03 *EQ "' *CAT &DBT03 *CAT '" & +
                          BT061 *EQ "' *CAT &DBT061 *CAT '"') +
                          KEYFLD(*FILE) +
                          MAPFLD((BT04C BT04 *CHAR 6) +
                                 (BT05C BT05 *CHAR 2))

             CLRPFM     FILE(PYB12PF)

             CALL       PYA7078
             CLOF       OPNID(PYBTPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
