             PGM
             DCL        VAR(&DELYN )    TYPE(*CHAR) LEN(1)
             DCL        VAR(&DLP01 )    TYPE(*CHAR) LEN(2)
             DCL        VAR(&LP03M )    TYPE(*CHAR) LEN(6)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DELYN )    VALUE(%SST(*LDA 503 1))
             CHGVAR     VAR(&DLP01 )    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&LP03M )    VALUE(%SST(*LDA 511 6))

             OVRPRTF    FILE(PYA908P) TOFILE(*LIBL/PYA908P) +
                          PAGESIZE(66 132) CPI(15)

           CPYF       FROMFILE(PYA908WF) TOFILE(QTEMP/PYA908WF) +
                        CRTFILE(*YES)
           MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/PYA908WF))
           OVRDBF     FILE(PYA908WF) TOFILE(QTEMP/PYA908WF) SHARE(*YES)
           CLRPFM     FILE(PYA908WF)

           OVRDBF     FILE(PYLPPF) SHARE(*YES)

             OPNQRYF    FILE((PYLPPF  )) QRYSLT('                    +
                      LP01   *EQ "' *CAT &DLP01  *CAT '"             +
                    & LP03   *EQ  ' *CAT &LP03M  *CAT '              +
                                                         ')

             CALL       PGM(PYA9082)

             IF         COND(&DELYN *EQ 'Y') THEN(DO)
             CALL       PGM(PYA9084)
             ENDDO


             CALL       PYA9083

             CLOF       OPNID(PYLPPF)

           DLTOVR     FILE(*ALL)


             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYA908P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
