             PGM
             DCL        VAR(&DSH01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WSH06)    TYPE(*CHAR) LEN(8)

             CHGVAR     VAR(&DSH01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&WSH06)    VALUE(%SST(*LDA 509 8))

             OVRDBF     FILE(PCFILE) SHARE(*YES)
             OPNQRYF    FILE((PCFILE))

             CALL       PYB0012
             CLOF       OPNID(PCFILE)
             DLTOVR     FILE(*ALL)

             ENDPGM
