     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYH123                                    */
     /*    PROGRAM NAME : 產生本月申報檔作業                      */
     /*    AUTHOR       : MAX PENG                                  */
     /*    CREATE DATE  : 94/05/17                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DH601)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DH603)    TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DH601)    VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DH603)    VALUE(%SST(*LDA 603 6))

             OVRDBF     FILE(PYH6PF) SHARE(*YES)

       /*                      */
             OPNQRYF    FILE((PYH6PF)) QRYSLT('  +
                           H601 *EQ "' || &DH601 || '"  +
                        & H603C *EQ "' || &DH603 || '" ') +
                          KEYFLD((H601) (H602))           +
                          MAPFLD((H603C H603 *CHAR 6))


             CALL       PYH1231
             CLOF       OPNID(PYH6PF)
             DLTOVR     FILE(*ALL)

             ENDPGM
