     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYH124                                    */
     /*    PROGRAM NAME : 產生月提繳工資                        */
     /*    AUTHOR       : MAX PENG                                  */
     /*    CREATE DATE  : 94/05/17                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DH401)    TYPE(*CHAR) LEN(2)

             CHGVAR     VAR(&DH401)    VALUE(%SST(*LDA 601 2))

             OVRDBF     FILE(PYH4PF) SHARE(*YES)

       /*                      */
             OPNQRYF    FILE((PYH4PF)) OPTION(*ALL) QRYSLT('  H401 +
                          *EQ "' || &DH401 || '" ') KEYFLD((H401) +
                          (H402))


             CALL       PYH1241
             CLOF       OPNID(PYH4PF)
             DLTOVR     FILE(*ALL)

             ENDPGM
