             PGM
             DCL        VAR(&DH601) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM04F) TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM04T) TYPE(*CHAR) LEN(7)
             DCL        VAR(&DPT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DH602F) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DH602T) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DYM) TYPE(*CHAR) LEN(6)
             DCL        VAR(&$PENV) TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY) TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I) TYPE(*DEC) LEN(3 0)

             CHGVAR     VAR(&DH601) VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM04F) VALUE(%SST(*LDA 640 7))
             CHGVAR     VAR(&DEM04T) VALUE(%SST(*LDA 647 7))
             CHGVAR     VAR(&DPT) VALUE(%SST(*LDA 513 1))
             CHGVAR     VAR(&DH602F) VALUE(%SST(*LDA 514 8))
             CHGVAR     VAR(&DH602T) VALUE(%SST(*LDA 522 8))
             CHGVAR     VAR(&DYM) VALUE(%SST(*LDA 530 6))

             IF         COND(&DPT *EQ '1') THEN(DO)
             OVRDBF     FILE(PYH6JF01) SHARE(*YES)
             OPNQRYF    FILE((PYH6JF01)) QRYSLT('EM04 *EQ %RANGE("' +
                          *CAT &DEM04F *CAT '" "' *CAT &DEM04T *CAT +
                          '") & H601 *EQ "' *CAT &DH601 *CAT '" & +
                          H602 *EQ %RANGE("' *CAT &DH602F *CAT '" +
                          "' *CAT &DH602T *CAT '") & H603C *EQ "' +
                          *CAT &DYM *CAT '" & EM11 *NE "Y" *AND +
                          EM11 *NE "*"') KEYFLD((EM041) (EM042) +
                          (EM043) (EM044)) MAPFLD((EM04 'EM041 *CAT +
                          EM042 *CAT EM043 *CAT EM044') (H603C H603 +
                          *CHAR 6))
             ENDDO

             IF         COND(&DPT *EQ '2') THEN(DO)
             OVRDBF     FILE(PYH6JF01) SHARE(*YES)
             OPNQRYF    FILE((PYH6JF01)) QRYSLT(' EM04 *EQ %RANGE("' +
                          *CAT &DEM04F *CAT '" "' *CAT &DEM04T *CAT +
                          '") & H601 *EQ ("' *CAT &DH601 *CAT '")& +
                          H602 *EQ %RANGE("' *CAT &DH602F *CAT '" +
                          "' *CAT &DH602T *CAT '") & H603C *EQ ("' +
                          *CAT &DYM *CAT '") &  (EM11 *EQ "Y" *OR  +
                          EM11 *EQ "*")') KEYFLD((EM041) (EM042) +
                          (EM043) (EM044)) MAPFLD((EM04 'EM041 *CAT +
                          EM042 *CAT EM043 *CAT EM044' *CALC) +
                          (H603C H603 *CHAR 6))
             ENDDO

             OVRPRTF    FILE(PYH125P) PAGESIZE(*N 198) CPI(15)
             CALL       PGM(PYH1252)
             CLOF       OPNID(PYH6JF01)
             DLTOVR     FILE(*ALL)
             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYH125P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)
             ENDPGM
