             PGM
             DCL        VAR(&DH401) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM04F) TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM04T) TYPE(*CHAR) LEN(7)
             DCL        VAR(&DOPT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DH402F) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DH402T) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DYM) TYPE(*CHAR) LEN(6)
             DCL        VAR(&$PENV) TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY) TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I) TYPE(*DEC) LEN(3 0)

             CHGVAR     VAR(&DH401) VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM04F) VALUE(%SST(*LDA 550 7))
             CHGVAR     VAR(&DEM04T) VALUE(%SST(*LDA 557 7))
             CHGVAR     VAR(&DOPT) VALUE(%SST(*LDA 513 1))
             CHGVAR     VAR(&DH402F) VALUE(%SST(*LDA 514 8))
             CHGVAR     VAR(&DH402T) VALUE(%SST(*LDA 522 8))
             CHGVAR     VAR(&DYM) VALUE(%SST(*LDA 530 6))

             OVRDBF     FILE(PYH4JF01) SHARE(*YES)
             OPNQRYF    FILE((PYH4JF01)) QRYSLT('EM04 *EQ %RANGE("' +
                          *CAT &DEM04F *CAT '" "' *CAT &DEM04T *CAT +
                          '") & H401 *EQ "' *CAT &DH401 *CAT '" & +
                          H402 *EQ %RANGE("' *CAT &DH402F *CAT '" +
                          "' *CAT &DH402T *CAT '") +
                          & H405 *NE "2" ')                       +
                          KEYFLD((EM041) (EM042) (EM043) (EM044)) +
                          MAPFLD((EM04 'EM041 *CAT EM042 *CAT EM043 +
                          *CAT EM044'))

             OVRPRTF    FILE(PYH113P) PAGESIZE(*N 198) CPI(15)
             CALL       PGM(PYH1132)
             CLOF       OPNID(PYH4JF01)
             DLTOVR     FILE(*ALL)
             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYH113P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)
             ENDPGM
