             PGM
             DCL        VAR(&DEM01)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041) TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042) TYPE(*CHAR) LEN(7)
             DCL        VAR(&DSYYMM) TYPE(*CHAR) LEN(6)

             DCL        VAR(&$PENV)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I) TYPE(*DEC) LEN(3 0)

             CHGVAR     VAR(&DEM01)  VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041) VALUE(%SST(*LDA 540 7))
             CHGVAR     VAR(&DEM042) VALUE(%SST(*LDA 547 7))
             CHGVAR     VAR(&DSYYMM) VALUE(%SST(*LDA 529 6))

             OVRDBF     FILE(PYH4JF01) SHARE(*YES)
             OPNQRYF    FILE((PYH4JF01)) QRYSLT('EM01 *EQ "' *CAT +
                          &DEM01 *CAT '" & CEM04 *EQ %RANGE("' *CAT +
                          &DEM041 *CAT '" "' *CAT &DEM042 *CAT '") +
                          & H405 *EQ "1"')  KEYFLD((H409)(H402))   +
                          MAPFLD((CEM04 'EM041 *CAT EM042 *CAT +
                          EM043 *CAT EM044'))

             OVRPRTF    FILE(PYH105P) PAGESIZE(*N 198) CPI(15)
             CALL       PGM(PYH1052)
             CLOF       OPNID(PYH4JF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYH105P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
