             PGM
             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&YYMM6)    TYPE(*CHAR) LEN(6)
             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 1))
             CHGVAR     VAR(&YYMM6)   VALUE(%SST(*LDA 511 6))
             OVRDBF     FILE(PYH6PF) SHARE(*YES)
             OPNQRYF    FILE((PYH6PF)) QRYSLT('                    +
                          H603C *EQ "' *CAT &YYMM6 *CAT '"    +
                       &  H605  *NE 0  ')  +
                          KEYFLD((H601) (H602) )                  +
                          MAPFLD((H603C H603 *CHAR 6))

             OVRPRTF    FILE(PYH307P) PAGESIZE(66) OVRFLW(60)
             CALL       PYH3072
             CLOF       OPNID(PYH6PF)
             DLTOVR     FILE(PYH307P)
             ENDPGM
