             PGM
       /*  CHECK SCREEN */
             DCL        VAR(&IN03)     TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN96)     TYPE(*LGL)  LEN(1)
             DCL        VAR(&CPY)      TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&PRTID)    TYPE(*DEC)  LEN(1 0)
             CHGVAR     VAR(&IN03)  VALUE('0')
             CHGVAR     VAR(&IN96)  VALUE('0')
 START:      CALL       PGM(PYH3071) PARM(&IN03 &IN96 &CPY &PRTID)
             IF         COND(&IN03) THEN(DO)
      /*     CHGVAR     VAR(%SST(*LDA 501 28)) VALUE(' ') */
             RETURN
             ENDDO
             CHGVAR     VAR(%SST(*LDA 125 3)) VALUE(&CPY)
             CHGVAR     VAR(%SST(*LDA 128 1)) VALUE(&PRTID)
     /*      SBMJOB     JOB(PYH3072C) RQSDTA('CALL PYH3072C') */
             CALL PYH3072C
     /*      CHGVAR     VAR(%SST(*LDA 501 28)) VALUE(' ')   */
             CHGVAR     VAR(&IN96)  VALUE('1')
             GOTO       START
             ENDPGM
