             PGM
             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&YYMM6)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&$PENV) TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY) TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I) TYPE(*DEC) LEN(3 0)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 1))
             CHGVAR     VAR(&YYMM6)   VALUE(%SST(*LDA 511 6))

             OVRDBF     FILE(PYH6JF01) SHARE(*YES)
             OPNQRYF    FILE((PYH6JF01)) QRYSLT('        +
                          H603C *EQ "' *CAT &YYMM6 *CAT '"    +
                       &  H606  *NE 0  ')  +
        KEYFLD((H601) (EM041)(EM042)(EM043)(EM044) (H602) )    +
                          MAPFLD((H603C H603 *CHAR 6))

             OVRPRTF    FILE(PYH308P) PAGESIZE(66 80) CPI(15)
             CALL       PGM(PYH3082)
             CLOF       OPNID(PYH6JF01)
             DLTOVR     FILE(*ALL)
             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYH308P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)
             ENDPGM
