    PGM
    DCL        VAR(&DSP)     TYPE(*CHAR)  LEN(10)
    CHGVAR     VAR(&DSP) VALUE(%SST(*LDA 163 10))
    CALL PYH306
    SNDBRKMSG  MSG('勞退主檔報表已產生') TOMSGQ(&DSP)
    ENDPGM

