     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /***************************************************************/
             PGM
             DCL        VAR(&$USER)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0102I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101O) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LMSG)   TYPE(*CHAR) LEN(6)
             DCLF       FILE(*LIBL/PYM500D) RCDFMT(DSPC1)

             CALL       PGM(L@S004) PARM('PY' '01' &LMSG)
             CHGVAR     VAR(&$USER)  VALUE(%SST(*LDA 101 10))
             CHGVAR     VAR(&DDATE)  VALUE(%SST(*LDA 203 6))
             CHGVAR     VAR(&$USERN) VALUE(%SST(*LDA 152 10))
             CHGDTAARA  DTAARA(*LDA (187 6)) VALUE(%SST(*LDA 111 6))
             CHGVAR     VAR(&S0101I) VALUE(&$USER)

             CHGVAR     VAR(&IN31) VALUE('0')
             CHGVAR     VAR(&IN32) VALUE('0')
             IF         COND(&LMSG *NE 'A' & &LMSG *NE 'W') +
                          THEN(CHGVAR VAR(&IN32) VALUE('1'))
             IF         COND(&LMSG *EQ 'W') THEN(CHGVAR +
                          VAR(&IN31) VALUE('1'))

             OVRMSGF    MSGF(QCPFMSG) TOMSGF(*LIBL/PTMF)
             SETATNPGM  PGM(*LIBL/ATN01)

  START:
             SNDRCVF    DEV(*FILE) RCDFMT(DSPC1)
             IF         COND(&IN32) THEN(GOTO START)
             IF         COND(&IN03) THEN(RETURN)
             CHGVAR     VAR(&IN98) VALUE('0')

             IF         COND(&DOPID *EQ '01') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA517'))
             IF         COND(&DOPID *EQ '02') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA512'))
    /*       IF         COND(&DOPID *EQ '03') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA513'))      */
             IF         COND(&DOPID *EQ '04') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA516'))
             IF         COND(&DOPID *EQ '05') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA519'))
             IF         COND(&DOPID *EQ '06') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA501'))
             IF         COND(&DOPID *EQ '07') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA502'))
             IF         COND(&DOPID *EQ '08') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA518'))
             IF         COND(&DOPID *EQ '09') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA511'))
   /*        IF         COND(&DOPID *EQ '10') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA509'))     */
   /*        IF         COND(&DOPID *EQ '11') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA224'))    */
   /*        IF         COND(&DOPID *EQ '12') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA225'))    */
   /*        IF         COND(&DOPID *EQ '13') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA226'))    */
   /*        IF         COND(&DOPID *EQ '21') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA506'))     */
             IF         COND(&DOPID *EQ '22') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA543'))
             IF         COND(&DOPID *EQ '23') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA520'))
             IF         COND(&DOPID *EQ '31') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA503'))
      /*     IF         COND(&DOPID *EQ '32') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA505'))        */
      /*     IF         COND(&DOPID *EQ '33') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA510'))        */
             IF         COND(&DOPID *EQ '41') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA507'))
             IF         COND(&DOPID *EQ '42') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA504'))
             IF         COND(&DOPID *EQ '51') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PTA110'))
             IF         COND(&DOPID *EQ '52') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PTA120'))
             IF         COND(&DOPID *EQ '53') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PTR1A0C'))
   /*        IF         COND(&DOPID *EQ '61') THEN(CHGVAR +   */
   /*                     VAR(&S0102I) VALUE('PYA224'))       */
   /*        IF         COND(&DOPID *EQ '62') THEN(CHGVAR +   */
   /*                     VAR(&S0102I) VALUE('PYA225'))       */
   /*        IF         COND(&DOPID *EQ '63') THEN(CHGVAR +   */
   /*                     VAR(&S0102I) VALUE('PYA226'))       */
  /*         IF         COND(&DOPID *EQ '64') THEN(CHGVAR +   */
  /*                      VAR(&S0102I) VALUE('PYA228'))       */
  /*         IF         COND(&DOPID *EQ '71') THEN(CHGVAR +   */
  /*                      VAR(&S0102I) VALUE('PYA227'))       */
   /*        IF         COND(&DOPID *EQ '61') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA531'))          */
   /*        IF         COND(&DOPID *EQ '62') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA532'))          */
   /*        IF         COND(&DOPID *EQ '63') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYR5310C'))        */
   /*        IF         COND(&DOPID *EQ '64') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYR5320C'))        */
             GOTO       CHKAUT

  CHKAUT:    CALL       PGM(S#S01) PARM(&S0101I &S0102I &S0101O)
             IF         COND(&S0101O = 'Y') THEN(CALL PGM(&S0102I))
             ELSE       CMD(CHGVAR VAR(&IN98) VALUE('1'))
             GOTO       START

             ENDPGM
