     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /***************************************************************/
             PGM
             DCL        VAR(&$USER)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0102I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101O) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LMSG)   TYPE(*CHAR) LEN(6)
             DCLF       FILE(*LIBL/PYM700D) RCDFMT(DSPC1)

             CALL       PGM(L@S004) PARM('PY' '01' &LMSG)
             CHGVAR     VAR(&$USER)  VALUE(%SST(*LDA 101 10))
             CHGVAR     VAR(&DDATE)  VALUE(%SST(*LDA 203 6))
             CHGVAR     VAR(&$USERN) VALUE(%SST(*LDA 152 10))
             CHGDTAARA  DTAARA(*LDA (187 6)) VALUE(%SST(*LDA 111 6))
             CHGVAR     VAR(&S0101I) VALUE(&$USER)

             CHGVAR     VAR(&IN31) VALUE('0')
             CHGVAR     VAR(&IN32) VALUE('0')
             IF         COND(&LMSG *NE 'A' & &LMSG *NE 'W') +
                          THEN(CHGVAR VAR(&IN32) VALUE('1'))
             IF         COND(&LMSG *EQ 'W') THEN(CHGVAR +
                          VAR(&IN31) VALUE('1'))

             OVRMSGF    MSGF(QCPFMSG) TOMSGF(*LIBL/PTMF)
             SETATNPGM  PGM(*LIBL/ATN01)

  START:
             SNDRCVF    DEV(*FILE) RCDFMT(DSPC1)
             IF         COND(&IN32) THEN(GOTO START)
             IF         COND(&IN03) THEN(RETURN)
             CHGVAR     VAR(&IN98) VALUE('0')

             IF         COND(&DOPID *EQ '01') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA530'))
             IF         COND(&DOPID *EQ '02') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA110'))
             IF         COND(&DOPID *EQ '03') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA111'))
             IF         COND(&DOPID *EQ '11') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA533'))
             IF         COND(&DOPID *EQ '12') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA114'))
             IF         COND(&DOPID *EQ '21') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA902'))
             IF         COND(&DOPID *EQ '22') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA903'))
             IF         COND(&DOPID *EQ '23') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA907'))
             IF         COND(&DOPID *EQ '24') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA9041C'))
             IF         COND(&DOPID *EQ '25') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA9081C'))
   /*        IF         COND(&DOPID *EQ '13') THEN(CHGVAR +  */
   /*                     VAR(&S0102I) VALUE('PYA135'))      */
   /*        IF         COND(&DOPID *EQ '21') THEN(CHGVAR +  */
   /*                     VAR(&S0102I) VALUE('PYA131'))      */
   /*        IF         COND(&DOPID *EQ '22') THEN(CHGVAR +  */
   /*                     VAR(&S0102I) VALUE('PYA132'))      */
   /*        IF         COND(&DOPID *EQ '23') THEN(CHGVAR +  */
   /*                     VAR(&S0102I) VALUE('PYA133'))      */
   /*        IF         COND(&DOPID *EQ '31') THEN(CHGVAR +  */
   /*                     VAR(&S0102I) VALUE('PYA534'))      */
   /*        IF         COND(&DOPID *EQ '32') THEN(CHGVAR +  */
   /*                     VAR(&S0102I) VALUE('PYA116'))      */
   /*        IF         COND(&DOPID *EQ '33') THEN(CHGVAR +  */
   /*                     VAR(&S0102I) VALUE('PYA539'))      */
             IF         COND(&DOPID *EQ '41') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYR6190C'))
             IF         COND(&DOPID *EQ '42') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYR6340C'))
   /*        IF         COND(&DOPID *EQ '42') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYR6350C'))    */
   /*        IF         COND(&DOPID *EQ '43') THEN(CHGVAR +  */
   /*                     VAR(&S0102I) VALUE('PYR6240C'))    */
   /*        IF         COND(&DOPID *EQ '44') THEN(CHGVAR +  */
   /*                     VAR(&S0102I) VALUE('PYR6220C'))    */
   /*        IF         COND(&DOPID *EQ '45') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYR6340C'))    */
             IF         COND(&DOPID *EQ '51') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYR6180C'))
             IF         COND(&DOPID *EQ '52') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYR6300C'))
   /*        IF         COND(&DOPID *EQ '52') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYR6200C'))    */
   /*        IF         COND(&DOPID *EQ '53') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYR6300C'))    */
   /*        IF         COND(&DOPID *EQ '61') THEN(CHGVAR +  */
   /*                     VAR(&S0102I) VALUE('PYR6361C'))    */
   /*        IF         COND(&DOPID *EQ '62') THEN(CHGVAR +  */
   /*                     VAR(&S0102I) VALUE('PYR6370C'))    */
   /*        IF         COND(&DOPID *EQ '63') THEN(CHGVAR +  */
   /*                     VAR(&S0102I) VALUE('PYR6320C'))    */
    /*       IF         COND(&DOPID *EQ '71') THEN(CHGVAR +  */
    /*                    VAR(&S0102I) VALUE('PYR6391C'))    */
             IF         COND(&DOPID *EQ '72') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYR6400C'))
             IF         COND(&DOPID *EQ '73') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYR6411C'))
             IF         COND(&DOPID *EQ '74') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYR6421C'))
    /*       IF         COND(&DOPID *EQ '75') THEN(CHGVAR +  */
    /*                    VAR(&S0102I) VALUE('PYR7170C'))    */
             IF         COND(&DOPID *EQ '81') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYR6460C'))
             IF         COND(&DOPID *EQ '82') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYR6430C'))
             IF         COND(&DOPID *EQ '83') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYR6450C'))
    /*       IF         COND(&DOPID *EQ '83') THEN(CHGVAR +  */
    /*                    VAR(&S0102I) VALUE('PYR6330C'))    */
    /*       IF         COND(&DOPID *EQ '84') THEN(CHGVAR +  */
    /*                    VAR(&S0102I) VALUE('PYR6380C'))    */
             IF         COND(&DOPID *EQ '85') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PYA644C'))
             GOTO       CHKAUT

  CHKAUT:    CALL       PGM(S#S01) PARM(&S0101I &S0102I &S0101O)
             IF         COND(&S0101O = 'Y') THEN(CALL PGM(&S0102I))
             ELSE       CMD(CHGVAR VAR(&IN98) VALUE('1'))
             GOTO       START

             ENDPGM
