             PGM
             DCL        VAR(&DED01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DED021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DED022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DED031)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DED032)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&EM1101)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&EM1102)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&WED031)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WED032)   TYPE(*CHAR) LEN(8)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DED01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 503 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 510 7))
             CHGVAR     VAR(&DED021)   VALUE(%SST(*LDA 537 8))
             CHGVAR     VAR(&DED022)   VALUE(%SST(*LDA 545 8))
             CHGVAR     VAR(&DED031)   VALUE(%SST(*LDA 601 6))
             CHGVAR     VAR(&DED032)   VALUE(%SST(*LDA 608 6))
             CHGVAR     VAR(&EM1101)   VALUE(%SST(*LDA 535 1))
             CHGVAR     VAR(&EM1102)   VALUE(%SST(*LDA 536 1))
             CHGVAR     VAR(&WED031)   VALUE(%SST(*LDA 553 8))
             CHGVAR     VAR(&WED032)   VALUE(%SST(*LDA 561 8))

             OVRDBF     FILE(PYEDJF01) SHARE(*YES)
             OPNQRYF    FILE((PYEDJF01)) QRYSLT('ED01 *EQ "' *CAT +
                          &DED01 *CAT '" & CEM04 *EQ %RANGE("' *CAT +
                          &DEM041 *CAT '" "' *CAT &DEM042 *CAT +
                          '") & ED02 *EQ %RANGE("' *CAT &DED021 +
                          *CAT '" "' *CAT &DED022 *CAT '") & +
                          ED03C *EQ %RANGE("' *CAT &WED031 *CAT '" +
                          "' *CAT &WED032 *CAT '") & +
                          EM110 *EQ %RANGE("' *CAT &EM1101 *CAT '" +
                          "' *CAT &EM1102 *CAT '") ') +
                          KEYFLD((EM041) (EM042) (EM043) (EM044) +
                                 (ED02) (ED11)(ED12)(ED03)) +
                          MAPFLD((ED03C ED03 *CHAR 8) +
                          (CEM04 'EM041 *CAT EM042 *CAT EM043 *CAT +
                          EM044'))

             OVRPRTF    FILE(PYR104P) PAGESIZE(*N 198) CPI(15)
             CALL       PYR1042
             CLOF       OPNID(PYEDJF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR104P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
