             PGM
             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DEM022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DMM)      TYPE(*CHAR) LEN(2)
             DCL        VAR(&DOPT)     TYPE(*CHAR) LEN(1)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 503 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 510 7))
             CHGVAR     VAR(&DEM021)   VALUE(%SST(*LDA 537 8))
             CHGVAR     VAR(&DEM022)   VALUE(%SST(*LDA 545 8))
             CHGVAR     VAR(&DMM)      VALUE(%SST(*LDA 523 2))
             CHGVAR     VAR(&DOPT)     VALUE(%SST(*LDA 525 1))

             OVRDBF     FILE(PYEMPF) SHARE(*YES)

             IF         COND(&DOPT *EQ '1') THEN(DO)
             OPNQRYF    FILE((PYEMPF)) QRYSLT('EM01 *EQ "' *CAT +
                          &DEM01 *CAT '" & CEM04 *EQ %RANGE("' *CAT +
                          &DEM041 *CAT '" "' *CAT &DEM042 *CAT '") +
                          & EM02 *EQ %RANGE("' *CAT &DEM021 *CAT '" +
                          "' *CAT &DEM022 *CAT '") & EM33M *EQ "' +
                          *CAT &DMM *CAT '" *AND EM11 *NE "Y" *AND +
                          EM11 *NE "*" ') KEYFLD((EM01) (EM041) +
                          (EM042) (EM043) (EM044) (EM02) (EM33)) +
                          MAPFLD((EM33C EM33 *CHAR 8) (EM33M +
                          '%SST(EM33C 5 2 )') (CEM04 'EM041 *CAT +
                          EM042 *CAT EM043 *CAT EM044'))
             ENDDO
             IF         COND(&DOPT *EQ '2') THEN(DO)
             OPNQRYF    FILE((PYEMPF)) QRYSLT('EM01 *EQ "' *CAT +
                          &DEM01 *CAT '" & CEM04 *EQ %RANGE("' *CAT +
                          &DEM041 *CAT '" "' *CAT &DEM042 *CAT '") +
                          & EM02 *EQ %RANGE("' *CAT &DEM021 *CAT '" +
                          "' *CAT &DEM022 *CAT '") & EM33M *EQ "' +
                          *CAT &DMM *CAT '" *AND EM11 *NE "Y" *AND +
                          EM11 *NE "*" ') KEYFLD((EM01) (EM33) +
                          (EM041) (EM042) (EM043) (EM044) (EM02)) +
                          MAPFLD((EM33C EM33 *CHAR 8) (EM33M +
                          '%SST(EM33C 5 2 )') (CEM04 'EM041 *CAT +
                          EM042 *CAT EM043 *CAT EM044'))
             ENDDO

             CALL       PYR1052
             CLOF       OPNID(PYEMPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR105P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
