             PGM
             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DYM)      TYPE(*CHAR) LEN(4)
             DCL        VAR(&WYM)      TYPE(*CHAR) LEN(6)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 560 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 567 7))
             CHGVAR     VAR(&DYM)      VALUE(%SST(*LDA 513 4))
             CHGVAR     VAR(&WYM)      VALUE(%SST(*LDA 518 6))

             OVRDBF     FILE(PYEMPF) SHARE(*YES)
             OPNQRYF    FILE((PYEMPF)) QRYSLT('EM01 *EQ "' *CAT +
                          &DEM01 *CAT '" & CEM04 *EQ %RANGE("' *CAT +
                          &DEM041 *CAT '" "' *CAT &DEM042 *CAT '") +
                          ') KEYFLD((EM041) (EM042) (EM043) (EM044) +
                          (EM02)) MAPFLD((CEM04 'EM041 *CAT EM042 +
                          *CAT EM043 *CAT EM044'))

             OVRDBF     FILE(PYLAPF) SHARE(*YES)
             OPNQRYF    FILE((PYLAPF)) QRYSLT(' LA01 *EQ "' *CAT +
                          &DEM01 *CAT '" & CLA03 *EQ "' *CAT &WYM +
                          *CAT '" ') KEYFLD((LA01)(LA02) (LA03)) +
                          MAPFLD((LA03C LA03 *CHAR 8) (CLA03 +
                          '%SST(LA03C 1 6)'))

             OVRDBF     FILE(PYLVPF) SHARE(*YES)
             OPNQRYF    FILE((PYLVPF)) QRYSLT(' LV01 *EQ "' *CAT +
                          &DEM01 *CAT '" & CLV03 *EQ "' *CAT &WYM +
                          *CAT '" ') KEYFLD((LV01)(LV02) (LV03)) +
                          MAPFLD((LV03C LV03 *CHAR 8) (CLV03 +
                          '%SST(LV03C 1 6)'))

             CALL       PYR2082
             CLOF       OPNID(PYEMPF)
             CLOF       OPNID(PYLVPF)
             CLOF       OPNID(PYLAPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR208P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
