             PGM
             DCL        VAR(&DXX01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DXX021)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DXX022)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DXX041)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DXX042)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DXX051)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DXX052)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&WXX051)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WXX052)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DXX061)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DXX062)   TYPE(*CHAR) LEN(2)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DXX01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DXX021)   VALUE(%SST(*LDA 601 7))
             CHGVAR     VAR(&DXX022)   VALUE(%SST(*LDA 608 7))
             CHGVAR     VAR(&DXX051)   VALUE(%SST(*LDA 513 7))
             CHGVAR     VAR(&DXX052)   VALUE(%SST(*LDA 520 7))
             CHGVAR     VAR(&DXX041)   VALUE(%SST(*LDA 537 8))
             CHGVAR     VAR(&DXX042)   VALUE(%SST(*LDA 545 8))
             CHGVAR     VAR(&WXX051)   VALUE(%SST(*LDA 553 8))
             CHGVAR     VAR(&WXX052)   VALUE(%SST(*LDA 561 8))
             CHGVAR     VAR(&DXX061)   VALUE(%SST(*LDA 569 2))
             CHGVAR     VAR(&DXX062)   VALUE(%SST(*LDA 571 2))

             OVRDBF     FILE(PYXXPF) SHARE(*YES)
             OPNQRYF    FILE((PYXXPF)) QRYSLT('XX01 *EQ "' *CAT +
                          &DXX01 *CAT '" & XX02 *EQ %RANGE("' *CAT +
                          &DXX021 *CAT '" "' *CAT &DXX022 *CAT +
                          '") & XX04 *EQ %RANGE("' *CAT &DXX041 +
                          *CAT '" "' *CAT &DXX042 *CAT '") & +
                          XX06 *EQ %RANGE("' *CAT &DXX061 +
                          *CAT '" "' *CAT &DXX062 *CAT '") & +
                          XX05C *EQ %RANGE("' *CAT &WXX051 *CAT '" +
                          "' *CAT &WXX052 *CAT '")') +
                          KEYFLD((XX02) (XX04) (XX05)) +
                          MAPFLD((XX05C XX05 *CHAR 8))

             OVRPRTF    FILE(PYR226P) PAGESIZE(*N 158) CPI(12)
             CALL       PYR2262
             CLOF       OPNID(PYXXPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR226P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
