             PGM
             DCL        VAR(&DLV01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DLV021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DLV022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DLV031)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DLV032)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&WLV031)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WLV032)   TYPE(*CHAR) LEN(8)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DLV01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 560 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 567 7))
             CHGVAR     VAR(&DLV021)   VALUE(%SST(*LDA 513 8))
             CHGVAR     VAR(&DLV022)   VALUE(%SST(*LDA 521 8))
             CHGVAR     VAR(&DLV031)   VALUE(%SST(*LDA 600 6))
             CHGVAR     VAR(&DLV032)   VALUE(%SST(*LDA 607 6))
             CHGVAR     VAR(&WLV031)   VALUE(%SST(*LDA 543 8))
             CHGVAR     VAR(&WLV032)   VALUE(%SST(*LDA 551 8))

             OVRDBF     FILE(PYLVJF01) SHARE(*YES)
             OPNQRYF    FILE((PYLVJF01)) QRYSLT('LV01 *EQ "' *CAT +
                          &DLV01 *CAT '" & CEM04 *EQ %RANGE("' *CAT +
                          &DEM041 *CAT '" "' *CAT &DEM042 *CAT '") +
                          & LV02 *EQ %RANGE("' *CAT &DLV021 *CAT '" +
                          "' *CAT &DLV022 *CAT '") & LV03C *EQ +
                          %RANGE("' *CAT &WLV031 *CAT '" "' *CAT +
                          &WLV032 *CAT '")') KEYFLD((EM041) (EM042) +
                          (EM043) (EM044) (LV02) (LV03)) +
                          MAPFLD((LV03C LV03 *CHAR 8) (CEM04 'EM041 +
                          *CAT EM042 *CAT EM043 *CAT EM044' *CHAR 7))

             OVRPRTF    FILE(PYR203P) PAGESIZE(*N 198) CPI(15)
             CALL       PYR2032
             CLOF       OPNID(PYLVJF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR203P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
