             PGM
             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DEM022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DOV031)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DOV032)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&WOV031)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WOV032)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DYEAR)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WYMDS)    TYPE(*CHAR) LEN(8)
             DCL        VAR(&WYMDE)    TYPE(*CHAR) LEN(8)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 580 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 587 7))
             CHGVAR     VAR(&DEM021)   VALUE(%SST(*LDA 513 8))
             CHGVAR     VAR(&DEM022)   VALUE(%SST(*LDA 521 8))
             CHGVAR     VAR(&DOV031)   VALUE(%SST(*LDA 600 6))
             CHGVAR     VAR(&DOV032)   VALUE(%SST(*LDA 607 6))
             CHGVAR     VAR(&WOV031)   VALUE(%SST(*LDA 543 8))
             CHGVAR     VAR(&WOV032)   VALUE(%SST(*LDA 551 8))
             CHGVAR     VAR(&DYEAR)    VALUE(%SST(*LDA 614 2))
             CHGVAR     VAR(&WYMDS)    VALUE(%SST(*LDA 561 8))
             CHGVAR     VAR(&WYMDE)    VALUE(%SST(*LDA 569 8))

             OVRDBF     FILE(PYEMPF) SHARE(*YES)
             OPNQRYF    FILE((PYEMPF)) QRYSLT(' +
                          EM01 *EQ "' *CAT &DEM01 *CAT '" +
                          & EM19 *EQ 0 +
                          & CEM04 *EQ %RANGE("' *CAT &DEM041 *CAT '" +
                                             "' *CAT &DEM042 *CAT '") +
                          & EM02 *EQ %RANGE("' *CAT &DEM021 *CAT '" +
                          "' *CAT &DEM022 *CAT '")') +
                          KEYFLD((EM041) (EM042) (EM043) (EM044) +
                          (EM05) (EM02)) +
                          MAPFLD((CEM04 'EM041 *CAT EM042 *CAT +
                          EM043 *CAT EM044'))

             OVRPRTF    FILE(PYR205P) PAGESIZE(*N 198) CPI(15)
             CALL       PYR2052
             CLOF       OPNID(PYEMPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR205P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
