             PGM
             DCL        VAR(&DT201)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DYEAR)    TYPE(*CHAR) LEN(3)
             DCL        VAR(&WYEAR)    TYPE(*CHAR) LEN(4)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DT201)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 560 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 567 7))
             CHGVAR     VAR(&DYEAR)    VALUE(%SST(*LDA 600 3))
             CHGVAR     VAR(&WYEAR)    VALUE(%SST(*LDA 603 4))

             OVRDBF     FILE(PYPEJF01) SHARE(*YES)
             OPNQRYF    FILE((PYPEJF01)) QRYSLT('PE01 *EQ "' *CAT +
                          &DT201 *CAT '" & CEM04 *EQ %RANGE("' *CAT +
                          &DEM041 *CAT '" "' *CAT &DEM042 *CAT '") +
                          & EM11 *NE "Y" & CPE03 *EQ "' *CAT &WYEAR +
                          *CAT '"') KEYFLD((EM041) (EM042) (EM043) +
                          (EM044) (PE02)) MAPFLD((CEM04 'EM041 *CAT +
                          EM042 *CAT EM043 *CAT EM044') (CPE03 PE03 +
                          *CHAR 4))

             CALL       PYR2172
             CLOF       OPNID(PYPEJF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR217P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
