     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     /*                                                              */
     /*    PROGRAM-ID   : PYR2071C                                   */
     /*    PROGRAM NAME :遲到資料明細表列印                        */
     /*    AUTHOR       : A1226 PETER                                */
     /*    CREATE DATE  : 86/02/11                                   */
     /*    UPDATE DATE  : 88/10/01 A1274 EVA                         */
     /*    SYSTEM       :人事薪資系統                              */
     /****************************************************************/
             PGM

             DCL        VAR(&DLA01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DLA021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DLA022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DLA031)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DLA032)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&WLA031)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WLA032)   TYPE(*CHAR) LEN(8)

             DCL        VAR(&$PENV)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6402I) TYPE(*CHAR)  LEN(1)
             DCL        VAR(&P6403I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6404I) TYPE(*CHAR)  LEN(2)

             CHGVAR     VAR(&DLA01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 560 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 567 7))
             CHGVAR     VAR(&DLA021)   VALUE(%SST(*LDA 513 8))
             CHGVAR     VAR(&DLA022)   VALUE(%SST(*LDA 521 8))
             CHGVAR     VAR(&DLA031)   VALUE(%SST(*LDA 600 6))
             CHGVAR     VAR(&DLA032)   VALUE(%SST(*LDA 607 6))
             CHGVAR     VAR(&WLA031)   VALUE(%SST(*LDA 543 8))
             CHGVAR     VAR(&WLA032)   VALUE(%SST(*LDA 551 8))

             OVRDBF     FILE(PYLAJF02) SHARE(*YES)
             OPNQRYF    FILE((PYLAJF02)) QRYSLT('LA01 *EQ "' *CAT +
                          &DLA01 *CAT '" & CEM04 *EQ %RANGE("' *CAT +
                          &DEM041 *CAT '" "' *CAT &DEM042 *CAT '") +
                          & LA02 *EQ %RANGE("' *CAT &DLA021 *CAT '" +
                          "' *CAT &DLA022 *CAT '") & LA03C *EQ +
                          %RANGE("' *CAT &WLA031 *CAT '" "' *CAT +
                          &WLA032 *CAT '")') KEYFLD((EM041) (EM042) +
                          (EM043) (EM044) (EM05) (LA02) (LA03)) +
                          MAPFLD((LA03C LA03 *CHAR 8) (CEM04 'EM041 +
                          *CAT EM042 *CAT EM043 *CAT EM044'))

             OVRPRTF    FILE(PYR207P) PAGESIZE(*N 132) CPI(15)
             CALL       PYR2072
             CLOF       OPNID(PYLAJF02)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR207P')
             CHGVAR     VAR(&P6402I) VALUE(&$PENV)
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CHGVAR     VAR(&P6404I) VALUE(&$PRTCD)
             CALL       PGM(P64) PARM(&P6401I &P6402I &P6403I &P6404I)

             ENDPGM
