     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYR2102C                                  */
     /*    PROGRAM NAME :刷卡資料報表                             */
     /*    AUTHOR       : A1184                                     */
     /*    CREATE DATE  : 85/02/16                                  */
     /*    UPDATE DATE  : 88/10/01 A1274 EVA                        */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DT505)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DT506F)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DT506T)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DT501F)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DT501T)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DT502)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&WDT502)    TYPE(*CHAR) LEN(6)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DT505)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DT506F)   VALUE(%SST(*LDA 560 7))
             CHGVAR     VAR(&DT506T)   VALUE(%SST(*LDA 567 7))
             CHGVAR     VAR(&DT501F)   VALUE(%SST(*LDA 513 8))
             CHGVAR     VAR(&DT501T)   VALUE(%SST(*LDA 521 8))
             CHGVAR     VAR(&DT502)    VALUE(%SST(*LDA 529 4))
             CHGVAR     VAR(&WDT502)   VALUE(%SST(*LDA 533 6))

             OVRDBF     FILE(PYT5PF) SHARE(*YES)
             OPNQRYF    FILE((PYT5PF)) QRYSLT(' T505 *EQ "' *CAT +
                          &DT505 *CAT '" & CT502 *EQ "' *CAT &WDT502 +
                          *CAT '" & T501 *EQ %RANGE("' *CAT &DT501F +
                          *CAT '" "' *CAT &DT501T *CAT '") & T506 +
                          *EQ %RANGE("' *CAT &DT506F *CAT '" "' +
                          *CAT &DT506T *CAT '")') KEYFLD((T505) +
                          (T506) (T501) (T502) (T503) (T504)) +
                          MAPFLD((WT502 T502 *CHAR 8) (CT502 +
                          '%SST(WT502 1 6)'))
             OVRPRTF    FILE(PYR214P) PAGESIZE(33 80) CPI(10) +
                          OVRFLW(30)
             CALL       PYR2142
             CLOF       OPNID(PYT5PF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR214P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
