     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYR2122                                   */
     /*    PROGRAM NAME :排班資料報表列印                         */
     /*    AUTHOR       : A1184                                     */
     /*    CREATE DATE  : 85/05/01                                  */
     /*    UPDATE DATE  : 88/10/01 A1274 EVA                        */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DT201)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM04F)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM04T)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DT202F)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DT202T)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DT203F)   TYPE(*CHAR) LEN(5)
             DCL        VAR(&DT203T)   TYPE(*CHAR) LEN(5)
             DCL        VAR(&WT203F)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&WT203T)   TYPE(*CHAR) LEN(6)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DT201)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM04F)   VALUE(%SST(*LDA 560 7))
             CHGVAR     VAR(&DEM04T)   VALUE(%SST(*LDA 567 7))
             CHGVAR     VAR(&DT202F)   VALUE(%SST(*LDA 513 8))
             CHGVAR     VAR(&DT202T)   VALUE(%SST(*LDA 521 8))
             CHGVAR     VAR(&DT203F)   VALUE(%SST(*LDA 600 5))
             CHGVAR     VAR(&DT203T)   VALUE(%SST(*LDA 605 5))
             CHGVAR     VAR(&WT203F)   VALUE(%SST(*LDA 543 6))
             CHGVAR     VAR(&WT203T)   VALUE(%SST(*LDA 549 6))

             OVRDBF     FILE(PYT2JF03) SHARE(*YES)
             OPNQRYF    FILE((PYT2JF03)) QRYSLT(' EM04 *EQ %RANGE("' +
                          *CAT &DEM04F *CAT '" "' *CAT &DEM04T *CAT +
                          '") & T202 *EQ %RANGE("' *CAT &DT202F +
                          *CAT '" "' *CAT &DT202T *CAT '")  & T201 +
                          *EQ "' *CAT &DT201 *CAT '" & T203C *EQ +
                          %RANGE("' *CAT &WT203F *CAT '" "' *CAT +
                          &WT203T *CAT '") ') KEYFLD((EM041) +
                          (EM042) (EM043) (EM044) (EM02) (T203)) +
                          MAPFLD((EM04 'EM041 *CAT EM042 *CAT EM043 +
                          *CAT EM044') (T203C T203 *CHAR 6))

             OVRPRTF    FILE(PYR212P) PAGESIZE(*N 198) CPI(15)
             CALL       PYR2122
             CLOF       OPNID(PYT2JF03)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR212P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
