             PGM
             DCL        VAR(&DLV01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&WLV031)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WLV032)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DOPT)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&DOPT1)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&DOPT2)    TYPE(*CHAR) LEN(1)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DLV01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 503 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 510 7))
             CHGVAR     VAR(&WLV031)   VALUE(%SST(*LDA 523 8))
             CHGVAR     VAR(&WLV032)   VALUE(%SST(*LDA 531 8))
             CHGVAR     VAR(&DOPT)     VALUE(%SST(*LDA 543 1))
             CHGVAR     VAR(&DOPT1)    VALUE(%SST(*LDA 544 1))
             CHGVAR     VAR(&DOPT2)    VALUE(%SST(*LDA 545 1))

             OVRDBF     FILE(PYLVJF01) SHARE(*YES)
             OPNQRYF    FILE((PYLVJF01)) QRYSLT('LV01 *EQ "' *CAT +
                          &DLV01 *CAT '" & CEM04 *EQ %RANGE("' *CAT +
                          &DEM041 *CAT '" "' *CAT &DEM042 *CAT '") +
                          & LV03C *EQ %RANGE("' *CAT &WLV031 *CAT +
                          '" "' *CAT &WLV032 *CAT '") & LV04 *EQ +
                          %RANGE("' *CAT &DOPT1 *CAT '" "' *CAT +
                          &DOPT2 *CAT '")  ') KEYFLD((EM041) +
                          (EM042) (EM043) (EM044) (LV02)) +
                          MAPFLD((LV03C LV03 *CHAR 8) (CEM04 'EM041 +
                          *CAT EM042 *CAT EM043 *CAT EM044'))

             OVRPRTF    FILE(PYR204P) PAGESIZE(*N 158) CPI(12)
             CALL       PYR2042
             CLOF       OPNID(PYLVJF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR204P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
