     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYR2112C                                  */
     /*    PROGRAM NAME :刷卡資料異常報表                         */
     /*    AUTHOR       : A1184                                     */
     /*    CREATE DATE  : 85/03/06                                  */
     /*    UPDATE DATE  : 88/10/01 A1274 EVA                        */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DT602)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM04F)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM04T)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DT603F)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DT603T)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DT601F)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DT601T)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&WT601F)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WT601T)   TYPE(*CHAR) LEN(8)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DT602)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM04F)   VALUE(%SST(*LDA 560 7))
             CHGVAR     VAR(&DEM04T)   VALUE(%SST(*LDA 567 7))
             CHGVAR     VAR(&DT603F)   VALUE(%SST(*LDA 513 8))
             CHGVAR     VAR(&DT603T)   VALUE(%SST(*LDA 521 8))
             CHGVAR     VAR(&DT601F)   VALUE(%SST(*LDA 600 7))
             CHGVAR     VAR(&DT601T)   VALUE(%SST(*LDA 607 7))
             CHGVAR     VAR(&WT601F)   VALUE(%SST(*LDA 543 8))
             CHGVAR     VAR(&WT601T)   VALUE(%SST(*LDA 551 8))

             OVRDBF     FILE(PYT6JF01) SHARE(*YES)
             OPNQRYF    FILE((PYT6JF01)) QRYSLT(' T602 *EQ "' *CAT +
                          &DT602 *CAT '" & CEM04 *EQ %RANGE("' *CAT +
                          &DEM04F *CAT '" "' *CAT &DEM04T *CAT '") +
                          & T603 *EQ %RANGE("' *CAT &DT603F *CAT +
                          '" "' *CAT &DT603T *CAT '") & CT601 *EQ +
                          %RANGE("' *CAT &WT601F *CAT '" "' *CAT +
                          &WT601T *CAT '") ') +
                          KEYFLD((EM041) (EM042) (EM043) (EM044) +
                          (T603) (T601)) MAPFLD((CT601 T601 *CHAR +
                          8) (CEM04 'EM041 *CAT EM042 *CAT EM043 +
                          *CAT EM044'))

             CALL       PYR2112
             CLOF       OPNID(PYT6JF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR211P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
