             PGM
             DCL        VAR(&DT201)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&WT2031)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&WT2032)   TYPE(*CHAR) LEN(7)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DT201)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 560 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 567 7))
             CHGVAR     VAR(&WT2031)   VALUE(%SST(*LDA 513 6))
             CHGVAR     VAR(&WT2032)   VALUE(%SST(*LDA 519 6))

             OVRDBF     FILE(PYT2JF03) SHARE(*YES)
             OPNQRYF    FILE((PYT2JF03)) QRYSLT('T201 *EQ "' *CAT +
                          &DT201 *CAT '" & CEM04 *EQ %RANGE("' *CAT +
                          &DEM041 *CAT '" "' *CAT &DEM042 *CAT '") +
                          & T203C *EQ %RANGE("' *CAT &WT2031 *CAT +
                          '" "' *CAT &WT2032 *CAT '")') +
                          KEYFLD((EM041) (EM042) (EM043) (EM044) +
                          (EM02) (T203)) MAPFLD((T203C T203 *CHAR +
                          6) (CEM04 'EM041 *CAT EM042 *CAT EM043 +
                          *CAT EM044'))

             CALL       PYR2062
             CLOF       OPNID(PYT2JF03)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR206P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
