             PGM
             DCL        VAR(&DOV01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DOV021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DOV022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DOV031)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DOV032)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&WOV031)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WOV032)   TYPE(*CHAR) LEN(8)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DOV01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 503 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 510 7))
             CHGVAR     VAR(&DOV031)   VALUE(%SST(*LDA 600 6))
             CHGVAR     VAR(&DOV032)   VALUE(%SST(*LDA 607 6))
             CHGVAR     VAR(&DOV021)   VALUE(%SST(*LDA 537 8))
             CHGVAR     VAR(&DOV022)   VALUE(%SST(*LDA 545 8))
             CHGVAR     VAR(&WOV031)   VALUE(%SST(*LDA 553 8))
             CHGVAR     VAR(&WOV032)   VALUE(%SST(*LDA 561 8))

             OVRDBF     FILE(PYOVJF02) SHARE(*YES)
             OPNQRYF    FILE((PYOVJF02)) QRYSLT('OV01 *EQ "' *CAT +
                          &DOV01 *CAT '" & CEM04 *EQ %RANGE("' *CAT +
                          &DEM041 *CAT '" "' *CAT &DEM042 *CAT +
                          '") & OV02 *EQ %RANGE("' *CAT &DOV021 +
                          *CAT '" "' *CAT &DOV022 *CAT '") & +
                          OV03C *EQ %RANGE("' *CAT &WOV031 *CAT '" +
                          "' *CAT &WOV032 *CAT '")') +
                          KEYFLD((EM041) (EM042) (EM043) (EM044) +
                                 (OV02) (OV03)) +
                          MAPFLD((OV03C OV03 *CHAR 8) +
                          (CEM04 'EM041 *CAT EM042 *CAT EM043 *CAT +
                          EM044'))

             OVRPRTF    FILE(PYR201P) PAGESIZE(*N 158) CPI(12)
             CALL       PYR2012
             CLOF       OPNID(PYOVJF02)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR201P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
