             PGM
             DCL        VAR(&DOV01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(5)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(5)
             DCL        VAR(&DOV021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DOV022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DOV031)   TYPE(*CHAR) LEN(4)
             DCL        VAR(&DOV032)   TYPE(*CHAR) LEN(4)
             DCL        VAR(&WOV031)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&WOV032)   TYPE(*CHAR) LEN(6)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DOV01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 609 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 616 7))
             CHGVAR     VAR(&DOV021)   VALUE(%SST(*LDA 513 8))
             CHGVAR     VAR(&DOV022)   VALUE(%SST(*LDA 521 8))
             CHGVAR     VAR(&DOV031)   VALUE(%SST(*LDA 529 4))
             CHGVAR     VAR(&DOV032)   VALUE(%SST(*LDA 533 4))
             CHGVAR     VAR(&WOV031)   VALUE(%SST(*LDA 537 6))
             CHGVAR     VAR(&WOV032)   VALUE(%SST(*LDA 543 6))

             OVRDBF     FILE(PYR222WF) SHARE(*YES)
             OPNQRYF    FILE((PYR222WF)) +
                          KEYFLD((W2201) (W2206) (W2202) +
                          (W2204))

             OVRPRTF    FILE(PYR222P) PAGESIZE(*N 198) CPI(10)
             CALL       PYR2223
             CLOF       OPNID(PYR222WF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR222P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
