     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : PYR3151C                                  */
     /*    PROGRAM NAME :薪資加班請假記錄表列印                   */
     /*    AUTHOR       : A1226 PETER                               */
     /*    CREATE DATE  : 85/12/14                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       : 人事薪資系統                            */
     /***************************************************************/
             PGM

             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM021)   TYPE(*CHAR) LEN(5)
             DCL        VAR(&DEM022)   TYPE(*CHAR) LEN(5)
             DCL        VAR(&DOV96)    TYPE(*CHAR) LEN(5)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 623 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 630 7))
             CHGVAR     VAR(&DEM021)   VALUE(%SST(*LDA 513 5))
             CHGVAR     VAR(&DEM022)   VALUE(%SST(*LDA 518 5))
             CHGVAR     VAR(&DOV96)    VALUE(%SST(*LDA 601 5))

             OVRDBF     FILE(PYEMPF) SHARE(*YES)
             OPNQRYF    FILE((PYEMPF)) QRYSLT('EM01 *EQ "' *CAT +
                          &DEM01 *CAT '" & CEM04 *EQ %RANGE("' *CAT +
                          &DEM041 *CAT '" "' *CAT &DEM042 *CAT '") +
                          & EM02 *EQ %RANGE("' *CAT &DEM021 *CAT '" +
                          "' *CAT &DEM022 *CAT '")') KEYFLD((EM041) +
                          (EM042) (EM043) (EM044) (EM02)) +
                          MAPFLD((CEM04 'EM041 *CAT EM042 *CAT +
                          EM043 *CAT EM044'))

             OVRPRTF    FILE(PYR315P) PAGESIZE(*N 198) CPI(15)
             CALL       PYR3152
             CLOF       OPNID(PYEMPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR315P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
