     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     /*                                                              */
     /*    PROGRAM-ID   : PYA3201C                                   */
     /*    PROGRAM NAME :薪資所得扣繳稅額繳款書                    */
     /*    AUTHOR       : A1226 PETER                                */
     /*    CREATE DATE  : 86/01/20                                   */
     /*    UPDATE DATE  : 89/04/06 A1274 EVA                         */
     /*    SYSTEM       :人事薪資系統                              */
     /****************************************************************/
             PGM

             DCL        VAR(&DPH01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DYM)      TYPE(*CHAR) LEN(5)
             DCL        VAR(&WYM)      TYPE(*CHAR) LEN(6)
             DCL        VAR(&DPH021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DPH022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DSEL)     TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DPH01)   VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DYM)     VALUE(%SST(*LDA 541 5))
             CHGVAR     VAR(&WYM)     VALUE(%SST(*LDA 509 6))
             CHGVAR     VAR(&DPH021)  VALUE(%SST(*LDA 520 8))
             CHGVAR     VAR(&DPH022)  VALUE(%SST(*LDA 528 8))
             CHGVAR     VAR(&DSEL)    VALUE(%SST(*LDA 550 1))

             OVRDBF     FILE(PYTBPF) SHARE(*YES)
             OPNQRYF    FILE((PYTBPF)) QRYSLT(' +
                          TB11 *EQ "' *CAT &DPH01 *CAT '" +
                        & CTB15 *EQ "' *CAT &WYM *CAT '" +
                        & TB12 *EQ %RANGE("' *CAT &DPH021 *CAT '" +
                                          "' *CAT &DPH022 *CAT '")') +
                        KEYFLD((TB11) (TB04) (TB12)) +
                        MAPFLD((ZTB15 TB15 *ZONED 6) +
                               (CTB15 ZTB15 *CHAR 6))

             CALL       PYR3203
             CALL       PYR3203C
             CLOF       OPNID(PYTBPF)

             ENDPGM
