     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     /*                                                              */
     /*    PROGRAM-ID   : PYA3181C                                   */
     /*    PROGRAM NAME :薪資請假明細表列印                        */
     /*    AUTHOR       : A1226 PETER                                */
     /*    CREATE DATE  : 86/01/20                                   */
     /*    UPDATE DATE  : 88/10/04 A1274 EVA                         */
     /*    SYSTEM       :人事薪資系統                              */
     /****************************************************************/
             PGM
             DCL        VAR(&DLV01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DLV021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DLV022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DLV96)    TYPE(*CHAR) LEN(5)
             DCL        VAR(&WLV96)    TYPE(*CHAR) LEN(6)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DLV01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 603 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 610 7))
             CHGVAR     VAR(&DLV021)   VALUE(%SST(*LDA 531 8))
             CHGVAR     VAR(&DLV022)   VALUE(%SST(*LDA 539 8))
             CHGVAR     VAR(&DLV96)    VALUE(%SST(*LDA 523 5))
             CHGVAR     VAR(&WLV96)    VALUE(%SST(*LDA 547 6))

             OVRDBF     FILE(PYLVJF01) SHARE(*YES)
             OPNQRYF    FILE((PYLVJF01)) QRYSLT('LV01 *EQ "' *CAT +
                          &DLV01 *CAT '" & CEM04 *EQ %RANGE("' *CAT +
                          &DEM041 *CAT '" "' *CAT &DEM042 *CAT +
                          '") & LV02 *EQ %RANGE("' *CAT &DLV021 +
                          *CAT '" "' *CAT &DLV022 *CAT '") & +
                          LV96C *EQ "' *CAT &WLV96  *CAT '" +
                                                  ') +
                          KEYFLD((EM041) (EM042) (EM043) (EM044) +
                                 (LV02) (LV03)) +
                          MAPFLD((LV96C LV96 *CHAR 6) +
                          (CEM04 'EM041 *CAT EM042 *CAT EM043 *CAT +
                          EM044'))

             OVRPRTF    FILE(PYR318P) PAGESIZE(*N 198) CPI(15)
             CALL       PYR3182
             CLOF       OPNID(PYLVJF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR318P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
