             PGM
             DCL        VAR(&DOPT)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&SPT01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&EPT01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WPT03)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&WPT04)    TYPE(*CHAR) LEN(6)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&SPT01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&EPT01)    VALUE(%SST(*LDA 503 2))
             CHGVAR     VAR(&DOPT)     VALUE(%SST(*LDA 509 1))
             CHGVAR     VAR(&WPT03)    VALUE(%SST(*LDA 510 6))
             CHGVAR     VAR(&WPT04)    VALUE(%SST(*LDA 520 6))

             OVRPRTF    FILE(PYR328P) PAGESIZE(*N 158) CPI(13.3)

             IF         COND(&DOPT *EQ '1') THEN(DO)
             OVRDBF     FILE(PYPTPF)   SHARE(*YES)
             OPNQRYF    FILE((PYPTPF)) QRYSLT(' +
                          PT01 =  %RANGE("' || &SPT01 ||'"          +
                                         "' || &EPT01 ||'")         +
                        & CPT03 = "' || &WPT03 || '" ')             +
                        MAPFLD((CPT03 PT03 *CHAR 6))
             ENDDO

             IF         COND(&DOPT *EQ '2') THEN(DO)
             OVRDBF     FILE(PYPTPF)   SHARE(*YES)
             OPNQRYF    FILE((PYPTPF)) QRYSLT(' +
                          PT01 =  %RANGE("' || &SPT01 ||'"          +
                                         "' || &EPT01 ||'")         +
                        & CPT04 = "' || &WPT04 || '" ')             +
                        MAPFLD((CPT04 PT04 *CHAR 6))
             ENDDO

             CALL       PYR3282
             CLOF       OPNID(PYPTPF)
             DLTOVR     FILE(PYPTPF)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR328P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
