             PGM
             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DEM022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WDYM)     TYPE(*CHAR) LEN(6)
             DCL        VAR(&DOP)      TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&DPW04)    TYPE(*CHAR) LEN(1)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 603 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 610 7))
             CHGVAR     VAR(&DEM021)   VALUE(%SST(*LDA 531 8))
             CHGVAR     VAR(&DEM022)   VALUE(%SST(*LDA 539 8))
             CHGVAR     VAR(&WDYM)     VALUE(%SST(*LDA 547 6))
             CHGVAR     VAR(&DOP)      VALUE(%SST(*LDA 527 1))
             CHGVAR     VAR(&DPW04)    VALUE(%SST(*LDA 528 1))
             CHGVAR     VAR(&DSEL)     VALUE(%SST(*LDA 560 1))

             OVRPRTF    FILE(PYR319P) PAGESIZE(*N 198) CPI(15) +
                          OVRFLW(59)

  /* ¸Õºâ¡D¦©µ| */
             IF         COND(&DOP *EQ '1' & &DSEL *EQ '1') THEN(DO)
             OVRDBF     FILE(PYR319WF) SHARE(*YES)
             OPNQRYF    FILE((PYR319WF)) QRYSLT(' +
                          W3191 *EQ "' *CAT &DEM01 *CAT '" +
                          & CEM04 *EQ %RANGE("' *CAT &DEM041 *CAT '" +
                                             "' *CAT &DEM042 *CAT '") +
                          & W3192 *EQ %RANGE("' *CAT &DEM021 *CAT '" +
                                             "' *CAT &DEM022 *CAT '") +
                          & (C3193 *EQ "' *CAT &WDYM *CAT '") +
                          & W3199 *EQ "Y" +
                          & W3194 *EQ "' *CAT &DPW04 *CAT '" ') +
                          KEYFLD((W3191) (W319A) +
                          (W319B) (W319C) (W319D) (W3192) (W3193)) +
                          MAPFLD((CEM04 'W319A *CAT W319B *CAT +
                          W319C *CAT W319D') (C3193 W3193 *CHAR 6))
             CALL       PYR31921
             CLOF       OPNID(PYR319WF)
             ENDDO

  /* ¸Õºâ¡D¤£¦©µ| */
             IF         COND(&DOP *EQ '1' & &DSEL *EQ '2') THEN(DO)
             OVRDBF     FILE(PYR319WF) SHARE(*YES)
             OPNQRYF    FILE((PYR319WF)) QRYSLT(' +
                          W3191 *EQ "' *CAT &DEM01 *CAT '" +
                          & CEM04 *EQ %RANGE("' *CAT &DEM041 *CAT '" +
                                             "' *CAT &DEM042 *CAT '") +
                          & W3192 *EQ %RANGE("' *CAT &DEM021 *CAT '" +
                                             "' *CAT &DEM022 *CAT '") +
                          & (C3193 *EQ "' *CAT &WDYM *CAT '") +
                          & W3199 *EQ "N" +
                          & W3194 *EQ "' *CAT &DPW04 *CAT '" ') +
                          KEYFLD((W3191) (W319A) +
                          (W319B) (W319C) (W319D) (W3192) (W3193)) +
                          MAPFLD((CEM04 'W319A *CAT W319B *CAT +
                          W319C *CAT W319D') (C3193 W3193 *CHAR 6))
             CALL       PYR31921
             CLOF       OPNID(PYR319WF)
             ENDDO


  /* ½T»{¡D¦©µ| */
             IF         COND(&DOP *EQ '2' & &DSEL *EQ '1') THEN(DO)
             OVRDBF     FILE(PYR319WF) SHARE(*YES)
             OPNQRYF    FILE((PYR319WF)) QRYSLT(' +
                          W3191 *EQ "' *CAT &DEM01 *CAT '" +
                          & CEM04 *EQ %RANGE("' *CAT &DEM041 *CAT '" +
                                             "' *CAT &DEM042 *CAT '") +
                          & W3192 *EQ %RANGE("' *CAT &DEM021 *CAT '" +
                                             "' *CAT &DEM022 *CAT '") +
                          & (C3193 *EQ "' *CAT &WDYM *CAT '") +
                          & W3199 *EQ "Y" +
                          & W3194 *EQ "' *CAT &DPW04 *CAT '" ') +
                          KEYFLD((W3191) (W319A) +
                          (W319B) (W319C) (W319D) (W3192) (W3193)) +
                          MAPFLD((CEM04 'W319A *CAT W319B *CAT +
                          W319C *CAT W319D') (C3193 W3193 *CHAR 6))
             CALL       PYR31922
             CLOF       OPNID(PYR319WF)
             ENDDO

  /* ½T»{¡D¤£¦©µ| */
             IF         COND(&DOP *EQ '2' & &DSEL *EQ '2') THEN(DO)
             OVRDBF     FILE(PYR319WF) SHARE(*YES)
             OPNQRYF    FILE((PYR319WF)) QRYSLT(' +
                          W3191 *EQ "' *CAT &DEM01 *CAT '" +
                          & CEM04 *EQ %RANGE("' *CAT &DEM041 *CAT '" +
                                             "' *CAT &DEM042 *CAT '") +
                          & W3192 *EQ %RANGE("' *CAT &DEM021 *CAT '" +
                                             "' *CAT &DEM022 *CAT '") +
                          & (C3193 *EQ "' *CAT &WDYM *CAT '") +
                          & W3199 *EQ "N" +
                          & W3194 *EQ "' *CAT &DPW04 *CAT '" ') +
                          KEYFLD((W3191) (W319A) +
                          (W319B) (W319C) (W319D) (W3192) (W3193)) +
                          MAPFLD((CEM04 'W319A *CAT W319B *CAT +
                          W319C *CAT W319D') (C3193 W3193 *CHAR 6))
             CALL       PYR31922
             CLOF       OPNID(PYR319WF)
             ENDDO


             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR319P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
