     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : PYR3150C                                  */
     /*    PROGRAM NAME :薪資加班請假記錄表列印                   */
     /*    AUTHOR       : A1226 PETER                               */
     /*    CREATE DATE  : 85/12/14                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       : 人事薪資系統                            */
     /***************************************************************/
             PGM

      /*  CHECK SCREEN */
             DCL        VAR(&$PENV)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN10)   TYPE(*LGL)  LEN(1)

             CHGVAR     VAR(%SST(*LDA 125 3)) VALUE('001')
             CHGVAR     VAR(%SST(*LDA 217 2)) VALUE('00')
             CHGVAR     VAR(%SST(*LDA 219 1)) VALUE('0')

 START:      CALL       PGM(PYR3151) PARM(&IN03 &IN10)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 501 100)) VALUE(' ')
             RETURN
             ENDDO

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             IF         COND(&$PENV *EQ '2') THEN(DO)
                        SBMJOB    JOB(PYR3151C) RQSDTA('CALL PYR3151C')
                        ENDDO
             ELSE       CMD(DO)
                        CALL       PGM(PYR3151C)
                        ENDDO

             GOTO       START

             ENDPGM
