             PGM
             DCL        VAR(&DSH01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DSH021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DSH022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WSH031)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WSH032)   TYPE(*CHAR) LEN(8)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DSH01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 623 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 630 7))
             CHGVAR     VAR(&DSH021)   VALUE(%SST(*LDA 513 8))
             CHGVAR     VAR(&DSH022)   VALUE(%SST(*LDA 521 8))
             CHGVAR     VAR(&WSH031)   VALUE(%SST(*LDA 541 8))
             CHGVAR     VAR(&WSH032)   VALUE(%SST(*LDA 549 8))

             OVRDBF     FILE(PYSHJF02) SHARE(*YES)
             OPNQRYF    FILE((PYSHJF02)) QRYSLT('SH01 *EQ "' *CAT +
                          &DSH01 *CAT '" & CEM04 *EQ %RANGE("' *CAT +
                          &DEM041 *CAT '" "' *CAT &DEM042 *CAT '") +
                          & SH02 *EQ %RANGE("' *CAT &DSH021 *CAT '" +
                          "' *CAT &DSH022 *CAT '") *AND CSH03 *EQ +
                          %RANGE("' *CAT &WSH031 *CAT '" "' *CAT +
                          &WSH032 *CAT '") ') +
                          KEYFLD((SH01) (EM041) (EM042) (EM043) +
                          (EM044) (EM05) (SH02)) MAPFLD((CEM04 +
                          'EM041 *CAT EM042 *CAT EM043 *CAT EM044') +
                          (CSH03 SH03 *CHAR 8))
          /*              &WSH032 *CAT '") *AND SH06 *EQ 0 ') +   */

             OVRPRTF    FILE(PYR303P) PAGESIZE(*N 198) CPI(15)
             CALL       PYR3032
             CLOF       OPNID(PYSHJF02)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR303P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
