             PGM
             DCL        VAR(&SEN01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&EEN01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&SEN02)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&EEN02)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&DYY)      TYPE(*CHAR) LEN(4)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&SEN01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&EEN01)    VALUE(%SST(*LDA 503 2))
             CHGVAR     VAR(&SEN02)    VALUE(%SST(*LDA 505 10))
             CHGVAR     VAR(&EEN02)    VALUE(%SST(*LDA 515 10))
             CHGVAR     VAR(&DYY)      VALUE(%SST(*LDA 525 4))

             OVRPRTF    FILE(PYR330P) PAGESIZE(*N 132) CPI(15) +
                         USRDTA('¤uÅªÁ~¸ê')
             OVRDBF     FILE(PYPTPF)   SHARE(*YES)
             OPNQRYF    FILE((PYPTPF)) QRYSLT('                  +
                          PT01 = %RANGE("' || &SEN01 || '"       +
                                        "' || &EEN01 || '"  )    +
                        & PT02 = %RANGE("' || &SEN02 || '"       +
                                        "' || &EEN02 || '"  )    +
                        & CPT04C = "' || &DYY || '"              +
                                                            ')   +
                        KEYFLD((PT01) (PT02) (PT04))             +
                        MAPFLD((CPT04 PT04 *CHAR 6)              +
                               (CPT04C '%SST(CPT04 1 4)' ) )

             CALL       PYR3302
             CLOF       OPNID(PYPTPF)
             DLTOVR     FILE(PYPTPF)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR330P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
