     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     /*                                                              */
     /*    PROGRAM-ID   : PYR3211C                                   */
     /*    PROGRAM NAME :薪資所得扣繳稅額繳款書                    */
     /*    AUTHOR       : A1274 EVA                                  */
     /*    CREATE DATE  : 90/04/12                                   */
     /*    UPDATE DATE  :                                            */
     /*    SYSTEM       :人事薪資系統                              */
     /****************************************************************/
             PGM

             DCL        VAR(&DPH01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DYM)      TYPE(*CHAR) LEN(5)
             DCL        VAR(&WYM)      TYPE(*CHAR) LEN(6)
             DCL        VAR(&DPH021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DPH022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DSEL)     TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DPH01)   VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DYM)     VALUE(%SST(*LDA 541 5))
             CHGVAR     VAR(&WYM)     VALUE(%SST(*LDA 509 6))
             CHGVAR     VAR(&DPH021)  VALUE(%SST(*LDA 520 8))
             CHGVAR     VAR(&DPH022)  VALUE(%SST(*LDA 528 8))
             CHGVAR     VAR(&DSEL)    VALUE(%SST(*LDA 550 1))

 /* 清理WORK FILE 資料*/
             CLRPFM     FILE(PYR321WF)

             OVRDBF     FILE(PYEMPF) SHARE(*YES)
             OPNQRYF    FILE((PYEMPF)) QRYSLT(' +
                          EM01 *EQ "' *CAT &DPH01 *CAT '" +
                        & EM105 *EQ "' *CAT &DSEL *CAT '" +
                        & EM02 *EQ %RANGE("' *CAT &DPH021 *CAT '" +
                                          "' *CAT &DPH022 *CAT '")') +
                        KEYFLD((EM01) (EM130) (EM02))

             CALL       PYR3212
             CALL       PYR3212C
             CLOF       OPNID(PYEMPF)

             ENDPGM
