     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    */
     /*                                                              */
     /*    PROGRAM-ID   : PYA3171C                                   */
     /*    PROGRAM NAME :薪資加班明細表列印                        */
     /*    AUTHOR       : A1226 PETER                                */
     /*    CREATE DATE  : 97/01/20                                   */
     /*    UPDATE DATE  :                                            */
     /*    SYSTEM       :人事薪資系統                              */
     /****************************************************************/
             PGM
             DCL        VAR(&DOV01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DOV021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DOV022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WOV96)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DOV96)   TYPE(*CHAR) LEN(5)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DOV01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 603 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 610 7))
             CHGVAR     VAR(&DOV021)   VALUE(%SST(*LDA 513 8))
             CHGVAR     VAR(&DOV022)   VALUE(%SST(*LDA 521 8))
             CHGVAR     VAR(&WOV96)    VALUE(%SST(*LDA 533 6))
             CHGVAR     VAR(&DOV96)    VALUE(%SST(*LDA 629 5))

             OVRDBF     FILE(PYOVJF01) SHARE(*YES)
             OPNQRYF    FILE((PYOVJF01)) QRYSLT('OV01 *EQ "' *CAT +
                          &DOV01 *CAT '" & CEM04 *EQ %RANGE("' *CAT +
                          &DEM041 *CAT '" "' *CAT &DEM042 *CAT '") +
                          & OV02 *EQ %RANGE("' *CAT &DOV021 *CAT '" +
                          "' *CAT &DOV022 *CAT '") & OV96C *EQ "' +
                          *CAT &WOV96 *CAT '" ') KEYFLD((EM041) +
                          (EM042) (EM043) (EM044) (OV02) (OV03)) +
                          MAPFLD((OV96C OV96 *CHAR 6) (CEM04 'EM041 +
                          *CAT EM042 *CAT EM043 *CAT EM044'))

             OVRPRTF    FILE(PYR317P) PAGESIZE(*N 158) CPI(12)
             CALL       PYR3172
             CLOF       OPNID(PYOVJF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR317P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
