             PGM

             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DEM022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DYYMM)    TYPE(*CHAR) LEN(5)
             DCL        VAR(&DEM01T)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&WYYMM)    TYPE(*CHAR) LEN(6)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 623 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 630 7))
             CHGVAR     VAR(&DEM021)   VALUE(%SST(*LDA 531 8))
             CHGVAR     VAR(&DEM022)   VALUE(%SST(*LDA 539 8))
             CHGVAR     VAR(&DYYMM)    VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DEM01T)   VALUE(%SST(*LDA 527 2))
             CHGVAR     VAR(&WYYMM)    VALUE(%SST(*LDA 547 6))

             OVRDBF     FILE(PYWHJF01) SHARE(*YES)
             OPNQRYF    FILE((PYWHJF01)) QRYSLT('WH01 *EQ +
                          "' *CAT &DEM01 *CAT '" +
                          & CWH03 *EQ "' *CAT &WYYMM *CAT '" & +
                          CEM04 *EQ %RANGE("' *CAT &DEM041 *CAT '" +
                          "' *CAT &DEM042 *CAT '") & WH02 *EQ +
                          %RANGE("' *CAT &DEM021 *CAT '" "' *CAT +
                          &DEM022 *CAT '")') KEYFLD((WH01) (WH03) +
                          (EM041) (EM042) (EM043) (EM044) (WH02)) +
                          MAPFLD((CEM04 'EM041 *CAT EM042 *CAT +
                          EM043 *CAT EM044') (CWH03 WH03 *CHAR 6))

             OVRPRTF    FILE(PYR305P) PAGESIZE(*N 158) CPI(12)

             CALL       PYR3052
             CLOF       OPNID(PYWHJF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR305P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
