     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     /*                                                              */
     /*    PROGRAM-ID   : PYR3061C                                   */
     /*    PROGRAM NAME :其他薪資資料明細表　　                    */
     /*    AUTHOR       :                                            */
     /*    CREATE DATE  :                                            */
     /*    UPDATE DATE  : 90/04/13 A1274 EVA                         */
     /*    SYSTEM       :人事薪資系統                              */
     /****************************************************************/
             PGM
             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DEM022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DYYMM)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&DOS04)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&DYYMMW)   TYPE(*CHAR) LEN(6)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 623 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 630 7))
             CHGVAR     VAR(&DEM021)   VALUE(%SST(*LDA 513 8))
             CHGVAR     VAR(&DEM022)   VALUE(%SST(*LDA 521 8))
             CHGVAR     VAR(&DYYMM)    VALUE(%SST(*LDA 601 4))
             CHGVAR     VAR(&DOS04)    VALUE(%SST(*LDA 535 1))
             CHGVAR     VAR(&DYYMMW)   VALUE(%SST(*LDA 536 6))

             OVRDBF     FILE(PYOSJF01) SHARE(*YES)
             OPNQRYF    FILE((PYOSJF01)) QRYSLT('OS01 *EQ "' *CAT +
                          &DEM01 *CAT '" & COS03 *EQ "' *CAT &DYYMMW +
                          *CAT '" & CEM04 *EQ %RANGE("' *CAT +
                          &DEM041 *CAT '" "' *CAT &DEM042 *CAT '") +
                          & OS02 *EQ %RANGE("' *CAT &DEM021 *CAT '" +
                          "' *CAT &DEM022 *CAT '") & OS04 *EQ "' +
                          *CAT &DOS04 *CAT '" ') KEYFLD((OS01) +
                          (OS03) (EM041) (EM042) (EM043) (EM044) +
                          (OS02)) MAPFLD((CEM04 'EM041 *CAT EM042 +
                          *CAT EM043 *CAT EM044') (COS03 OS03 *CHAR 6))

             OVRPRTF    FILE(PYR306P) PAGESIZE(*N 158) CPI(12)
             CALL       PYR3062
             CLOF       OPNID(PYOSJF01)
             DLTOVR     FILE(*ALL)
             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR306P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
