     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     /*                                                              */
     /*    PROGRAM-ID   : PYR3191C                                   */
     /*    PROGRAM NAME :薪資彙總表－扣稅／不扣稅　　　            */
     /*    AUTHOR       : A1274 EVA                                  */
     /*    CREATE DATE  : 90/02/06                                   */
     /*    UPDATE DATE  :                                            */
     /*    SYSTEM       :音樂講師管理系統                          */
     /****************************************************************/
             PGM

             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DEM022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WDYM)     TYPE(*CHAR) LEN(6)
             DCL        VAR(&DOP)      TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&DPW04)    TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 603 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 610 7))
             CHGVAR     VAR(&DEM021)   VALUE(%SST(*LDA 531 8))
             CHGVAR     VAR(&DEM022)   VALUE(%SST(*LDA 539 8))
             CHGVAR     VAR(&WDYM)     VALUE(%SST(*LDA 547 6))
             CHGVAR     VAR(&DOP)      VALUE(%SST(*LDA 527 1))
             CHGVAR     VAR(&DPW04)    VALUE(%SST(*LDA 528 1))
             CHGVAR     VAR(&DSEL)     VALUE(%SST(*LDA 560 1))

  /* 清除工作檔資料 */
             CLRPFM     FILE(PYR319WF)

             ENDPGM
