             PGM
             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DEM022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DYM)      TYPE(*CHAR) LEN(4)
             DCL        VAR(&DPH04)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&WDYM)     TYPE(*CHAR) LEN(6)
             DCL        VAR(&WDYMD)    TYPE(*CHAR) LEN(8)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 555 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 623 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 630 7))
             CHGVAR     VAR(&DEM021)   VALUE(%SST(*LDA 531 8))
             CHGVAR     VAR(&DEM022)   VALUE(%SST(*LDA 539 8))
             CHGVAR     VAR(&DYM)      VALUE(%SST(*LDA 522 4))
             CHGVAR     VAR(&WDYM)     VALUE(%SST(*LDA 547 6))
             CHGVAR     VAR(&WDYMD)    VALUE(%SST(*LDA 547 8))
             CHGVAR     VAR(&DPH04)    VALUE(%SST(*LDA 557 1))

             OVRPRTF    FILE(PYR308P) PAGESIZE(33) CPI(15) +
                          OVRFLW(32) USRDTA('Á~¸ê³æ')
             OVRDBF     FILE(PYEMPF)   SHARE(*YES)
             OPNQRYF    FILE((PYEMPF))   QRYSLT('                     +
                        EM01 *EQ "' *CAT &DEM01 *CAT '"               +
                      & CEM044 *EQ %RANGE( "' *CAT &DEM041 *CAT '"    +
                                           "' *CAT &DEM042 *CAT '" )  +
                      & EM02 *EQ %RANGE("' *CAT &DEM021 *CAT '"       +
                                        "' *CAT &DEM022 *CAT '")   ') +
                        KEYFLD((EM01) (EM041) (EM042) (EM043) (EM044) +
                          (EM02) ) MAPFLD((CEM044 'EM041 *CAT         +
                                         EM042 *CAT EM043 *CAT EM044'))
             CALL       PYR3082
             CLOF       OPNID(PYEMPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR308P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)
             ENDPGM
