             PGM
             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM561)   TYPE(*CHAR) LEN(5)
             DCL        VAR(&DEM562)   TYPE(*CHAR) LEN(5)
             DCL        VAR(&DEM021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DEM022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DYM)      TYPE(*CHAR) LEN(6)
    /*       DCL        VAR(&DOP)      TYPE(*CHAR) LEN(1)   */
             DCL        VAR(&DPW04)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&WDYM)     TYPE(*CHAR) LEN(5)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM561)   VALUE(%SST(*LDA 503 5))
             CHGVAR     VAR(&DEM562)   VALUE(%SST(*LDA 508 5))
             CHGVAR     VAR(&DEM021)   VALUE(%SST(*LDA 537 8))
             CHGVAR     VAR(&DEM022)   VALUE(%SST(*LDA 545 8))
             CHGVAR     VAR(&DYM)      VALUE(%SST(*LDA 529 6))
     /*      CHGVAR     VAR(&DOP)      VALUE(%SST(*LDA 527 1))  */
             CHGVAR     VAR(&DPW04)    VALUE(%SST(*LDA 528 1))
             CHGVAR     VAR(&WDYM)     VALUE(%SST(*LDA 601 5))
             OVRPRTF    FILE(PYR312P) PAGESIZE(*N 198) CPI(15) +
                          OVRFLW(59)

             OVRDBF     FILE(PYCHPF) SHARE(*YES)
             OPNQRYF    FILE((PYCHPF)) QRYSLT('CH01 *EQ "' *CAT +
                          &DEM01 *CAT '" & CCH06 *EQ %RANGE("' *CAT +
                          &DEM561 *CAT '" "' *CAT &DEM562 *CAT '") +
                          & CH02 *EQ %RANGE("' *CAT &DEM021 *CAT '" +
                          "' *CAT &DEM022 *CAT '") & (CCH03 *EQ "' +
                          *CAT &DYM *CAT '") & CH04 *EQ "' *CAT +
                          &DPW04 *CAT '" ') KEYFLD((CH01) (CH061) +
                          (CH062) (CH063) (CH02) (CH03)) +
                          MAPFLD((CCH06 'CH061 *CAT CH062 *CAT +
                          CH063') (CCH03 CH03 *CHAR 6))
             CALL       PYR3122
             CLOF       OPNID(PYCHPF)

             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR312P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)
             ENDPGM
