             PGM
             DCL        VAR(&DSH01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DDPCB)    TYPE(*CHAR) LEN(5)
             DCL        VAR(&DDPCE)    TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSH02B)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DSH02E)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WSH03B)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WSH03E)   TYPE(*CHAR) LEN(8)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DSH01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DDPCB)    VALUE(%SST(*LDA 503 5))
             CHGVAR     VAR(&DDPCE)    VALUE(%SST(*LDA 508 5))
             CHGVAR     VAR(&DSH02B)   VALUE(%SST(*LDA 513 8))
             CHGVAR     VAR(&DSH02E)   VALUE(%SST(*LDA 521 8))
             CHGVAR     VAR(&WSH03B)   VALUE(%SST(*LDA 541 8))
             CHGVAR     VAR(&WSH03E)   VALUE(%SST(*LDA 549 8))

             OVRDBF     FILE(PYSHJF02) SHARE(*YES)
             OPNQRYF    FILE((PYSHJF02)) QRYSLT('SH01 *EQ "' *CAT +
                          &DSH01 *CAT '" & CEM04 *EQ %RANGE("' *CAT +
                          &DDPCB *CAT '" "' *CAT &DDPCE *CAT '") & +
                          SH02 *EQ %RANGE("' *CAT &DSH02B *CAT '" +
                          "' *CAT &DSH02E *CAT '") *AND CSH03 *EQ +
                          %RANGE("' *CAT &WSH03B *CAT '" "' *CAT +
                &WSH03E *CAT '") ') KEYFLD((SH01) (EM32 *DESCEND) +
                          (EM05) (EM041) (EM042) (EM043) (EM044) +
                          (SH02) (SH03)) MAPFLD((CEM04 'EM041 *CAT +
                          EM042 *CAT EM043 *CAT EM044') (CSH03 SH03 +
                          *CHAR 8))

             OVRPRTF    FILE(PYR343P) PAGESIZE(*N 198) CPI(15)
             CALL       PYR3432
             CLOF       OPNID(PYSHJF02)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR343P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
