             PGM
             DCL        VAR(&DPB01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DPB051)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DPB052)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&WPB051)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WPB052)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DPB041)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DPB042)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DPB021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DPB022)   TYPE(*CHAR) LEN(8)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DPB01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DPB051)   VALUE(%SST(*LDA 601 7))
             CHGVAR     VAR(&DPB052)   VALUE(%SST(*LDA 608 7))
             CHGVAR     VAR(&WPB051)   VALUE(%SST(*LDA 541 8))
             CHGVAR     VAR(&WPB052)   VALUE(%SST(*LDA 549 8))
             CHGVAR     VAR(&DPB041)   VALUE(%SST(*LDA 517 2))
             CHGVAR     VAR(&DPB042)   VALUE(%SST(*LDA 519 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 601 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 608 7))
             CHGVAR     VAR(&DPB021)   VALUE(%SST(*LDA 531 8))
             CHGVAR     VAR(&DPB022)   VALUE(%SST(*LDA 561 8))

   /*離職人員及獎金金額為零者不發放獎金*/

             OVRDBF     FILE(PYPBJF01) SHARE(*YES)
             OPNQRYF    FILE((PYPBJF01)) QRYSLT(' +
                          PB01 *EQ "' *CAT &DPB01 *CAT '" +
                       &  PB06 *NE 0 +
                       &  CPB05 *EQ %RANGE("' *CAT &WPB051 *CAT '" +
                                           "' *CAT &WPB052 *CAT '") +
                       &  PB04  *EQ %RANGE("' *CAT &DPB041 *CAT '" +
                                           "' *CAT &DPB042 *CAT '") +
                       &  CEM04 *EQ %RANGE("' *CAT &DEM041 *CAT '" +
                                           "' *CAT &DEM042 *CAT '") +
                       &  CPB02 *EQ %RANGE("' *CAT &DPB021 *CAT '" +
                                           "' *CAT &DPB022 *CAT '")') +
                          KEYFLD((PB04) (EM041) +
                                 (EM042) (EM043) (EM044) (PB02)) +
                          MAPFLD((CEM04 'EM041 *CAT EM042 *CAT +
                                         EM043 *CAT EM044') +
                                  (CPB02 PB02 *CHAR 8) +
                                  (PB05C1 PB05 *CHAR 6)  +
                                  (PB05C2 PB05D *CHAR 2) +
                                  (CPB05 'PB05C1 *CAT PB05C2'))

             OVRPRTF    FILE(PYR405P) PAGESIZE(*N 158) CPI(15)
             CALL       PYR4052
             CLOF       OPNID(PYPBJF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR405P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
