             PGM
             DCL        VAR(&DH201)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DH203)    TYPE(*CHAR) LEN(3)
             DCL        VAR(&WH203)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DH2021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DH2022)   TYPE(*CHAR) LEN(8)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DH201)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DH203)    VALUE(%SST(*LDA 503 3))
             CHGVAR     VAR(&WH203)    VALUE(%SST(*LDA 506 4))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 510 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 517 7))
             CHGVAR     VAR(&DH2021)   VALUE(%SST(*LDA 524 8))
             CHGVAR     VAR(&DH2022)   VALUE(%SST(*LDA 532 8))

             OVRDBF     FILE(PY2HJF01) SHARE(*YES)
             OPNQRYF    FILE((PY2HJF01)) QRYSLT(' H201 *EQ "' *CAT +
                          &DH201 *CAT '" & CH203 *EQ "' *CAT &WH203 +
                          *CAT '" & CEM04 *EQ %RANGE("' *CAT +
                          &DEM041 *CAT '" "' *CAT &DEM042 *CAT '") +
                          & H202 *EQ %RANGE("' *CAT &DH2021 *CAT +
                          '" "' *CAT &DH2022 *CAT '")') +
                          KEYFLD((H203) (EM041) (EM042) (EM043) +
                          (EM044) (H202)) MAPFLD((CEM04 'EM041 *CAT +
                          EM042 *CAT EM043 *CAT EM044') (CH203 H203 +
                          *CHAR 4))

             CALL       PYR4192
             CLOF       OPNID(PY2HJF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR419P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
