             PGM
             DCL        VAR(&DPY01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DPB03)    TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPB03)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&DPB05D)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DPB041)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DPB042)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DBN01)    TYPE(*CHAR) LEN(7)
             DCL        VAR(&DBN02)    TYPE(*CHAR) LEN(7)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DPY01)   VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DPB03)   VALUE(%SST(*LDA 503 3))
             CHGVAR     VAR(&WPB03)   VALUE(%SST(*LDA 531 4))
             CHGVAR     VAR(&DPB05D)  VALUE(%SST(*LDA 537 2))
             CHGVAR     VAR(&DPB041)  VALUE(%SST(*LDA 509 2))
             CHGVAR     VAR(&DPB042)  VALUE(%SST(*LDA 511 2))
             CHGVAR     VAR(&DBN01)   VALUE(%SST(*LDA 513 7))
             CHGVAR     VAR(&DBN02)   VALUE(%SST(*LDA 520 7))

             CPYF       FROMFILE(PYR310F) TOFILE(QTEMP/PYR310F) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/PYR310F))
             OVRDBF     FILE(PYR310F) TOFILE(QTEMP/PYR310F)

             OVRDBF     FILE(PYPBJF02) SHARE(*YES)
             OPNQRYF    FILE((PYPBJF02)) QRYSLT(' PB01 *EQ "' *CAT +
                          &DPY01 *CAT '" & CPB03 *EQ "' *CAT &WPB03 +
                          *CAT '" & PB04 *EQ %RANGE("' *CAT &DPB041 +
                          *CAT '" "' *CAT &DPB042 *CAT '")  & +
                          CBN012 *EQ %RANGE("' *CAT &DBN01 *CAT '" +
                          "' *CAT &DBN02 *CAT '")') KEYFLD((PY04) +
                          (PY05) (PY06) (PB02)) MAPFLD((CBN012 +
                          'PY04 *CAT PY05') (CPB03 PB03 *CHAR 4))

             CALL       PYR4042
             CLOF       OPNID(PYPBJF02)

             OVRDBF     FILE(PYR310F) TOFILE(QTEMP/PYR310F) SHARE(*YES)
             OPNQRYF    FILE((PYR310F)) QRYSLT(' CBN012 *EQ +
                          %RANGE("' *CAT &DBN01 *CAT '" "' *CAT +
                          &DBN02 *CAT '")') KEYFLD((R3103) (R3104) +
                          (R3105) (R3102)) MAPFLD((CBN012 'R3103 +
                          *CAT R3104 '))
             CALL       PYR4043
             CLOF       OPNID(PYR310F)

             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR404P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
