     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    */
     /*                                                              */
     /*    PROGRAM-ID   : PYR4072C                                   */
     /*    PROGRAM NAME :特別休假代金明細表                        */
     /*    AUTHOR       : A1326 SANTOS                               */
     /*    CREATE DATE  : 90/02/19                                   */
     /*    UPDATE DATE  :                                            */
     /*    SYSTEM       :                                          */
     /****************************************************************/
             PGM
             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM04S)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM04E)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM02S)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DEM02E)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DYEAR)    TYPE(*CHAR) LEN(3)
             DCL        VAR(&WYM  )    TYPE(*CHAR) LEN(6)
             DCL        VAR(&WYEAR)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&DSEL)     TYPE(*CHAR) LEN(1)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM04S)   VALUE(%SST(*LDA 606 7))
             CHGVAR     VAR(&DEM04E)   VALUE(%SST(*LDA 613 7))
             CHGVAR     VAR(&DEM02S)   VALUE(%SST(*LDA 521 8))
             CHGVAR     VAR(&DEM02E)   VALUE(%SST(*LDA 531 8))
             CHGVAR     VAR(&DSEL)     VALUE(%SST(*LDA 581 1))
             CHGVAR     VAR(&WYM  )    VALUE(%SST(*LDA 591 6))
             CHGVAR     VAR(&WYEAR)    VALUE(%SST(*LDA 597 4))

             OVRDBF     FILE(PY2HJF01) SHARE(*YES)

             IF         COND(&DSEL *EQ '1') THEN(DO)
             OPNQRYF    FILE((PY2HJF01)) QRYSLT('H201 +
                             *EQ "' *CAT &DEM01 *CAT '" +
                          & CEM04 *EQ %RANGE("' *CAT &DEM04S *CAT '" +
                                             "' *CAT &DEM04E *CAT '") +
                          & H202 *EQ %RANGE("' *CAT &DEM02S *CAT '" +
                                            "' *CAT &DEM02E *CAT '") +
                          & H203 *EQ ' *CAT &WYEAR *CAT ' +
                          & H207 *EQ ' *CAT &WYM *CAT ' ') +
                          KEYFLD((H201) (H202)) +
                          MAPFLD((CEM04 'EM041 *CAT EM042 *CAT +
                          EM043 *CAT EM044'))
             ENDDO

             IF         COND(&DSEL *EQ '2') THEN(DO)
             OPNQRYF    FILE((PY2HJF01)) QRYSLT('H201 +
                             *EQ "' *CAT &DEM01 *CAT '" +
                          & CEM04 *EQ %RANGE("' *CAT &DEM04S *CAT '" +
                                             "' *CAT &DEM04E *CAT '") +
                          & H202 *EQ %RANGE("' *CAT &DEM02S *CAT '" +
                                            "' *CAT &DEM02E *CAT '") +
                          & H203 *EQ ' *CAT &WYEAR *CAT ' +
                          & H207  *EQ ' *CAT &WYM *CAT ' ') +
                          KEYFLD((H201) (EM041) (EM042) +
                                 (EM043) (EM044) (H202)) +
                          MAPFLD((CEM04 'EM041 *CAT EM042 *CAT +
                          EM043 *CAT EM044'))
             ENDDO

             OVRPRTF    FILE(PYR407P) PAGESIZE(*N 158) CPI(12)
             CALL       PYR4072
             CLOF       OPNID(PY2HJF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR407P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
