             PGM
             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DEM022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DYEAR)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&DTYP)     TYPE(*CHAR) LEN(2)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM021)   VALUE(%SST(*LDA 520 8))
             CHGVAR     VAR(&DEM022)   VALUE(%SST(*LDA 530 8))
             CHGVAR     VAR(&DYEAR)    VALUE(%SST(*LDA 505 4))
             CHGVAR     VAR(&DTYP)     VALUE(%SST(*LDA 510 2))


             OVRDBF     FILE(PYBUJF01) SHARE(*YES)
             OPNQRYF    FILE((PYBUJF01)) QRYSLT(' +
                          BU01 *EQ "' *CAT &DEM01 *CAT '" +
                       &  CBU03 *EQ "' *CAT &DYEAR *CAT '" +
                       &  BU04 *EQ "' *CAT &DTYP *CAT '" +
                       &  BU02 *EQ %RANGE("' *CAT &DEM021 *CAT '" +
                                          "' *CAT &DEM022 *CAT '")') +
                          KEYFLD((BU01) (EM041) (EM042) (EM043) +
                          (EM044) (BU02)) +
                          MAPFLD((CBU03 BU03 *CHAR 4))

             OVRPRTF    FILE(PYR411P) PAGESIZE(*N 132) CPI(10)
             CALL       PGM(PYR4112)
             CLOF       OPNID(PYBUJF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR411P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
