     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    */
     /*                                                              */
     /*    PROGRAM-ID   : PYR4102C                                   */
     /*    PROGRAM NAME :離職人員特休結算表                        */
     /*    AUTHOR       : A1336 KLAUS                                */
     /*    CREATE DATE  : 91/10/18                                   */
     /*    UPDATE DATE  :                                            */
     /*    SYSTEM       :                                          */
     /****************************************************************/
             PGM
             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM02S)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAY)      TYPE(*CHAR) LEN(7)
             DCL        VAR(&WDAY)     TYPE(*CHAR) LEN(8)
             DCL        VAR(&WYY)      TYPE(*CHAR) LEN(4)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM02S)   VALUE(%SST(*LDA 521 8))
             CHGVAR     VAR(&DAY)      VALUE(%SST(*LDA 541 7))
             CHGVAR     VAR(&WDAY)     VALUE(%SST(*LDA 548 8))
             CHGVAR     VAR(&WYY)      VALUE(%SST(*LDA 548 4))

             OVRDBF     FILE(PYLTJF03) SHARE(*YES)
             OPNQRYF    FILE((PYLTJF03)) QRYSLT(' +
                             EM01 *EQ "' *CAT &DEM01 *CAT '" +
                          & EM02 *EQ "' *CAT &DEM02S *CAT '" +
                          & LT03 *EQ ' *CAT &WYY *CAT ' ') +
                          KEYFLD((EM01) (EM02))

             OVRPRTF    FILE(PYR410P) PAGESIZE(*N 158) CPI(12)
             CALL       PYR4102
             CLOF       OPNID(PYLTJF03)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR410P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
