             PGM
             DCL        VAR(&DRV01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DRV021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DRV022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DRV03)    TYPE(*CHAR) LEN(3)
             DCL        VAR(&WRV02)    TYPE(*CHAR) LEN(4)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DRV01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 601 7))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 608 7))
             CHGVAR     VAR(&DRV021)   VALUE(%SST(*LDA 541 8))
             CHGVAR     VAR(&DRV022)   VALUE(%SST(*LDA 549 8))
             CHGVAR     VAR(&DRV03)    VALUE(%SST(*LDA 523 3))
             CHGVAR     VAR(&WRV02)    VALUE(%SST(*LDA 557 4))

             OVRDBF     FILE(PYRV4PF) SHARE(*YES)
             OPNQRYF    FILE((PYRV4PF)) QRYSLT('RVD01 *EQ "' *CAT +
                          &DRV01 *CAT '" & RVD03 *EQ %RANGE("' *CAT +
                          &DEM041 *CAT '" "' *CAT &DEM042 *CAT '") +
                          & RVD04 *EQ %RANGE("' *CAT &DRV021 *CAT +
                          '" "' *CAT &DRV022 *CAT '") & CRV02 *EQ +
                          "' *CAT &WRV02 *CAT '"') KEYFLD(*FILE) +
                          MAPFLD((CRV02 RVD02 *CHAR 4))

             OVRPRTF    FILE(PYR532P) PAGESIZE(*N 158) CPI(12)
             CALL       PYR5322
             CLOF       OPNID(PYRV4PF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR532P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
