             PGM
             DCL        VAR(&DRR01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DRR021)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DRR022)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DRR031)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DRR032)   TYPE(*CHAR) LEN(2)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DRR01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DRR021)   VALUE(%SST(*LDA 511 1))
             CHGVAR     VAR(&DRR022)   VALUE(%SST(*LDA 512 1))
             CHGVAR     VAR(&DRR031)   VALUE(%SST(*LDA 521 2))
             CHGVAR     VAR(&DRR032)   VALUE(%SST(*LDA 531 2))

             OVRDBF     FILE(PYRRPF) SHARE(*YES)
             OPNQRYF    FILE((PYRRPF)) QRYSLT('RR01 *EQ "' *CAT +
                          &DRR01 *CAT '" &  RR02 *EQ %RANGE("' *CAT +
                          &DRR021 *CAT '" "' *CAT &DRR022 *CAT '") +
                          & RR03 *EQ %RANGE("' *CAT &DRR031 *CAT '" +
                          "' *CAT &DRR032 *CAT '")  ') +
                          KEYFLD((RR01) (RR02) (RR03))


             OVRPRTF    FILE(PYR531P) PAGESIZE(*N 158) CPI(12)
             CALL       PYR5312
             CLOF       OPNID(PYRRPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR531P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
