     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : PYR6441C                                  */
     /*    PROGRAM NAME :全民健保費用証明表　　　 　　　        */
     /*    AUTHOR       : 1328 JEFFREY                              */
     /*    CREATE DATE  : 90/05/17                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DEM022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DPENK)    TYPE(*CHAR) LEN(4)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM021)   VALUE(%SST(*LDA 531 8))
             CHGVAR     VAR(&DEM022)   VALUE(%SST(*LDA 541 8))
             CHGVAR     VAR(&DPENK)    VALUE(%SST(*LDA 611 4))


             CPYF       FROMFILE(PYR646WF) TOFILE(*LIBL/PYR646WF) +
                        CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM +
                        FILE(*LIBL/PYR646WF))
             OVRDBF     FILE(PYR646WF) TOFILE(*LIBL/PYR646WF) +
                        SHARE(*YES)

             OVRDBF     FILE(PYTIPF) SHARE(*YES)
             OPNQRYF    FILE((PYTIPF)) QRYSLT('TI01 *EQ "' *CAT     +
                          &DEM01 *CAT '"                            +
                          & TI03 *EQ %RANGE("' *CAT &DEM021 *CAT '" +
                          "' *CAT &DEM022 *CAT '")                  +
                          & TI024 *EQ "' *CAT &DPENK *CAT '"  ')    +
                         KEYFLD((TI01) (TI03) (TI02))               +
                         MAPFLD((TI021 TI02 *CHAR 6)                +
                                (TI024 '%SST(TI021 1 4)' *CHAR 4))


             OVRPRTF    FILE(PYR646P) PAGESIZE(66 132) CPI(10) +
                          OVRFLW(33)

/*將符合的資料寫入暫存檔(PYR646WF)                           */
             CALL       PYR6462

             OPNQRYF    FILE((PYR646WF))                            +
                        KEYFLD((WF01) (WF02) (WF05))

             CALL       PYR6463

             CLOF       OPNID(PYTIPF)
             CLOF       OPNID(PYR646WF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR646P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
