     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    */
     /*                                                              */
     /*    PROGRAM-ID   : PYR6062C                                   */
     /*    PROGRAM NAME :綜合福利金餘額查詢表　                    */
     /*    AUTHOR       : A1274 EVA                                  */
     /*    CREATE DATE  : 90/04/18                                   */
     /*    UPDATE DATE  :                                            */
     /*    SYSTEM       :人事薪資系統                              */
     /****************************************************************/
             PGM
             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(5)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(5)
             DCL        VAR(&DEM021)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DEM022)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DYEAR)    TYPE(*CHAR) LEN(4)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 503 5))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 508 5))
             CHGVAR     VAR(&DEM021)   VALUE(%SST(*LDA 513 8))
             CHGVAR     VAR(&DEM022)   VALUE(%SST(*LDA 521 8))
             CHGVAR     VAR(&DYEAR)    VALUE(%SST(*LDA 534 4))

             OVRDBF     FILE(PYGHJF01) SHARE(*YES)

             OPNQRYF    FILE((PYGHJF01)) QRYSLT(' +
                            GH01 *EQ "' *CAT &DEM01 *CAT '" +
                          & GH02 *EQ %RANGE("' *CAT &DEM021 *CAT '" +
                                            "' *CAT &DEM022 *CAT '") +
                          & CEM04 *EQ %RANGE("' *CAT &DEM041 *CAT '" +
                                            "' *CAT &DEM042 *CAT '") +
                          & GH03 *EQ ' *CAT &DYEAR *CAT ' ') +
                          KEYFLD((GH01) (EM041) (EM042) (EM043) +
                          (EM044) (GH02)) +
                          MAPFLD( (CEM04 'EM041 *CAT EM042 *CAT +
                          EM043 *CAT EM044'))

             OVRPRTF    FILE(PYR606P) PAGESIZE(*N 132) CPI(12)
             CALL       PGM(PYR6062)
             CLOF       OPNID(PYGHJF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR606P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
