     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     /*                                                              */
     /*    PROGRAM-ID   : PYR6401C                                   */
     /*    PROGRAM NAME :健保調整投保申報表                        */
     /*    AUTHOR       : A1274 EVA                                  */
     /*    CREATE DATE  : 90/03/26                                   */
     /*    UPDATE DATE  :                                            */
     /*    SYSTEM       :員工保險維護子系統                        */
     /****************************************************************/
             PGM
             DCL        VAR(&DEM01)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM02S)    TYPE(*CHAR) LEN(8)
             DCL        VAR(&DEM02E)    TYPE(*CHAR) LEN(8)
             DCL        VAR(&DYM )      TYPE(*CHAR) LEN(4)
             DCL        VAR(&WYM )      TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSORT)     TYPE(*CHAR) LEN(1)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM02S)   VALUE(%SST(*LDA 571 8))
             CHGVAR     VAR(&DEM02E)   VALUE(%SST(*LDA 581 8))
             CHGVAR     VAR(&DYM)      VALUE(%SST(*LDA 519 4))
             CHGVAR     VAR(&WYM)      VALUE(%SST(*LDA 552 6))
             CHGVAR     VAR(&DSORT)    VALUE(%SST(*LDA 568 1))

             OVRDBF     FILE(PYA131WF) SHARE(*YES)
             OPNQRYF    FILE((PYA131WF)) QRYSLT(' W1301 *EQ "' *CAT +
                          &DEM01 *CAT '" & W1303 *EQ ' *CAT &WYM +
                          *CAT '  & W1302 *EQ %RANGE("' *CAT +
                          &DEM02S *CAT '" "' *CAT &DEM02E *CAT '") +
                          ') KEYFLD(*FILE)

    /* 留存．申報表 */
             CALL       PGM(PYR6402)
             CALL       PGM(PYR6403)
             CLOF       OPNID(PYA131WF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR640P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
