     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     /*                                                              */
     /*    PROGRAM-ID   : PYR6422C                                   */
     /*    PROGRAM NAME :健保保額調低明細表                        */
     /*    AUTHOR       : A1274 EVA                                  */
     /*    CREATE DATE  : 90/03/26                                   */
     /*    UPDATE DATE  :                                            */
     /*    SYSTEM       :員工保險維護子系統                        */
     /****************************************************************/
             PGM

             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM02S)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DEM02E)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WYM)      TYPE(*CHAR) LEN(6)
             DCL        VAR(&DOPT)     TYPE(*CHAR) LEN(1)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM02S)   VALUE(%SST(*LDA 571 8))
             CHGVAR     VAR(&DEM02E)   VALUE(%SST(*LDA 581 8))
             CHGVAR     VAR(&WYM)      VALUE(%SST(*LDA 561 6))
             CHGVAR     VAR(&DOPT)     VALUE(%SST(*LDA 567 1))

             OVRDBF     FILE(PYA131WF) SHARE(*YES)
             OPNQRYF    FILE((PYA131WF)) QRYSLT(' +
                            W1301 *EQ "' *CAT &DEM01 *CAT '" +
                          & W1302 *EQ %RANGE("' *CAT &DEM02S *CAT '" +
                                             "' *CAT &DEM02E *CAT '") +
                          & W1303 *EQ ' *CAT &WYM *CAT ' +
                          ') KEYFLD(*FILE)

             OVRPRTF    FILE(PYR642P) PAGESIZE(*N 198) CPI(15)
             CALL       PGM(PYR6422)

             IF         COND(&DOPT *EQ '1') THEN(DO)
             OVRDBF     FILE(PYR642WF) SHARE(*YES)
             OPNQRYF    FILE((PYR642WF)) KEYFLD((W6406) (W6414))
             ENDDO

             IF         COND(&DOPT *EQ '2') THEN(DO)
             OVRDBF     FILE(PYR642WF) SHARE(*YES)
             OPNQRYF    FILE((PYR642WF)) KEYFLD((W6414) (W6406))
             ENDDO

             CALL       PGM(PYR6423)

             CLOF       OPNID(PYA131WF)
             CLOF       OPNID(PYR642WF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR642P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)
             ENDPGM
