     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     /*                                                              */
     /*    PROGRAM-ID   : PYR6421C                                   */
     /*    PROGRAM NAME :健保保額調低明細表                      */
     /*    AUTHOR       : A1274 EVA                                  */
     /*    CREATE DATE  : 90/03/26                                   */
     /*    UPDATE DATE  :                                            */
     /*    SYSTEM       :員工保險維護子系統                        */
     /****************************************************************/
             PGM
       /*  CHECK SCREEN */
             DCL        VAR(&$PENV)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN10)   TYPE(*LGL)  LEN(1)

             CHGVAR     VAR(%SST(*LDA 125 3)) VALUE('001')
             CHGVAR     VAR(%SST(*LDA 217 2)) VALUE('00')
             CHGVAR     VAR(%SST(*LDA 219 1)) VALUE('0')

 START:      CALL       PGM(PYR6421) PARM(&IN03 &IN10)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 501 100)) VALUE(' ')
             RETURN
             ENDDO

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             IF         COND(&$PENV *EQ '2') THEN(DO)
                        SBMJOB    JOB(PYR6422C) RQSDTA('CALL PYR6422C')
                        ENDDO
             ELSE       CMD(DO)
                        CALL      PGM(PYR6422C)
                        ENDDO

             GOTO       START

             ENDPGM
