     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    */
     /*                                                              */
     /*    PROGRAM-ID   : PYR6092C                                   */
     /*    PROGRAM NAME : YYY/MM貸款扣款明細表-員工              */
     /*    AUTHOR       : WILLIAMS                                   */
     /*    CREATE DATE  : 97/01/20                                   */
     /*    UPDATE DATE  :                                            */
     /*    SYSTEM       :人事薪資系統                              */
     /****************************************************************/
             PGM
             DCL        VAR(&DLN01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM04S)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DEM04E)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DLN02S)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DLN02E)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DLN12S)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DLN12E)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DLN03S)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DLN03E)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&WYM)      TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSORT)    TYPE(*CHAR) LEN(1)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DLN01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM04S)   VALUE(%SST(*LDA 601 7))
             CHGVAR     VAR(&DEM04E)   VALUE(%SST(*LDA 608 7))
             CHGVAR     VAR(&DLN02S)   VALUE(%SST(*LDA 519 8))
             CHGVAR     VAR(&DLN02E)   VALUE(%SST(*LDA 527 8))
             CHGVAR     VAR(&DLN12S)   VALUE(%SST(*LDA 535 8))
             CHGVAR     VAR(&DLN12E)   VALUE(%SST(*LDA 543 8))
             CHGVAR     VAR(&DLN03S)   VALUE(%SST(*LDA 551 1))
             CHGVAR     VAR(&DLN03E)   VALUE(%SST(*LDA 552 1))
             CHGVAR     VAR(&DSORT)    VALUE(%SST(*LDA 558 1))
             CHGVAR     VAR(&WYM)      VALUE(%SST(*LDA 561 6))

             OVRDBF     FILE(PYLNJF01) SHARE(*YES)

             IF         COND(&DSORT *EQ '1') THEN(DO)
             OPNQRYF    FILE((PYLNJF01)) QRYSLT('LN01 +
                             *EQ "' *CAT &DLN01 *CAT '" +
                          & CEM04 *EQ %RANGE("' *CAT &DEM04S *CAT '" +
                                             "' *CAT &DEM04E *CAT '") +
                          & LN02 *EQ %RANGE("' *CAT &DLN02S *CAT '" +
                                            "' *CAT &DLN02E *CAT '") +
                          & LN12 *EQ %RANGE("' *CAT &DLN12S *CAT '" +
                                            "' *CAT &DLN12E *CAT '") +
                          & LN03 *EQ %RANGE("' *CAT &DLN03S *CAT '" +
                                            "' *CAT &DLN03E *CAT '") +
                          & LN06C *LE "' *CAT &WYM *CAT '" +
                          & LN09C *GE "' *CAT &WYM *CAT '" ') +
                          KEYFLD((LN01) (LN16) (EM041) (EM042) +
                                 (EM043) (EM044)) +
                          MAPFLD((CEM04 'EM041 *CAT EM042 *CAT +
                          EM043 *CAT EM044') (LN06C LN06 *CHAR 6) +
                          (LN09C LN09 *CHAR 6))
             ENDDO

             IF         COND(&DSORT *EQ '2') THEN(DO)
             OPNQRYF    FILE((PYLNJF01)) QRYSLT('LN01 +
                             *EQ "' *CAT &DLN01 *CAT '" +
                          & CEM04 *EQ %RANGE("' *CAT &DEM04S *CAT '" +
                                             "' *CAT &DEM04E *CAT '") +
                          & LN02 *EQ %RANGE("' *CAT &DLN02S *CAT '" +
                                            "' *CAT &DLN02E *CAT '") +
                          & LN12 *EQ %RANGE("' *CAT &DLN12S *CAT '" +
                                            "' *CAT &DLN12E *CAT '") +
                          & LN03 *EQ %RANGE("' *CAT &DLN03S *CAT '" +
                                            "' *CAT &DLN03E *CAT '") +
                          & LN06C *LE "' *CAT &WYM *CAT '" +
                          & LN09C *GE "' *CAT &WYM *CAT '" ') +
                          KEYFLD((LN01) (LN02)) +
                          MAPFLD((CEM04 'EM041 *CAT EM042 *CAT +
                          EM043 *CAT EM044') (LN06C LN06 *CHAR 6) +
                          (LN09C LN09 *CHAR 6))
             ENDDO
             OVRPRTF    FILE(PYR609P) PAGESIZE(*N 158) CPI(12)
             CALL       PYR6092
             CLOF       OPNID(PYLNJF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR609P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
