     /***************************************************************/
     /*   PROGRAM ID   : PYR6061C                                   */
     /*   PROGRAM NAME :綜合福利金餘額查詢表　　　　              */
     /*   AUTHER       : A1274 EVA                                  */
     /*   CREATE DATE  : 90/04/18                                   */
     /*   UPDATE DATE  :                                            */
     /*   SUBSYSTEM    :                                            */
     /***************************************************************/
             PGM
       /*  CHECK SCREEN */
             DCL        VAR(&$PENV)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN10)   TYPE(*LGL)  LEN(1)

             CHGVAR     VAR(%SST(*LDA 125 3)) VALUE('001')
             CHGVAR     VAR(%SST(*LDA 217 2)) VALUE('00')
             CHGVAR     VAR(%SST(*LDA 219 1)) VALUE('0')

 START:      CALL       PGM(PYR6061) PARM(&IN03 &IN10)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 501 100)) VALUE(' ')
             RETURN
             ENDDO

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             IF         COND(&$PENV *EQ '2') THEN(DO)
             SBMJOB     JOB(PYR6062C) RQSDTA('CALL PYR6062C')
                        ENDDO
             ELSE       CMD(DO)
                        CALL       PGM(PYR6062C)
                        ENDDO

             GOTO       START

             ENDPGM
