     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYR7121C                                  */
     /*    PROGRAM NAME :薪資所得銀行不轉存資料表                 */
     /*    AUTHOR       : A1274 EVA                                 */
     /*    CREATE DATE  : 2001/11/07                                */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :人事薪資系統                             */
     /***************************************************************/
             PGM
             DCL        VAR(&DBC01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DBC04)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&WBC04)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&DBC05)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DBC03)    TYPE(*CHAR) LEN(1)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DBC01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DBC03)    VALUE(%SST(*LDA 522 1))
             CHGVAR     VAR(&DBC04)    VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DBC05)    VALUE(%SST(*LDA 606 2))
             CHGVAR     VAR(&WBC04)    VALUE(%SST(*LDA 531 6))

             OVRDBF    FILE(PYBCPF) SHARE(*YES)
             OPNQRYF   FILE((PYBCPF)) QRYSLT('    +
                       (BC01 *EQ "' || &DBC01 || '")  *AND  +
                       (BC03 *EQ "' || &DBC03 || '")  *AND  +
                       (CBC05 *EQ "' || &DBC05 || '")  *AND  +
                       (CBC04 *EQ "' || &WBC04 || '")') +
                       KEYFLD((BC01)(BC06)(BC02)) +
                       MAPFLD((CBC04 BC04 *CHAR 6) +
                             (CBC05 BC05 *CHAR 2))

             OVRPRTF    FILE(PYR712P) PAGESIZE(*N 100) CPI(12)
             CALL       PYR7122
             CLOF       OPNID(PYBCPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR712P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
