     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     /*                                                              */
     /*    PROGRAM-ID   : PYR7132C                                   */
     /*    PROGRAM NAME :年度應稅所得明細表－部門                  */
     /*    AUTHOR       : A1266 HANK                                 */
     /*    CREATE DATE  : 901219                                     */
     /*    UPDATE DATE  :                                            */
     /*    SYSTEM       :人事薪資                                  */
     /****************************************************************/
             PGM

             DCL        VAR(&DEM01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEM041)   TYPE(*CHAR) LEN(5)
             DCL        VAR(&DEM042)   TYPE(*CHAR) LEN(5)
             DCL        VAR(&DYEAR)    TYPE(*CHAR) LEN(3)
             DCL        VAR(&WYEAR)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&SYYMM)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&EYYMM)    TYPE(*CHAR) LEN(6)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DEM01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DEM041)   VALUE(%SST(*LDA 503 5))
             CHGVAR     VAR(&DEM042)   VALUE(%SST(*LDA 508 5))
             CHGVAR     VAR(&DYEAR)    VALUE(%SST(*LDA 600 3))
             CHGVAR     VAR(&WYEAR)    VALUE(%SST(*LDA 531 4))
             CHGVAR     VAR(&SYYMM)    VALUE(%SST(*LDA 535 6))
             CHGVAR     VAR(&EYYMM)    VALUE(%SST(*LDA 541 6))
 /*PH01=公司PH34=部門PH03=年月                                         */
             OVRDBF     FILE(PYPHPF)   SHARE(*YES)
             OPNQRYF    FILE((PYPHPF)) QRYSLT(' +
                            PH01 *EQ "' *CAT &DEM01 *CAT '" +
                          & CPH34 *EQ %RANGE("' *CAT &DEM041 *CAT '" +
                                             "' *CAT &DEM042 *CAT '") +
                          & PH03 *EQ %RANGE( ' *CAT &SYYMM *CAT '  +
                                              ' *CAT &EYYMM *CAT ' ) ') +
                          KEYFLD((PH35)(PH341)(PH342)(PH343)(PH344)) +
                          MAPFLD((CPH34 'PH341 *CAT PH342 *CAT PH343 +
                          *CAT PH344'))

             OVRPRTF    FILE(PYR713P) PAGESIZE(*N 198) CPI(15)
             CALL       PYR7132
             CLOF       OPNID(PYPHPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR713P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
