     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     /*                                                              */
     /*    PROGRAM-ID   : PYR7131C CPY FROM  PYR7091C                */
     /*    PROGRAM NAME :年度應稅所得明細表－部門                  */
     /*    AUTHOR       : A1274 EVA                                  */
     /*    CREATE DATE  : 89/12/18                                   */
     /*    UPDATE DATE  : A1266 HANK 901219                          */
     /*    SYSTEM       :人事薪資                                  */
     /****************************************************************/
      /*  CHECK SCREEN */
             DCL        VAR(&$PENV)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN10)   TYPE(*LGL)  LEN(1)

             CHGVAR     VAR(%SST(*LDA 125 3)) VALUE('001')
             CHGVAR     VAR(%SST(*LDA 217 2)) VALUE('00')
             CHGVAR     VAR(%SST(*LDA 219 1)) VALUE('0')

 START:      CALL       PGM(PYR7131) PARM(&IN03 &IN10)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 501 100)) VALUE(' ')
             RETURN
             ENDDO

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             IF         COND(&$PENV *EQ '2') THEN(DO)
                        SBMJOB    JOB(PYR7132C) RQSDTA('CALL PYR7132C')
                        ENDDO
             ELSE       CMD(DO)
                        CALL       PGM(PYR7132C)
                        ENDDO

             GOTO       START

             ENDPGM
