             PGM
             DCL        VAR(&DTD02)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&WTD01)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&DTD01)    TYPE(*CHAR) LEN(2)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DTD02)    VALUE(%SST(*LDA 501 4))
             CHGVAR     VAR(&WTD01)    VALUE(%SST(*LDA 507 4))
             CHGVAR     VAR(&DTD01)    VALUE(%SST(*LDA 601 2))

             OVRDBF     FILE(PYTDPF) SHARE(*YES)

             OPNQRYF    FILE((PYTDPF)) QRYSLT('    +
                        (TD02  *EQ "' || &DTD02 || '")  *AND  +
                        (CTD01 *EQ "' || &WTD01 || '")  *AND  +
                         TD10  *NE " " *AND +
                         TD96  *NE 0 ') +
                         KEYFLD((TD11) (TD03))      +
                         MAPFLD((CTD01 TD01 *CHAR 4))

             OVRPRTF    FILE(PYR702P) PAGESIZE(*N 198) CPI(15)
             CALL       PYR7022
             CLOF       OPNID(PYTDPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR702P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
