             PGM
             DCL        VAR(&DTD02)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&WTD01)    TYPE(*CHAR) LEN(4)
/*K          DCL        VAR(&WTD16)    TYPE(*CHAR) LEN(6)        */
             DCL        VAR(&DOPT)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&DCO )     TYPE(*CHAR) LEN(2)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DTD02)    VALUE(%SST(*LDA 501 4))
             CHGVAR     VAR(&WTD01)    VALUE(%SST(*LDA 507 4))
/*K          CHGVAR     VAR(&WTD16)    VALUE(%SST(*LDA 511 6))   */
             CHGVAR     VAR(&DOPT)     VALUE(%SST(*LDA 517 1))
             CHGVAR     VAR(&DCO )     VALUE(%SST(*LDA 518 2))

             OVRPRTF    FILE(PYR704P) PAGESIZE(*N 198) CPI(15)


  /******************************************************************/
  /* 指定本國╱外籍人士的扣繳總表　*/

             IF         COND(&DOPT= 'F' *OR &DOPT='L') THEN(DO)
             OVRDBF     FILE(PYTDPF) SHARE(*YES)
             OPNQRYF    FILE((PYTDPF)) QRYSLT('              +
                         TD11 *EQ "' || &DCO   || '"   *AND  +
                         TD02 *EQ "' || &DTD02 || '"   *AND  +
                         CTD01 *EQ "' || &WTD01 || '"  *AND  +
                         CTD99 *EQ "'||&DOPT||'" ')     +
                         KEYFLD((TD04) (TD99) (TD12))        +
                         MAPFLD((CTD01 TD01 *CHAR 4)(CTD99 TD99 *CHAR 1))


             CALL       PYR7042
             CLOF       OPNID(PYTDPF)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR704P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)
             ENDDO


  /******************************************************************/
  /* 全部人士的扣繳總表　*/
             IF         COND(&DOPT= 'A') THEN(DO)
             OVRDBF     FILE(PYTDPF) SHARE(*YES)
             OPNQRYF    FILE((PYTDPF)) QRYSLT('              +
                         TD11 *EQ "' || &DCO   || '"   *AND  +
                         TD02 *EQ "' || &DTD02 || '"   *AND  +
                         CTD01 *EQ "' || &WTD01 || '" ')     +
                         KEYFLD((TD04) (TD99) (TD12))        +
                         MAPFLD((CTD01 TD01 *CHAR 4)(CTD99 TD99 *CHAR 1))


             CALL       PYR7043
             CLOF       OPNID(PYTDPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR704P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)
             ENDDO

             ENDPGM
