             PGM
             DCL        VAR(&DBT01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DBT061)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&DBT04)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&WBT04)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&DBT05)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DBT03)    TYPE(*CHAR) LEN(1)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DBT01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DBT061)   VALUE(%SST(*LDA 503 3))
             CHGVAR     VAR(&DBT03)    VALUE(%SST(*LDA 522 1))
             CHGVAR     VAR(&DBT04)    VALUE(%SST(*LDA 523 6))
             CHGVAR     VAR(&DBT05)    VALUE(%SST(*LDA 527 2))
             CHGVAR     VAR(&WBT04)    VALUE(%SST(*LDA 531 6))

             OVRDBF    FILE(PYBTJF01) SHARE(*YES)
             OPNQRYF   FILE((PYBTJF01)) QRYSLT('    +
                       (BT01 *EQ "' || &DBT01 || '")  *AND  +
                       (BT03 *EQ "' || &DBT03 || '")  *AND  +
                       (BT061 *EQ "' || &DBT061 || '") *AND  +
                       (CBT05 *EQ "' || &DBT05 || '")  *AND  +
                       (CBT04 *EQ "' || &WBT04 || '")') +
                       KEYFLD((EM041)(EM042)(EM043)(EM044)(BT02)) +
                       MAPFLD((CBT04 BT04 *CHAR 6) +
                             (CBT05 BT05 *CHAR 2))

             OVRPRTF    FILE(PYR701P) PAGESIZE(*N 110) CPI(12)
             CALL       PYR7012
             CLOF       OPNID(PYBTJF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PYR701P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
