             PGM        PARM(&MSGDTA1 &MSG)

             DCL        VAR(&MSGDTA1) TYPE(*CHAR) LEN(5)
             DCL        VAR(&MSG) TYPE(*CHAR) LEN(70)
             RTVMSG     MSGID(UMI0180) MSGF(CEMF) MSGDTA(&MSGDTA1) +
                          MSG(&MSG)

             ENDPGM
