             PGM        PARM(&PARM)
             DCL        VAR(&PARM) TYPE(*DEC) LEN(8 0)
             ADDLIBLE   LIB(PYDBFLIB40)
             MONMSG     MSGID(CPF9999)
             CALL       PGM(PYT104) PARM(&PARM)
             RMVLIBLE   LIB(PYDBFLIB40)
             MONMSG     MSGID(CPF9999)
             ENDPGM
