     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYA6011C                                  */
     /*    PROGRAM NAME :福委會收支登錄作業　　　　　             */
     /*    AUTHOR       : A1274 EVA                                 */
     /*    CREATE DATE  : 90/02/21                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DER01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DER03)    TYPE(*CHAR) LEN(8)
             DCL        VAR(&DER05)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&DER04)    TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DER01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DER03)    VALUE(%SST(*LDA 503 8))
             CHGVAR     VAR(&DER05)    VALUE(%SST(*LDA 511 6))
             CHGVAR     VAR(&DER04)    VALUE(%SST(*LDA 517 2))

  /*離職員工不作登錄動作 */

             OVRDBF     FILE(PYEMPF) SHARE(*YES)
             OPNQRYF    FILE((PYEMPF)) QRYSLT(' +
                            EM01 *EQ ("' *CAT &DER01 *CAT '") +
                          & EM19 *EQ 0 +
                          | EM01 *EQ ("' *CAT &DER01 *CAT '") +
                          & CEM19 *GT ("' *CAT &DER03 *CAT '")') +
                          KEYFLD(*FILE) +
                          MAPFLD((CEM19 EM19 *CHAR 8))

             CALL       PYA6011
             CLOF       OPNID(PYEMPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
