     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM ID   : PYR601C                                   */
     /*    PROGRAM NAME : 福委會所得扣繳申報作業　　　            */
     /*    AUTHOR       : A1274 EVA                                 */
     /*    CREATE DATE  : 88/01/26                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DER01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WER03) TYPE(*CHAR) LEN(4)
             DCL        VAR(&XER03) TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DER01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&WER03) VALUE(%SST(*LDA 511 4))
             CHGVAR     VAR(&XER03) VALUE(%SST(*LDA 511 6))

             CALL PYT118

             OVRPRTF    FILE(QSYSPRT) PAGESIZE(*N 132) CPI(10) +
                          IGCDTA(*YES)
             OVRPRTF    FILE(QSYSPRT1) PAGESIZE(*N 132) CPI(10) +
                          IGCDTA(*YES)
             OVRPRTF    FILE(QSYSPRT2) PAGESIZE(*N 132) CPI(10) +
                          IGCDTA(*YES)
             OVRDBF     FILE(PYERPF) SHARE(*YES)
             OPNQRYF    FILE((PYERPF)) QRYSLT('ER01 *EQ  "' *CAT +
                          &DER01 *CAT '"  & PER03 *EQ  "' *CAT +
                          &WER03 *CAT '" ') KEYFLD(*FILE) +
                          MAPFLD((CER03 ER03 *ZONED 8) (SER03 CER03 +
                          *CHAR 8)(PER03 SER03 *CHAR 4))

             CALL       PYR6011
             CLOF       OPNID(PYERPF)

             OVRDBF     FILE(PYERPF) SHARE(*YES)
             OPNQRYF    FILE((PYERPF)) QRYSLT('ER01 *EQ  "' *CAT +
                          &DER01 *CAT '"  & TER03 *EQ  "' *CAT +
                          &WER03 *CAT '" ') KEYFLD(*FILE) +
                          MAPFLD((CER03 ER03 *ZONED 8) (SER03 CER03 +
                          *CHAR 8)(TER03 SER03 *CHAR 4))
             CALL       PYR6012
             CLOF       OPNID(PYERPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
