     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    PROGRAM NAME : ARR096C1                                  */
     /*    AUTHOR       : DEREK                                     */
     /*    CREATE DATE  : 113/03/08                                 */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :茂世進銷存系統                           */
     /*    SUBSYSTEM    :應收系統                                 */
     /*    REMARK       :作廢發票報表                             */
     /***************************************************************/
             PGM

             DCL        VAR(&DSI01S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSI01E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSI21S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSI21E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&WSI21S) TYPE(*CHAR) LEN(8)
             DCL        VAR(&WSI21E) TYPE(*CHAR) LEN(8)
             DCL        VAR(&LIB)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&FILE)  TYPE(*CHAR) LEN(10)

             CHGVAR     VAR(&DSI01S) VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DSI01E) VALUE(%SST(*LDA 603 2))
             CHGVAR     VAR(&DSI21S) VALUE(%SST(*LDA 605 6))
             CHGVAR     VAR(&DSI21E) VALUE(%SST(*LDA 611 6))
             CHGVAR     VAR(&WSI21S) VALUE(%SST(*LDA 617 8))
             CHGVAR     VAR(&WSI21E) VALUE(%SST(*LDA 625 8))
             CHGVAR     VAR(&LIB)   VALUE('QTEMP')

      /*作廢發票報表*/
             DLTF       FILE(QTEMP/ARR096F)
             MONMSG     MSGID(CPF2105)

             CPYF       FROMFILE(ARR096F) TOFILE(QTEMP/ARR096F) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM +
                          FILE(QTEMP/ARR096F))
             CLRPFM     FILE(QTEMP/ARR096F)

             OVRDBF     FILE(ARR096F) TOFILE(QTEMP/ARR096F) +
                          SHARE(*YES)

             CHGVAR     VAR(&FILE)  VALUE('ARR096F')

      /*讀取發票主檔*/
             OVRDBF     FILE(SOSIPF) SHARE(*YES)
             OPNQRYF    FILE((SOSIPF)) QRYSLT('SI01 *EQ %RANGE("' +
                          *CAT &DSI01S *CAT '" "' *CAT &DSI01E +
                          *CAT '") & CSI21 *EQ %RANGE("' *CAT +
                          &WSI21S *CAT '" "' *CAT &WSI21E *CAT '") +
                          & SI37 *NE 0 ') KEYFLD((SI01) (SI02)) +
                          MAPFLD((CSI21 SI21 *CHAR 8))

             CALL       PGM(ARR0961)

             CLOF       OPNID(SOSIPF)
             DLTOVR     FILE(*ALL)

             /*將FILE轉換成CSV FILE AND FTP TO PC */
                CALL       PGM(ECL100C) PARM(&LIB &FILE)

             ENDPGM
