/*   A*-------------------------------------------------------------*/
             PGM

             DCL       VAR(&LIB)   TYPE(*CHAR) LEN(10) VALUE('REFLIB')
             DCL       VAR(&FILE)  TYPE(*CHAR) LEN(10) VALUE('IMR085F')

             OVRDBF     FILE(IMIAPF) SHARE(*YES)
             OPNQRYF    FILE((IMIAPF)) QRYSLT('IA02 *EQ "B0099" *OR +
                          %SST(IA02 1 1) *EQ "W"') KEYFLD((IA01) +
                          (IA02) (IA03))

             CLRPFM     FILE(REFLIB/IMR085F)
             CALL       PGM(IMR085)

             CLOF       OPNID(IMIAPF)
             DLTOVR     FILE(*ALL)

             CPYF       FROMFILE(REFLIB/IMR085F) +
                          TOFILE(REFLIB/IMR085PF) MBROPT(*ADD) +
                          FMTOPT(*NOCHK)

             /*±NIMI4WFÂà´«¦¨CSV FILE AND FTP TO PC */
                CALL       PGM(ECL100C) PARM(&LIB &FILE)

             ENDPGM
