     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    AUTHOR       : DEREK                                     */
     /*    CREATE DATE  : 2016/12/12                                */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : KIP019C                                   */
     /*    SYSTEM       :茂世進銷存                               */
     /*    SUBSYSTEM    :專櫃進銷存系統                           */
     /*    REMARK       :業績獎金計算                             */
     /***************************************************************/
             PGM

             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN98)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN97)   TYPE(*LGL)  LEN(1)

             CHGVAR     VAR(%SST(*LDA 162   1)) VALUE('1')

 START:      CALL       PGM(KIP0191) PARM(&IN03 &IN98 &IN97)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 501 100)) VALUE(' ')
             RETURN
             ENDDO

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)

             IF         COND(&$EVR *EQ '1') THEN(DO)
                        CALL       PGM(KIP019C1)
                        CHGVAR     VAR(&IN98)  VALUE('1')
                        ENDDO
             ELSE       CMD(DO)
                        SBMJOB    JOB(KIP019C1) RQSDTA('CALL KIP019C1')
                        CHGVAR    VAR(&IN97) VALUE('1')
                        ENDDO

             GOTO       START

             ENDPGM
