  /****************************************************************/
  /*  泛太資訊科技開發股份有限公司－版權所有    TEL:27313250    */
  /*                                                              */
  /* PROGRAM NAME : KIP018C1                                      */
  /* AUTHER       : DEREK                                         */
  /* CREATE DATE  : 105/12/08                                     */
  /* UPDATE DATE  :                                               */
  /* SYSTEM       :茂世進銷存                                 */
  /* SUBSYSTEM    :專櫃進銷存系統                               */
  /* REMARK       :單瓶獎金設定 (A/U/D/I)                       */
  /****************************************************************/
             PGM

             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FILE) TYPE(*CHAR) LEN(10)

             CHGVAR     VAR(&LIB) VALUE('QTEMP')
             CHGVAR     VAR(&FILE) VALUE('KIP018F')

             /*將KIP018F轉換成CSV FILE AND FTP TO PC */
             CALL       PGM(ECL100C) PARM(&LIB &FILE)

             ENDPGM
