     /****************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     /*--------------------------------------------------------------*/
     /*    DSPF NAME    : KIS000DD                                   */
     /*    AUTHOR       : DEREK                                      */
     /*    CREATE DATE  : 105/12/31                                  */
     /*    UPDATE DATE  :                                            */
     /*    PROGRAM NAME : KIS000C4                                   */
     /*    SYSTEM       :茂世後台                                  */
     /*    SUBSYSTEM    :                                            */
     /*    REMARK       :專櫃業績獎金管理主畫面                    */
     /****************************************************************/
             PGM
             DCL        VAR(&WDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&$USER)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0102I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101O) TYPE(*CHAR) LEN(1)
             DCLF       FILE(*LIBL/KIS000D4) RCDFMT(DSPC1)
             OVRMSGF MSGF(QCPFMSG) TOMSGF(PTFLIB/PTMF)
             CALL       PGM(P63)
             RTVDTAARA  DTAARA(*LDA (101 10)) RTNVAR(&$USER)
             RTVDTAARA  DTAARA(*LDA (119 6)) RTNVAR(&WDATE)
             CHGVAR     VAR(&$EGMDY) VALUE(&WDATE)
             SETATNPGM  PGM(*LIBL/ATN01)
             CHGVAR     VAR(&S0101I) VALUE(&$USER)
  START:
             SNDRCVF    DEV(*FILE) RCDFMT(DSPC1)
             CHGVAR     VAR(&IN98) VALUE('0')

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&DOPID *EQ '01') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('KIP017C')
             ENDDO
             IF         COND(&DOPID *EQ '02') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('KIP018C')
             ENDDO
             IF         COND(&DOPID *EQ '21') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('KIP019C')
             ENDDO
             IF         COND(&DOPID *EQ '31') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('KIR010C')
             ENDDO
             IF         COND(&DOPID *EQ '32') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('KIR020C')
             ENDDO
             IF         COND(&DOPID *EQ '33') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('KIR030C')
             ENDDO
             IF         COND(&DOPID *EQ '34') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('KIR040C')
             ENDDO
             IF         COND(&DOPID *EQ '35') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('MTR058C')
             ENDDO
             IF         COND(&DOPID *EQ '  ') THEN(GOTO START)
             GOTO       CHKAUT

  CHKAUT:    CALL       PGM(S#S01) PARM(&S0101I &S0102I &S0101O)
             IF         COND(&S0101O = 'Y') THEN(CALL PGM(&S0102I))
             ELSE       CMD(CHGVAR VAR(&IN98) VALUE('1'))
             GOTO       START

   ENDPGM:   ENDPGM
