     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    AUTHOR       : DEREK                                     */
     /*    CREATE DATE  : 2016/12/19                                */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : MTR058C1                                  */
     /*    SYSTEM       :茂世進銷存                               */
     /*    SUBSYSTEM    :專櫃進銷存系統                           */
     /*    REMARK       :每月新增產品明細表                       */
     /***************************************************************/
             PGM

             DCL        VAR(&DMA53S) TYPE(*CHAR) LEN(6)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6402I)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6404I)   TYPE(*CHAR) LEN(2)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)

             CHGVAR     VAR(&DMA53S)   VALUE(%SST(*LDA 505 6))

             OVRDBF     FILE(MTMAPF) SHARE(*YES)
             OPNQRYF    FILE((MTMAPF)) OPTION(*INP) QRYSLT(' CMA53 = +
                          "' || &DMA53S || '" ') KEYFLD((MA01)) +
                          MAPFLD((SMA53 MA53 *CHAR 8) (CMA53 +
                          '%SST(SMA53 1 6)' *CHAR 6))

             CALL       MTR0582
             CLOF       OPNID(MTMAPF)
             DLTOVR     FILE(*ALL)

             CHGVAR     VAR(&P6401I) VALUE('MTR058P')
             CHGVAR     VAR(&P6402I) VALUE(&$PENV)
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CHGVAR     VAR(&P6404I) VALUE(&$PRTCD)
             CALL       PGM(P64) PARM(&P6401I &P6402I &P6403I &P6404I)

             ENDPGM
