             PGM        PARM(&PARM1 &PARM2)

             DCL        VAR(&PARM1) TYPE(*CHAR) LEN(9)
             DCL        VAR(&PARM2) TYPE(*CHAR) LEN(4)

             CALL       PGM(ZEB001) PARM(&PARM1 &PARM2)

             ENDPGM
