     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H* PROGRAM NAME : ARR0632                                       *
     H* AUTHER       : DEREK                                         *
     H* CREATE DATE  : 2016/06/07                                    *
     H* UPDATE DATE  :                                               *
     H* SYSTEM       :人頭馬匯東                                   *
     H* SUBSYSTEM    :應收系統                                     *
     H* REMARK       :計算收款種類沖帳金額                         *
     H*===============================================================
     H* CODE | AUTHOR |  DATE  | DESCRIPTION
     H*---------------------------------------------------------------
     H****************************************************************
     FARADLF07IF  E           K        DISK
     C*==============================================================*
     C*                    PARAMETER
     C*==============================================================*
     C           *ENTRY    PLIST
     C           KAD10     PARM           P001I   2        公司別
     C           KAD02     PARM           P002I   5        客戶代號
     C           WAD12     PARM           P003I   60       分配年月
     C           WAD05     PARM           P004I   2        收款種類
     C                     PARM WAD08     P001O   90       沖銷金額
     C*==============================================================*
     C*                    DEFINE
     C*==============================================================*
     C           *LIKE     DEFN AD10      KAD10            公司別
     C           *LIKE     DEFN AD02      KAD02            客戶代號
     C           *LIKE     DEFN AD12      WAD12 - 2        分配年月
     C           *LIKE     DEFN AD05      WAD05            收款種類
     C           *LIKE     DEFN AD12      KAD12S           分配日期
     C           *LIKE     DEFN AD12      KAD12E           分配日期
     C           *LIKE     DEFN AD08      WAD08            沖銷金額
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYAD1    KLIST
     C                     KFLD           KAD10            公司別
     C                     KFLD           KAD02            客戶代號
     C                     KFLD           KAD12S           分配日期
     C           KEYAD2    KLIST
     C                     KFLD           KAD10            公司別
     C                     KFLD           KAD02            客戶代號
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      .INIT
     C                     EXSR R1000                      .計算     L
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ... INITIAL
     C*==============================================================*
     C           R0100     BEGSR
     C*
     C                     MOVELWAD12     KAD12S
     C                     MOVE '01'      KAD12S
     C                     MOVELWAD12     KAD12E
     C                     MOVE '31'      KAD12E
     C                     Z-ADD0         WAD08
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R1000 ....計算沖銷金額
     C*==============================================================*
     C           R1000     BEGSR
     C*
     C           KEYAD1    SETLLAD0
     C           KEYAD2    READEAD0                      46
     C           *IN46     DOWEQ'0'
     C           AD12      IFLE KAD12E
     C           AD05      ANDEQWAD05
     C                     ADD  AD08      WAD08
     C                     ENDIF
     C           KEYAD2    READEAD0                      46
     C                     ENDDO
     C*
     C                     ENDSR
