      ****************************************************************
      * PROGRAM NAME : ARR095                                        *
      * AUTHER       : YVONNE                                        *
      * CREATE DATE  : 111/11/03                                     *
      * UPDATE DATE  :                                               *
      * SYSTEM       :茂世進銷存系統                               *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :應收沖帳明細轉EXCEL                          *
     /*=============================================================*/
     FARR095D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      135 135 $ADD
     I*公司別
     I                                      601 602 DAC01S
     I                                      606 607 DAC01E
     I*收款日期區間
     I                                      615 6200DAC04S
     I                                      621 6260DAC04E
     I*
     I                                      630 6370YMDS
     I                                      640 6470YMDE
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
    C                     EXSR RTN100                     .CHECK      ?
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVE *BLANK    DAC01S
|    C                     MOVE *BLANK    DAC01E
|    C                     Z-ADD0         DAC04S
|    C                     Z-ADD0         DAC04E
|    C                     Z-ADD0         YMDS
|    C                     Z-ADD0         YMDE
|    C                     Z-ADD0         W6      60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
| 01-C           DAC01S    IFEQ *BLANK
|   C                     SETON                     649599
| 01-C                     END
|    C   99                GOTO END100
|    C*
| 02-C           DAC01E    IFEQ *BLANK
|   C                     SETON                     659599
| 02-C                     END
|    C   99                GOTO END100
|    C*
| 03-C           DAC01S    IFGT DAC01E
|   C                     SETON                     649099
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C*收款日期要輸入
| 04-C           DAC04S    IFEQ 0
|   C           DAC04E    OREQ 0
|   C                     SETON                     6667
|   C                     SETON                     9599
| 04*C                     ELSE
|   C*(CHECK DATE)-日期
|   C                     CALL 'P09'
|   C                     PARM DAC04S    P0901I  60
|   C                     PARM           P0901O  1
| 05-C           P0901O    IFEQ 'N'
|   C                     SETON                     669399
| 05-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DAC04E    P0901I  60
|   C                     PARM           P0901O  1
| 06-C           P0901O    IFEQ 'N'
|   C                     SETON                     679399
| 06-C                     END
|   C   99                GOTO END100
|   C*
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DAC04S    S001I2  60
|   C           W6        PARM           S001O1  60
|   C                     MOVE W6        HB2@F6  6
|   C                     EXSR HB@68L                     + CENTURY 6->8 LEFT
|   C                     MOVE HB2@T8    YMDS
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DAC04E    S001I2  60
|   C           W6        PARM           S001O1  60
|   C                     MOVE W6        HB2@F6  6
|   C                     EXSR HB@68L                     + CENTURY 6->8 LEFT
|   C                     MOVE HB2@T8    YMDE
|   C**
| 07-C           YMDS      IFGT YMDE
|   C                     SETON                     6667
|   C                     SETON                     9399
| 07-C                     END
|   C   99                GOTO END100
| 04-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
