     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H* PROGRAM NAME : ARR091                                        *
     H* AUTHER       : DEREK                                         *
     H* CREATE DATE  : 104/07/30                                     *
     H* UPDATE DATE  :                                               *
     H* SYSTEM       :人頭馬匯東                                   *
     H* SUBSYSTEM    :應收系統                                     *
     H* REMARK       :應收報表                                     *
     H*==============================================================*
     H* CODE   AUTHOR.     DATE    DESCRIPTION                    *
     H*--------------------------------------------------------------*
     H*==============================================================*
     FARR091D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     F**ARR091Z O   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      600 601 DAD10S
     I                                      602 603 DAD10E
     I                                      604 608 DAD02S
     I                                      609 613 DAD02E
     I                                      614 6190DAD11
     I                                      620 6270YDATES
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     I*
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
     C*==============================================================*
     C*                    DEFINE
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*===============================================================*
     C*          RTN010....INIT SCREEN
     C*===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DAD10S
|    C                     MOVE *BLANK    DAD10E
|    C                     MOVE *BLANK    DAD02S
|    C                     MOVE *BLANK    DAD02E
|    C                     Z-ADD0         DAD11
|    C                     Z-ADD0         YDATES
|    C                     Z-ADD0         W6      60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C***
|    C*公司別
|    C***
| 01-C           DAD10S    IFEQ *BLANK
|   C                     MOVEL*LOVAL    DAD10S
| 01-C                     END
| 01-C           DAD10E    IFEQ *BLANK
|   C                     MOVEL*HIVAL    DAD10E
| 01-C                     END
| 03-C           DAD10S    IFGT DAD10E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C***
|    C*客戶
|    C***
| 07-C           DAD02S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DAD02S
| 07-C                     END
|    C*
| 08-C           DAD02E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DAD02E
| 08-C                     END
|    C*
| 09-C           DAD02S    IFGT DAD02E
|   C                     SETON                     6768
|   C                     SETON                     9299
| 09-C                     END
|    C   99                GOTO END100
|    C*******
|    C*日期
|    C*******
|    C*
| 10-C           DAD11     IFEQ 0
|   C                     SETON                     6995
|   C                     SETON                     99
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C*
|    C*(CHECK START DATE)
|    C                     CALL 'P09'
|    C                     PARM DAD11     P0901I  60
|    C                     PARM           P0911O  1
| 11-C           P0911O    IFEQ 'N'
|   C                     SETON                     699499
| 11-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHENK STRART <= END DATE)
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DAD11     S001I2  60
|    C           W6        PARM           S001O1  60
|    C                     MOVE W6        HB2@F6  6
|    C                     EXSR HB@68L                     + CENTURY 6->8 LEFT
|    C                     MOVE HB2@T8    YDATES
|    C*
|    C*SCREEN LOG
|    C***                  OPEN ARR091Z
|    C***                  WRITEPH1
|    C***                  CLOSEARR091Z
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 9
| 03-C           D#COL     IFGE 38
| 03-C           D#COL     ANDLE42
|   C                     CALL 'WDS003'
|   C                     PARM           DAD02S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 43
| 03-C           D#COL     ANDLE47
|   C                     CALL 'WDS003'
|   C                     PARM           DAD02E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 11-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 11-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
