      ****************************************************************
      * PROGRAM NAME : ARR0951                                       *
      * AUTHER       : YVONNE                                        *
      * CREATE DATE  : 111/11/03                                     *
      * UPDATE DATE  :                                               *
      * SYSTEM       :茂世進銷存系統                               *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :應收沖帳明細轉EXCEL                          *
      ****************************************************************
     FARACPF  IF  E           K        DISK
     FARR095F O   E           K        DISK
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      135 135 $ADD
     I*公司代號
     I                                      601 602 DAC01S
     I                                      606 607 DAC01E
     I*收款日期
     I                                      615 6200DAC04S
     I                                      625 6300DAC04E
     I*
     I                                      630 6370YMDS
     I                                      640 6470YMDE
     I*
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     READ AC0                      45
  01-C           *IN45     DOWEQ'0'
    C                     MOVELAC01      WF01
    C                     Z-ADDAC04      WF02
    C                     MOVELAC02      WF03
    C                     MOVELAC03      WF04
    C                     MOVELAC05      WF05
    C                     MOVELAC06      WF06
    C                     Z-ADDAC07      WF07
    C                     Z-ADDAC08      WF08
    C                     Z-ADDAC10      WF09
    C                     WRITEWF0
    C                     READ AC0                      45
  01-C                     END
     C*
     C                     SETON                     LR
