     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : IMI029                                     *
     A*    AUTHOR       : CAROL                                      *
     A*    DATE WRITTEN : 109/09/02                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款子系統                            *
     A*    PROCEDURE    :                                          *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /*=============================================================*/
     A****************************************************************
     FIMIAPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FSOSFLF02IF  E           K        DISK
 00A+FSOSCLF10IF  E           K        DISK
 00A+FSOSDPF  IF  E           K        DISK
     FIMI4WF  O   E           K        DISK
     I**********
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      201 2080DATE
 00A-I*                                     205 2060MM
 00A-I*                                     207 2080DD
 00A-I*                                     211 2180WDATE
 00A-I*                                     213 2140WYY
 00A-I*                                     215 2160WMM
     I*
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYSF     KLIST
     C                     KFLD           IA03
 00A-C*                    KFLD           WDATE
 00A+C                     KFLD           WDATE   80
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
 00A-C*                    MOVELDATE      WDATE
 00A-C*          DD        IFNE 1
 00A-C*          DATE      SUB  1         WDATE
 00A-C*                    ELSE
 00A-C*          MM        SUB  1         WMM     20
 00A-C*          WMM       IFEQ 4
 00A-C*          WMM       OREQ 6
 00A-C*          WMM       OREQ 9
 00A-C*          WMM       OREQ 11
 00A-C*                    MOVE 30        WDATE
 00A-C*                    ELSE
 00A-C*                    SELEC
 00A-C*          WMM       WHEQ 0
 00A-C*          WYY       SUB  1         WYY
 00A-C*                    MOVEL12        WMM
 00A-C*                    MOVE 31        WDATE
 00A-C*          WMM       WHEQ 2
 00A-C*                    MOVE 28        WDATE
 00A-C*                    OTHER
 00A-C*                    MOVE 31        WDATE
 00A-C*                    END
 00A-C*                    END
 00A-C*                    END
 00A+C*轉換前一天日期YYYYMMDD
 00A+C*
 00A+C                     CALL 'P37'
 00A+C                     PARM DATE      S3701I  80
 00A+C                     PARM '2'       S3702I  1
 00A+C                     PARM '1'       S3703I  1
 00A+C                     PARM -1        S3704I  40
 00A+C           WDATE     PARM           S3711O  80
     C                     READ IA0                      45
  01-C           *IN45     DOWEQ'0'
    C*
    C                     Z-ADD0         WORK    60
    C           KEYSF     SETLLSF0
     C           KEYSF     READESF0                      46
  01-C           *IN46     DOWEQ'0'
  01-C           *IN46     IFEQ '0'
     C*
    C                     ADD  SF04      WORK
    C                     ADD  SF05      WORK
     C*
     C                     END
     C                     READESF0                      46
     C                     END
     C           IA10      IFNE 0
 00A+C           IA09      ORNE 0
     C           WORK      ORNE 0
 00A+C                     Z-ADD0         SUM     60
 00A+C                     MOVEL*BLANK    SC02
 00A+C           SC02      SETLLSC0
 00A+C                     READ SC0                      48
 00A+C           *IN48     DOWEQ'0'
 00A+C           SC02      SETLLSD0
 00A+C           SC02      READESD0                      49
 00A+C           *IN49     DOWEQ'0'
 00A+C           *IN49     IFEQ '0'
 00A+C           SD03      ANDEQIA03
 00A+C                     ADD  SD04      SUM
 00A+C                     ADD  SD05      SUM
 00A+C                     END
 00A+C           SC02      READESD0                      49
 00A+C                     END
 00A+C                     READ SC0                      48
 00A+C                     END
 00A+C                     ADD  IA10      SUM
 00A+C           SUM       IFNE 0
     C                     EXSR R1000
 00A+C                     END
     C                     END
     C                     READ IA0                      45
     C                     END
     C*
     C                     SETON                     LR
      *==============================================================*
      *                    MOVE DATE TO WORKFILE
      *==============================================================*
     C           R1000     BEGSR
     C                     MOVELIA01      WF01
     C                     MOVELIA02      WF02
     C                     MOVELDATE      WF03
     C                     MOVELIA03      WF04
     C           IA03      CHAINMA0                  40
     C           *IN40     IFEQ '0'
     C                     MOVELMA02      WF05
     C                     ELSE
     C                     MOVEL*BLANK    WF05
     C                     END
     C                     Z-ADDWORK      WF06
 00A-C*                    Z-ADDIA10      WF07
 00A+C                     Z-ADDSUM       WF07
     C*
     C                     WRITEWF0
     C                     ENDSR
