     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : IMI029                                     *
     A*    AUTHOR       : CAROL                                      *
     A*    DATE WRITTEN : 109/09/02                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款子系統                            *
     A*    PROCEDURE    :                                          *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /*=============================================================*/
     A****************************************************************
     FIMIAPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FSOSFLF02IF  E           K        DISK
     FIMI4WF  O   E           K        DISK
     I**********
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      201 2080DATE
     I                                      205 2060MM
     I                                      207 2080DD
     I                                      211 2180WDATE
     I                                      213 2140WYY
     I                                      215 2160WMM
     I*
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYSF     KLIST
     C                     KFLD           IA03
     C                     KFLD           WDATE
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     MOVELDATE      WDATE
     C           DD        IFNE 1
     C           DATE      SUB  1         WDATE
     C                     ELSE
     C           MM        SUB  1         WMM     20
     C           WMM       IFEQ 4
     C           WMM       OREQ 6
     C           WMM       OREQ 9
     C           WMM       OREQ 11
     C                     MOVE 30        WDATE
     C                     ELSE
     C                     SELEC
     C           WMM       WHEQ 0
     C           WYY       SUB  1         WYY
     C                     MOVEL12        WMM
     C                     MOVE 31        WDATE
     C           WMM       WHEQ 2
     C                     MOVE 28        WDATE
     C                     OTHER
     C                     MOVE 31        WDATE
     C                     END
     C                     END
     C                     END
     C                     READ IA0                      45
  01-C           *IN45     DOWEQ'0'
    C*
    C                     Z-ADD0         WORK    60
    C           KEYSF     SETLLSF0
     C           KEYSF     READESF0                      46
  01-C           *IN46     DOWEQ'0'
  01-C           *IN46     IFEQ '0'
     C*
    C                     ADD  SF04      WORK
    C                     ADD  SF05      WORK
     C*
     C                     END
     C                     READESF0                      46
     C                     END
     C           IA10      IFNE 0
     C           WORK      ORNE 0
     C                     EXSR R1000
     C                     END
     C                     READ IA0                      45
     C                     END
     C*
     C                     SETON                     LR
      *==============================================================*
      *                    MOVE DATE TO WORKFILE
      *==============================================================*
     C           R1000     BEGSR
     C                     MOVELIA01      WF01
     C                     MOVELIA02      WF02
     C                     MOVELDATE      WF03
     C                     MOVELIA03      WF04
     C           IA03      CHAINMA0                  40
     C           *IN40     IFEQ '0'
     C                     MOVELMA02      WF05
     C                     ELSE
     C                     MOVEL*BLANK    WF05
     C                     END
     C                     Z-ADDWORK      WF06
     C                     Z-ADDIA10      WF07
     C*
     C                     WRITEWF0
     C                     ENDSR
