     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    DSPF NAME    : KIR0402                                    *
     H*    AUTHOR       : DEREK                                      *
     H*    CREATE DATE  : 2016/12/19                                 *
     H*    UPDATE DATE  :                                            *
     H*    PROGRAM NAME : KIR0402                                    *
     H*    SYSTEM       :茂世進銷存                                *
     H*    SUBSYSTEM    :專櫃進銷存系統                            *
     H*    REMARK       :供應商請款銷售報表                        *
     H****************************************************************
     FW3EEPF  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMBPF  IF  E           K        DISK
     FKIR040P O   E             39     PRINTER
     IEE0
     I                                              EE04  L2
     I                                              EE03  L1
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     I                                      501 5040DEE01
     I                                      505 5100DEE01S
     I                                      521 525 DEE04S
     I                                      526 530 DEE04E
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*==============================================================*
     C*                    DEFINE
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R0100
     C*
     C   L1                EXSR R7100
     C   L2                EXSR R7200
     C*
     C                     EXSR R2000                      PROCESS
     C*
     CL1 10                EXSR R8100
     CL2 10                EXSR R8200
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R0100 ... INIT
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     SETON                     1039
|    C                     IN   PTDA01
|    C*
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $PFMT     P3104I  1
|    C                     PARM $PTYPE    P3105I  1
|    C           DDATE     PARM           P3111O  80
|    C*
|    C*HEAD專櫃代號
|    C                     MOVEL'B0006'   WHSA      P
|    C                     MOVEL'B0011'   WHSB      P
|    C                     MOVEL'B0013'   WHSC      P
|    C                     MOVEL'B0015'   WHSD      P
|    C                     MOVEL'B0017'   WHSE      P
|    C                     MOVEL'B0018'   WHSF      P
|    C                     MOVEL'B0019'   WHSG      P
|    C                     MOVEL'B0022'   WHSH      P
|    C                     MOVEL'B0026'   WHSI      P
|    C                     MOVEL'B0032'   WHSJ      P
|    C                     MOVEL'B0000'   WHSK      P
|    C                     MOVEL'B1001'   WHSL      P
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R7100 ... LEVEL BREAK 1 -- INIT
     C*==============================================================*
02===C           R7100     BEGSR
|    C*
|    C                     Z-ADD0         PEE07            銷售總量
|    C                     Z-ADD0         QTYA             銷售數量
|    C                     Z-ADD0         BONA             單瓶獎金
|    C                     Z-ADD0         QTYB             銷售數量
|    C                     Z-ADD0         BONB             單瓶獎金
|    C                     Z-ADD0         QTYC             銷售數量
|    C                     Z-ADD0         BONC             單瓶獎金
|    C                     Z-ADD0         QTYD             銷售數量
|    C                     Z-ADD0         BOND             單瓶獎金
|    C                     Z-ADD0         QTYE             銷售數量
|    C                     Z-ADD0         BONE             單瓶獎金
|    C                     Z-ADD0         QTYF             銷售數量
|    C                     Z-ADD0         BONF             單瓶獎金
|    C                     Z-ADD0         QTYG             銷售數量
|    C                     Z-ADD0         BONG             單瓶獎金
|    C                     Z-ADD0         QTYH             銷售數量
|    C                     Z-ADD0         BONH             單瓶獎金
|    C                     Z-ADD0         QTYI             銷售數量
|    C                     Z-ADD0         BONI             單瓶獎金
|    C                     Z-ADD0         QTYJ             銷售數量
|    C                     Z-ADD0         BONJ             單瓶獎金
|    C                     Z-ADD0         QTYK             銷售數量
|    C                     Z-ADD0         BONK             單瓶獎金
|    C                     Z-ADD0         QTYL             銷售數量
|    C                     Z-ADD0         BONL             單瓶獎金
|    C*
|    C           EE03      CHAINMA0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELMA03      DMA03     P      產品簡稱
| 01*C                     ELSE
|   C                     MOVEL*BLANK    DMA03            產品簡稱
| 01-C                     ENDIF
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          R7200 ... LEVEL BREAK 2 -- INIT
     C*==============================================================*
03===C           R7200     BEGSR
|    C*
|    C                     SETON                     39
|    C                     Z-ADD0         BONTOT           獎金小計
|    C                     Z-ADD0         QTYAT            數量小計
|    C                     Z-ADD0         BONAT            單瓶獎金小計
|    C                     Z-ADD0         QTYBT            數量小計
|    C                     Z-ADD0         BONBT            單瓶獎金小計
|    C                     Z-ADD0         QTYCT            數量小計
|    C                     Z-ADD0         BONCT            單瓶獎金小計
|    C                     Z-ADD0         QTYDT            數量小計
|    C                     Z-ADD0         BONDT            單瓶獎金小計
|    C                     Z-ADD0         QTYET            數量小計
|    C                     Z-ADD0         BONET            單瓶獎金小計
|    C                     Z-ADD0         QTYFT            數量小計
|    C                     Z-ADD0         BONFT            單瓶獎金小計
|    C                     Z-ADD0         QTYGT            數量小計
|    C                     Z-ADD0         BONGT            單瓶獎金小計
|    C                     Z-ADD0         QTYHT            數量小計
|    C                     Z-ADD0         BONHT            單瓶獎金小計
|    C                     Z-ADD0         QTYIT            數量小計
|    C                     Z-ADD0         BONIT            單瓶獎金小計
|    C                     Z-ADD0         QTYJT            數量小計
|    C                     Z-ADD0         BONJT            單瓶獎金小計
|    C                     Z-ADD0         QTYKT            數量小計
|    C                     Z-ADD0         BONKT            單瓶獎金小計
|    C                     Z-ADD0         QTYLT            數量小計
|    C                     Z-ADD0         BONLT            單瓶獎金小計
|    C*
|    C           EE04      CHAINMB0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELMB03      DMB03     P      供應商簡稱
| 01*C                     ELSE
|   C                     MOVEL*BLANK    DMB03            供應商簡稱
| 01-C                     ENDIF
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... PROCESS
     C*==============================================================*
04===C           R2000     BEGSR
|    C*
| 01-C                     SELEC
|   C           EE02      WHEQ 'B0006'
|   C                     ADD  EE07      QTYA             銷售數量
|   C                     ADD  EE09      BONA             單瓶獎金
|   C                     ADD  EE07      PEE07            銷售總量
|   C           EE02      WHEQ 'B0011'
|   C                     ADD  EE07      QTYB             銷售數量
|   C                     ADD  EE09      BONB             單瓶獎金
|   C                     ADD  EE07      PEE07            銷售總量
|   C           EE02      WHEQ 'B0013'
|   C                     ADD  EE07      QTYC             銷售數量
|   C                     ADD  EE09      BONC             單瓶獎金
|   C                     ADD  EE07      PEE07            銷售總量
|   C           EE02      WHEQ 'B0015'
|   C                     ADD  EE07      QTYD             銷售數量
|   C                     ADD  EE09      BOND             單瓶獎金
|   C                     ADD  EE07      PEE07            銷售總量
|   C           EE02      WHEQ 'B0017'
|   C                     ADD  EE07      QTYE             銷售數量
|   C                     ADD  EE09      BONE             單瓶獎金
|   C                     ADD  EE07      PEE07            銷售總量
|   C           EE02      WHEQ 'B0018'
|   C                     ADD  EE07      QTYF             銷售數量
|   C                     ADD  EE09      BONF             單瓶獎金
|   C                     ADD  EE07      PEE07            銷售總量
|   C           EE02      WHEQ 'B0019'
|   C                     ADD  EE07      QTYG             銷售數量
|   C                     ADD  EE09      BONG             單瓶獎金
|   C                     ADD  EE07      PEE07            銷售總量
|   C           EE02      WHEQ 'B0022'
|   C                     ADD  EE07      QTYH             銷售數量
|   C                     ADD  EE09      BONH             單瓶獎金
|   C                     ADD  EE07      PEE07            銷售總量
|   C           EE02      WHEQ 'B0026'
|   C                     ADD  EE07      QTYI             銷售數量
|   C                     ADD  EE09      BONI             單瓶獎金
|   C                     ADD  EE07      PEE07            銷售總量
|   C           EE02      WHEQ 'B0032'
|   C                     ADD  EE07      QTYJ             銷售數量
|   C                     ADD  EE09      BONJ             單瓶獎金
|   C                     ADD  EE07      PEE07            銷售總量
|   C           EE02      WHEQ 'B0000'
|   C                     ADD  EE07      QTYK             銷售數量
|   C                     ADD  EE09      BONK             單瓶獎金
|   C                     ADD  EE07      PEE07            銷售總量
|   C           EE02      WHEQ 'B1001'
|   C                     ADD  EE07      QTYL             銷售數量
|   C                     ADD  EE09      BONL             單瓶獎金
|   C                     ADD  EE07      PEE07            銷售總量
| 01-C                     ENDSL
|    C*
04===C           E2000     ENDSR
     C*==============================================================*
     C*          R8100 ... LEVEL BREAK 1 -- TOTAL
     C*==============================================================*
05===C           R8100     BEGSR
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
|    C                     WRITEPD1
|    C*
|    C                     ADD  QTYA      QTYAT            數量小計
|    C                     ADD  BONA      BONAT            單瓶獎金小計
|    C                     ADD  QTYB      QTYBT            數量小計
|    C                     ADD  BONB      BONBT            單瓶獎金小計
|    C                     ADD  QTYC      QTYCT            數量小計
|    C                     ADD  BONC      BONCT            單瓶獎金小計
|    C                     ADD  QTYD      QTYDT            數量小計
|    C                     ADD  BOND      BONDT            單瓶獎金小計
|    C                     ADD  QTYE      QTYET            數量小計
|    C                     ADD  BONE      BONET            單瓶獎金小計
|    C                     ADD  QTYF      QTYFT            數量小計
|    C                     ADD  BONF      BONFT            單瓶獎金小計
|    C                     ADD  QTYG      QTYGT            數量小計
|    C                     ADD  BONG      BONGT            單瓶獎金小計
|    C                     ADD  QTYH      QTYHT            數量小計
|    C                     ADD  BONH      BONHT            單瓶獎金小計
|    C                     ADD  QTYI      QTYIT            數量小計
|    C                     ADD  BONI      BONIT            單瓶獎金小計
|    C                     ADD  QTYJ      QTYJT            數量小計
|    C                     ADD  BONJ      BONJT            單瓶獎金小計
|    C                     ADD  QTYK      QTYKT            數量小計
|    C                     ADD  BONK      BONKT            單瓶獎金小計
|    C                     ADD  QTYL      QTYLT            數量小計
|    C                     ADD  BONL      BONLT            單瓶獎金小計
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R8200 ... LEVEL BREAK 2 -- TOTAL
     C*==============================================================*
06===C           R8200     BEGSR
|    C*
|    C                     ADD  BONA      BONTOT           獎金小計
|    C                     ADD  BONB      BONTOT           獎金小計
|    C                     ADD  BONC      BONTOT           獎金小計
|    C                     ADD  BOND      BONTOT           獎金小計
|    C                     ADD  BONE      BONTOT           獎金小計
|    C                     ADD  BONF      BONTOT           獎金小計
|    C                     ADD  BONG      BONTOT           獎金小計
|    C                     ADD  BONH      BONTOT           獎金小計
|    C                     ADD  BONI      BONTOT           獎金小計
|    C                     ADD  BONJ      BONTOT           獎金小計
|    C                     ADD  BONK      BONTOT           獎金小計
|    C                     ADD  BONL      BONTOT           獎金小計
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
|    C                     WRITEPT1
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR -- NO DATA
     C*==============================================================*
07===C           R8999     BEGSR
|    C*
|    C                     EXSR R0100
|    C*
|    C                     WRITEPH1
|    C*
|    C                     WRITEPE9
|    C*
07===C                     ENDSR
     C*==============================================================*
