     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有     TEL:5042266    *
     A*                                                              *
     A* PROGRAM NAME : PIR050                                        *
     A* AUTHER       : YVONNE                                        *
     A* CREATE DATE  : 08/23/21                                      *
     A* UPDATE DATE  :                                               *
     A* SYSTEM       :人頭馬匯東                                   *
     A* SUBSYSTEM    :盤點系統                                     *
     A* REMARK       :年終各倉庫庫存量及金額產生PIR050PF & CSV檔 *
     A****************************************************************
     FIMIYPF  IP  E           K        DISK
     FIMIXPF  IF  E           K        DISK
     FPIR050PFO   E           K        DISK
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*
     I                                      601 6040DIY15
     I                                      601 6020MM
     I                                      603 6040YY
     I                                      615 623 DIY03S
     I                                      624 632 DIY03E
     I                                      640 6430DYYMM
     I                                      640 6410WYY
     I                                      642 6430WMM
     I                                      650 650 COMP
M001AI*(YYYY/MM/DD)
M001AI                                      850 855 YMD8S
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYIX     KLIST
     C                     KFLD           IY15
     C                     KFLD           IY03
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN100                     *READE DETAIL
     C*
     C*==============================================================*
     C*          RTN010....INIT VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....READ
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*讀IMIXPF,FOB-UNIT/FHI-UNIT/DUTY-UNIT/單位成本
|    C           KEYIX     CHAINIX0                  43     年終成本
|    C           *IN43     IFEQ '1'
|    C                     Z-ADD0         IX02
|    C                     Z-ADD0         IX03
|    C                     Z-ADD0         IX04
|    C                     Z-ADD0         IX05
|    C                     ENDIF
|    C*
|    C*WRITE TO EXCEL
|    C                     EXSR RTN101
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN101....WRITE TO EXCEL
     C*==============================================================*
03===C           RTN101    BEGSR
|    C*
|    C                     Z-ADDIY15      F5001            年終年月
|    C                     MOVELIY03      F5002     P      產品代號
|    C                     MOVELIY02      F5004     P      物流點代號
|    C                     Z-ADDIX02      F5006             FOB-UNIT
|    C                     Z-ADDIX03      F5007             FHI-UNIT
|    C                     Z-ADDIX04      F5008             DUTY-UNIT
|    C                     Z-ADDIX05      F5009            單位成本
|    C                     Z-ADDIY06      F5010            庫存量
|    C*          IX05      MULT IY06      F5011     H
|    C*
|    C           IY02      IFEQ 'T9999'
|    C                     Z-ADD0         F5008
|    C           F5006     ADD  F5007     F5009
|    C                     ENDIF
|    C           F5009     MULT F5010     F5011     H
|    C                     WRITEF500
|    C*
03===C                     ENDSR
      *==============================================================*
