     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H* PROGRAM NAME : SAR087                                        *
     H* AUTHER       : DEREK                                         *
     H* CREATE DATE  : 2015/09/24                                    *
     H* UPDATE DATE  :                                               *
     H* SYSTEM       :茂世企業                                     *
     H* SUBSYSTEM    :銷售分析系統                                 *
     H* REMARK       :銷售排行榜                                   *
     H*===============================================================
     H* MODI CODE |   DATE   | DESCRIPTION
     H*---------------------------------------------------------------
     H*---------------------------------------------------------------
     F****************************************************************
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$ADMDY
     I                                      129 1340$ADDMY
     I                                      131 1340$ADMY
     I                                      601 609 SD03S
     I                                      610 618 SD03E
     I                                      619 6260YMDS
     I                                      619 6220YYS
     I                                      623 6240MMS
     I                                      627 6340YMDE
     I            DS
     I                                        1  20 WP03
     I                                        1   4 WP03A
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           PARM1  20
     C                     PARM           PARM2  20
     C           WP03      PARM           PARM3  20
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*==============================================================*
     C*                    DEFINE
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *LIKE     DEFN P3901I    FMY
     C           *LIKE     DEFN P3911O    NEWFMT
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      .INIT SCREEN
     C*
     C                     EXSR R1000                      *PROCESS
     C*
     C                     OUT  LDA
     C*
     C                     SETON                     LR
     C*===============================================================*
     C*          R0100 ... INIT SCREEN
     C*===============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     MOVEL*ZERO     FMY
|    C                     MOVE WP03A     FMY
|    C                     IN   LDA
|    C                     MOVELPARM1     SD03S     P
|    C                     MOVELPARM2     SD03E     P
|    C*INIT OTHER FIELD
|    C                     Z-ADD0         YMDS             期間起
|    C                     Z-ADD0         YMDE             期間迄
|    C*
01===C                     ENDSR
     C*===============================================================*
     C*          R0300 ...轉換月份格式
     C*===============================================================*
02===C           R0300     BEGSR
|    C*
|    C                     CALL 'P39'
|    C                     PARM FMY       P3901I  60       原始月份
|    C                     PARM '3'       P3902I  1        原日期格式
|    C                     PARM '1'       P3903I  1        原曆別
|    C                     PARM '2'       P3904I  1        轉換後格式
|    C                     PARM '1'       P3905I  1        轉換後曆別
|    C           NEWFMT    PARM           P3911O  60       轉換後月份
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          R1000 ... PROCESS
     C*==============================================================*
03===C           R1000     BEGSR
|    C*產品起
| 01-C           SD03S     IFEQ *BLANK
|   C                     MOVEL*LOVAL    SD03S
| 01-C                     ENDIF
|    C*產品迄
| 02-C           SD03E     IFEQ *BLANK
|   C                     MOVEL*HIVAL    SD03E
| 02-C                     ENDIF
|    C*當月送貨日期
| 03-C           FMY       IFEQ 0
|   C                     Z-ADD$ADMY     FMY
| 03-C                     ENDIF
|    C*轉換當月送貨日期格式
|    C                     EXSR R0300
|    C                     MOVELNEWFMT    YMDS
|    C                     MOVELNEWFMT    YMDE
|    C                     MOVE '01'      YMDS
|    C                     MOVE '31'      YMDE
|    C*計算前十一個月日期
|    C                     SUB  11        MMS
| 04-C           MMS       IFLE 0
|   C                     ADD  12        MMS
|   C                     SUB  1         YYS
| 04-C                     END
|    C*
03===C           E1000     ENDSR
