     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H* PROGRAM NAME : SAR0876                                       *
     H* AUTHER       : DEREK                                         *
     H* CREATE DATE  : 2015/09/30                                    *
     H* UPDATE DATE  :                                               *
     H* SYSTEM       :茂世企業                                     *
     H* SUBSYSTEM    :銷售分析系統                                 *
     H* REMARK       :銷售排行榜                                   *
     H*此程式要組出以下之SQL (EXAMPLE)                             *
     H* LABEL ON COLUMN REFLIB/SAR087PF (F8701A IS '08/15');         *
     H*===============================================================
     H* MODI CODE |   DATE   | DESCRIPTION
     H*---------------------------------------------------------------
     H*---------------------------------------------------------------
     F****************************************************************
     FSAR087R O   E           K        DISK
     F            SAR087R                           KRENAMESAR0870
     E*---------------------------------------------------------------*
     E                    @A03       12  6 0             年月
     E*---------------------------------------------------------------*
     I*LDA
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$ADMDY
     I                                      129 1340$ADDMY
     I                                      131 1340$ADMY
     I                                      187 1920$ADYMD
     I                                      601 609 SD03S
     I                                      610 618 SD03E
     I                                      619 6260YMDS
     I                                      619 6220YYS
     I                                      623 6240MMS
     I                                      627 6340YMDE
     I                                      627 6320YME
     I*年月
     I            DS
     I                                        1  720@A03
     I                                        1   60WYM01
     I                                        7  120WYM02
     I                                       13  180WYM03
     I                                       19  240WYM04
     I                                       25  300WYM05
     I                                       31  360WYM06
     I                                       37  420WYM07
     I                                       43  480WYM08
     I                                       49  540WYM09
     I                                       55  600WYM10
     I                                       61  660WYM11
     I                                       67  720WYM12
     I*年月
     I            DS
     I                                        1   60WYM
     I                                        1   40WYY
     I                                        5   60WMM
     I*年月
     I            DS
     I                                        1   6 CYM
     I                                        1   4 CYY
     I                                        3   4 CYYB
     I                                        5   6 CMM
     I*FTP COMMAND
     I              'LABEL ON COLUMN'     C         LABEL
     I              'REFLIB/SAR087PF'     C         FILE
     I              'IS'                  C         IS
     I              '('                   C         PARENL
     I              ')'                   C         PARENR
     I              ''''                  C         SINGLE
     I              ';'                   C         BRANCH
     I              '/'                   C         SLASH
     I              '庫存量'            C         STOCK
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*==============================================================*
     C*                    DEFINE
     C*==============================================================*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      .INIT
     C*
     C                     EXSR R1000                      .PROCESS
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ... INITIAL
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     Z-ADD$ADYMD    SRCDAT           SOURCE DATE
|    C                     Z-ADD0         SRCSEQ           SOURCE SEQUENCE
|    C                     Z-ADD0         @A03             年月
|    C                     MOVEL*BLANK    CYM     6        年月
|    C*計算畫面輸入之年月前十一個月
|    C                     Z-ADDYME       WYM
|    C                     Z-ADD12        X       20
| 01-C                     DO   12
|   C                     Z-ADDWYM       @A03,X
|   C                     SUB  1         X
|   C                     SUB  1         WMM
| 02-C           WMM       IFEQ 0
|   C                     Z-ADD12        WMM
|   C                     SUB  1         WYY
| 02-C                     ENDIF
| 01-C                     ENDDO
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ... PROCESS
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8701A':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,1    CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8701B':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,1    CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8702A':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,2    CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8702B':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,2    CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8703A':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,3    CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8703B':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,3    CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8704A':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,4    CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8704B':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,4    CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8705A':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,5    CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8705B':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,5    CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8706A':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,6    CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8706B':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,6    CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8707A':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,7    CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8707B':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,7    CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8708A':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,8    CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8708B':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,8    CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8709A':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,9    CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8709B':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,9    CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8710A':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,10   CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8710B':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,10   CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8711A':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,11   CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8711B':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,11   CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8712A':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,12   CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8712B':0SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,12   CYM       P
|    C                     EXSR R1300
|    C                     WRITESAR0870
|    C*
|    C                     EXSR R1100
|    C           SRCDTA    CAT  'F8714':0 SRCDTA    P
|    C                     EXSR R1200
|    C                     MOVE @A03,12   CYM       P
|    C                     EXSR R1301
|    C                     WRITESAR0870
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1100 ... LABEL ON
     C*==============================================================*
03===C           R1100     BEGSR
|    C*
|    C                     ADD  1         SRCSEQ
|    C           LABEL     CAT  FILE:1    SRCDTA    P
|    C           SRCDTA    CAT  PARENL:1  SRCDTA    P
|    C*
03===C           E1100     ENDSR
     C*==============================================================*
     C*          R1200 ... IS
     C*==============================================================*
04===C           R1200     BEGSR
|    C*
|    C           SRCDTA    CAT  IS:1      SRCDTA    P
|    C           SRCDTA    CAT  SINGLE:1  SRCDTA    P
|    C*
04===C           E1200     ENDSR
     C*==============================================================*
     C*          R1300 ... FIELD NAME
     C*==============================================================*
05===C           R1300     BEGSR
|    C*
|    C           SRCDTA    CAT  CMM:0     SRCDTA    P
|    C           SRCDTA    CAT  SLASH:0   SRCDTA    P
|    C           SRCDTA    CAT  CYYB:0    SRCDTA    P
|    C           SRCDTA    CAT  SINGLE:0  SRCDTA    P
|    C           SRCDTA    CAT  PARENR:0  SRCDTA    P
|    C           SRCDTA    CAT  BRANCH:0  SRCDTA    P
|    C*
05===C           E1300     ENDSR
     C*==============================================================*
     C*          R1301 ... FIELD NAME WITH庫存量
     C*==============================================================*
06===C           R1301     BEGSR
|    C*
|    C           SRCDTA    CAT  CMM:0     SRCDTA    P
|    C           SRCDTA    CAT  SLASH:0   SRCDTA    P
|    C           SRCDTA    CAT  CYYB:0    SRCDTA    P
|    C           SRCDTA    CAT  STOCK:0   SRCDTA    P
|    C           SRCDTA    CAT  SINGLE:0  SRCDTA    P
|    C           SRCDTA    CAT  PARENR:0  SRCDTA    P
|    C           SRCDTA    CAT  BRANCH:0  SRCDTA    P
|    C*
06===C           E1301     ENDSR
