      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SOR1803                                       *
      * AUTHER       : KEVINH                                        *
      * CREATE DATE  : 112/06/06                                     *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                           *
      * SUBSYSTEM    :銷售訂單系統                                 *
      * REMARK       :業務銷售報表(寫入SOR180F)                  *
      *需求單號:1120360                                            *
      ****************************************************************
     FMTMCPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FSOR180F O   E           K        DISK
     FSOR180WFIP  E           K        DISK
     IWF0
     I                                              WF01  L1
     I                                              WF02  L1
     I                                              WF04  L1
     I                                              WF03  L1
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     初始化
     C   L1                EXSR RTN100                      F01-F07
     C                     EXSR RTN200                     計算F08-F11
     CL1 10                EXSR RTN300                      WRITE SOR180F
      *==============================================================*
      *          RTN010....初始化
      *==============================================================*
01===C           RTN010    BEGSR
|     *
|    C                     SETON                     10
|    C                     CLEARF0
|    C                     Z-ADD0         QTY1    70
|    C                     Z-ADD0         QTY2    70
|    C                     Z-ADD0         SAL1   110
|    C                     Z-ADD0         COST   132
|     *
01===C                     ENDSR
      *==============================================================*
      *          RTN100.... F01-F07
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     MOVELWF01      F01       P
|    C*
|    C           F01       CHAINMC0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELMC02      F02       P
| 01*C                     ELSE
|   C                     MOVEL*BLANK    F02
| 01-C                     ENDIF
|    C*
|    C                     MOVELWF02      F03       P
|    C                     MOVELWF03      F04       P
|    C*
|    C           F04       CHAINME0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVELME04      F05       P
| 02*C                     ELSE
|   C                     MOVEL*BLANK    F05
| 02-C                     ENDIF
|    C*
|    C                     MOVELWF04      F06       P
|    C*
|    C           F06       CHAINMA0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     MOVELMA02      F07       P
| 03*C                     ELSE
|   C                     MOVEL*BLANK    F07
| 03-C                     ENDIF
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....計算F08-F11
      *==============================================================*
03===C           RTN200    BEGSR
|     *
|    C                     ADD  WF05      QTY1
|    C                     SUB  WF09      QTY1
|    C*
|    C                     ADD  WF06      QTY2
|    C                     SUB  WF10      QTY2
|     *
|    C                     ADD  WF07      SAL1
|    C                     SUB  WF11      SAL1
|     *
|    C                     ADD  WF08      COST
|    C                     SUB  WF12      COST
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN300.... WRITE SOR180F
      *==============================================================*
04===C           RTN300    BEGSR
|    C*
|    C                     Z-ADDQTY1      F08
|    C                     Z-ADDQTY2      F09
|    C                     Z-ADDSAL1      F10
|    C                     Z-ADDCOST      F11
|    C                     WRITEF0
|    C*
|    C                     Z-ADD0         QTY1
|    C                     Z-ADD0         QTY2
|    C                     Z-ADD0         SAL1
|    C                     Z-ADD0         COST
|    C*
04===C                     ENDSR
