      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SOR1801                                       *
      * AUTHER       : KEVIN                                         *
      * CREATE DATE  : 112/06/06                                     *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                           *
      * SUBSYSTEM    :銷售訂單系統                                 *
      * REMARK       :業務銷售報表(寫入銷貨資料)                 *
      *需求單號:1120360                                            *
      ****************************************************************
     FSOSCPF  IP  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FSOR180WFO   E                    DISK
     E*
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     *初始化
     C*
     C                     EXSR RTN100                     *WRITE DETAIL
      *==============================================================*
      *          RTN010....初始化
      *==============================================================*
01===C           RTN010    BEGSR
|     *
|    C                     SETON                     10
|    C                     CLEARWF0
|    C*
|    C*COST=SD22+SD23+SD24 QTY=SD04+SD05  TOT=COST*QTY
|    C*
|    C                     Z-ADD0         COST    92
|    C                     Z-ADD0         QTY     50
|    C                     Z-ADD0         TOT    112
|     *
01===C                     ENDSR
      *==============================================================*
      *          RTN100....WRITE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C           SC02      SETLLSD0
|    C           SC02      READESD0                      46
| 01-C           *IN46     DOWEQ'0'
|   C*
|   C                     MOVELSC27      WF01      P
|   C*
|   C           SD03      CHAINMA0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVELMA10      WF02      P
| 02*C                     ELSE
|   C                     MOVEL*BLANK    WF02
| 02-C                     ENDIF
|   C*
|   C                     MOVELSC04      WF03      P
|   C                     MOVELSD03      WF04      P
|   C                     Z-ADDSD04      WF05
|   C                     Z-ADDSD05      WF06
|   C                     Z-ADDSD07      WF07
|   C*
|   C           SD22      ADD  SD23      COST
|   C                     ADD  SD24      COST
|   C           SD04      ADD  SD05      QTY
|   C           COST      MULT QTY       TOT
|   C                     Z-ADDTOT       WF08
|   C*
|   C                     Z-ADD0         WF09
|   C                     Z-ADD0         WF10
|   C                     Z-ADD0         WF11
|   C                     Z-ADD0         WF12
|   C                     WRITEWF0
|   C*
|   C           SC02      READESD0                      46
|   C*
| 01-C                     ENDDO
|    C*
02===C                     ENDSR
