      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SOR1902                                       *
      * AUTHER       : KEVIN                                         *
      * CREATE DATE  : 112/07/19                                     *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                           *
      * SUBSYSTEM    :銷售訂單系統                                 *
      * REMARK       :不列印發票客戶銷售報表(寫入資料-確認日期)*
      *需求單號    : 1120456                                       *
      ****************************************************************
     FSOSCPF  IP  E           K        DISK
     FMTMDPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FSOSIPF  IF  E           K        DISK
     FSOR190F2O   E                    DISK
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYMD     KLIST                           *MTMDPF
     C                     KFLD           SC04
     C*
     C           KEYME     KLIST                           *MTMEPF
     C                     KFLD           SC04
     C                     KFLD           SC05
     C*
     C           KEYSI     KLIST                           *SOSIPF
     C                     KFLD           SC01
     C                     KFLD           SC30
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN100                     *WRITE DETAIL
      *==============================================================*
      *          RTN100....WRITE DETAIL
      *==============================================================*
01===C           RTN100    BEGSR
|    C*
|    C           KEYSI     CHAINSI0                  40
|    C*
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELSC04      F01       P
|   C           KEYME     CHAINME0                  40
|   C  N40                MOVELME04      F02       P
|   C   40                MOVEL*BLANK    F02
|   C                     Z-ADDSC39      F03
|   C                     MOVELSC30      F04       P
|   C                     MOVELSC06      F05       P
|   C                     Z-ADDSI23      F06
|   C                     Z-ADDSI24      F07
|   C                     Z-ADDSI25      F08
|   C           KEYMD     CHAINMD0                  40
|   C  N40                MOVELMD17      F09       P
|   C   40                MOVEL*BLANK    F09       P
|   C                     Z-ADDSC08      F10
|   C*
|   C                     WRITEF0
|   C*
| 01-C                     ENDIF
|    C*
01===C                     ENDSR
