      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR1703                                       *
      * AUTHER       : CAROL                                         *
      * CREATE DATE  : 108/10/28                                     *
      * UPDATE DATE  :                                               *
      * SYSTEM       :茂世進銷存系統                               *
      * SUBSYSTEM    :銷售系統                                     *
      * REMARK       :寄賣客戶產品異動報表                         *
     /*=============================================================*/
     /*  CODE       AUTHOR.     DATE    DESCRIPTION
     /*-------------------------------------------------------------
     /*=============================================================*/
      ****************************************************************
     FSOSOPF  IF  E           K        DISK
     FSOSNPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FSOR170F UF  E           K        DISK                      A
     FSOR170W O   E           K        DISK
      *==============================================================*
     E                    ARY        30  8 0
      *==============================================================*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      135 135 $ADD
     I*客戶代號
     I                                      601 605 DSE04
     I*分店代號
     I                                      610 613 DSE05
     I*送／退貨年月
     I                                      630 6330DSE06
     I                                      630 6310MM
     I                                      632 6330YY
     I                                      635 6420DSE06S
     I                                      645 6520DSE06E
     I*確認年月
     I                                      660 6630DSE24
     I                                      660 6610MM2
     I                                      662 6630YY2
     I                                      665 6720DSE24S
     I                                      675 6820DSE24E
     I*
     I                                      690 6930DYYMM
     I                                      690 6910WYY
     I                                      692 6930WMM
     I                                      700 7050YMD
     I*
     I                                      750 750 IN20
     I*
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           SN03
     C                     KFLD           SN11
     C           KEYWF     KLIST
     C                     KFLD           SN03
     C                     KFLD           SN11
     C                     KFLD           SO03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     MOVE *BLANKS   ARY
     C                     Z-ADD1         X       30       *目前元素
     C                     Z-ADD0         Y       30       *已寫入至
     C                     READ SN0                      45
  01-C           *IN45     DOWEQ'0'
    C           SN02      SETLLSO0
    C           SN02      READESO0                      55
  02-C           *IN55     DOWEQ'0'
    C           SO03      CHAINMA0                  40
  03-C           *IN40     IFEQ '0'
     C           MA55      ANDEQ'Y'
     C*LOKUP ARY
    C                     EXSR DTL100
    C*WRITE PRODUCT
    C                     EXSR DTL300
    C*
  03-C                     END
    C           SN02      READESO0                      55
  02-C                     END
    C                     READ SN0                      45
  01-C                     END
     C*
     C                     SETON                     LR
     C*================================================================
     C*          DTL100....SELECT DETAIL TO WORKFILE
     C*================================================================
     C           DTL100    BEGSR
     C*
     C           SN06      LOKUPARY,X                    10
  01-C           *IN10     IFEQ '0'                        *NOT FOUND
    C                     ADD  1         Y
    C                     Z-ADDSN06      ARY,Y
    C                     Z-ADDY         X
    C*WRITE DATE
  02-C           X         IFEQ Y
    C                     EXSR DTL200
  02-C                     END
  01-C                     END
     C*
     C                     ENDSR
     C*================================================================
     C*          DTL200....SELECT DETAIL TO WORKFILE
     C*================================================================
     C           DTL200    BEGSR
     C*
     C                     Z-ADD500       Z       30
     C                     ADD  Y         Z
     C                     Z-ADDZ         WK01
     C                     Z-ADDARY,Y     WK02
     C                     WRITEWK0
     C*
     C                     ENDSR
     C*================================================================
     C*          DTL300....SELECT DETAIL TO WORKFILE
     C*================================================================
     C           DTL300    BEGSR
     C*INIT
     C                     Z-ADD0         WF001
     C                     Z-ADD0         WF002
     C                     Z-ADD0         WF003
     C                     Z-ADD0         WF004
     C                     Z-ADD0         WF005
     C                     Z-ADD0         WF006
     C                     Z-ADD0         WF007
     C                     Z-ADD0         WF008
     C                     Z-ADD0         WF009
     C                     Z-ADD0         WF010
     C                     Z-ADD0         WF011
     C                     Z-ADD0         WF012
     C                     Z-ADD0         WF013
     C                     Z-ADD0         WF014
     C                     Z-ADD0         WF015
     C                     Z-ADD0         WF016
     C                     Z-ADD0         WF017
     C                     Z-ADD0         WF018
     C                     Z-ADD0         WF019
     C                     Z-ADD0         WF020
     C                     Z-ADD0         WF501
     C                     Z-ADD0         WF502
     C                     Z-ADD0         WF503
     C                     Z-ADD0         WF504
     C                     Z-ADD0         WF505
     C                     Z-ADD0         WF506
     C                     Z-ADD0         WF507
     C                     Z-ADD0         WF508
     C                     Z-ADD0         WF509
     C                     Z-ADD0         WF510
     C                     Z-ADD0         WF511
     C                     Z-ADD0         WF512
     C                     Z-ADD0         WF513
     C                     Z-ADD0         WF514
     C                     Z-ADD0         WF515
     C                     Z-ADD0         WF516
     C                     Z-ADD0         WF517
     C                     Z-ADD0         WF518
     C                     Z-ADD0         WF519
     C                     Z-ADD0         WF520
     C                     Z-ADD0         WF000
     C           KEYWF     CHAINWF0                  41
     C           *IN41     IFEQ '1'                        *NOT FOUND
     C                     MOVELSN03      WF01
     C                     MOVELSN11      WF02
     C                     MOVELSO03      WF04
     C*
     C           KEYME     CHAINME0                  42
     C  N42                MOVELME04      WF03
     C   42                MOVEL*BLANK    WF03
     C*
     C           SO03      CHAINMA0                  43
     C  N43                MOVELMA03      WF05
     C   43                MOVEL*BLANK    WF05
     C*
     C                     SELEC
     C           X         WHEQ 1
     C                     Z-ADDSO04      WF501
     C           X         WHEQ 2
     C                     Z-ADDSO04      WF502
     C           X         WHEQ 3
     C                     Z-ADDSO04      WF503
     C           X         WHEQ 4
     C                     Z-ADDSO04      WF504
     C           X         WHEQ 5
     C                     Z-ADDSO04      WF505
     C           X         WHEQ 6
     C                     Z-ADDSO04      WF506
     C           X         WHEQ 7
     C                     Z-ADDSO04      WF507
     C           X         WHEQ 8
     C                     Z-ADDSO04      WF508
     C           X         WHEQ 9
     C                     Z-ADDSO04      WF509
     C           X         WHEQ 10
     C                     Z-ADDSO04      WF510
     C           X         WHEQ 11
     C                     Z-ADDSO04      WF511
     C           X         WHEQ 12
     C                     Z-ADDSO04      WF512
     C           X         WHEQ 13
     C                     Z-ADDSO04      WF513
     C           X         WHEQ 14
     C                     Z-ADDSO04      WF514
     C           X         WHEQ 15
     C                     Z-ADDSO04      WF515
     C           X         WHEQ 16
     C                     Z-ADDSO04      WF516
     C           X         WHEQ 17
     C                     Z-ADDSO04      WF517
     C           X         WHEQ 18
     C                     Z-ADDSO04      WF518
     C           X         WHEQ 19
     C                     Z-ADDSO04      WF519
     C           X         WHEQ 20
     C                     Z-ADDSO04      WF520
     C                     ENDSL
     C                     SUB  SO04      WF000
     C*
     C                     WRITEWF0
     C                     ELSE
     C*
     C                     SELEC
     C           X         WHEQ 1
     C                     ADD  SO04      WF501
     C           X         WHEQ 2
     C                     ADD  SO04      WF502
     C           X         WHEQ 3
     C                     ADD  SO04      WF503
     C           X         WHEQ 4
     C                     ADD  SO04      WF504
     C           X         WHEQ 5
     C                     ADD  SO04      WF505
     C           X         WHEQ 6
     C                     ADD  SO04      WF506
     C           X         WHEQ 7
     C                     ADD  SO04      WF507
     C           X         WHEQ 8
     C                     ADD  SO04      WF508
     C           X         WHEQ 9
     C                     ADD  SO04      WF509
     C           X         WHEQ 10
     C                     ADD  SO04      WF510
     C           X         WHEQ 11
     C                     ADD  SO04      WF511
     C           X         WHEQ 12
     C                     ADD  SO04      WF512
     C           X         WHEQ 13
     C                     ADD  SO04      WF513
     C           X         WHEQ 14
     C                     ADD  SO04      WF514
     C           X         WHEQ 15
     C                     ADD  SO04      WF515
     C           X         WHEQ 16
     C                     ADD  SO04      WF516
     C           X         WHEQ 17
     C                     ADD  SO04      WF517
     C           X         WHEQ 18
     C                     ADD  SO04      WF518
     C           X         WHEQ 19
     C                     ADD  SO04      WF519
     C           X         WHEQ 20
     C                     ADD  SO04      WF520
     C                     ENDSL
     C                     SUB  SO04      WF000
     C*
     C                     UPDATWF0
     C                     END
     C*
     C                     ENDSR
