      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR1704                                       *
      * AUTHER       : CAROL                                         *
      * CREATE DATE  : 108/10/28                                     *
      * UPDATE DATE  :                                               *
      * SYSTEM       :茂世進銷存系統                               *
      * SUBSYSTEM    :銷售系統                                     *
      * REMARK       :寄賣客戶產品異動報表                         *
     /*=============================================================*/
     /*  CODE       AUTHOR.     DATE    DESCRIPTION
     /*-------------------------------------------------------------
     /*=============================================================*/
      ****************************************************************
     FSOR170W IF  E           K        DISK
     FSQLCMD  O   E           K        DISK
     F            SQLCMD                            KRENAMESQLCMDX
      *==============================================================*
     I            DS
     I                                        1   30WK01
     I                                        1   3 WK01A
     I                                       10  170WK02
     I                                       10  17 WK02A
     I              'LABEL ON COLUMN'     C         LABEL
     I              'QTEMP/SOR170F ('     C         FILE
     I              'TEXT IS'             C         IS
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     Z-ADD0         SRCDAT
     C                     Z-ADD0         SRCSEQ
     C                     MOVEL'WF'      A       2
     C                     MOVEL'送貨'  B      12
     C                     MOVE '日期'  B
     C                     MOVEL'收回'  C      12
     C                     MOVE '日期'  C
     C                     READ WK0                      45
  01-C           *IN45     DOWEQ'0'
    C                     ADD  1         SRCSEQ
    C           WK01      IFLT 501
    C           LABEL     CAT  FILE:1    SRCDTA    P
  02-C           SRCDTA    CAT  A:0       SRCDTA    P
    C           SRCDTA    CAT  WK01A:0   SRCDTA    P
    C           SRCDTA    CAT  IS:1      SRCDTA    P
  03-C           SRCDTA    CAT  '''':1    SRCDTA    P
     C           SRCDTA    CAT  B:0       SRCDTA    P
    C           SRCDTA    CAT  WK02A:1   SRCDTA    P
  05-C           SRCDTA    CAT  ''');':1  SRCDTA    P
     C                     ELSE
    C           LABEL     CAT  FILE:1    SRCDTA    P
  02-C           SRCDTA    CAT  A:0       SRCDTA    P
    C           SRCDTA    CAT  WK01A:0   SRCDTA    P
    C           SRCDTA    CAT  IS:1      SRCDTA    P
  03-C           SRCDTA    CAT  '''':1    SRCDTA    P
     C           SRCDTA    CAT  C:0       SRCDTA    P
    C           SRCDTA    CAT  WK02A:1   SRCDTA    P
  05-C           SRCDTA    CAT  ''');':1  SRCDTA    P
  02-C                     END
     C                     WRITESQLCMDX
     C                     READ WK0                      45
  01-C                     END
     C*
     C                     SETON                     LR
     C*================================================================
