      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SOR2001                                       *
      * AUTHER       : CLEMENT                                       *
      * CREATE DATE  : 112/07/19                                     *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                           *
      * SUBSYSTEM    :銷售訂單系統                                 *
      * REMARK       :寄賣客戶出貨報表(寫入出貨資料)             *
      *需求單號:1120457                                            *
      ****************************************************************
     FSOSEPF  IP  E           K        DISK
     FSOSFPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FSOR200F O   E                    DISK
     E*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           SE04
     C                     KFLD           SE05
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     *初始化
     C*
     C                     EXSR RTN100                     *WRITE DETAIL
      *==============================================================*
      *          RTN010....初始化
      *==============================================================*
01===C           RTN010    BEGSR
|     *
|    C                     SETON                     10
|    C                     CLEARF0
|    C*
|    C* QTY=SF04+SF05
|    C*
|    C                     Z-ADD0         QTY     50
|     *
01===C                     ENDSR
      *==============================================================*
      *          RTN100....WRITE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C           SE02      SETLLSF0
|    C           SE02      READESF0                      46
| 01-C           *IN46     DOWEQ'0'
|   C*
|   C                     MOVELSE04      F01       P
|   C*
|   C           KEYME     CHAINME0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVELME04      F02       P
| 02*C                     ELSE
|   C                     MOVEL*BLANK    F02
| 02-C                     ENDIF
|   C*
|   C                     MOVELSF03      F03       P
     C           SF03      CHAINMA0                  40
     C           *IN40     IFEQ '0'
|   C                     MOVELMA02      F04       P
|    C                     ELSE
|   C                     MOVEL*BLANK    F04
|    C                     ENDIF
     C*
|   C                     Z-ADDSE06      F05
|   C*
|   C           SF04      ADD  SF05      QTY
|   C                     Z-ADDQTY       F06
|   C*
     C                     Z-ADDSE24      F07
|   C                     WRITEF0
|   C*
|   C           SE02      READESF0                      46
|   C*
| 01-C                     ENDDO
|    C*
02===C                     ENDSR
