     FSOSGPF  IP  E           K        DISK
     FSOSJLF01IF  E           K        DISK
     FARAGPF  IF  E           K        DISK
     FZ002F1  O   E           K        DISK
     C*===============================================================*
     C*                    DEFINE
     C*===============================================================*
     C           *LIKE     DEFN SJ04      DSJ04A
     C           *LIKE     DEFN SJ05      DSJ06A
     C           *LIKE     DEFN SJ06      DSJ06B
     C*===============================================================*
     C*                    KEY LIST
     C*===============================================================*
     C           KEYSJ     KLIST
     C                     KFLD           SG01
     C                     KFLD           SG04
     C                     KFLD           AG03
     C                     KFLD           AG04
     C*===============================================================*
     C*                    MAIN
     C*===============================================================*
     C           SG09      SETLLAG0
     C           SG09      READEAG0                      46
     C           *IN46     DOWEQ'0'
     C*SOSJPF
     C           KEYSJ     CHAINSJ0                  40
     C           *IN40     IFEQ '0'
     C           SJ04      SUB  SJ13      DSJ04A
     C           SJ06      SUB  SJ07      DSJ06B    H
     C           SJ05      SUB  AG06      AG06A  112       *牌－售
     C           DSJ04A    MULT AG06A     AG06A     H      *折扣
     C           DSJ04A    IFNE 0
     C           DSJ06B    DIV  DSJ04A    DSJ06A
     C                     ELSE
     C                     Z-ADD0         DSJ06A
     C                     ENDIF
     C                     ELSE
     C                     Z-ADD0         DSJ06A
     C                     ENDIF
     C*
     C           AG06A     IFNE SJ071
     C           AG13      ANDNE0
     C***********DSJ06A    IFNE AG06
     C***********AG13      ANDNE0
     C                     EXSR R1000
     C                     END
     C*
     C           SG09      READEAG0                      46
     C                     END
     C*===============================================================*
     C*          R1000 ... WRITE Z002F1
     C*===============================================================*
     C           R1000     BEGSR
     C*
     C                     MOVELSG01      WF01      P      公司別
     C                     MOVELSG02      WF02      P      退貨單號
     C                     MOVELSG04      WF03      P      客戶代號
     C                     MOVELSG05      WF04      P      分店代號
     C                     Z-ADDSG06      WF05             退貨日期
     C                     MOVELSG09      WF06      P      折讓單號
     C                     Z-ADDSG26      WF07             折讓日期
     C                     MOVELAG04      WF08      P      發票號碼
     C                     Z-ADDAG06      WF09             銷退單價
     C                     Z-ADDDSJ06A    WF10             銷售單價
     C*
     C                     WRITEWF0
     C*
     C                     ENDSR
