     FZ003F   UP  E                    DISK
     FMTMEPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     C*===============================================================*
     C*                    KEY LIST
     C*===============================================================*
     C           KEYME     KLIST
     C                     KFLD           WF02             客戶代號
     C                     KFLD           WF03             分店代號
     C*===============================================================*
     C*                    MAIN
     C*===============================================================*
     C           KEYME     CHAINME0                  40
     C           *IN40     IFEQ '0'
     C           ME15      CHAINMC0                  41
     C           *IN41     IFEQ '0'
     C                     MOVELMC01      WF09      P      業務代號
     C                     MOVELMC02      WF10      P      業務姓名
     C                     ELSE
     C                     MOVEL*BLANK    WF09             業務代號
     C                     MOVEL*BLANK    WF10             業務姓名
     C                     END
     C                     ELSE
     C                     MOVEL*BLANK    WF09             業務代號
     C                     MOVEL*BLANK    WF10             業務姓名
     C                     END
     C*
     C                     UPDATWF0
