     FZ004F   UP  E                    DISK
     FMTMALF@7IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     E*---------------------------------------------------------------*
     I*產品編號
     I            DS
     I                                        1   9 WF06
     I                                        1   7 WF06A
     I*英文全稱
     I            DS
     I                                        1  60 MA045@
     I                                        1  30 MA04
     I                                       31  60 MA05
     C*===============================================================*
     C*                    KEY LIST
     C*===============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01             代碼欄位
     C                     KFLD           #A02             代碼內容
     C*===============================================================*
     C*                    MAIN
     C*===============================================================*
     C           WF06A     CHAINMA0@7                40
     C           *IN40     IFEQ '0'
     C                     MOVELMA02      WF07      P      中文全稱
     C                     MOVELMA03      WF08      P      中文簡稱
     C                     MOVELMA045@    WF09      P      英文全稱
     C                     MOVELMA06      WF10      P      英文簡稱
     C                     MOVEL'BRAND'   #A01      P
     C                     MOVELWF04      #A02      P
     C           KEY#A     CHAIN#A0                  40
     C           *IN40     IFEQ '0'
     C                     MOVEL#A03      WF05      P      品牌說明
     C                     ELSE
     C                     MOVEL*BLANK    WF05             品牌說明
     C                     ENDIF
     C                     ENDIF
     C*
     C                     UPDATWF0
