     FZ005F   IP  E           K        DISK
     FIMIXPF  UF  E           K        DISK
     FIMI1PF  UF  E           K        DISK
     F            IX0                               KRENAMEIXX
     E*---------------------------------------------------------------*
     C*===============================================================*
     C*                    KEY LIST
     C*===============================================================*
     C           KEYIX     KLIST
     C                     KFLD           IX11             年終年月
     C                     KFLD           WF01             產品代號
     C*===============================================================*
     C*                    MAIN
     C*===============================================================*
     C           WF06A     CHAINMA0@7                40
     C           *IN40     IFEQ '0'
     C                     MOVELMA02      WF07      P      中文全稱
     C                     MOVELMA03      WF08      P      中文簡稱
     C                     MOVELMA045@    WF09      P      英文全稱
     C                     MOVELMA06      WF10      P      英文簡稱
     C                     MOVEL'BRAND'   #A01      P
     C                     MOVELWF04      #A02      P
     C           KEY#A     CHAIN#A0                  40
     C           *IN40     IFEQ '0'
     C                     MOVEL#A03      WF05      P      品牌說明
     C                     ELSE
     C                     MOVEL*BLANK    WF05             品牌說明
     C                     ENDIF
     C                     ENDIF
     C*
     C                     UPDATWF0
