     FZEB001F UP  E                    DISK
     C*===============================================================*
     C*                    MAIN
     C*===============================================================*
     C                     CALL 'ZEB001'
     C                     PARM WF06      PARM01 10
     C           WF15      PARM '0000'    PARM02  4
     C*
     C                     UPDATWF0
