     FMTMAPF  IF  E           K        DISK
     FMTMALF@4IF  E           K        DISK
     FMTMALF@7IF  E           K        DISK
     I            DS
     I                                        1   9 ITEM
     I                                        1   4 ITEM04
     I                                        1   7 ITEM07
     C*===============================================================*
     C*                    PARAMETER
     C*===============================================================*
     C           *ENTRY    PLIST
     C           ITEM      PARM           PARM01 10
     C                     PARM           PARM02  4
     C*===============================================================*
     C*                    MAIN
     C*===============================================================*
     C                     MOVEL*ALL'0'   PARM02
     C*
     C           ITEM      CHAINMA0                  40
     C           *IN40     IFEQ '0'
     C                     MOVE MA15      PARM02
     C                     GOTO ENDPGM
     C                     END
     C*
     C           ITEM07    CHAINMA0@7                40
     C           *IN40     IFEQ '0'
     C                     MOVE MA15      PARM02
     C                     GOTO ENDPGM
     C                     END
     C*
     C           ITEM04    CHAINMA0@4                40
     C           *IN40     IFEQ '0'
     C                     MOVE MA15      PARM02
     C                     GOTO ENDPGM
     C                     END
     C*
     C           ENDPGM    TAG
     C                     SETON                     LR
