     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : RES014                                     *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    DATE WRITTEN : 81/03/09                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :共用資料維護子系統                        *
     A*    PROCEDURE    :發票號碼採番                              *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.10.28 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M002      | 13.12.17 | DAISY |電子發票判斷
     A****************************************************************
     E*: 字軌英文字母FUNCTION DATA1:
     E                    WFUN1  26  26  1
     E*: 字軌（英文字母）數字FUNCTION DATA2:
     E                    WFUN2  26  26  2 0
     I            DS
     I                                        1   20WT
     I                                        2   20WT01
     I            DS
     I                                        1   4 WO2
     I                                        1   1 P
     I                                        2   20M1
     I                                        3   30M2
     I                                        4   40M3
     I            DS
     I                                        1   2 WKA04
     I                                        1   1 X1
     I                                        2   2 X2
     I            DS
     I                                        1   80WKA07
     I                                        1   10N1
     I                                        3   30N3
     I                                        5   50N5
     I                                        8   80N8
     IS014O1      DS
     I                                        1   2 WAA04
     I                                        3  100WAA07
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           S014O1 10        發票號碼
     C                     PARM           S014O2  4        檢查號碼
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
    C                     MOVE WAA04     WKA04
    C                     Z-ADDWAA07     WKA07
    C                     EXSR RTN100
     C                     SETON                     LR
      *==============================================================*
      *          RTN100....GET 檢查號碼
      *==============================================================*
01===C           RTN100    BEGSR
|    C* GET  X1
|    C                     Z-ADD0         ID      20
| 06-C           ID        DOWLT26
|   C                     ADD  1         ID
| 07-C           X1        IFEQ WFUN1,ID
|   C                     Z-ADDWFUN2,ID  XXN1    20
|   C                     Z-ADD99        ID
| 07-C                     END
| 06-C                     END
|    C* GET  X2
|    C                     Z-ADD0         ID
| 08-C           ID        DOWLT26
|   C                     ADD  1         ID
| 09-C           X2        IFEQ WFUN1,ID
|   C                     Z-ADDWFUN2,ID  XXN2    20
|   C                     Z-ADD99        ID
| 09-C                     END
| 08-C                     END
|    C* GET Y1
|    C                     ADD  XXN1      XXN2
|    C           XXN2      DIV  2         Y1      20
|    C                     MOVE WFUN1,Y1  P
|    C* GET  M1/M2/M3
|    C           10        SUB  N1        N1
|    C           N1        ADD  N8        WT
|    C                     Z-ADDWT01      M1
|    C*
|    C           10        SUB  N3        N1
|    C           N1        ADD  N8        WT
|    C                     Z-ADDWT01      M2
|    C*
|    C           10        SUB  N5        N1
|    C           N1        ADD  N8        WT
|    C                     Z-ADDWT01      M3
|    C*
|    C                     MOVE WO2       S014O2
|    C*
01===C                     ENDSR
     C*==============================================================*
**
ABCDEFGHIJKLMNOPQRSTUVWXYZ
**
0102030405060708091011121314151617181920212223242526
