     FZSOSIPF UP  E           K        DISK
     C           ZSI07     IFEQ *BLANK
     C                     CALL 'ZRES014'
     C                     PARM ZSI02     S014O1 10        發票號碼
     C           ZSI07     PARM           S014O2  4        檢查號碼
     C                     UPDATZSI0
     C                     ENDIF
