     FZSOSIPF IP  E           K        DISK
     FSOSILF13UF  E           K        DISK
     C           KEYSI     KLIST
     C                     KFLD           ZSI01            公司別
     C                     KFLD           ZSI10            訂單編號
     C                     KFLD           ZSI11            送貨單號
     C           KEYSI     CHAINSI0                  40
     C           *IN40     IFEQ '0'
     C                     MOVELZSI02     SI02      P      發票號碼
     C                     MOVELZSI36     SI36      P      發票類別
     C                     UPDATSI0
     C                     END
