     FZSOSEPF IP  E           K        DISK
     FSOSEPF  UF  E           K        DISK
     C           ZSE02     CHAINSE0                  40
     C           *IN40     IFEQ '0'
     C                     MOVELZSE30     SE30      P      µo²¼¸¹½X
     C                     UPDATSE0
     C                     END
