     FZSOSIPF IP  E           K        DISK
     FSOSIPF  UF  E           K        DISK
     C           KEYSI     KLIST
     C                     KFLD           ZSI01            公司別
     C                     KFLD           ZSI02            發票號碼
     C           KEYSI     CHAINSI0                  40
     C           *IN40     IFEQ '0'
     C                     MOVELZSI07     SI07      P      檢查號碼
     C                     UPDATSI0
     C                     END
