     FZSOSCPF IP  E           K        DISK
     FSOSCPF  UF  E           K        DISK
     C           ZSC02     CHAINSC0                  40
     C           *IN40     IFEQ '0'
     C                     MOVELZSC30     SC30      P      µo²¼¸¹½X
     C                     UPDATSC0
     C                     END
