     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM-ID   : GLA170                                    */
     /*    PROGRAM NAME : 過帳作業                                */
     /*    AUTHOR       : A1087  JOYCE                              */
     /*    CREATE DATE  : 1992.11.06                                */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       : 泛太總帳                                */
     /***************************************************************/
             PGM

             DCL        VAR(&DAH01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAH10F)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAH17F)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAH17T)   TYPE(*CHAR) LEN(2)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DAH01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DAH10F)   VALUE(%SST(*LDA 512 8))
             CHGVAR     VAR(&DAH17F)   VALUE(%SST(*LDA 520 2))
             CHGVAR     VAR(&DAH17T)   VALUE(%SST(*LDA 522 2))

 /*****   CRTPF -> QTEMP  *****/
     /*      CRTPF      FILE(QTEMP/GLWF05) SRCFILE(GLFLIB/QDDSSRC) +
                          SRCMBR(GLWF05)           */
             CPYF       FROMFILE(GLWF05) TOFILE(QTEMP/GLWF05) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/GLWF05))
             OVRDBF     FILE(GLWF05) TOFILE(QTEMP/GLWF05)

             OVRDBF     FILE(GLAHLF01) SHARE(*YES)
             OPNQRYF    FILE((GLAHLF01)) OPTION(*ALL) QRYSLT(' (ah01 +
                          *eq "' *CAT &DAH01 *CAT '") & (ah10 *LE ' +
                          *CAT &DAH10F *CAT ') & (ah17 *EQ +
                          %RANGE("' *CAT &DAH17F *CAT '" "' *CAT +
                          &DAH17T *CAT '")) & (ah20 *EQ " ") & +
                          (ah19 *eq "V") & (ah18 *eq " ") ') +
                          KEYFLD(*FILE)

 /*FOR GLA1701'S SUBPGM GLS005,GLS002 */
             OVRDBF     FILE(GLACPF)   SHARE(*YES)
             OVRDBF     FILE(GLACLF01) SHARE(*YES)
             OVRDBF     FILE(GLAKPF)   SHARE(*YES)

             CALL       GLA1701
             CLOF       OPNID(GLAHLF01)
             DLTOVR     FILE(*ALL)

             CHGVAR     VAR(&$PENV)  VALUE('1')
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('GLA170P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

 /*****  RECLAIM RESOURCES  *****/
             RCLRSC
             ENDPGM
