     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM-ID   : GLA780                                    */
     /*    PROGRAM NAME : 過帳還原作業                            */
     /*    AUTHOR       : A1087  JOYCE                              */
     /*    CREATE DATE  : 1992.11.06                                */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       : 泛太總帳                                */
     /***************************************************************/
             PGM

             DCLF       FILE(QGPL/GLAHREV)

             CALL       PGM(P63)
             DLTF       FILE(GLAHBKUP)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(GLAIBKUP)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(GLALBKUP)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(GLAMBKUP)
             MONMSG     MSGID(CPF2105)

             CPYF       FROMFILE(GLAHPF) TOFILE(QGPL/GLAHBKUP) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(GLAIPF) TOFILE(QGPL/GLAIBKUP) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(GLALPF) TOFILE(QGPL/GLALBKUP) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(GLAMPF) TOFILE(QGPL/GLAMBKUP) +
                          CRTFILE(*YES)
RCVF:
             RCVF
             MONMSG     MSGID(CPF0864) EXEC(GOTO CMDLBL(END1))

             CHGDTAARA  DTAARA(*LDA (501 2)) VALUE(&AH01)
             CHGDTAARA  DTAARA(*LDA (503 9)) VALUE(&AH02)
             CHGDTAARA  DTAARA(*LDA (512 9)) VALUE(' ')

             CALL       GLA7801

             GOTO       CMDLBL(RCVF)
END1:
             RUNSQLSTM  SRCFILE(GLPLIB/QCLSRC) SRCMBR(GLA7899T) +
                          COMMIT(*NONE)

             ENDPGM
