     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : GLB910C                                   */
     /*    PROGRAM NAME :總帳Ｖ１－＞Ｖ２                         */
     /*    AUTHOR       : A1034  STEPHANIE                          */
     /*    CREATE DATE  : 1993.07.27                                */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       : 泛太總帳                                */
     /***************************************************************/
             PGM

             DCL        VAR(&IN99) TYPE(*LGL)
             DCLF       FILE(GLA910D)

 START:      SNDRCVF    RCDFMT(DSPD1)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

             IF         COND(&IN10 *EQ '1') THEN(DO)
               OVRDBF     FILE(PT#APF@#) TOFILE(&LIB/PT#APF)
               OVRDBF     FILE(PT#BPF@#) TOFILE(&LIB/PT#BPF)
               OVRDBF     FILE(PT#1PF@#) TOFILE(&LIB/PT#1PF)
               OVRDBF     FILE(GLAAPF@#) TOFILE(&LIB/GLAAPF)
               OVRDBF     FILE(GLABPF@#) TOFILE(&LIB/GLABPF)
               OVRDBF     FILE(GLAEPF@#) TOFILE(&LIB/GLAEPF)
               OVRDBF     FILE(GLAFPF@#) TOFILE(&LIB/GLAFPF)
               OVRDBF     FILE(GLAHPF@#) TOFILE(&LIB/GLAHPF)
               OVRDBF     FILE(GLAKPF@#) TOFILE(&LIB/GLAKPF)
               CALL       PGM(GLA910) PARM(&IN99 &IN98 &AK04P &AK07P &AK08P)
             ENDDO
               GOTO       CMDLBL(START)

  END:       ENDPGM
