     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : GLA1401C                                  */
     /*    PROGRAM NAME :核准作業　　　　                         */
     /*    AUTHOR       : A1152                                     */
     /*    CREATE DATE  : 81/11/05                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM        PARM(&IN03 &IN12)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN12)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&DA701)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DA705F)   TYPE(*CHAR) LEN(12)
             DCL        VAR(&DA705T)   TYPE(*CHAR) LEN(12)
             DCL        VAR(&DA702F)   TYPE(*CHAR) LEN(9)
             DCL        VAR(&DA702T)   TYPE(*CHAR) LEN(9)

             CHGVAR     VAR(&DA701)   VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DA705T)   VALUE(%SST(*LDA 503 12))
             CHGVAR     VAR(&DA705F)   VALUE(%SST(*LDA 515 12))
             CHGVAR     VAR(&DA702T)   VALUE(%SST(*LDA 527 12))
             CHGVAR     VAR(&DA702F)   VALUE(%SST(*LDA 536 12))
             CHGVAR     VAR(&IN03)     VALUE('0')
             CHGVAR     VAR(&IN12)     VALUE('0')

             OVRDBF     FILE(GLA7LF01) SHARE(*YES)
             OPNQRYF    FILE((GLA7LF01)) QRYSLT(' A701 *EQ "' *CAT +
                          &DA701 *CAT '" & A705 *EQ %RANGE("' *CAT +
                          &DA705F *CAT '" "' *CAT &DA705T *CAT '") +
                          & A702 *EQ %RANGE("' *CAT &DA702F *CAT '" +
                          "' *CAT &DA702T *CAT '") & A704 *NE "D" ') +
                          KEYFLD((A705))

             CALL       PGM(GLI1M01) PARM(&IN03 &IN12)
                        CLOF       OPNID(GLA7LF01)
                        DLTOVR     FILE(*ALL)

             ENDPGM
