     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : GLR1J01C                                  */
     /*    PROGRAM NAME :傳票列印　　　　                         */
     /*    AUTHOR       : A1150                                     */
     /*    CREATE DATE  : 81/11/18                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM
             DCL        VAR(&DAH01) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAH25F) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAH25T) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAH10F) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAH10T) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAH02F) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DAH02T) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DAH26F) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DAH26T) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DAH17F) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAH17T) TYPE(*CHAR) LEN(2)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DAH01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DAH25F)   VALUE(%SST(*LDA 503 8))
             CHGVAR     VAR(&DAH25T)   VALUE(%SST(*LDA 511 8))
             CHGVAR     VAR(&DAH10F)   VALUE(%SST(*LDA 519 8))
             CHGVAR     VAR(&DAH10T)   VALUE(%SST(*LDA 527 8))
             CHGVAR     VAR(&DAH02F)   VALUE(%SST(*LDA 535 9))
             CHGVAR     VAR(&DAH02T)   VALUE(%SST(*LDA 544 9))
             CHGVAR     VAR(&DAH26F)   VALUE(%SST(*LDA 553 10))
             CHGVAR     VAR(&DAH26T)   VALUE(%SST(*LDA 563 10))
             CHGVAR     VAR(&DAH17F)   VALUE(%SST(*LDA 573 2))
             CHGVAR     VAR(&DAH17T)   VALUE(%SST(*LDA 575 2))

             OVRDBF     FILE(GAWF01) TOFILE(GLAHPF) SHARE(*YES)
             OPNQRYF    FILE(GLAHPF) FORMAT(GAWF01) QRYSLT(' +
                        WF0101  *EQ        "' *CAT &DAH01 *CAT '" +
                      & WF0125  *EQ %RANGE(' *CAT &DAH25F *CAT ' +
                                           ' *CAT &DAH25T *CAT ')      +
                      & WF0110  *EQ %RANGE(' *CAT &DAH10F *CAT ' +
                                           ' *CAT &DAH10T *CAT ')      +
                      & WF0102  *EQ %RANGE("' *CAT &DAH02F *CAT '" +
                                           "' *CAT &DAH02T *CAT '")    +
                      & AH26    *EQ %RANGE("' *CAT &DAH26F *CAT '" +
                                           "' *CAT &DAH26T *CAT '")    +
                      & AH17    *EQ %RANGE("' *CAT &DAH17F *CAT '" +
                                           "' *CAT &DAH17T *CAT '") ') +
                        MAPFLD((WF0101 'AH01') +
                               (WF0102 'AH02') +
                               (WF0103 'AH03') +
                               (WF0104 'AH04') +
                               (WF0105 'AH05') +
                               (WF0106 'AH06') +
                               (WF0107 'AH07') +
                               (WF0108 'AH08') +
                               (WF0109 'AH09') +
                               (WF0110 'AH10') +
                               (WF0112 'AH12') +
                               (WF0113 'AH13') +
                               (WF0115 'AH15') +
                               (WF0116 'AH16') +
                               (WF0125 'AH25') +
                               (WF0126 'AH26')) +
                        KEYFLD((WF0101) (WF0102) (WF0103))

             OVRPRTF    FILE(GLR1J0P) PAGESIZE(33 198) CPI(15) +
                          OVRFLW(30) PRTTXT(*BLANK) +
                          USRDTA('傳票列印')
             CALL       GLR1J01
             CLOF       OPNID(GLAHPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('GLR1J0P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
