     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM-ID   : GLR2A0                                    */
     /*    PROGRAM NAME : 分類帳                                  */
     /*    AUTHOR       :  A1149    MAY                             */
     /*    CREATE DATE  :  1992.11.13                               */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       : 泛太總帳                                */
     /***************************************************************/
             PGM
             DCL        VAR(&DAH01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DOPT)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&DAH04S)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAH04E)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DATE)     TYPE(*CHAR)  LEN(8)
             DCL        VAR(&P006O1)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&P006O2)   TYPE(*CHAR)  LEN(8)
             DCL        VAR(&P006O3)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&P006O4)   TYPE(*CHAR) LEN(1)
             /*ADD     */
             DCL        VAR(&DAH04)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DSEL)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&DAH05S) TYPE(*CHAR) LEN(20)
             DCL        VAR(&DAH06S) TYPE(*CHAR) LEN(20)
             DCL        VAR(&DAH07S) TYPE(*CHAR) LEN(20)
             DCL        VAR(&DAH08S) TYPE(*CHAR) LEN(20)
             DCL        VAR(&DAH09F) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAH05E) TYPE(*CHAR) LEN(20)
             DCL        VAR(&DAH06E) TYPE(*CHAR) LEN(20)
             DCL        VAR(&DAH07E) TYPE(*CHAR) LEN(20)
             DCL        VAR(&DAH08E) TYPE(*CHAR) LEN(20)
             DCL        VAR(&DAH09T) TYPE(*CHAR) LEN(8)
             DCL        VAR(&$YEAR) TYPE(*CHAR) LEN(4)
             /*ADD     */

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DAH01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DOPT)     VALUE(%SST(*LDA 503 1))
             CHGVAR     VAR(&DAH04S)   VALUE(%SST(*LDA 504 8))
             CHGVAR     VAR(&DAH04E)   VALUE(%SST(*LDA 512 8))
             CHGVAR     VAR(&DATE)     VALUE(%SST(*LDA 520 8))
             CHGVAR     VAR(&P006O1)   VALUE(%SST(*LDA 528 8))
             CHGVAR     VAR(&P006O2)   VALUE(%SST(*LDA 536 8))
             CHGVAR     VAR(&P006O3)   VALUE(%SST(*LDA 544 1))
             CHGVAR     VAR(&P006O4)   VALUE(%SST(*LDA 545 1))
             /*ADD     */
             CHGVAR     VAR(&DAH04) VALUE(%SST(*LDA 551 8))
             CHGVAR     VAR(&DSEL) VALUE(%SST(*LDA 546 1))
             CHGVAR     VAR(&DAH05S) VALUE(%SST(*LDA 592 20))
             CHGVAR     VAR(&DAH06S) VALUE(%SST(*LDA 612 20))
             CHGVAR     VAR(&DAH07S) VALUE(%SST(*LDA 632 20))
             CHGVAR     VAR(&DAH08S) VALUE(%SST(*LDA 652 20))
             CHGVAR     VAR(&DAH09F) VALUE(%SST(*LDA 572 8))
             CHGVAR     VAR(&DAH05E) VALUE(%SST(*LDA 680 20))
             CHGVAR     VAR(&DAH06E) VALUE(%SST(*LDA 700 20))
             CHGVAR     VAR(&DAH07E) VALUE(%SST(*LDA 720 20))
             CHGVAR     VAR(&DAH08E) VALUE(%SST(*LDA 740 20))
             CHGVAR     VAR(&DAH09T) VALUE(%SST(*LDA 760 8))
             CHGVAR     VAR(&$YEAR) VALUE(%SST(*LDA 559 4))
             /*ADD     */

             CPYF       FROMFILE(GLWF02) TOFILE(QTEMP/GLWF02) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/GLWF02))
             OVRDBF     FILE(GLWF02) TOFILE(QTEMP/GLWF02)

             OVRDBF     FILE(GLAHLF01) SHARE(*YES)
             OVRDBF     FILE(GLAILF01) SHARE(*YES)
             IF         COND(&DSEL = 'N') THEN(DO)

             OPNQRYF    FILE((GLAHLF01)) QRYSLT(' AH01 *EQ ("' *CAT +
                          &DAH01 *CAT '" ) & AH04 *EQ %RANGE("' +
                          *CAT &DAH04S *CAT '" "' *CAT &DAH04E +
                          *CAT '")  & AH10C *EQ %RANGE("' *CAT +
                          &P006O1 *CAT '" "' *CAT &DATE *CAT '") +
                          & AH18 *EQ ("V")') KEYFLD((AH01) (AH04) +
                              (AH02) ) +
                          MAPFLD((AH10C AH10 *CHAR 8))
             OPNQRYF    FILE((GLAILF01)) QRYSLT(' AI01 *EQ "' *CAT +
                          &DAH01 *CAT '"  & AI03 *EQ %RANGE("' *CAT +
                          &DAH04S *CAT '" "' *CAT &DAH04E *CAT '")  +
                          & Ai02 *EQ ' *CAT &$YEAR *CAT ' ') +
                          KEYFLD(*FILE)
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((GLAHLF01)) QRYSLT('AH01 *EQ "' *CAT +
                          &DAH01 *CAT '"  & AH04 *EQ "' *CAT &DAH04 +
                          *CAT '" & AH10C *EQ %RANGE("' *CAT +
                          &P006O1 *CAT '" "' *CAT &DATE *CAT '") & +
                          AH18 *EQ "V" & AH05 *EQ %RANGE("' *CAT +
                          &DAH05S *CAT '" "' *CAT &DAH05E *CAT '") +
                          & AH06 *EQ %RANGE("' *CAT &DAH06S *CAT '" +
                          "' *CAT &DAH06E *CAT '") & AH07 *EQ +
                          %RANGE("' *CAT &DAH07S *CAT '" "' *CAT +
                          &DAH07E *CAT '") & AH08 *EQ %RANGE("' +
                          *CAT &DAH08S *CAT '" "' *CAT &DAH08E *CAT +
                          '") & AH09C *EQ %RANGE("' *CAT &DAH09F +
                          *CAT '" "' *CAT &DAH09T *CAT '")') +
                          KEYFLD((AH01) (AH04) (AH02)) +
                          MAPFLD((AH10C AH10 *CHAR 8) (AH09C AH09 +
                          *CHAR 8))
             OPNQRYF    FILE((GLAILF01)) QRYSLT('AI01 *EQ "' *CAT +
                          &DAH01 *CAT '"  & AI03 *EQ "' *CAT &DAH04 +
                          *CAT '" & AI02 *EQ ' *CAT &$YEAR *CAT '  +
                          & AI04 *EQ %RANGE("' *CAT &DAH05S *CAT '" +
                          "' *CAT &DAH05E *CAT '") & AI05 *EQ +
                          %RANGE("' *CAT &DAH06S *CAT '" "' *CAT +
                          &DAH06E *CAT '") & AI06 *EQ %RANGE("' +
                          *CAT &DAH07S *CAT '" "' *CAT &DAH07E *CAT +
                          '") & AI07 *EQ %RANGE("' *CAT &DAH08S +
                          *CAT '" "' *CAT &DAH08E *CAT '") & AI08C +
                          *EQ %RANGE("' *CAT &DAH09F *CAT '" "' +
                          *CAT &DAH09T *CAT '")') KEYFLD(*FILE) +
                          MAPFLD((AI08C AI08 *CHAR 8))
             ENDDO

             CALL       GLR2A01
    /*總分類帳－日計表*/
             IF         COND(&DOPT *EQ '1') THEN(DO)
                        CALL GLR2A011
                        CHGVAR  VAR(&P6401I) VALUE('GLR2A0P')
                        ENDDO

    /*明細分類帳*/
             IF         COND(&DOPT *EQ '2') THEN(DO)
             OVRPRTF    FILE(GLR2A1P) CPI(15)
                        CALL GLR2A012
                        CHGVAR  VAR(&P6401I) VALUE('GLR2A1P')
                        ENDDO

             CLOF       OPNID(GLAHLF01)
             CLOF       OPNID(GLAILF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
