     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : GLR2Q01C                                  */
     /*    PROGRAM NAME :傳票張數統計列印                         */
     /*    AUTHOR       : A1150                                     */
     /*    CREATE DATE  : 81/11/26                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DAB01)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAB02F)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAB02T)   TYPE(*CHAR) LEN(8)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DAB01)   VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DAB02F)   VALUE(%SST(*LDA 503 8))
             CHGVAR     VAR(&DAB02T)   VALUE(%SST(*LDA 511 8))

             OVRDBF     FILE(GLABPF) SHARE(*YES)

             OPNQRYF    FILE((GLABPF)) QRYSLT(' AB01 *EQ "' *CAT +
                          &DAB01 *CAT '" & AB02C *EQ %RANGE("' *CAT +
                          &DAB02F *CAT '" "' *CAT &DAB02T *CAT '") +
                          ') KEYFLD(*FILE) +
                             MAPFLD((AB02C AB02 *CHAR 8))

         /*  OVRPRTF    FILE(GLR2Q0P) PAGESIZE(*N 100) CPI(12) */
             CALL       GLR2Q01
             CLOF       OPNID(GLABPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('GLR2Q0P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
