     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM-ID   : GLR2T0                                    */
     /*    PROGRAM NAME : 比較損益表－成本中心                    */
     /*    AUTHOR       :  A1149   HUANG-SHU.MEI                    */
     /*    CREATE DATE  :  1992.12.21                               */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       : 泛太總帳                                */
     /***************************************************************/
             PGM
             DCL        VAR(&$AI01S)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&$AI01E)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&$YEAR)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&$AR05)   TYPE(*CHAR)  LEN(1)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&$AI01S)   VALUE(%SST(*LDA 514 2))
             CHGVAR     VAR(&$AI01E)   VALUE(%SST(*LDA 516 2))
             CHGVAR     VAR(&$YEAR)    VALUE(%SST(*LDA 518 4))
             CHGVAR     VAR(&$AR05)    VALUE(%SST(*LDA 522 1))

      /*工作檔GLWF14 */
             CPYF       FROMFILE(GLWF14) TOFILE(QTEMP/GLWF14) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/GLWF14))
             OVRDBF     FILE(GLWF14) TOFILE(QTEMP/GLWF14)
      /*工作檔GLWF15 */
             CPYF       FROMFILE(GLWF15) TOFILE(QTEMP/GLWF15) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/GLWF15))
             OVRDBF     FILE(GLWF15) TOFILE(QTEMP/GLWF15)
      /*工作檔GLWF16 */
             CPYF       FROMFILE(GLWF16) TOFILE(QTEMP/GLWF16) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/GLWF16))
             OVRDBF     FILE(GLWF16) TOFILE(QTEMP/GLWF16)
      /******/

             OVRDBF     FILE(GLAILF06) SHARE(*YES)
             OPNQRYF    FILE((GLAILF06)) QRYSLT(' AI01 *EQ %RANGE("' +
                          *CAT &$AI01S *CAT '" "' *CAT &$AI01E *CAT +
                          '") & AI02 *EQ (' *CAT &$YEAR *CAT +
                          ')') KEYFLD(*FILE)

    /*中英格式判斷*/
             IF         COND(&$AR05 *EQ '1') THEN(DO)
             OVRPRTF    FILE(GLR2T0P1) PAGESIZE(*N 196) CPI(15)
                        ENDDO

             IF         COND(&$AR05 *EQ '2') THEN(DO)
             OVRPRTF    FILE(GLR2T0P1) TOFILE(GLR2T0P2) PAGESIZE(*N +
                          196) CPI(15)
                        ENDDO

                        CALL GLR2T01

             CLOF       OPNID(GLAILF06)
             DLTOVR     FILE(*ALL)
           /********/
             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)

             IF         COND(&$AR05 = '1' ) THEN(DO)
             CHGVAR     VAR(&P6401I) VALUE('GLR2T0P1')
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)
             ENDDO
           /*******/
             IF         COND(&$AR05 = '2' ) THEN(DO)
             CHGVAR     VAR(&P6401I) VALUE('GLR2T0P2')
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)
             ENDDO


             ENDPGM
