     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : GLR3A01C                                  */
     /*    PROGRAM NAME :常用傳票設定列印                         */
     /*    AUTHOR       : A1150                                     */
     /*    CREATE DATE  : 81/10/30                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DAN01)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAN02F)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAN02T)   TYPE(*CHAR) LEN(8)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DAN01)   VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DAN02F)   VALUE(%SST(*LDA 503 8))
             CHGVAR     VAR(&DAN02T)   VALUE(%SST(*LDA 511 8))

             OVRDBF     FILE(GLANPF) SHARE(*YES)
             OPNQRYF    FILE((GLANPF)) QRYSLT(' AN01 *EQ "' *CAT +
                          &DAN01 *CAT '" & AN02 *EQ %RANGE("' *CAT +
                          &DAN02F *CAT '" "' *CAT &DAN02T *CAT '") +
                          ') KEYFLD(*FILE)

             OVRPRTF    FILE(GLR3A0P) PAGESIZE(*N 158) CPI(12)
             CALL       GLR3A01
             CLOF       OPNID(GLANPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('GLR3A0P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
