     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : GLR4E01C                                  */
     /*    PROGRAM NAME :資金代碼資料列印                         */
     /*    AUTHOR       : A1150                                     */
     /*    CREATE DATE  : 81/10/29                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DAD01F)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAD01T)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAD02F)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAD02T)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAD05F)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DAD05T)   TYPE(*CHAR) LEN(1)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DAD01F)   VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DAD01T)   VALUE(%SST(*LDA 503 2))
             CHGVAR     VAR(&DAD02F)   VALUE(%SST(*LDA 505 8))
             CHGVAR     VAR(&DAD02T)   VALUE(%SST(*LDA 513 8))
             CHGVAR     VAR(&DAD05F)   VALUE(%SST(*LDA 521 1))
             CHGVAR     VAR(&DAD05T)   VALUE(%SST(*LDA 522 1))

             OVRDBF     FILE(GLADPF) SHARE(*YES)
             OPNQRYF    FILE((GLADPF)) QRYSLT(' AD01 *EQ %RANGE("' +
                          *CAT &DAD01F *CAT '" "' *CAT &DAD01T *CAT +
                          '") & AD02 *EQ %RANGE("' *CAT &DAD02F +
                          *CAT '" "' *CAT &DAD02T *CAT '") & AD05 +
                          *EQ %RANGE("' *CAT &DAD05F *CAT '" "' +
                          *CAT &DAD05T *CAT '") ') KEYFLD(*FILE)

     /*      OVRPRTF    FILE(GLR4E0P) PAGESIZE(*N 198) CPI(15)    */
             CALL       GLR4E01
             CLOF       OPNID(GLADPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('GLR4E0P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
