     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : GLR4C01C                                  */
     /*    PROGRAM NAME :欄位名稱資料列印                         */
     /*    AUTHOR       : A1150                                     */
     /*    CREATE DATE  : 81/10/29                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM
             DCL        VAR(&WAF01F)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&WAF01T)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&WAF02F)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WAF02T)   TYPE(*CHAR) LEN(8)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&WAF01F)   VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&WAF01T)   VALUE(%SST(*LDA 503 2))
             CHGVAR     VAR(&WAF02F)   VALUE(%SST(*LDA 505 8))
             CHGVAR     VAR(&WAF02T)   VALUE(%SST(*LDA 513 8))

             OVRDBF     FILE(GLAFPF) SHARE(*YES)
             OPNQRYF    FILE((GLAFPF)) QRYSLT(' AF01 *EQ %RANGE("' +
                          *CAT &WAF01F *CAT '" "' *CAT &WAF01T *CAT +
                          '") & AF02 *EQ %RANGE("' *CAT &WAF02F +
                          *CAT '" "' *CAT &WAF02T *CAT '") ') +
                          KEYFLD(*FILE)

             OVRPRTF    FILE(GLR4B0P) PAGESIZE(*N 198) CPI(15)
             CALL       GLR4B01
             CLOF       OPNID(GLAFPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('GLR4B0P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
