     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : GLR4F01C                                  */
     /*    PROGRAM NAME :分類帳碼資料列印                         */
     /*    AUTHOR       : A1150                                     */
     /*    CREATE DATE  : 81/10/29                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DA301F)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DA301T)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DA302F)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DA302T)   TYPE(*CHAR) LEN(1)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DA301F)   VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DA301T)   VALUE(%SST(*LDA 503 2))
             CHGVAR     VAR(&DA302F)   VALUE(%SST(*LDA 505 1))
             CHGVAR     VAR(&DA302T)   VALUE(%SST(*LDA 506 1))

             OVRDBF     FILE(GLA3PF) SHARE(*YES)
             OPNQRYF    FILE((GLA3PF)) QRYSLT(' A301 *EQ %RANGE("' +
                          *CAT &DA301F *CAT '" "' *CAT &DA301T *CAT +
                          '") & A302 *EQ %RANGE("' *CAT &DA302F +
                          *CAT '" "' *CAT &DA302T *CAT '") ') +
                          KEYFLD(*FILE)

             OVRPRTF    FILE(GLR4F0P) PAGESIZE(*N 198) CPI(15)
             CALL       GLR4F01
             CLOF       OPNID(GLA3PF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('GLR4F0P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
