     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : GLR4D01C                                  */
     /*    PROGRAM NAME :沖帳組合資料列印                         */
     /*    AUTHOR       : A1150                                     */
     /*    CREATE DATE  : 81/10/30                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DAE01F)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAE01T)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAE02F)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAE02T)   TYPE(*CHAR) LEN(2)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DAE01F)   VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DAE01T)   VALUE(%SST(*LDA 503 2))
             CHGVAR     VAR(&DAE02F)   VALUE(%SST(*LDA 505 2))
             CHGVAR     VAR(&DAE02T)   VALUE(%SST(*LDA 507 2))

             OVRDBF     FILE(GLAEPF) SHARE(*YES)
             OPNQRYF    FILE((GLAEPF)) QRYSLT(' AE01 *EQ %RANGE("' +
                          *CAT &DAE01F *CAT '" "' *CAT &DAE01T *CAT +
                          '") & AE02 *EQ %RANGE("' *CAT &DAE02F +
                          *CAT '" "' *CAT &DAE02T *CAT '") ') +
                          KEYFLD(*FILE)

             OVRPRTF    FILE(GLR4D0P) PAGESIZE(*N 198) CPI(15)
             CALL       GLR4D01
             CLOF       OPNID(GLAEPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('GLR4D0P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
