     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM-ID   : GLR6E0                                    */
     /*    PROGRAM NAME : 科目預算比較表－成本中心                */
     /*    AUTHOR       :  A1149   HUANG-SHU.MEI                    */
     /*    CREATE DATE  :  1993.01.09                               */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       : 泛太總帳                                */
     /***************************************************************/
             PGM
             DCL        VAR(&$AI01S)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&$AI01E)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&$YEAR)    TYPE(*CHAR) LEN(4)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&$AI01S)   VALUE(%SST(*LDA 529 2))
             CHGVAR     VAR(&$AI01E)   VALUE(%SST(*LDA 531 2))
             CHGVAR     VAR(&$YEAR)    VALUE(%SST(*LDA 533 4))

      /*工作檔GLWF14 */
             CPYF       FROMFILE(GLWF24) TOFILE(QTEMP/GLWF24) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/GLWF24))
             OVRDBF     FILE(GLWF24) TOFILE(QTEMP/GLWF24)
      /*工作檔GLWF15 */
             CPYF       FROMFILE(GLWF15) TOFILE(QTEMP/GLWF15) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/GLWF15))
             OVRDBF     FILE(GLWF15) TOFILE(QTEMP/GLWF15)
      /*工作檔GLWF16 */
             CPYF       FROMFILE(GLWF26) TOFILE(QTEMP/GLWF26) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/GLWF26))
             OVRDBF     FILE(GLWF26) TOFILE(QTEMP/GLWF26)
      /******/

             OVRDBF     FILE(GLAILF05) SHARE(*YES)
             OPNQRYF    FILE((GLAILF05)) QRYSLT(' AI01 *EQ %RANGE("' +
                          *CAT &$AI01S *CAT '" "' *CAT &$AI01E *CAT +
                          '") & AI02 *EQ (' *CAT &$YEAR *CAT ')') +
                          KEYFLD(*FILE)

             OVRPRTF    FILE(GLR6E0P) PAGESIZE(*N 196) CPI(15) +
                          OVRFLW(55)

                        CALL GLR6E01

             CLOF       OPNID(GLAILF05)
             DLTOVR     FILE(*ALL)
           /********/
             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CHGVAR     VAR(&P6401I) VALUE('GLR6E0P')
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
