     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : GLR698C                                   */
     /*    PROGRAM NAME :旅費暨交際費合併報表                     */
     /*    AUTHOR       : TINA                                      */
     /*    CREATE DATE  : 1994.12.21                                */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       : 泛太總帳                                */
     /***************************************************************/
             PGM

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             DCL        VAR(&DAH01S)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAH01E)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAH10S)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAH10E)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAC03A)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DYY)   TYPE(*CHAR) LEN(4)
             DCL        VAR(&DAH05S)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DAH05E)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DAH06S)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DAH06E)   TYPE(*CHAR) LEN(6)

     /*****  CPYF       --> GLAWF02                              *****/
             CPYF       FROMFILE(GLAWF02) TOFILE(QTEMP/GLAWF02) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/GLAWF02))
             OVRDBF     FILE(GLAWF02) TOFILE(QTEMP/GLAWF02)
     /*-------------------------------------------------------------*/
             CHGVAR     VAR(&DAH01S)    VALUE(%SST(*LDA 501  2))
             CHGVAR     VAR(&DAH01E)    VALUE(%SST(*LDA 560  2))
             CHGVAR     VAR(&DAH10S)   VALUE(%SST(*LDA 511  8))
             CHGVAR     VAR(&DAH10E)   VALUE(%SST(*LDA 521  8))
             CHGVAR     VAR(&DAC03A)   VALUE(%SST(*LDA 550  8))
             CHGVAR     VAR(&DYY)   VALUE(%SST(*LDA 511  4))
             CHGVAR     VAR(&DAH05S)   VALUE(%SST(*LDA 530  6))
             CHGVAR     VAR(&DAH05E)   VALUE(%SST(*LDA 540  6))
             CHGVAR     VAR(&DAH06S)   VALUE(%SST(*LDA 565  6))
             CHGVAR     VAR(&DAH06E)   VALUE(%SST(*LDA 571  6))

             OVRDBF     FILE(GLAHLF11) SHARE(*YES)
             OVRDBF     FILE(GLACPF) SHARE(*YES)
             OPNQRYF    FILE((GLAHLF11)) QRYSLT(' (AH04 *EQ "610401" +
                          *OR AH04 *EQ "610402" *OR AH04 *EQ +
                          "611201" *OR AH04 *EQ "613201" *OR AH04 +
                          *EQ "611202") & AH01 *EQ %RANGE("' *CAT +
                          &DAH01S *CAT '" "' *CAT &DAH01E *CAT '") +
                          & AH01 *NE "RE" & AH01 *NE "WL" & AH10C +
                          *EQ %RANGE("' *CAT &DAC03A *CAT '" "' +
                          *CAT &DAH10E *CAT '") & AH05  *EQ +
                          %RANGE("' *CAT &DAH05S *CAT '" "' *CAT +
                          &DAH05E *CAT '") & AH06 *EQ %RANGE("' +
                          *CAT &DAH06S *CAT '" "' *CAT &DAH06E *CAT +
                          '") & AH18 *EQ "V" & AH20 *NE "V" ') +
                          KEYFLD((AH05) (AH06)) MAPFLD((AH10C AH10 +
                          *CHAR 8))
             OPNQRYF    FILE((GLACPF)) KEYFLD((AC01) (AC02))
             CALL       GLR6981

             CLOF       OPNID(GLAHLF11)
             DLTOVR     FILE(GLAHLF11)
             CLOF       OPNID(GLACPF)
             DLTOVR     FILE(GLACPF)

             OVRPRTF    FILE(GLR698P) PAGESIZE(*N 198) CPI(15) +
                          OVRFLW(55)
             CALL       GLR69821

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CHGVAR     VAR(&P6401I) VALUE('GLR698P')
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
