     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : GLR699C                                   */
     /*    PROGRAM NAME :修繕費ＹＴＤ細表                         */
     /*    AUTHOR       : TINA                                      */
     /*    CREATE DATE  : 1994.12.21                                */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       : 泛太總帳                                */
     /***************************************************************/
             PGM

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             DCL        VAR(&DAH01S)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAH01E)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAH10S)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAH10E)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAC03A)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAH18)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&DYY)   TYPE(*CHAR) LEN(4)
             DCL        VAR(&DAH05S)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DAH05E)   TYPE(*CHAR) LEN(6)

     /*****  CPYF       --> GLAWF01                              *****/
             CPYF       FROMFILE(GLAWF01) TOFILE(QTEMP/GLAWF01) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/GLAWF01))
             OVRDBF     FILE(GLAWF01) TOFILE(QTEMP/GLAWF01)
     /*-------------------------------------------------------------*/
             CHGVAR     VAR(&DAH01S)    VALUE(%SST(*LDA 501  2))
             CHGVAR     VAR(&DAH01E)    VALUE(%SST(*LDA 560  2))
             CHGVAR     VAR(&DAH10S)   VALUE(%SST(*LDA 511  8))
             CHGVAR     VAR(&DAH10E)   VALUE(%SST(*LDA 521  8))
             CHGVAR     VAR(&DAC03A)   VALUE(%SST(*LDA 550  8))
             CHGVAR     VAR(&DAH18)    VALUE(%SST(*LDA 797  1))
             CHGVAR     VAR(&DYY)   VALUE(%SST(*LDA 511  4))
             CHGVAR     VAR(&DAH05S)   VALUE(%SST(*LDA 530  6))
             CHGVAR     VAR(&DAH05E)   VALUE(%SST(*LDA 540  6))

             OVRDBF     FILE(GLAHLF01) SHARE(*YES)
             OVRDBF     FILE(GLACPF) SHARE(*YES)

             IF         COND(&DAH18 *EQ '1') THEN(DO)
             OPNQRYF    FILE((GLAHLF01)) QRYSLT(' AH04 *EQ "610701" +
                          & AH01 *EQ %RANGE("' *CAT &DAH01S *CAT '" +
                          "' *CAT &DAH01E *CAT '") & AH01 *NE "RE" +
                          & AH01 *NE "WL" & AH10C *EQ %RANGE("' +
                          *CAT &DAC03A *CAT '" "' *CAT &DAH10E *CAT +
                          '") & AH05  *EQ %RANGE("' *CAT &DAH05S +
                          *CAT '" "' *CAT &DAH05E *CAT '")  & AH18 +
                          *EQ "V" & AH20 *NE "V" ') KEYFLD((AH05) +
                          (AH06)) MAPFLD((AH10C AH10 *CHAR 8))
             ENDDO
             ELSE
             IF         COND(&DAH18 *EQ '2') THEN(DO)
             OPNQRYF    FILE((GLAHLF01)) QRYSLT(' AH04 *EQ "610701" +
                          & AH01 *EQ %RANGE("' *CAT &DAH01S *CAT '" +
                          "' *CAT &DAH01E *CAT '") & AH01 *NE "RE" +
                          & AH01 *NE "WL" & AH10C *EQ %RANGE("' +
                          *CAT &DAC03A *CAT '" "' *CAT &DAH10E *CAT +
                          '") & AH05  *EQ %RANGE("' *CAT &DAH05S +
                          *CAT '" "' *CAT &DAH05E *CAT '")  +
                          & AH20 *NE "V" ') KEYFLD((AH05) (AH06)) +
                          MAPFLD((AH10C AH10 *CHAR 8))
             ENDDO

             OPNQRYF    FILE((GLACPF)) KEYFLD((AC01) (AC02))
             CALL       GLR6991

             CLOF       OPNID(GLAHLF01)
             DLTOVR     FILE(GLAHLF01)
             CLOF       OPNID(GLACPF)
             DLTOVR     FILE(GLACPF)

             OVRPRTF    FILE(GLR699P) PAGESIZE(*N 198) CPI(15) +
                          OVRFLW(55)
             CALL       GLR69921

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CHGVAR     VAR(&P6401I) VALUE('GLR699P')
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
