     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : GLR1I01C                                  */
     /*    PROGRAM NAME :傳票核對表　　　                         */
     /*    AUTHOR       : A1150                                     */
     /*    CREATE DATE  : 81/11/05                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM

             DCL        VAR(&DAH01)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAH25F)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAH25T)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAH10F)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAH10T)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAH02F)   TYPE(*CHAR) LEN(9)
             DCL        VAR(&DAH02T)   TYPE(*CHAR) LEN(9)
             DCL        VAR(&DAH26F)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&DAH26T)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&DAH17F)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAH17T)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAH19F)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DAH19T)   TYPE(*CHAR) LEN(1)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DAH01)   VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DAH25F)   VALUE(%SST(*LDA 503 8))
             CHGVAR     VAR(&DAH25T)   VALUE(%SST(*LDA 511 8))
             CHGVAR     VAR(&DAH10F)   VALUE(%SST(*LDA 519 8))
             CHGVAR     VAR(&DAH10T)   VALUE(%SST(*LDA 527 8))
             CHGVAR     VAR(&DAH02F)   VALUE(%SST(*LDA 535 9))
             CHGVAR     VAR(&DAH02T)   VALUE(%SST(*LDA 544 9))
             CHGVAR     VAR(&DAH26F)   VALUE(%SST(*LDA 553 10))
             CHGVAR     VAR(&DAH26T)   VALUE(%SST(*LDA 563 10))
             CHGVAR     VAR(&DAH17F)   VALUE(%SST(*LDA 573 2))
             CHGVAR     VAR(&DAH17T)   VALUE(%SST(*LDA 575 2))
             CHGVAR     VAR(&DAH19F)   VALUE(%SST(*LDA 578 1))
             CHGVAR     VAR(&DAH19T)   VALUE(%SST(*LDA 579 1))

             OVRDBF     FILE(GLAHLF01) SHARE(*YES)

             OPNQRYF    FILE((GLAHLF01)) QRYSLT(' AH01 *EQ "' *CAT +
                          &DAH01 *CAT '" & AH25C *EQ %RANGE("' *CAT +
                          &DAH25F *CAT '" "' *CAT &DAH25T *CAT '") +
                          & AH10C *EQ %RANGE("' *CAT &DAH10F *CAT +
                          '" "' *CAT &DAH10T *CAT '") & AH02 *EQ +
                          %RANGE("' *CAT &DAH02F *CAT '" "' *CAT +
                          &DAH02T *CAT '") & AH26 *EQ %RANGE("' +
                          *CAT &DAH26F *CAT '" "' *CAT &DAH26T *CAT +
                          '") & AH17 *EQ %RANGE("' *CAT &DAH17F +
                          *CAT '" "' *CAT &DAH17T *CAT '") & AH19 +
                          *EQ %RANGE("' *CAT &DAH19F *CAT '" "' +
                          *CAT &DAH19T *CAT '") ') KEYFLD((AH25) +
                          (AH02) (AH03)) MAPFLD((AH25C AH25 *CHAR +
                          8) (AH10C AH10 *CHAR 8))

             OVRPRTF    FILE(GLR1I0P) PAGESIZE(*N 198) CPI(15)
             CALL       GLR1I01
             CLOF       OPNID(GLAHLF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('GLR1I0P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
