     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有    TEL:3459696     */
     /*                                                             */
     /*    AUTHOR       : CHARLES                                   */
     /*    CREATE DATE  : 83/07/11                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : NPB0221C                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :產品促銷                                 */
     /*    REMARK       :傳票彙總批次                             */
     /***************************************************************/
             PGM
             DCL        VAR(&DAH01)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAH10S)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAH10E)   TYPE(*CHAR) LEN(8)


             CHGVAR     VAR(&DAH01)   VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DAH10S) VALUE(%SST(*LDA 541 8))
             CHGVAR     VAR(&DAH10E) VALUE(%SST(*LDA 549 8))

      /******/

             OVRDBF     FILE(GLAHLF04) SHARE(*YES)
             OPNQRYF    FILE((GLAHLF04)) QRYSLT(' AH01 *EQ "' *CAT +
                          &DAH01 *CAT '" & AH10 *EQ %RANGE(' *CAT +
                          &DAH10S *CAT ' ' *CAT &DAH10E *CAT ') & +
                          AH05A *EQ "01" & (AH06A *EQ "02" *OR +
                          AH06A *EQ "03") & AH07A *EQ "36" & AH08A +
                          *EQ "05" & AH15A *EQ "06" ') KEYFLD(*FILE)

                        CALL NPB0221

             CLOF       OPNID(GLAHLF04)
             DLTOVR     FILE(*ALL)
           /********/

             ENDPGM
