     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有    TEL:3459696     */
     /*                                                             */
     /*    AUTHOR       : CHARLES                                   */
     /*    CREATE DATE  : 83/06/09                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : NPB0211C                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :產品促銷                                 */
     /*    REMARK       :實績批次                                 */
     /***************************************************************/
             PGM
             DCL        VAR(&@YEAR)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&DAI01)   TYPE(*CHAR) LEN(2)


             CHGVAR     VAR(&@YEAR)    VALUE(%SST(*LDA 534 4))
             CHGVAR     VAR(&DAI01)   VALUE(%SST(*LDA 501 2))

      /******/

             OVRDBF     FILE(GLAILF01) SHARE(*YES)
             OPNQRYF    FILE((GLAILF01)) QRYSLT(' AI01 *EQ "' *CAT +
                          &DAI01 *CAT '" & AI02 *EQ ' *CAT &@YEAR +
                          *CAT ' ') KEYFLD(*FILE)

                        CALL NPB0211

             CLOF       OPNID(GLAILF01)
             DLTOVR     FILE(*ALL)
           /********/

             ENDPGM
