     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有    TEL:3459696     */
     /*                                                             */
     /*    AUTHOR       : CHARLES                                   */
     /*    CREATE DATE  : 83/07/11                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : NPB022C                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :產品促銷                                 */
     /*    REMARK       :傳票彙總批次                             */
     /***************************************************************/
             PGM
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN10)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&$PENV)  TYPE(*CHAR) LEN(1)

 START:      CALL       PGM(NPB022) PARM(&IN03 &IN10)
             IF         COND(&IN03)  THEN(DO)
             CHGVAR     VAR(%SST(*LDA 501 100)) VALUE(' ')
             RETURN
             ENDDO

                        CALL    PGM(NPB0221C)

             GOTO       START

             ENDPGM
