             PGM
             DCL        VAR(&DNF01)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&$YEAR)   TYPE(*CHAR) LEN(4)
             DCL        VAR(&DNF06S)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DNF06E)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DNF08S)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DNF08E)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DNF05S)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&DNF05E)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&DNF03S)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DNF03E)   TYPE(*CHAR) LEN(2)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DNF01)   VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&$YEAR)   VALUE(%SST(*LDA 535 4))
             CHGVAR     VAR(&DNF03S)   VALUE(%SST(*LDA 561 2))
             CHGVAR     VAR(&DNF03E)   VALUE(%SST(*LDA 563 2))
             CHGVAR     VAR(&DNF06S)   VALUE(%SST(*LDA 541 1))
             CHGVAR     VAR(&DNF06E)   VALUE(%SST(*LDA 542 1))
             CHGVAR     VAR(&DNF08S)   VALUE(%SST(*LDA 543 5))
             CHGVAR     VAR(&DNF08E)   VALUE(%SST(*LDA 549 5))
             CHGVAR     VAR(&DNF05S)   VALUE(%SST(*LDA 555 3))
             CHGVAR     VAR(&DNF05E)   VALUE(%SST(*LDA 558 3))

      /******/

             OVRDBF     FILE(NPNFLF01) SHARE(*YES)
             OPNQRYF    FILE((NPNFLF01)) QRYSLT(' NF01 *EQ "' *CAT +
                          &DNF01 *CAT '"  & NF02 *EQ ' *CAT &$YEAR +
                          *CAT '  & NF03  *EQ %RANGE("' *CAT +
                          &DNF03S *CAT '" "' *CAT &DNF03E *CAT '")& +
                          NF06A *EQ %RANGE("' *CAT &DNF06S *CAT '" +
                          "' *CAT &DNF06E *CAT '") & NF08 *EQ +
                          %RANGE("' *CAT &DNF08S *CAT '" "' *CAT +
                          &DNF08E *CAT '") & NF05 *EQ %RANGE("' +
                          *CAT &DNF05S *CAT '" "' *CAT &DNF05E *CAT +
                          '")') KEYFLD((NF08) (NF05))

             OVRPRTF    FILE(NPR045P) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('­û«P¾P¦~')

                        CALL NPR0451

             CLOF       OPNID(NPNFLF01)
             DLTOVR     FILE(*ALL)
           /********/
             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)

             CHGVAR     VAR(&P6401I) VALUE('NPR045P')
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
