     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       : AN MING HSIA                              */
     /*    CREATE DATE  : 10/23/93                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : PCR041C                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :零用金系統                               */
     /*    REMARK       :零用金明細表                             */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DCA01)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&CA17S)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&CA17E)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&YCA10S) TYPE(*CHAR) LEN(8)
             DCL        VAR(&YCA10E) TYPE(*CHAR) LEN(8)
             DCL        VAR(&YCA11S) TYPE(*CHAR) LEN(8)
             DCL        VAR(&YCA11E) TYPE(*CHAR) LEN(8)
             DCL        VAR(&YDATE)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&DCA02S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DCA02E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DCA28S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DCA28E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSEL1)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL2)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL3)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN20)   TYPE(*CHAR) LEN(1)

             OVRDBF     FILE(PCCALF01) SHARE(*YES)

             CHGVAR     VAR(&DCA01)  VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&CA17S)  VALUE(%SST(*LDA 603 1))
             CHGVAR     VAR(&CA17E)  VALUE(%SST(*LDA 604 1))
             CHGVAR     VAR(&DSEL1)  VALUE(%SST(*LDA 605 1))
             CHGVAR     VAR(&DSEL2)  VALUE(%SST(*LDA 606 1))
             CHGVAR     VAR(&DSEL3)  VALUE(%SST(*LDA 608 1))
             CHGVAR     VAR(&YCA10S) VALUE(%SST(*LDA 611 8))
             CHGVAR     VAR(&YCA10E) VALUE(%SST(*LDA 621 8))
             CHGVAR     VAR(&YCA11S) VALUE(%SST(*LDA 691 8))
             CHGVAR     VAR(&YCA11E) VALUE(%SST(*LDA 701 8))
             CHGVAR     VAR(&YDATE)  VALUE(%SST(*LDA 651 8))
             CHGVAR     VAR(&DCA02S) VALUE(%SST(*LDA 631 9))
             CHGVAR     VAR(&DCA02E) VALUE(%SST(*LDA 641 9))
             CHGVAR     VAR(&DCA28S) VALUE(%SST(*LDA 730 6))
             CHGVAR     VAR(&DCA28E) VALUE(%SST(*LDA 740 6))


             IF         COND(&DSEL1 *EQ 'A') THEN(DO)
             IF         COND(&DSEL2 *EQ 'Y') THEN(DO)
             OPNQRYF    FILE((PCCALF01)) QRYSLT(' CA01 *EQ ("' *CAT +
                          &DCA01 *CAT '") & CA17 *EQ %RANGE("' *CAT +
                          &CA17S *CAT '" "' *CAT &CA17E *CAT '") & +
                          CA02 *EQ %RANGE("' *CAT &DCA02S *CAT '" +
                          "' *CAT &DCA02E *CAT '") & CA10 *EQ +
                          %RANGE(' *CAT &YCA10S *CAT ' ' *CAT +
                          &YCA10E *CAT ') & CA11 *EQ %RANGE(' *CAT +
                          &YCA11S *CAT ' ' *CAT &YCA11E *CAT ') & +
                          CA28 *EQ %RANGE("' *CAT &DCA28S *CAT '" +
                          "' *CAT &DCA28E *CAT '") &  CA29 *EQ 0 ') +
                          KEYFLD((CA01) (CA17) (CA02))
                       ENDDO

             ELSE       CMD(DO)
             OPNQRYF    FILE((PCCALF01)) QRYSLT(' CA01 *EQ ("' *CAT +
                          &DCA01 *CAT '") & CA17 *EQ %RANGE("' *CAT +
                          &CA17S *CAT '" "' *CAT &CA17E *CAT '") & +
                          CA02 *EQ %RANGE("' *CAT &DCA02S *CAT '" +
                          "' *CAT &DCA02E *CAT '") & CA10 *EQ +
                          %RANGE(' *CAT &YCA10S *CAT ' ' *CAT +
                          &YCA10E *CAT ') & CA11 *EQ %RANGE(' *CAT +
                          &YCA11S *CAT ' ' *CAT &YCA11E *CAT ') & +
                          CA28 *EQ %RANGE("' *CAT &DCA28S *CAT '" +
                          "' *CAT &DCA28E *CAT '") & CA29 *EQ 0 & +
                          CA20 *EQ " " ') KEYFLD((CA01) (CA17) (CA02))
                        ENDDO
                        ENDDO

             IF         COND(&DSEL1 *EQ 'B') THEN(DO)
             IF         COND(&DSEL2 *EQ 'Y') THEN(DO)
             OPNQRYF    FILE((PCCALF01)) QRYSLT(' CA01 *EQ ("' *CAT +
                          &DCA01 *CAT '") & CA17 *EQ %RANGE("' *CAT +
                          &CA17S *CAT '" "' *CAT &CA17E *CAT '") & +
                          CA02 *EQ %RANGE("' *CAT &DCA02S *CAT '" +
                          "' *CAT &DCA02E *CAT '") & CA10 *EQ +
                          %RANGE(' *CAT &YCA10S *CAT ' ' *CAT +
                          &YCA10E *CAT ') & CA11 *EQ %RANGE(' *CAT +
                          &YCA11S *CAT ' ' *CAT &YCA11E *CAT ') & +
                          CA28 *EQ %RANGE("' *CAT &DCA28S *CAT '" +
                          "' *CAT &DCA28E *CAT '") & CA29 *NE 0 ') +
                          KEYFLD((CA01) (CA17) (CA02))
                       ENDDO

             ELSE       CMD(DO)
             OPNQRYF    FILE((PCCALF01)) QRYSLT(' CA01 *EQ ("' *CAT +
                          &DCA01 *CAT '") & CA17 *EQ %RANGE("' *CAT +
                          &CA17S *CAT '" "' *CAT &CA17E *CAT '") & +
                          CA02 *EQ %RANGE("' *CAT &DCA02S *CAT '" +
                          "' *CAT &DCA02E *CAT '") & CA10 *EQ +
                          %RANGE(' *CAT &YCA10S *CAT ' ' *CAT +
                          &YCA10E *CAT ') & CA11 *EQ %RANGE(' *CAT +
                          &YCA11S *CAT ' ' *CAT &YCA11E *CAT ') & +
                          CA28 *EQ %RANGE("' *CAT &DCA28S *CAT '" +
                          "' *CAT &DCA28E *CAT '") & CA29 *NE 0 & +
                          CA20 *EQ " " ') KEYFLD((CA01) (CA17) (CA02))
                        ENDDO
                        ENDDO

             IF         COND(&DSEL1 *EQ 'C') THEN(DO)
             IF         COND(&DSEL2 *EQ 'Y') THEN(DO)
             OPNQRYF    FILE((PCCALF01)) QRYSLT(' CA01 *EQ ("' *CAT +
                          &DCA01 *CAT '") & CA17 *EQ %RANGE("' *CAT +
                          &CA17S *CAT '" "' *CAT &CA17E *CAT '") & +
                          CA02 *EQ %RANGE("' *CAT &DCA02S *CAT '" +
                          "' *CAT &DCA02E *CAT '") & CA10 *EQ +
                          %RANGE(' *CAT &YCA10S *CAT ' ' *CAT +
                          &YCA10E *CAT ') & CA11 *EQ %RANGE(' *CAT +
                          &YCA11S *CAT ' ' *CAT &YCA11E *CAT ') & +
                          CA28 *EQ %RANGE("' *CAT &DCA28S *CAT '" +
                          "' *CAT &DCA28E *CAT '")') KEYFLD((CA01) +
                          (CA17) (CA02))
                       ENDDO

             ELSE       CMD(DO)
             OPNQRYF    FILE((PCCALF01)) QRYSLT(' CA01 *EQ ("' *CAT +
                          &DCA01 *CAT '") & CA17 *EQ %RANGE("' *CAT +
                          &CA17S *CAT '" "' *CAT &CA17E *CAT '") & +
                          CA02 *EQ %RANGE("' *CAT &DCA02S *CAT '" +
                          "' *CAT &DCA02E *CAT '") & CA10 *EQ +
                          %RANGE(' *CAT &YCA10S *CAT ' ' *CAT +
                          &YCA10E *CAT ') & CA11 *EQ %RANGE(' *CAT +
                          &YCA11S *CAT ' ' *CAT &YCA11E *CAT ')  & +
                          CA28 *EQ %RANGE("' *CAT &DCA28S *CAT '" +
                          "' *CAT &DCA28E *CAT '") & CA20 *EQ " " +
                          ') KEYFLD((CA01) (CA17) (CA02))
                        ENDDO

                        ENDDO

             IF         COND(&DSEL3 *EQ 'A') THEN(DO)
             OVRPRTF    FILE(PCR041AP) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('零用金細')
                        CALL       PCR0411
                        CHGVAR     VAR(&P6601I) VALUE('PCR041AP')
                        ENDDO

             ELSE       CMD(DO)
             OVRPRTF    FILE(PCR041BP) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('零用金細')
                        CALL       PCR0412
                        CHGVAR     VAR(&P6601I) VALUE('PCR041BP')
                        ENDDO

             CLOF       OPNID(PCCALF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
