     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       : AN MING HSIA                              */
     /*    CREATE DATE  : 01/22/94                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : PCR043C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :零用金系統                               */
     /*    REMARK       :成本中心彙總表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DCA01)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&COMPS)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&YCA11S)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&YCA11E)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&YCA10S)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&YCA10E)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&YDATE)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&DCA02S)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&DCA02E)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSEL1)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL2)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL3)  TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DCA01) VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&COMPS) VALUE(%SST(*LDA 603 1))
             CHGVAR     VAR(&COMPE) VALUE(%SST(*LDA 604 1))
             CHGVAR     VAR(&DSEL1) VALUE(%SST(*LDA 605 1))
             CHGVAR     VAR(&DSEL3) VALUE(%SST(*LDA 608 1))
             CHGVAR     VAR(&YCA11S) VALUE(%SST(*LDA 611 8))
             CHGVAR     VAR(&YCA11E) VALUE(%SST(*LDA 621 8))
             CHGVAR     VAR(&YCA10S) VALUE(%SST(*LDA 691 8))
             CHGVAR     VAR(&YCA10E) VALUE(%SST(*LDA 701 8))
             CHGVAR     VAR(&YDATE) VALUE(%SST(*LDA 651 8))
             CHGVAR     VAR(&DCA02S) VALUE(%SST(*LDA 631 9))
             CHGVAR     VAR(&DCA02E) VALUE(%SST(*LDA 641 9))

             OVRPRTF    FILE(PCR043P) PAGESIZE(*N 158) CPI(12) +
                          USRDTA('零成本總')

             OVRDBF     FILE(PCWF01) TOFILE(PCCALF01) SHARE(*YES)

             IF         COND(&DSEL1 *EQ 'A') THEN(DO) /*撥補*/
                IF      COND(&DSEL3 *EQ 'A') THEN(DO)
                OPNQRYF  FILE((PCCALF01)) FORMAT(PCWF01) QRYSLT(' +
                          CA01 *EQ ("' *CAT &DCA01 *CAT '") & CA17 +
                          *EQ %RANGE("' *CAT &COMPS *CAT '" "' *CAT +
                          &COMPE *CAT '") & CA02 *EQ %RANGE("' *CAT +
                          &DCA02S *CAT '" "' *CAT &DCA02E *CAT '") +
                          & CA11 *NE 0 & CA11 *EQ %RANGE(' *CAT +
                          &YCA11S *CAT ' ' *CAT &YCA11E *CAT ') & +
                          CA10 *EQ %RANGE(' *CAT &YCA10S *CAT ' ' +
                          *CAT &YCA10E *CAT ') & CA29 *NE 0 & CA11 +
                          *ne 0 & CA20 *NE "V" ') KEYFLD((CA17) +
                          (CA04) (CA05) (CA06) (CA07) (CA08) +
                          (CA09)) MAPFLD((CA05L '%SST(CA05 1 3)' +
                          *CHAR 3) (CA04L '%SST(CA04 1 4)' *CHAR 4))
                ENDDO
                IF     COND(&DSEL3 *EQ 'B') THEN(DO)
                OPNQRYF FILE((PCCALF01)) FORMAT(PCWF01) QRYSLT(' +
                          CA01 *EQ ("' *CAT &DCA01 *CAT '") & CA17 +
                          *EQ %RANGE("' *CAT &COMPS *CAT '" "' *CAT +
                          &COMPE *CAT '") & CA02 *EQ %RANGE("' *CAT +
                          &DCA02S *CAT '" "' *CAT &DCA02E *CAT '") +
                          & CA11 *EQ 0 & CA11 *EQ %RANGE(' *CAT +
                          &YCA11S *CAT ' ' *CAT &YCA11E *CAT ') & +
                          CA10 *EQ %RANGE(' *CAT &YCA10S *CAT ' ' +
                          *CAT &YCA10E *CAT ') & CA29 *NE 0 & CA11 +
                          *ne 0 & CA20 *NE "V" ') KEYFLD((CA17) +
                          (CA04) (CA05) (CA06) (CA07) (CA08) +
                          (CA09)) MAPFLD((CA05L '%SST(CA05 1 3)' +
                          *CHAR 3) (CA04L '%SST(CA04 1 4)' *CHAR 4))
                ENDDO
                IF      COND(&DSEL3 *EQ 'C') THEN(DO)
                OPNQRYF FILE((PCCALF01)) FORMAT(PCWF01) QRYSLT(' +
                          CA01 *EQ ("' *CAT &DCA01 *CAT '") & CA17 +
                          *EQ %RANGE("' *CAT &COMPS *CAT '" "' *CAT +
                          &COMPE *CAT '") & CA02 *EQ %RANGE("' *CAT +
                          &DCA02S *CAT '" "' *CAT &DCA02E *CAT '") +
                          & CA11 *EQ %RANGE(' *CAT &YCA11S *CAT ' ' +
                          *CAT &YCA11E *CAT ') & CA10 *EQ %RANGE(' +
                          *CAT &YCA10S *CAT ' ' *CAT &YCA10E *CAT +
                          ') & CA29 *NE 0 & CA11 *ne 0 & CA20 *NE +
                          "V" ') KEYFLD((CA17) (CA04) (CA05) (CA06) +
                          (CA07) (CA08) (CA09)) MAPFLD((CA05L +
                          '%SST(CA05 1 3)' +
                          *CHAR 3) (CA04L '%SST(CA04 1 4)' *CHAR 4))
                ENDDO
             ENDDO

             IF         COND(&DSEL1 *EQ 'B') THEN(DO) /*未撥補*/
                IF      COND(&DSEL3 *EQ 'A') THEN(DO)
                OPNQRYF FILE((PCCALF01)) FORMAT(PCWF01) QRYSLT(' +
                          CA01 *EQ ("' *CAT &DCA01 *CAT '") & CA17 +
                          *EQ %RANGE("' *CAT &COMPS *CAT '" "' *CAT +
                          &COMPE *CAT '") & CA02 *EQ %RANGE("' *CAT +
                          &DCA02S *CAT '" "' *CAT &DCA02E *CAT '") +
                          &  CA11 *NE 0 & CA11 *EQ %RANGE(' *CAT +
                          &YCA11S *CAT ' ' *CAT &YCA11E *CAT ') & +
                          CA10 *EQ %RANGE(' *CAT &YCA10S *CAT ' ' +
                          *CAT &YCA10E *CAT ') & CA29 *EQ 0 & CA20 +
                          *NE "V" ') KEYFLD((CA17) (CA05) (CA04)) +
                          MAPFLD((CA05L '%SST(CA05 1 3)' +
                          *CHAR 3) (CA04L '%SST(CA04 1 4)' *CHAR 4))
                ENDDO
                IF      COND(&DSEL3 *EQ 'B') THEN(DO)
                OPNQRYF FILE((PCCALF01)) FORMAT(PCWF01) QRYSLT(' +
                          CA01 *EQ ("' *CAT &DCA01 *CAT '") & CA17 +
                          *EQ %RANGE("' *CAT &COMPS *CAT '" "' *CAT +
                          &COMPE *CAT '") & CA02 *EQ %RANGE("' *CAT +
                          &DCA02S *CAT '" "' *CAT &DCA02E *CAT '") +
                          &  CA11 *EQ 0 & CA11 *EQ %RANGE(' *CAT +
                          &YCA11S *CAT ' ' *CAT &YCA11E *CAT ') & +
                          CA10 *EQ %RANGE(' *CAT &YCA10S *CAT ' ' +
                          *CAT &YCA10E *CAT ') & CA29 *EQ 0 & CA20 +
                          *NE "V" ') KEYFLD((CA17) (CA05) (CA04)) +
                          MAPFLD((CA05L '%SST(CA05 1 3)' +
                          *CHAR 3) (CA04L '%SST(CA04 1 4)' *CHAR 4))
                ENDDO
                IF      COND(&DSEL3 *EQ 'C') THEN(DO)
                OPNQRYF FILE((PCCALF01)) FORMAT(PCWF01) QRYSLT(' +
                          CA01 *EQ ("' *CAT &DCA01 *CAT '") & CA17 +
                          *EQ %RANGE("' *CAT &COMPS *CAT '" "' *CAT +
                          &COMPE *CAT '") & CA02 *EQ %RANGE("' *CAT +
                          &DCA02S *CAT '" "' *CAT &DCA02E *CAT '") +
                          & CA11 *EQ %RANGE(' *CAT &YCA11S *CAT ' ' +
                          *CAT &YCA11E *CAT ') & CA10 *EQ %RANGE(' +
                          *CAT &YCA10S *CAT ' ' *CAT &YCA10E *CAT +
                          ') & CA29 *EQ 0 & CA20 *NE "V" ') +
                          KEYFLD((CA17) (CA05) (CA04)) +
                          MAPFLD((CA05L '%SST(CA05 1 3)' +
                          *CHAR 3) (CA04L '%SST(CA04 1 4)' *CHAR 4))
                ENDDO
             ENDDO

             IF         COND(&DSEL1 *EQ 'C') THEN(DO) /*全部撥補*/
                IF      COND(&DSEL3 *EQ 'A') THEN(DO)
                OPNQRYF FILE((PCCALF01)) FORMAT(PCWF01) QRYSLT(' +
                          CA01 *EQ ("' *CAT &DCA01 *CAT '") & CA17 +
                          *EQ %RANGE("' *CAT &COMPS *CAT '" "' *CAT +
                          &COMPE *CAT '") & CA02 *EQ %RANGE("' *CAT +
                          &DCA02S *CAT '" "' *CAT &DCA02E *CAT '") +
                          & CA11 *NE 0 & CA11 *EQ %RANGE(' *CAT +
                          &YCA11S *CAT ' ' *CAT &YCA11E *CAT ') & +
                          CA10 *EQ %RANGE(' *CAT &YCA10S *CAT ' ' +
                          *CAT &YCA10E *CAT ') &  CA20 *NE "V" ') +
                          KEYFLD((CA17) (CA05) (CA04)) +
                          MAPFLD((CA05L '%SST(CA05 1 3)' +
                          *CHAR 3) (CA04L '%SST(CA04 1 4)' *CHAR 4))
                ENDDO
                IF      COND(&DSEL3 *EQ 'B') THEN(DO)
                OPNQRYF FILE((PCCALF01)) FORMAT(PCWF01) QRYSLT(' +
                          CA01 *EQ ("' *CAT &DCA01 *CAT '") & CA17 +
                          *EQ %RANGE("' *CAT &COMPS *CAT '" "' *CAT +
                          &COMPE *CAT '") & CA02 *EQ %RANGE("' *CAT +
                          &DCA02S *CAT '" "' *CAT &DCA02E *CAT '") +
                          & CA11 *EQ 0 & CA11 *EQ %RANGE(' *CAT +
                          &YCA11S *CAT ' ' *CAT &YCA11E *CAT ') & +
                          CA10 *EQ %RANGE(' *CAT &YCA10S *CAT ' ' +
                          *CAT &YCA10E *CAT ') &  CA20 *NE "V" ') +
                          KEYFLD((CA17) (CA05) (CA04)) +
                          MAPFLD((CA05L '%SST(CA05 1 3)' +
                          *CHAR 3) (CA04L '%SST(CA04 1 4)' *CHAR 4))
                ENDDO
                IF      COND(&DSEL3 *EQ 'C') THEN(DO)
                OPNQRYF FILE((PCCALF01)) FORMAT(PCWF01) QRYSLT(' +
                          CA01 *EQ ("' *CAT &DCA01 *CAT '") & CA17 +
                          *EQ %RANGE("' *CAT &COMPS *CAT '" "' *CAT +
                          &COMPE *CAT '") & CA02 *EQ %RANGE("' *CAT +
                          &DCA02S *CAT '" "' *CAT &DCA02E *CAT '") +
                          & CA11 *EQ %RANGE(' *CAT &YCA11S *CAT ' ' +
                          *CAT &YCA11E *CAT ') & CA10 *EQ %RANGE(' +
                          *CAT &YCA10S *CAT ' ' *CAT &YCA10E *CAT +
                          ') &  CA20 *NE "V" ') KEYFLD((CA17) +
                          (CA05) (CA04)) MAPFLD((CA05L '%SST(CA05 1 +
                          3)' *CHAR 3) (CA04L '%SST(CA04 1 4)' +
                          *CHAR 4))
                ENDDO
             ENDDO

             CALL       PCR0431
             CHGVAR     VAR(&P6601I) VALUE('PCR043P')

             CLOF       OPNID(PCCALF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             ENDPGM
