     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266     */
     /*                                                             */
     /*    AUTHOR       : MERCURY                                   */
     /*    CREATE DATE  : 82/10/06                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : PTR540C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :基本資料子系統                           */
     /*    REMARK       :成本中心明細表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$PENV)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I) TYPE(*DEC)  LEN(3 0)

             DCL        VAR(&D#A01S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&D#A01E) TYPE(*CHAR) LEN(5)

             CHGVAR     VAR(&D#A01S) VALUE(%SST(*LDA 601 6))
             CHGVAR     VAR(&D#A01E) VALUE(%SST(*LDA 607 6))

             OVRPRTF    FILE(PTR540P) USRDTA('成本中心')
             OVRDBF     FILE(PT#APF) SHARE(*YES)

             OPNQRYF    FILE((PT#APF)) QRYSLT('#A01  *EQ %RANGE("' +
                          *CAT &D#A01S *CAT '" "' *CAT &D#A01E *CAT +
                          '") ') KEYFLD((#A01))

             CALL       PTR5401

             CLOF       OPNID(PT#APF)
             DLTOVR     FILE(PT#APF)
             DLTOVR     FILE(PTR540P)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PTR540P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
