     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       :                                           */
     /*    CREATE DATE  : 81/01/10                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : PTR550C1                                  */
     /*    SYSTEM       :總帳系統　                               */
     /*    SUBSYSTEM    :支援子系統                               */
     /*    REMARK       :費用廠商清冊列印                         */
     /***************************************************************/
             PGM
             DCL        VAR(&$PENV)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6402I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6403I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6404I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DMB01S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DMB01E) TYPE(*CHAR) LEN(5)

             CHGVAR     VAR(&DMB01S) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DMB01E) VALUE(%SST(*LDA 606 5))

             OVRPRTF    FILE(PTR550PT) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('費用廠商')
             OVRDBF     FILE(MTMBLF02) SHARE(*YES)

             OPNQRYF    FILE((MTMBLF02)) QRYSLT('MB01  *EQ %RANGE("' +
                          *CAT &DMB01S *CAT '" "' *CAT &DMB01E *CAT +
                          '") ') KEYFLD((MB01))

             CALL       PTR5501T

             CLOF       OPNID(MTMBLF02)
             DLTOVR     FILE(MTMBLF02)
             DLTOVR     FILE(PTR550PT)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('PTR550PT')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
