     A*%%TS  SD  19930301  144423  REPGMR      REL-V2R1M1  5738-PW1
     A*  92/09/30  09:10:17    TSPGMR      REL-R03M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : CK_INSTALL                                 *
     A*    PROGRAM NAME :票據管理系統安裝程式                      *
     A*    AUTHOR       : A1062   JEANNY                             *
     A*    CREATE DATE  : 1993.03.01                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :票據系統                                  *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R DSPD1
     A                                      CA03(03)
     A                                  1  2'<CK_INSTALL>'
     A                                  1 29'票據管理系統安裝資料'
     A                                      DSPATR(RI)
     A*
     A                                  6  9'日期格式:'
     A            DFMT           1   B  6 21DSPATR(MDT)
     A                                      VALUES('1' '2' '3' '5')
     A                                  6 23'( 1-00YYMMDD  2-0YYYMMDD  3-00MMDD-
     A                                      YY  5-00DDMMYY )'
     A*
     A                                  7  9'日期曆別:'
     A            DTYPE          1   B  7 21DSPATR(MDT)
     A                                      VALUES('1' '2')
     A                                  7 23'( 1-西曆    2-國曆)'
     A*
     A                                  9  9'是否使用泛太總帳系統:'
     A            DGL            1   B  9 33DSPATR(MDT)
     A                                      VALUES('Y' 'N')
     A                                  9 35'( Y-是   N-否 )'
     A*
     A                                 10  9'畫面與報表之公司全名:'
     A            DCOMPN        32   B 10 33DSPATR(MDT)
     A*
     A                                 12  9'最高權利USER PROFILE:'
     A            DHIGH         10   B 12 33DSPATR(MDT)
     A*
     A                                 13  9'一般操作USER PROFILE:'
     A            DUSER         10   B 13 33DSPATR(MDT)
     A*
     A                                 23  2'執行'
     A                                 23 11'F3 =回主畫面'
     A                                 24 67'【泛太資訊】'
