     A*%%TS  SD  19940614  104109  MAY         REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : CKA000                                     *
     A*    PROGRAM NAME : 開票作業主畫面　　                       *
     A*    AUTHOR       : A1149   HUANG.SHU.MEI                      *
     A*    CREATE DATE  : 1993/12/31                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 應付帳款VS票據系統                     *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(22)
     A                                      PRINT
     A*                                     CA12(12)
     A          R DSPD1
     A*%%TS  SD  19940614  104109  MAY         REL-V2R2M0  5738-PW1
     A                                  1  2'<CKA000>'
     A            CONAME        40A  O  1 23MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 70EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 32'開票作業主畫面'
     A                                      DSPATR(RI)
     A                                  4 33'開票作業'
     A                                  5 26'*******************************'
     A                                  7 27'01.應付票據開票作業　  (CK)'
     A                                  9 27'02.專櫃貨款轉開票作業  (AP)'
     A                                 11 27'03.連號請款開票作業　  (AP)'
     A                                 13 27'04.應付費用個別開票作業(AP)'
     A                                 15 27'90.結束'
     A                                 17 30'請輸入選擇項目:'
     A            DOP            2A  B 17 48DSPATR(MDT)
     A                                      VALUES('01' '02' '03' '04' '90')
     A  98        ERR1          70A  O 22  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 24 67'【泛太資訊】'
