     A*%%TS  SD  19940614  104109  MAY         REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : CKA001                                     *
     A*    PROGRAM NAME : 　　　　　　　　　                       *
     A*    AUTHOR       : A1149   HUANG.SHU.MEI                      *
     A*    CREATE DATE  : 1993/12/31                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 應付帳款VS票據系統                     *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(22)
     A                                      PRINT
     A*                                     CA12(12)
     A          R DSPD1
     A*%%TS  SD  19940614  104109  MAY         REL-V2R2M0  5738-PW1
     A                                  1  2'<CKA002>'
     A            CONAME        40A  O  1 23MSGID(US# 9001 S#MF)
     A                                  1 70DATE EDTCDE(Y)
     A                                  2  2USER
     A                                  2 32'產生會計傳票主畫面'
     A                                      DSPATR(RI)
     A                                  5 26'*******************************'
     A                                  7 27'01.產生兌現傳票科目設定作業'
     A                                      DSPATR(UL)
     A                                  8 27'02.產生兌現傳票批次作業　 '
     A                                      DSPATR(UL)
     A                                  9 27'03.非貨款現金收入開立傳票'
     A                                      DSPATR(UL)
     A                                 10 27'04.非貨款票據收入開立傳票'
     A                                      DSPATR(UL)
     A                                 11 27'05.現金支出開立傳票'
     A                                      DSPATR(UL)
     A                                 12 27'06.票據支付開立傳票'
     A                                      DSPATR(UL)
     A                                 19 27'90.結束'
     A                                 21 30'請輸入選擇項目:'
     A            DOP            2A  B 21 48DSPATR(MDT)
     A                                      VALUES('01' '02' '03' '04' '05' +
     A                                       '06' '90')
     A  98        ERR1          70A  O 22  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 24 67'【泛太資訊】'
