     A*%%TS  SD  19930518  103824  TSPGMR      REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : CKA1D0                                     *
     A*    PROGRAM NAME :銀行帳戶資料維護                          *
     A*    AUTHOR       : A1152      ANGY                            *
     A*    CREATE DATE  : 92/9/17                                    *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/CKRF)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19930210  215704  REPGMR      REL-V2R1M1  5738-PW1
     A                                      CA03(03)
     A                                      CF18(18)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A                                  1  2'<CKA1D0.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 70EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 31'銀行帳戶資料維護'
     A                                      DSPATR(RI)
     A                                  4  1'公司別　:'
     A            DHD01     R        B  4 13REFFLD(HD01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            DHD01N    R        O  4 16REFFLD(#B03 RERF)
     A                                  5  1'帳戶簡碼:'
     A            DHD04     R        B  5 13REFFLD(HD04)
     A  88
     AO 61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  5 20'(拷貝:'
     A            DHD01C    R        B  5 29REFFLD(HD01)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A            DHD04C    R        B  5 32REFFLD(HD04)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  5 39')'
     A                                  6  1'作業選擇:'
     A            DOPT           1Y 0B  6 13VALUES(1 2 4 5)
     A                                      EDTCDE(4)
     A                                  6 15'( 1.新增'
     A                                  6 26'2.修改'
     A                                  6 35'4.刪除'
     A                                  6 44'5.查詢)'
     A                                  7  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 11'F3 =回主畫面'
     A                                 23 28'F18=全頁查詢'
     A                                 24 67'【泛太資訊】'
     A*----------------------------------------------------------------
     A          R DSPD2
     A*%%TS  SD  19930518  103824  TSPGMR      REL-V2R2M0  5738-PW1
     A                                      CSRLOC(#LIN       #COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF05(05)
     A                                      CF12(12)
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A            ERRID          7A  H
     A            ERRF          10A  H
     A                                  1  2'<CKA1D0.2>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 70EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 31'銀行帳戶資料維護'
     A                                      DSPATR(RI)
     A                                  4  1'公司別　:'
     A            DHD01     R        O  4 13REFFLD(HD01)
     A            DHD01N    R        O  4 16REFFLD(#B03 RERF)
     A                                  5  1'帳戶簡碼:'
     A            DHD04     R        O  5 13REFFLD(HD04)
     A                                  5 20'(拷貝:'
     A            DHD01C    R        O  5 29REFFLD(HD01)
     A            DHD04C    R        O  5 32REFFLD(HD04)
     A                                  5 39')'
     A                                  6  1'作業選擇:'
     A            DOPT           1Y 0O  6 13EDTCDE(4)
     A                                  6 15'( 1.新增'
     A                                  6 26'2.修改'
     A                                  6 35'4.刪除'
     A                                  6 44'5.查詢)'
     A                                  7  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------'
     A                                  8  1'銀行帳戶:'
     A            DHD02     R        B  8 13REFFLD(HD02)
     A                                      CHECK(RB)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                  9  1'銀行代碼:'
     A                                      DSPATR(HI)
     A            DHD03     R        B  9 13REFFLD(HD03)
     A N99                                  DSPATR(HI)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DHB03     R        O  9 21REFFLD(HB03)
     A                                 10  1'帳戶種類:'
     A                                      DSPATR(HI)
     A            DHD05     R        B 10 13REFFLD(HD05)
     A N99                                  DSPATR(HI)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            D#A03         10A  O 10 15
     A                                 11  1'會計科目:'
     A                                      DSPATR(HI)
     A            DHD08     R        B 11 13REFFLD(HD08)
     A N99                                  DSPATR(HI)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            AF03      R        O 11 22REFFLD(AF03 GLAFPF)
     A                                 12  1'帳面餘額:'
     A            DHD07     R        B 12 13REFFLD(HD07)
     A                                      EDTCDE(J)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 13  1'使用幣別:'
     A            DHD06     R        B 13 13REFFLD(HD06)
     A  67                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 14  1'支票格式:'
     A            DHD21     R        B 14 13REFFLD(HD21)
     A  68                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 15  1'本票格式:'
     A            DHD22     R        B 15 13REFFLD(HD22)
     A  69                                  DSPATR(PC)
     A  69                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 16  1'保留帳戶:'
     A            DHD09     R        B 16 13REFFLD(HD09)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 16 15'(Y :保留)'
     A                                 17  1'備　　註:'
     A            DHD10     R        B 17 13REFFLD(HD10)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 11'F3 =回主畫面'
     A                                 23 28'F4 =欄位查詢'
     A                                 23 45'F5 =參考資料'
     A                                 23 62'F12=回前畫面'
     A                                 24 67'【泛太資訊】'
