     A*%%TS  SD  19930512  102751  REPGMR      REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : CKA1G0                                     *
     A*    PROGRAM NAME : 產生會計船票設定                         *
     A*    AUTHOR       : A1149  HUANG.SUE-MEI                       *
     A*    CREATE DATE  : 1993.05.12                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 票據系統                                 *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/GLRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A**                                    CSRLOC(#LIN #COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF18(18)
     A**          #LIN           3  0H
     A**          #COL           3  0H
     A                                  1  2'<CKA1G0.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 31'產生會計傳票設定'
     A                                      DSPATR(RI)
     A                                  4  2'公司別　:'
     A            DAF01     R        B  4 14REFFLD(AF01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            DAF01N        16A  O  4 18
     A                                  5  2'科目代號:'
     A            DAF02     R        B  5 14REFFLD(AF02)
     A  88
     AO 61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  6  2'作業選擇:'
     A            DOPT           1Y 0B  6 14VALUES(1 2 4 5)
     A                                      EDTCDE(4)
     A                                  6 18'( 1.新增'
     A                                  6 29'2.修改'
     A                                  6 38'4.刪除'
     A                                  6 47'5.查詢)'
     A                                  7  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A*
     A            ERRID          7   H
     A            ERRF          10   H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'PF3=回主畫面'
     A                                 23 28'PF4=提示'
     A                                 23 46'PF18=全頁查詢'
     A                                 24 67'【泛太資訊】'
     A*----------------------------------------------------------------
     A          R DSPD2
     A*%%TS  SD  19930512  102751  REPGMR      REL-V2R2M0  5738-PW1
     A                                      CSRLOC(#LIN       #COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF05(05)
     A                                      CF12(12)
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<CKA1G0.2>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 31'產生會計傳票設定'
     A                                      DSPATR(RI)
     A                                  4  2'公司別　:'
     A            DAF01     R        O  4 14REFFLD(AF01)
     A            DAF01N        16A  O  4 18
     A                                  5  2'科目代號:'
     A            DAF02     R        O  5 14REFFLD(AF02)
     A                                  6  2'作業選擇:'
     A            DOPT           1Y 0O  6 14EDTCDE(4)
     A                                  6 18'( 1.新增'
     A                                  6 29'2.修改'
     A                                  6 38'4.刪除'
     A                                  6 47'5.查詢)'
     A                                  7  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  8  2'會計科目:'
     A            DAF03     R        O  8 14REFFLD(AF03)
     A                                  8 50'輸入　票據系統資料代碼　彙總'
     A                                  9  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 10  5'1. 成本中心......:'
     A                                      DSPATR(HI)
     A            DAF11     R        O 10 26REFFLD(AF11)
     A            DAA31     R        O 10 29REFFLD(AA03)
     A                                 11  5'2. 對象別........:'
     A                                      DSPATR(HI)
     A            DAF12     R        O 11 26REFFLD(AF12)
     A            DAA32     R        O 11 29REFFLD(AA03)
     A                                 12  5'3. 相關號碼１....:'
     A                                      DSPATR(HI)
     A            DAF13     R        O 12 26REFFLD(AF13)
     A            DAA33     R        O 12 29REFFLD(AA03)
     A                                 13  5'4. 相關號碼２....:'
     A                                      DSPATR(HI)
     A            DAF14     R        O 13 26REFFLD(AF14)
     A            DAA34     R        O 13 29REFFLD(AA03)
     A                                 14  5'5. 日期..........:'
     A                                      DSPATR(HI)
     A            DAF15     R        O 14 26REFFLD(AF15)
     A            DAA35     R        O 14 29REFFLD(AA03)
     A                                 15  5'6. 數量..........:'
     A                                      DSPATR(HI)
     A            DAF16     R        O 15 26REFFLD(AF16)
     A            DAA36     R        O 15 29REFFLD(AA03)
     A                                 16  5'7. 其它..........:'
     A                                      DSPATR(HI)
     A            DAF17     R        O 16 26REFFLD(AF17)
     A            DAA37     R        O 16 29REFFLD(AA03)
     A            DAF181         1A  O 10 52
     A            DAF182         1A  O 11 52
     A            DAF183         1A  O 12 52
     A            DAF184         1A  O 13 52
     A            DAF185         1A  O 14 52
     A            DAF186         1A  O 15 52
     A            DAF187         1A  O 16 52
     A            DHG031         2A  B 10 57
     A N99                                  DSPATR(HI)
     A  71                                  DSPATR(PC)
     A  71                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DHG032         2A  B 11 57
     A N99                                  DSPATR(HI)
     A  72                                  DSPATR(PC)
     A  72                                  DSPATR(RI)
     A  32                                  DSPATR(UL)
     A N32                                  DSPATR(PR)
     A            DHG033         2A  B 12 57
     A N99                                  DSPATR(HI)
     A  73                                  DSPATR(PC)
     A  73                                  DSPATR(RI)
     A  33                                  DSPATR(UL)
     A N33                                  DSPATR(PR)
     A            DHG034         2A  B 13 57
     A N99                                  DSPATR(HI)
     A  74                                  DSPATR(PC)
     A  74                                  DSPATR(RI)
     A  34                                  DSPATR(UL)
     A N34                                  DSPATR(PR)
     A            DHG035         2A  B 14 57VALUES('04' '05' '12' '  ')
     A N99                                  DSPATR(HI)
     A  75                                  DSPATR(PC)
     A  75                                  DSPATR(RI)
     A  35                                  DSPATR(UL)
     A N35                                  DSPATR(PR)
     A            DHG036         2A  B 15 57VALUES('09' '10' '  ')
     A N99                                  DSPATR(HI)
     A  76                                  DSPATR(PC)
     A  76                                  DSPATR(RI)
     A  36                                  DSPATR(UL)
     A N36                                  DSPATR(PR)
     A            DHG037         2A  B 16 57
     A N99                                  DSPATR(HI)
     A  77                                  DSPATR(PC)
     A  77                                  DSPATR(RI)
     A  37                                  DSPATR(UL)
     A N37                                  DSPATR(PR)
     A            D#A031        14A  O 10 60
     A            D#Y032        14A  O 11 60
     A            D#A033        14A  O 12 60
     A            D#A034        14A  O 13 60
     A            D#A035        14A  O 14 60
     A            D#A036        14A  O 15 60
     A            D#A037        14A  O 16 60
     A            DHG041         1Y 0B 10 77EDTCDE(4)
     A  81                                  DSPATR(PC)
     A  81                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DHG042         1Y 0B 11 77EDTCDE(4)
     A  82                                  DSPATR(PC)
     A  82                                  DSPATR(RI)
     A  32                                  DSPATR(UL)
     A N32                                  DSPATR(PR)
     A            DHG043         1Y 0B 12 77EDTCDE(4)
     A  83                                  DSPATR(PC)
     A  83                                  DSPATR(RI)
     A  33                                  DSPATR(UL)
     A N33                                  DSPATR(PR)
     A            DHG044         1Y 0B 13 77EDTCDE(4)
     A  84                                  DSPATR(PC)
     A  84                                  DSPATR(RI)
     A  34                                  DSPATR(UL)
     A N34                                  DSPATR(PR)
     A            DHG045         1Y 0B 14 77EDTCDE(4)
     A  85                                  DSPATR(PC)
     A  85                                  DSPATR(RI)
     A  35                                  DSPATR(UL)
     A N35                                  DSPATR(PR)
     A            DHG046         1Y 0B 15 77EDTCDE(4)
     A  86                                  DSPATR(PC)
     A  86                                  DSPATR(RI)
     A  36                                  DSPATR(UL)
     A N36                                  DSPATR(PR)
     A            DHG047         1Y 0B 16 77EDTCDE(4)
     A  87                                  DSPATR(PC)
     A  87                                  DSPATR(RI)
     A  37                                  DSPATR(UL)
     A N37                                  DSPATR(PR)
     A                                 18  8'沖帳代碼......:'
     A                                      DSPATR(HI)
     A            DAF10     R        O 18 26REFFLD(AF10)
     A            DAE03     R        O 18 29REFFLD(AE03)
     A                                 19  8'分類帳碼......:'
     A                                      DSPATR(HI)
     A            DAF22     R        O 19 26REFFLD(AF22)
     A            DA303     R        O 19 29REFFLD(A303)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'PF3 =回主畫面'
     A                                 23 27'PF4 =欄位查詢'
     A                                 23 45'PF5 =參考資料'
     A                                 23 61'PF12=回前畫面'
     A                                 24 67'【泛太資訊】'
