     A*%%TS  SD  19950208  132146  LILY        REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : CKA220                                     *
     A*    PROGRAM NAME : 票據格式設定維護                         *
     A*    AUTHOR       : A1162 IVORY                                *
     A*    CREATE DATE  : 84/02/07                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/CKRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A                                      CA03(03)
     A                                      CF18(18)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A                                  1  2'<CKA220.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 70EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 32'票據格式設定維護'
     A                                      DSPATR(RI)
     A                                  4  1'公司別　:'
     A            DHI01     R        B  4 13REFFLD(CKRFR/HI01 *LIBL/CKRF)
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A  32                                  DSPATR(UL)
     A N32                                  DSPATR(PR)
     A            DHI01N    R        O  4 16REFFLD(PTRFR/#B02 *LIBL/PTRF)
     A                                  5  1'票據種類:'
     A            DHI02     R        B  5 13REFFLD(CKRFR/HI02 *LIBL/CKRF)
     A                                      VALUES('1' '3')
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  5 16'( 1.本票 3.支票)'
     A                                  6  1'票據格式:'
     A            DHI03     R        B  6 13REFFLD(CKRFR/HI03 *LIBL/CKRF)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                  7  1'作業選擇:'
     A            DOPT           1Y 0B  7 13EDTCDE(4)
     A                                      VALUES(1 2 4 5 7)
     A                                  7 15'( 1.新增'
     A                                  7 26'2.修改'
     A                                  7 35'4.刪除'
     A                                  7 44'5.查詢'
     A                                  7 53'7.試印)'
     A                                  8  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 11'F3 =回主畫面'
     A                                 23 28'F18=全頁查詢'
     A                                 24 67'【泛太資訊】'
     A*----------------------------------------------------------------
     A          R DSPD2
     A*%%TS  SD  19950208  132146  LILY        REL-V2R2M0  5738-PW1
     A                                      CA03(03)
     A                                      CF12(12)
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A            ERRID          7A  H
     A            ERRF          10A  H
     A                                  1  2'<CKA220.2>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 70EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 32'票據格式設定維護'
     A                                      DSPATR(RI)
     A                                  4  1'公司別　:'
     A            DHI01     R        O  4 13REFFLD(CKRFR/HI01 *LIBL/CKRF)
     A            DHI01N    R        O  4 16REFFLD(PTRFR/#B02 *LIBL/PTRF)
     A                                  5  1'票據種類:'
     A            DHI02     R        O  5 13REFFLD(CKRFR/HI02 *LIBL/CKRF)
     A                                  5 16'( 1.本票 3.支票)'
     A                                  6  1'票據格式:'
     A            DHI03     R        O  6 13REFFLD(CKRFR/HI03 *LIBL/CKRF)
     A                                  7  1'作業選擇:'
     A            DOPT           1Y 0O  7 13EDTCDE(4)
     A                                  7 15'( 1.新增'
     A                                  7 26'2.修改'
     A                                  7 35'4.刪除'
     A                                  7 44'5.查詢'
     A                                  7 53'7.試印)'
     A                                  8  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  9  1'請輸入起始值位置(行-R 列-C )-
     A                                      ;日期格式固定為: YYYYMMDD'
     A                                 11  4'Characters per inch :'
     A            DHI15     R        B 11 26REFFLD(CKRFR/HI15 *LIBL/CKRF)
     A  80                                  DSPATR(RI)
     A  80                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      VALUES('A' 'B')
     A                                 11 29'( A.10  B.15 )'
     A                                 13  3'日期曆別  -->'
     A            DHI04     R        B 13 19REFFLD(CKRFR/HI04 *LIBL/CKRF)
     A                                      VALUES('1' '2')
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 13 22'( 1.西曆 2.國曆)'
     A                                 14  3'開票日期  -->年('
     A            DHI051    R        B 14 24REFFLD(CKRFR/HI051 *LIBL/CKRF)
     A                                      EDTCDE(2)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      RANGE(0 20)
     A            DHI052    R        B 14 28REFFLD(CKRFR/HI052 *LIBL/CKRF)
     A                                      RANGE(0 198)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      EDTCDE(2)
     A                                 14 32')'
     A                                 14 34'月('
     A            DHI061    R        B 14 40REFFLD(CKRFR/HI061 *LIBL/CKRF)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      EDTCDE(2)
     A                                      RANGE(0 20)
     A            DHI062    R        B 14 44REFFLD(CKRFR/HI062 *LIBL/CKRF)
     A                                      RANGE(0 198)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      EDTCDE(2)
     A                                 14 48')'
     A                                 14 50'日('
     A            DHI071    R        B 14 56REFFLD(CKRFR/HI071 *LIBL/CKRF)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      EDTCDE(2)
     A                                      RANGE(0 20)
     A            DHI072    R        B 14 60REFFLD(CKRFR/HI072 *LIBL/CKRF)
     A                                      RANGE(0 198)
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      EDTCDE(2)
     A                                 14 64')'
     A                                 15  3'到期日期  -->年('
     A            DHI081    R        B 15 24REFFLD(CKRFR/HI081 *LIBL/CKRF)
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      EDTCDE(2)
     A                                      RANGE(0 20)
     A            DHI082    R        B 15 28REFFLD(CKRFR/HI082 *LIBL/CKRF)
     A                                      RANGE(0 198)
     A  68                                  DSPATR(RI)
     A  68                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      EDTCDE(2)
     A                                 15 32')'
     A                                 15 34'月('
     A            DHI091    R        B 15 40REFFLD(CKRFR/HI091 *LIBL/CKRF)
     A  69                                  DSPATR(RI)
     A  69                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      EDTCDE(2)
     A                                      RANGE(0 20)
     A            DHI092    R        B 15 44REFFLD(CKRFR/HI092 *LIBL/CKRF)
     A                                      RANGE(0 198)
     A  70                                  DSPATR(RI)
     A  70                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      EDTCDE(2)
     A                                 15 48')'
     A                                 15 50'日('
     A            DHI101    R        B 15 56REFFLD(CKRFR/HI101 *LIBL/CKRF)
     A  71                                  DSPATR(RI)
     A  71                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      EDTCDE(2)
     A                                      RANGE(0 20)
     A            DHI102    R        B 15 60REFFLD(CKRFR/HI102 *LIBL/CKRF)
     A                                      RANGE(0 198)
     A  72                                  DSPATR(RI)
     A  72                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      EDTCDE(2)
     A                                 15 64')'
     A                                 16  3'阿拉伯金額-->'
     A                                 16 19'('
     A            DHI111    R        B 16 21REFFLD(CKRFR/HI111 *LIBL/CKRF)
     A  73                                  DSPATR(RI)
     A  73                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      EDTCDE(2)
     A                                      RANGE(0 20)
     A            DHI112    R        B 16 25REFFLD(CKRFR/HI112 *LIBL/CKRF)
     A                                      RANGE(0 198)
     A  74                                  DSPATR(RI)
     A  74                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      EDTCDE(2)
     A                                 16 29')'
     A                                 17  3'大寫金額  -->'
     A                                 17 19'('
     A            DHI121    R        B 17 21REFFLD(CKRFR/HI121 *LIBL/CKRF)
     A  75                                  DSPATR(RI)
     A  75                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      EDTCDE(2)
     A                                      RANGE(0 20)
     A            DHI122    R        B 17 25REFFLD(CKRFR/HI122 *LIBL/CKRF)
     A                                      RANGE(0 198)
     A  76                                  DSPATR(RI)
     A  76                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      EDTCDE(2)
     A                                 17 29')'
     A            DHI13     R        B 17 35REFFLD(CKRFR/HI13 *LIBL/CKRF)
     A  77                                  DSPATR(RI)
     A  77                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      VALUES('1' '2')
     A                                 17 37'( 1.中文 2.英文)'
     A                                 18  3'付款對象  -->'
     A                                 18 19'('
     A            DHI141    R        B 18 21REFFLD(CKRFR/HI141 *LIBL/CKRF)
     A  78                                  DSPATR(RI)
     A  78                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      EDTCDE(2)
     A                                      RANGE(0 20)
     A            DHI142    R        B 18 25REFFLD(CKRFR/HI142 *LIBL/CKRF)
     A                                      RANGE(0 198)
     A  79                                  DSPATR(RI)
     A  79                                  DSPATR(PC)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      EDTCDE(2)
     A                                 18 29')'
     A                                 20  3'格式說明:'
     A            DHI16     R        B 20 15REFFLD(HI16 CKRF)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 11'F3 =回主畫面'
     A                                 23 28'F12=回前畫面'
     A                                 24 67'【泛太資訊】'
