     A*%%TS  SD  19930513  131015  REPGMR      REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : CKB310                                     *
     A*    PROGRAM NAME :產生會計傳票                              *
     A*    AUTHOR       : A1149   HUANG.SHU-MEI                      *
     A*    CREATE DATE  : 1993.05.13                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 票據系統
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/CKRF)
     A                                      PRINT
     A          R DSPD1
     A                                      CA03(03)
     A                                      CF14(14)
     A  28                                  FRCDTA
     A  28                                  LOCK
     A                                  1  2'<CKB310>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 70EDTCDE(Y)
     A                                  2 33'產生會計傳票'
     A                                      DSPATR(RI)
     A            $USERN        10A  O  2  2
     A                                  6 27'公司別　:'
     A            DHA02          2   B  6 39
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            DHA02N    R        O  6 43REFFLD(#B03 RERF)
     A                                  8 27'資料日期:'
     A            DHA15          7Y 0B  8 39EDTWRD('   /  /  ')
     A  88
     AO 61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  8 49'前(含當日)'
     A                                 10 27'已執行兌現作業之票據資料'
     A                                 12 27'批次處理產生會計傳票'
     A                                 14 26'(最近一次執行日:'
     A            LDATE          7Y 0O 14 45EDTWRD('   /  /  ')
     A                                 14 55')'
     A  28                             21 30'傳票處理中，請稍候'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2' '
     A                                 23 11'F3 =回主畫面'
     A                                 23 28'F14=過帳執行'
     A                                 24 67'【泛太資訊】'
