     A*%%TS  SD  19940126  162302  ICIPGMR     REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : CKB330                                     *
     A*    PROGRAM NAME :應付票據明細表                            *
     A*    AUTHOR       : A1162  IVORY                               *
     A*    CREATE DATE  : 1994.01.26                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :票據系統                                  *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/CKRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19940126  162302  ICIPGMR     REL-V2R2M0  5738-PW1
     A                                      CSRLOC(#LIN       #COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF14(14)
     A  28                                  FRCDTA
     A  28                                  LOCK
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A            ERRID          7A  H
     A            ERRF          10A  H
     A                                  1  2'CKB330'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 70EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 27'票據資料批次列印傳票作業'
     A                                      DSPATR(RI)
     A                                  5 21'****挑選範圍:'
     A                                  7 25'傳票日期:'
     A            D01S           7Y 0B  7 37EDTWRD('   /  /  ')
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A                                  7 47'-'
     A            D01E           7Y 0B  7 49EDTWRD('   /  /  ')
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  8 25'列印方式:'
     A            D02            1   B  8 37VALUES('1' '2')
     A                                  8 41'( 1:首印 2:重印)'
     A                                  9 25'傳票號碼:'
     A            D03S           9   B  9 37
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                  9 48'-'
     A            D03E           9   B  9 50
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                 11 21'****作業類別:'
     A            D04            1   B 11 37VALUES('1' '2')
     A                                 11 43'1:開票傳票'
     A                                 12 43'2:兌現傳票'
     A                                 18 24'執行環境:'
     A            $PENV          1A  B 18 36VALUES('0' '1' '2')
     A                                 18 39'(0-查詢 1-即時 2-批次)'
     A                                 19 24'列印份數:'
     A            $CPY           3Y 0B 19 36EDTCDE(3)
     A                                      CHECK(RB)
     A                                 20 24'列表機　:'
     A                                      DSPATR(HI)
     A            $PRTCD         2A  B 20 36DSPATR(HI)
     A  27                             21 29'請準備傳票專用報表紙'
     A                                      DSPATR(RI)
     A  28                             21 30'報表處理中，請稍候'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 11'PF3 =回主畫面'
     A                                 23 29'PF4 =欄位查詢'
     A                                 23 47'PF14=執行列印'
     A                                 24 67'【泛太資訊】'
