     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : CKB330P                                    *
     A*    PROGRAM NAME :票據資料批次列印傳票作業                  *
     A*    AUTHOR       : A1162  IVORY                               *
     A*    CREATE DATE  : 1994/01/26                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :票據系統                                  *
     A****************************************************************
     A                                      REF(APRF)
     A          R PH1                       SKIPB(3)
     A            PA15      R            111REFFLD(PA15)
     A                                      SPACEA(2)
     A            PAGE@          4  0    111
     A*                                  111PAGNBR
     A                                      EDTCDE(3)
     A                                      SPACEA(1)
     A            PRTY           2  0     57
     A            PRTM           2  0     66
     A            PRTD           2  0     75
     A                                      SPACEA(5)
     A*
     A          R PD1                       SPACEA(1)
     A  31        PA05      R              8REFFLD(PA05)
     A N31        PA05@     R             11REFFLD(PA05)
     A            PA07      R             33REFFLD(PA07)
     A            PA08      R             45REFFLD(PA08)
     A            PA09      R             48REFFLD(PA09)
     A            PA11      R             77REFFLD(PA11)
     A                                      SPACEA(2)
     A  31        PA05N         24         8
     A N31        PA05N@        24        11
     A            PA07N         10        33
     A            PA13      R             45REFFLD(PA13)
     A            PA12      R             77REFFLD(PA12)
     A            PA06      R             86REFFLD(PA06)
     A            WCASH1         9  0     92EDTCDE(2)
     A            WCASH2         9  0    108EDTCDE(2)
     A*
     A          R PT1                       SKIPB(33)
     A            PT01          10  0     90EDTCDE(2)
     A            PT02          10  0    106EDTCDE(2)
