     A*%%TS  SD  19940126  092611  MAY         REL-V2R2M0  5738-PW1
     A*  92/09/23  10:49:16    TSPGMR      REL-R03M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : CKI1E0                                     *
     A*    PROGRAM NAME :票據開票資料維護－全頁查詢                *
     A*    AUTHOR       : A1062                                      *
     A*    CREATE DATE  : 04/08/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/CKRF)
     A                                      PRINT
     A*  92/09/23  10:41:10    TSPGMR      REL-R03M00  5728-PW1
     A          R SFLSR                     SFL
     A*%%TS  SD  19940126  092611  MAY         REL-V2R2M0  5738-PW1
     A            RRN            4Y 0H
     A            DOPT           1A  B  8  2
     A            HF06N     R   -1   O  8  4REFFLD(HF06)
     A                                      EDTWRD('   /  /  ')
     A            HF71      R        O  8 14EDTCDE(4)
     A            HF03      R        O  8 19
     A            HF04N         10A  O  8 30
     A            HB02      R        O  8 41
     A            HF05N          6O  H
     A            HF73      R        O  8 53EDTCDE(4)
     A            HF07N     R   -1   O  8 59REFFLD(HF07)
     A                                      EDTWRD('   /  /  ')
     A            HF10      R        O  8 69EDTCDE(2)
     A*
     A*  92/09/23  10:49:16    TSPGMR      REL-R03M00  5728-PW1
     A          R SFLCR                     SFLCTL(SFLSR)
     A*%%TS  SD  19930506  171553  TSPGMR      REL-V2R2M0  5738-PW1
     A                                      SFLSIZ(0052)
     A                                      SFLPAG(0013)
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF12(12)
     A                                      ROLLUP(25)
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  96                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN           4S 0H      SFLRCDNBR
     A                                  1  2'<CKI1E0.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 70EDTWRD('  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 31'票據開票全頁查詢'
     A                                      DSPATR(RI)
     A                                  4  1'公司別　:'
     A            DHF02     R        B  4 13REFFLD(HF02)
     A                                      DSPATR(CS)
     A                                      DSPATR(HI)
     A            DHF02N    R           4 16REFFLD(#B03 RERF)
     A                                  6 52'列印'
     A                                  6  2'S'
     A                                  6  4'開票日'
     A                                  6 13'序號　票據號碼'
     A                                  6 30'廠商名稱'
     A                                  6 41'銀行簡稱'
     A                                  6 52'序號'
     A                                  6 61'到期日'
     A                                  6 71'票據金額'
     A            DHF06          7Y 0B  7  4EDTWRD('   /  /  ')
     A                                      DSPATR(HI)
     A                                      DSPATR(CS)
     A            DHF71     R        B  7 14REFFLD(HF71)
     A                                      EDTCDE(4)
     A                                      DSPATR(CS)
     A                                      DSPATR(HI)
     A          R DSPC1
     A*  92/09/23  10:49:16    TSPGMR      REL-R03M00  5728-PW1
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'F3=回主畫面'
     A                                 23 27'F12=回前畫面'
     A                                 23 44'PA1=下一頁'
     A                                 23 59'PA2=上一頁'
     A                                 24 67'【泛太資訊】'
