     A*%%TS  SD  19930210  214645  REPGMR      REL-V2R1M1  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : CKA190                                     *
     A*    PROGRAM NAME : 其它資金預測資料維護                     *
     A*    AUTHOR       : A1149  HUANG-SHU.MEI                       *
     A*    CREATE DATE  : 1993.02.22                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 票據系統                              *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/CKRF)
     A                                      PRINT
     A          R SFLSR                     SFL
     A*%%TS  SD  19930210  214645  REPGMR      REL-V2R1M1  5738-PW1
     A            RRN            3Y 0H
     A            DSEL           1A  B  8  2DSPATR(CS)
     A                                      DSPATR(PC)
     A                                      DSPATR(HI)
     A            DHA11     R   -1   O  8  5REFFLD(HA11)
     A                                      EDTWRD('   /  /  ')
     A            DHA41     R        O  8 16REFFLD(HA41)
     A                                      EDTCDE(4)
     A            DHA01          6O  O  8 22
     A            DHA16     R        O  8 30REFFLD(HA16)
     A            DHB02     R        O  8 45REFFLD(HB02)
     A            DHA23         10O  O  8 56
     A            DHA10     R        O  8 67REFFLD(HA10)
     A                                      EDTCDE(K)
     A*----------------------------------------------------------------
     A          R SFLCR                     SFLCTL(SFLSR)
     A*%%TS  SD  19930210  214645  REPGMR      REL-V2R1M1  5738-PW1
     A                                      SFLSIZ(0014)
     A                                      SFLPAG(0013)
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF12(12)
     A                                      ROLLUP(25)
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  96                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN           3S 0H      SFLRCDNBR
     A                                  1  2'<CKI190.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 70EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 29'其它資金預測全頁查詢'
     A                                      DSPATR(RI)
     A                                  4  1'公司別　:'
     A            DHA02S    R        B  4 13REFFLD(HA02)
     A                                      DSPATR(CS)
     A            DHA02N    R        O  4 16REFFLD(#B03 RERF)
     A                                  6  2'S  資金日期序號 性質　　+
     A                                      　預估帳戶   銀行名稱 來源用+
     A                                      途   資金金額'
     A                                      DSPATR(UL)
     A            DHA11S    R   -1   B  7  5REFFLD(HA11)
     A                                      EDTWRD('   /  /  ')
     A                                      DSPATR(CS)
     A                                      DSPATR(HI)
     A            DHA41S    R        B  7 16REFFLD(HA41)
     A                                      EDTCDE(4)
     A                                      DSPATR(CS)
     A                                      DSPATR(HI)
     A*----------------------------------------------------------------
     A          R DSPC1
     A            ERRID          7   H
     A            ERRF          10   H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'F3 =回主畫面'
     A                                 23 27'F12=回前畫面'
     A                                 23 44'PA1=下一頁'
     A                                 23 59'PA2=上一頁'
     A                                 24 67'【泛太資訊】'
