     A*%%TS  SD  19960606  162830  DERLERN     REL-V3R1M0  5763-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : CKI025D                                    *
     A*    PROGRAM NAME :                        *
     A*    AUTHOR       : A1209 STEVEN                               *
     A*    CREATE DATE  : 84/04/06                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/CKRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R SFLSR                     SFL
     A*%%TS  SD  19960606  162830  DERLERN     REL-V3R1M0  5763-PW1
     A  54                                  SFLNXTCHG
     A            RRN            3Y 0H
     A            HA03      R        O  9  2
     A            HA10      R        O  9 14EDTCDE(1)
     A            DHA15          6Y 0O  9 31EDTWRD('  /  /  ')
     A            DHA16          6A  O  9 47
     A*----------------------------------------------------------------
     A          R SFLCR                     SFLCTL(SFLSR)
     A*%%TS  SD  19950406  134248  LILY        REL-V2R3M0  5738-PW1
     A                                      SFLSIZ(0050)
     A                                      SFLPAG(0010)
     A                                      CSRLOC(#LIN       #COL)
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF12(12)
     A                                      ROLLUP(25)
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A            DRRN           3S 0H      SFLRCDNBR
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'CKI025.2'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DATE           6Y 0O  1 71EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 71TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2 34'傳票查詢票據'
     A                                      DSPATR(RI)
     A                                  4  1'公司別　:'
     A            DHA02     R        O  4 13REFFLD(HA02)
     A            #B02      R        O  4 16REFFLD(#B02 *LIBL/PT#BPF)
     A                                  5  1'傳票號碼:'
     A            DHA18     R        O  5 13REFFLD(HA18)
     A                                  6  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  7  1'票據號碼'
     A                                  7 20'金額'
     A                                  7 30'處理日期'
     A                                  7 45'處理帳號'
     A                                  8  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A*----------------------------------------------------------------
     A          R DSPC1
     A*%%TS  SD  19950417  143617  LILY        REL-V2R3M0  5738-PW1
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 11'PF3=回主畫面'
     A                                 23 28'PF12=回前畫面'
     A                                 23 46'PA1=下一頁'
     A                                 23 61'PA2=上一頁'
     A                                 24 67'【泛太資訊】'
     A*----------------------------------------------------------------
     A          R DSPD1
     A*%%TS  SD  19950406  133750  LILY        REL-V2R3M0  5738-PW1
     A                                      CSRLOC(#LIN       #COL)
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF18(18)
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'CKI025.1'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DATE           6Y 0O  1 71EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 71TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2 34'傳票查詢票據'
     A                                      DSPATR(RI)
     A                                  4  1'公司別　:'
     A            DHA02     R        B  4 13REFFLD(HA02)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A N31                                  DSPATR(UL)
     A  31                                  DSPATR(PR)
     A            #B02      R        O  4 16REFFLD(#B02 *LIBL/PT#BPF)
     A                                  5  1'傳票號碼:'
     A            DHA18     R        B  5 13REFFLD(HA18)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                  6  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 11'PF3=結束'
     A                                 23 25'PF4=欄位查詢'
     A                                 23 42'PF18=全頁查詢'
     A                                 24 67'【泛太資訊】'
