     A*%%TS  SD  19951102  102902  DERLERN     REL-V3R1M0  5763-PW1
     A*  92/10/07  15:56:39    TSPGMR      REL-R03M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : CKM000                                     *
     A*    PROGRAM NAME : 票據管理系統主畫面                       *
     A*    AUTHOR       : A1149  MAY                                 *
     A*    CREATE DATE  : 1992.10.07                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 票據管理系統                             *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(23)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19951102  102902  DERLERN     REL-V3R1M0  5763-PW1
     A                                  1  2'<CKM000>'
     A            CONAME        40A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 70EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 30'票據管理系統主畫面'
     A                                      DSPATR(RI)
     A                                  4  8'維護作業'
     A                                  4 33'查詢作業'
     A                                  4 56'報表作業'
     A                                  5  5'********************'
     A                                  5 30'********************'
     A                                  5 53'********************'
     A                                  6  5'11.應收票據維護'
     A                                      DSPATR(UL)
     A                                  6 30'21.應收票據查詢'
     A                                      DSPATR(UL)
     A                                  6 53'41.應收票據明細表'
     A                                      DSPATR(UL)
     A                                  7  5'12.應付票據維護'
     A                                      DSPATR(UL)
     A                                  7 30'22.應付票據查詢'
     A                                      DSPATR(UL)
     A                                  7 53'42.應付票據明細表'
     A                                      DSPATR(UL)
     A                                  8  5'13.票據託收作業'
     A                                      DSPATR(UL)
     A                                  8 30'23.銀行往來查詢'
     A                                      DSPATR(UL)
     A                                  8 53'43.財務動態日報表'
     A                                      DSPATR(UL)
     A                                  9  5'14.票據貼現作業'
     A                                      DSPATR(UL)
     A                                  9 30'24.銀行資金預測'
     A                                      DSPATR(UL)
     A                                 10 30'25.兌現票據傳票查詢'
     A                                      DSPATR(UL)
     A                                  9 53'44.帳戶收支明細表'
     A                                      DSPATR(UL)
     A                                 10  5'15.票據兌現作業'
     A                                      DSPATR(UL)
     A                                 10 53'45.票據兌現核對表'
     A                                      DSPATR(UL)
     A                                 11  5'16.票據退票作業'
     A                                      DSPATR(UL)
     A                                 14 33'其它作業'
     A                                 11 53'46.銀行資金預測表'
     A                                      DSPATR(UL)
     A                                 12  5'17.票據作廢作業'
     A                                      DSPATR(UL)
     A                                 15 30'********************'
     A                                 12 53'47.票據託收作業表'
     A                                      DSPATR(UL)
     A                                 13  5'18.票據狀況更正'
     A                                      DSPATR(UL)
     A                                 13 53'48.票據貼現作業表'
     A                                      DSPATR(UL)
     A                                 14  5'19.帳號存提轉作業'
     A                                      DSPATR(UL)
     A                                 14 53'49.票齡分析表'
     A                                      DSPATR(UL)
     A                                 16 30'31.產生會計傳票作業'
     A                                      DSPATR(UL)
     A                                 15  5'1A.銀行對帳單維護'
     A                                      DSPATR(UL)
     A                                 17 30'32.資料整理'
     A                                      DSPATR(UL)
     A                                 15 53'4A.銀行調節表'
     A                                      DSPATR(UL)
     A                                 16  5'1B.其他預測資金輸入'
     A                                      DSPATR(UL)
     A                                 18 30'71.代碼維護作業'
     A                                      DSPATR(UL)
     A                                 16 53'4B.簽收條／信封／掛號單'
     A                                      DSPATR(UL)
     A                                 17  5'1C.系統參數設定'
     A                                      DSPATR(UL)
     A                                 19 30'72.支票列印設定'
     A                                 17 53'4C.其他資金預測表'
     A                                      DSPATR(UL)
     A                                 18  5'1D.銀行資料維護'
     A                                      DSPATR(UL)
     A                                 18 53'4D.銀行基本資料列印'
     A                                      DSPATR(UL)
     A                                 19  5'1E.帳戶資料維護'
     A                                      DSPATR(UL)
     A                                 19 53'4E.銀行帳戶資料列印'
     A                                      DSPATR(UL)
     A                                 20  5'1F.開票對象維護'
     A                                      DSPATR(UL)
     A                                 20 53'4F.列印票據作業'
     A                                      DSPATR(UL)
     A                                 21  5'1G.應付票據確認作業'
     A                                      DSPATR(UL)
     A                                 21 30'90.結束'
     A                                      DSPATR(UL)
     A                                 21 53'4G.票據登錄明細表　'
     A                                      DSPATR(UL)
     A                                 22 53'4H.支票登記簿　'
     A                                      DSPATR(UL)
     A                                 22 29'請輸入選擇項目:'
     A            DOPID          2A  B 22 47DSPATR(MDT)
     A                                      VALUES('11' '12' '13' '14' '15' '16-
     A                                      ' '17' '18' '19' '1A' '1B' '1C' '1D-
     A                                      ' '1E' '1F' '1G' '21' '22' '23' '24-
     A                                      ' '31' '32' '41' '42' '43' '44' '45-
     A                                      ' '46' '47' '48' '49' '4A' '4B' '4C-
     A                                      ' '4D' '4E' '4F' '4G' '4H' '72' '90-
     A                                      ' '71' '25')
     A  98        ERR1          70A  O 23  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 67'【泛太資訊】'
     A                                 20 30'********************'
