     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : CKR4E0                                     *
     A*    PROGRAM NAME :其他資金預測表                            *
     A*    AUTHOR       : A1149  HUANG-SHU.MEI                       *
     A*    CREATE DATE  : 1993.02.23                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :票據系統                                  *
     A****************************************************************
     A                                      REF(CKRF)
     A          R PH1                       SKIPB(2)
     A            PCONAM    R              1REFFLD(#B02 RERF)
     A                                    75'日期:'
     A            PDATE          6  0     83EDTCDE(Y)
     A                                    94'頁次:'
     A                                   102PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'其他資金預測表－按預估帳+
     A                                       號排序'
     A                                    75'時間:'
     A                                    85TIME
     A                                      EDTWRD('  :  :  ')
     A                                    96'<CKR4E2P>'
     A                                      SPACEA(2)
     A                                     1'公司別　:'
     A            DHA02     R             13REFFLD(HA02)
     A                                    21'預測日期:'
     A            PHA11H         7  0     33EDTWRD('   /  /  ')
     A                                    42'前'
     A                                    49'預估帳戶:'
     A            PHA16F    R             61REFFLD(HA16)
     A                                    76'-'
     A            PHA16T    R             78REFFLD(HA16)
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==================='
     A                                      SPACEA(1)
     A                                     3'銀行帳號'
     A                                    16'資金日期　來源用途　性質'
     A                                    42'資金內容'
     A                                    87'台幣金額　　累計餘額'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==================='
     A*
     A          R PD1                       SPACEB(1)
     A  31        HA16      R              1REFFLD(HA16)
     A  32        PHA11          7  0     16EDTWRD('   /  /  ')
     A            PHA23C        10O       26
     A            PHA01C         4O       37
     A            HA42      R             42REFFLD(HA42)
     A            HA10      R             85REFFLD(HA10)
     A                                      EDTCDE(K)
     A            PBLN      R             97REFFLD(HA10)
     A                                      EDTCDE(K)
     A          R PD2                       SPACEB(1)
     A                                     1'                         '
     A*
     A          R PT1                       SPACEB(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==================='
     A*
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
