     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : CKR4C02                                    *
     A*    PROGRAM NAME :簽收條／信封／掛號單                      *
     A*    AUTHOR       : A1150                                      *
     A*    CREATE DATE  : 81/10/07                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A                                      REF(PTRF)
     A          R PD2                       SKIPB(15)
     A            PNO            4  0     55EDTCDE(4)
     A                                      SPACEA(2)
     A            HA04      R             16REFFLD(HA04 CKRF)
     A            P#D04         32        25
     A                                    56'啟'
     A                                      SPACEA(2)
     A            P#D05S        32        16
     A                                      SPACEA(1)
     A            P#D05E        32        16
     A*
     A          R PE2                       SKIPB(23)
     A                                    16'無符合列印範圍之資料'
