     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : CKR430                                     *
     A*    PROGRAM NAME :財務動態日報表                            *
     A*    AUTHOR       : A1149    MAY                               *
     A*    CREATE DATE  : 1992.10.08                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :票據系統                                  *
     A****************************************************************
     A                                      REF(CKRF)
     A          R PH1                       SKIPB(2)
     A            PCONAM    R              1REFFLD(#B02 RERF)
     A                                    94'日期:'
     A            PDATEC         6  0    102EDTCDE(Y)
     A                                   111'頁次:'
     A                                   119PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'財務動態日報表'
     A                                    94'時間:'
     A                                   102TIME
     A                                      EDTWRD('  :  :  ')
     A                                   113'<CKR430P>'
     A                                      SPACEA(2)
     A                                     1'公司別　:'
     A            DHA02     R             13REFFLD(HA02)
     A                                    33'日期:'
     A            PDATE          7  0     41EDTWRD('   /  /  ')
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ===='
     A                                      SPACEA(1)
     A                                     1'類別　　　銀行簡稱'
     A                                    22'帳號'
     A                                    37'前日餘額'
     A                                    55'本日存入'
     A                                    73'本日提出'
     A                                    91'本日餘額'
     A            DDATE1         4  0    101EDTWRD('  /  ')
     A            DDATE2         4  0    107EDTWRD('  /  ')
     A            DDATE3         4  0    113EDTWRD('  /  ')
     A            DDATE4         4  0    119EDTWRD('  /  ')
     A                                      SPACEA(1)
     A                                    28'【現況，單位：元------------+
     A                                       ------------------------------+
     A                                       --------】'
     A                                   100'【預測，單位：萬----】'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ===='
     A*
     A          R PD1                       SPACEB(1)
     A  31        PD01          10         1
     A            PD02          10        11
     A            PD03           6        22
     A            PD04          13  2     29EDTCDE(K)
     A            PD05          13  2     47EDTCDE(2)
     A            PD06          13  2     65EDTCDE(2)
     A            PD07          13  2     83EDTCDE(K)
     A            PD08           5  0    100EDTCDE(M)
     A            PD09           5  0    106EDTCDE(M)
     A            PD10           5  0    112EDTCDE(M)
     A            PD11           5  0    118EDTCDE(M)
     A*
     A          R PT1                       SPACEB(1)
     A                                    28'類別小計:'
     A            PT11          14  2     82EDTCDE(K)
     A                                      SPACEA(1)
     A*
     A          R PT2                       SPACEB(1)
     A                                     1'其他:'
     A            PT21          14  2     82EDTCDE(K)
     A                                      SPACEA(2)
     A                                     1'總計:'
     A            PT23          14  2     28EDTCDE(K)
     A            PT24          13  2     47EDTCDE(2)
     A            PT25          13  2     65EDTCDE(2)
     A            PT22          14  2     82EDTCDE(K)
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ===='
     A                                      SKIPA(62)
     A                                     3'總經理:'
     A                                    26'經理:'
     A                                    47'會計:'
     A                                    68'財務:'
     A                                    89'出納:'
     A*
     A          R PE9                       SPACEB(1)
     A                                    20'無符合列印範圍之資料'
