     A*%%TS  SD  19951215  125513  D910341     REL-V3R1M0  5763-PW1
     A*  92/10/05  13:46:01    TSPGMR      REL-R03M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : CKR4501                                    *
     A*    PROGRAM NAME :票據兌現核對表                            *
     A*    AUTHOR       : A1152      ANGY                            *
     A*    CREATE DATE  : 81/10/01                                   *
     A*    UPDATE DATE  : 81/10/05                                   *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/CKRF)
     A                                      PRINT
     A*  92/10/05  13:46:01    TSPGMR      REL-R03M00  5728-PW1
     A          R DSPD1
     A*%%TS  SD  19951215  114422  D910341     REL-V3R1M0  5763-PW1
     A                                      CSRLOC(#LIN       #COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A  28                                  FRCDTA
     A  28                                  LOCK
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A            ERRID          7A  H
     A            ERRF          10A  H
     A                                  1  2'<CKR450>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 70EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 32'票據兌現核對表'
     A                                      DSPATR(RI)
     A                                  6 23'公司別   :'
     A            DHA02     R        B  6 36REFFLD(HA02)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A            DHA02N    R        O  6 39REFFLD(#B03 RERF)
     A                                  8 23'性　　質 :'
     A            DHA01          1A  B  8 36VALUES(' ' '1' '2')
     A  88
     AO 62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  8 38'( 1應收 2應付 " "-ALL)'
     A                                 10 23'地區別   :'
     A            DHA59     R        B 10 36REFFLD(HA59)
     A                                 10 38'(應收:1北2-中3-南 " "-ALL)'
     A                                 12 23'銀行帳號 :'
     A                                      DSPATR(HI)
     A            DHA16F         6A  B 12 36
     A N99                                  DSPATR(HI)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                 12 43'-'
     A            DHA16T         6A  B 12 45
     A N99                                  DSPATR(HI)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                 14 23'兌現日期 :'
     A            DHA15F         7Y 0B 14 36EDTWRD('   /  /  ')
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A                                 14 46'-'
     A            DHA15T         7Y 0B 14 48EDTWRD('   /  /  ')
     A  66                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A                                 16 23'入帳類別 :'
     A            DHA27     R        B 16 36REFFLD(HA27 CKRF)
     A                                      VALUES('Y' 'N' ' ')
     A                                 16 38'( Y是 N否)'
     A                                 18 23'執行環境 :'
     A            $PENV          1A  B 18 36VALUES('0' '1' '2')
     A                                 18 39'(0-查詢 1-即時 2-批次)'
     A                                 19 23'列印份數 :'
     A            $CPY           3Y 0B 19 36EDTCDE(3)
     A                                      CHECK(RB)
     A                                 20 23'列表機　 :'
     A                                      DSPATR(HI)
     A            $PRTCD         2A  B 20 36DSPATR(HI)
     A  27                             21 30'請準備８０格報表紙'
     A                                      DSPATR(RI)
     A  28                             21 30'報表處理中，請稍候'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        ERRMSG        70   O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 11'F3 =回主畫面'
     A                                 23 28'F4 =欄位查詢'
     A                                 24 67'【泛太資訊】'
