     A*%%TS  SD  19930113  134222  REPGMR      REL-V2R1M1  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : CKS010D                                    *
     A*    PROGRAM NAME :票據代碼視窗查詢                          *
     A*    AUTHOR       : A1062   JEANNY                             *
     A*    CREATE DATE  : 82/01/12                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PTRF)
     A                                      PRINT
     A          R DSPC0
     A                                      ASSUME
     A                                  2  2' '
     A          R DSPD1
     A*%%TS  SD  19930113  134222  REPGMR      REL-V2R1M1  5738-PW1
     A                                      CA12(12)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      OVERLAY
     A                                      PROTECT
     A                                      CLRL(*NO)
     A                                  5 42'          票據代碼視窗查詢      -
     A                                          '
     A                                      DSPATR(RI)
     A                                  6 42' '
     A                                      DSPATR(RI)
     A                                  6 44'內容:'
     A            DHEAD         14O  O  6 52
     A N30                              6 67' 公司:'
     A N30        DCOMP     R        O  6 76REFFLD(#B01)
     A  30                              6 67'        '
     A  30                              6 76'  '
     A                                  6 79' '
     A                                      DSPATR(RI)
     A                                  7 42' '
     A                                      DSPATR(RI)
     A                                  7 44' S 代碼內容  代碼說明         '
     A                                      DSPATR(UL)
     A                                  7 79' '
     A                                      DSPATR(RI)
     A                                  8 42' '
     A                                      DSPATR(RI)
     A                                  8 44'  '
     A            DSTRK         10A  B  8 47DSPATR(CS)
     A                                  8 58'                    '
     A                                  8 79' '
     A                                      DSPATR(RI)
     A                                  9 42' '
     A                                      DSPATR(RI)
     A            DSEL1          1A  B  9 45
     A N61                                  DSPATR(ND)
     A N61                                  DSPATR(PR)
     A  61                                  DSPATR(CS)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(HI)
     A            DCODE1        10A  O  9 47
     A            DNAME1        18O  O  9 59
     A                                  9 77' '
     A                                  9 79' '
     A                                      DSPATR(RI)
     A                                 10 42' '
     A                                      DSPATR(RI)
     A            DSEL2          1A  B 10 45
     A N62                                  DSPATR(ND)
     A N62                                  DSPATR(PR)
     A  62                                  DSPATR(CS)
     A  62                                  DSPATR(HI)
     A            DCODE2        10A  O 10 47
     A            DNAME2        18O  O 10 59
     A                                 10 77' '
     A                                 10 79' '
     A                                      DSPATR(RI)
     A                                 11 42' '
     A                                      DSPATR(RI)
     A            DSEL3          1A  B 11 45
     A N63                                  DSPATR(ND)
     A N63                                  DSPATR(PR)
     A  63                                  DSPATR(CS)
     A  63                                  DSPATR(HI)
     A            DCODE3        10A  O 11 47
     A            DNAME3        18O  O 11 59
     A                                 11 77' '
     A                                 11 79' '
     A                                      DSPATR(RI)
     A                                 12 42' '
     A                                      DSPATR(RI)
     A            DSEL4          1A  B 12 45
     A N64                                  DSPATR(ND)
     A N64                                  DSPATR(PR)
     A  64                                  DSPATR(CS)
     A  64                                  DSPATR(HI)
     A            DCODE4        10A  O 12 47
     A            DNAME4        18O  O 12 59
     A                                 12 77' '
     A                                 12 79' '
     A                                      DSPATR(RI)
     A                                 13 42' '
     A                                      DSPATR(RI)
     A            DSEL5          1A  B 13 45
     A N65                                  DSPATR(ND)
     A N65                                  DSPATR(PR)
     A  65                                  DSPATR(CS)
     A  65                                  DSPATR(HI)
     A            DCODE5        10A  O 13 47
     A            DNAME5        18O  O 13 59
     A                                 13 77' '
     A                                 13 79' '
     A                                      DSPATR(RI)
     A                                 14 42' '
     A                                      DSPATR(RI)
     A            DSEL6          1A  B 14 45
     A N66                                  DSPATR(ND)
     A N66                                  DSPATR(PR)
     A  66                                  DSPATR(CS)
     A  66                                  DSPATR(HI)
     A            DCODE6        10A  O 14 47
     A            DNAME6        18O  O 14 59
     A                                 14 77' '
     A                                 14 79' '
     A                                      DSPATR(RI)
     A                                 15 42' '
     A                                      DSPATR(RI)
     A            DSEL7          1A  B 15 45
     A N67                                  DSPATR(ND)
     A N67                                  DSPATR(PR)
     A  67                                  DSPATR(CS)
     A  67                                  DSPATR(HI)
     A            DCODE7        10A  O 15 47
     A            DNAME7        18O  O 15 59
     A                                 15 77' '
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 16 42' '
     A                                      DSPATR(RI)
     A            DSEL8          1A  B 16 45
     A N68                                  DSPATR(ND)
     A N68                                  DSPATR(PR)
     A  68                                  DSPATR(CS)
     A  68                                  DSPATR(HI)
     A            DCODE8        10A  O 16 47
     A            DNAME8        18O  O 16 59
     A                                 16 77' '
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 17 42' '
     A                                      DSPATR(RI)
     A                                 17 44'                                  '
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 18 42'  F12 =回前畫面                 -
     A                                          '
     A                                      DSPATR(RI)
