     A*%%TS  SD  19930518  104323  TSPGMR      REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   獂び戈癟м秨祇Τそ⌒舦┮Τ    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : PTI#X0                                     *
     A*    PROGRAM NAME : ╰计把计琩高                         *
     A*    AUTHOR       : A1152    ANGY                              *
     A*    CREATE DATE  : 1992.09.23                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PTRF)
     A                                      PRINT
     A          R SFLSR                     SFL
     A*%%TS  SD  19930518  104323  TSPGMR      REL-V2R2M0  5738-PW1
     A            RRN            3Y 0H
     A            DOPT           1A  B  6  2DSPATR(CS)
     A                                      DSPATR(PC)
     A                                      DSPATR(HI)
     A            #X01      R        O  6  5REFFLD(#X01)
     A            #X02      R        O  6 13REFFLD(#X02)
     A            #X101          1   O  6 21
     A            D#X101         8A  O  6 24
     A            #X102          1   O  6 38
     A            D#X102         6A  O  6 41
     A            #X104          6A  O  6 53
     A            D#X104        14   O  6 61
     A*----------------------------------------------------------------
     A          R SFLCR                     SFLCTL(SFLSR)
     A*%%TS  SD  19930518  104323  TSPGMR      REL-V2R2M0  5738-PW1
     A                                      SFLSIZ(0060)
     A                                      SFLPAG(0015)
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF12(12)
     A                                      ROLLUP(25)
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  96                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN           3S 0H      SFLRCDNBR
     A                                  1  3'<PTI#X0.1>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DDATE          6Y 0O  1 70EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 31'╰参把计琩高'
     A                                      DSPATR(RI)
     A                                  4  2'S摸 そ  ら戳Α      -
     A                                       句         瞷眀め虏絏+
     A                                      絏         '
     A                                      DSPATR(UL)
     A            D#X01     R        B  5  5REFFLD(#X01)
     A                                      DSPATR(CS)
     A                                      DSPATR(HI)
     A            D#X02     R        B  5 13REFFLD(#X02)
     A                                      DSPATR(CS)
     A                                      DSPATR(HI)
     A*----------------------------------------------------------------
     A          R DSPC1
     A            ERRID          7   H
     A            ERRF          10   H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'磅︽'
     A                                 23 10'F3=礶'
     A                                 23 27'F12=玡礶'
     A                                 23 44'PA1='
     A                                 23 59'PA2='
     A                                 24 67'獂び戈癟'
