             PGM

             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN10)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&HA02) TYPE(*CHAR) LEN(2)
             DCL        VAR(&HA15) TYPE(*CHAR) LEN(8)

 /******* OPEN QUERY FILE *****/

             CHGVAR     VAR(&HA02) VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&HA15) VALUE(%SST(*LDA 503 8))

             OVRDBF     FILE(CKHAPF1) SHARE(*YES)
             OPNQRYF    FILE((CKHAPF1)) OPTION(*ALL) QRYSLT(' ha02 +
                          *eq "' *CAT &HA02 *CAT '" & ha28 *eq "Y" +
                          & ha18 *eq " " &  ha15C *LE "' *CAT &HA15 +
                          *CAT '" & ha01 *eq "3" & ha03 *ne " " & +
                          ha27 *eq "Y" ') KEYFLD((HA02) (HA15) +
                          (HA16) (HA31) (HA01)) MAPFLD((HA15C HA15 +
                          *CHAR 8))
             CALL       PGM(CKB3104)

             DLTOVR     FILE(*ALL)
             CLOF       OPNID(CKHAPF1)

             ENDPGM
