             PGM
             DCL        VAR(&DCOMP) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DDATE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&TDEV)  TYPE(*CHAR) LEN(10)
             CHGVAR     VAR(&DCOMP)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DDATE)    VALUE(%SST(*LDA 503 8))
             CHGVAR     VAR(&TDEV)     VALUE(%SST(*LDA 511 10))

             DLTF       FILE(QTEMP/CK*)
             MONMSG     MSGID(CPF2125)

             CPYF       FROMFILE(CKHAPF) TOFILE(QTEMP/CKHAPFS) +
                          MBROPT(*REPLACE) CRTFILE(*YES) +
                          INCREL((*IF HA02 *EQ &DCOMP) (*AND HA15 +
                          *LT &DDATE) (*AND HA17 *GE '4') +
                          (*AND HA26 *EQ 'Y'))

             CPYF       FROMFILE(CKHAPF1) TOFILE(QTEMP/CKHAPF1S) +
                          MBROPT(*REPLACE) CRTFILE(*YES) +
                          INCREL((*IF HA02 *EQ &DCOMP) (*AND HA15 +
                          *LT &DDATE) (*AND HA26 *EQ 'Y'))

             CPYF       FROMFILE(CKHAPF2) TOFILE(QTEMP/CKHAPF2S) +
                          MBROPT(*REPLACE) CRTFILE(*YES) +
                          INCREL((*IF HA02 *EQ &DCOMP) (*AND HA11 +
                          *LT &DDATE))

             CPYF       FROMFILE(CKHCPF) TOFILE(QTEMP/CKHCPFS) +
                          MBROPT(*REPLACE) CRTFILE(*YES) +
                          INCREL((*IF HC01 *EQ &DCOMP) (*AND HC03 +
                          *LT &DDATE) (*AND HC07 *EQ 'Y'))

             CPYF       FROMFILE(CKHEPF) TOFILE(QTEMP/CKHEPFS) +
                          MBROPT(*REPLACE) CRTFILE(*YES) +
                          INCREL((*IF HE02 *EQ &DCOMP) (*AND HE05 +
                          *LT &DDATE) (*AND HE07 *NE ' '))

             INZTAP     DEV(&TDEV) NEWVOL(CK) NEWOWNID(CHECK) +
                          CHECK(*NO)

             SAVOBJ     OBJ(CK*) LIB(QTEMP) DEV(&TDEV) OBJTYPE(*FILE)

             ENDPGM
