     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : CKGL101C                                  */
     /*    PROGRAM NAME :收／開票產生傳票　　　　　　             */
     /*    AUTHOR       : A1139                                     */
     /*    CREATE DATE  : 84/04/07                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM        PARM(&IN03)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&DHA02)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DHA01)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&WHA05F)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&WHA05T)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DHA04F)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&DHA04T)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&DHA03F)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&DHA03T)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&WHA07F)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WHA07T)   TYPE(*CHAR) LEN(8)


             CHGVAR     VAR(&DHA02)   VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DHA01)   VALUE(%SST(*LDA 503 1))
             CHGVAR     VAR(&DHA04F)  VALUE(%SST(*LDA 505 10))
             CHGVAR     VAR(&DHA04T)  VALUE(%SST(*LDA 515 10))
             CHGVAR     VAR(&DHA03F)  VALUE(%SST(*LDA 525 10))
             CHGVAR     VAR(&DHA03T)  VALUE(%SST(*LDA 535 10))
             CHGVAR     VAR(&WHA07F)  VALUE(%SST(*LDA 545 8))
             CHGVAR     VAR(&WHA07T)  VALUE(%SST(*LDA 553 8))
             CHGVAR     VAR(&WHA05F)  VALUE(%SST(*LDA 561 1))
             CHGVAR     VAR(&WHA05T)  VALUE(%SST(*LDA 562 1))
             CHGVAR     VAR(&IN03)    VALUE('0')

             OVRDBF     FILE(CKHALF01) SHARE(*YES)
             OPNQRYF    FILE((CKHALF01)) OPTION(*ALL) QRYSLT(' +
                          HA02 *EQ "' *CAT &DHA02 *CAT '" +
                        & HA01 *EQ "' *CAT &DHA01 *CAT '" +
                        & HA05 *EQ %RANGE("' *CAT &WHA05F +
                          *CAT '" "' *CAT &WHA05T *CAT '") +
                        & HA04 *EQ %RANGE("' *CAT &DHA04F +
                          *CAT '" "' *CAT &DHA04T *CAT '") +
                        & HA03 *EQ %RANGE("' *CAT &DHA03F  +
                          *CAT '" "' *CAT &DHA03T *CAT '") +
                        & HA07 *EQ %RANGE(' *CAT &WHA07F  +
                          *CAT ' ' *CAT &WHA07T *CAT ') +
                        & HA17 *NE "0" +
                        & HA27 *EQ "Y" +
                        & HA51 *EQ " " ') KEYFLD(*FILE)

             CALL       PGM(CKGL101) PARM(&IN03)
             CLOF       OPNID(CKHALF01)
             DLTOVR     FILE(*ALL)

             ENDPGM
