     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM-ID   : CKM000                                    */
     /*    PROGRAM NAME : 票據管理系統主畫面                      */
     /*    AUTHOR       : A1149  MY                                 */
     /*    CREATE DATE  : 1992.10.07                                */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       : 票據管理系統                            */
     /***************************************************************/
             PGM
             DCL        VAR(&WDATE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&$USER)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&$USERN) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0102I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101O) TYPE(*CHAR) LEN(1)
             DCL        VAR(&P3101I) TYPE(*DEC)  LEN(8 0)
             DCL        VAR(&P3102I) TYPE(*CHAR) LEN(1) VALUE('2')
             DCL        VAR(&P3103I) TYPE(*CHAR) LEN(1) VALUE('1')
             DCL        VAR(&P3104I) TYPE(*CHAR) LEN(1)
             DCL        VAR(&P3105I) TYPE(*CHAR) LEN(1)
             DCL        VAR(&P3101O) TYPE(*DEC)  LEN(8 0)
             DCLF       FILE(*LIBL/CKM000D) RCDFMT(DSPD1)
             CALL       PGM(R@S004) PARM('CK')
             RTVDTAARA  DTAARA(*LDA (101 10)) RTNVAR(&$USER)
             RTVDTAARA  DTAARA(*LDA (152 10)) RTNVAR(&$USERN)
             RTVDTAARA  DTAARA(*LDA (201 8)) RTNVAR(&WDATE)
             RTVDTAARA  DTAARA(PTDA01 (1 1)) RTNVAR(&P3104I)
             RTVDTAARA  DTAARA(PTDA01 (2 1)) RTNVAR(&P3105I)
             CHGVAR     VAR(&P3101I) VALUE(&WDATE)
             CALL       PGM(P31) PARM(&P3101I &P3102I &P3103I +
                          &P3104I &P3105I &P3101O)
             CHGVAR     VAR(&DDATE) VALUE(&P3101O)
             CHGVAR     VAR(&S0101I) VALUE(&$USER)
             OVRMSGF    MSGF(QCPFMSG) TOMSGF(*LIBL/PTMF)
  /*         SETATNPGM  PGM(PTPLIB/ATN01)      */

  START:
             SNDRCVF    DEV(*FILE) RCDFMT(DSPD1)
             CHGVAR     VAR(&IN98) VALUE('0')

             IF         COND(&DOPID *EQ '11') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKA110'))
             IF         COND(&DOPID *EQ '12') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKA120'))
             IF         COND(&DOPID *EQ '13') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKA130'))
             IF         COND(&DOPID *EQ '14') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKA140'))
             IF         COND(&DOPID *EQ '15') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKA150'))
             IF         COND(&DOPID *EQ '16') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKA160'))
             IF         COND(&DOPID *EQ '17') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKA1B0'))
             IF         COND(&DOPID *EQ '18') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKA1A0'))
             IF         COND(&DOPID *EQ '19') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKA170'))
             IF         COND(&DOPID *EQ '1A') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKA180'))
             IF         COND(&DOPID *EQ '1B') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKA190'))
             IF         COND(&DOPID *EQ '1C') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('PTA#X0'))
             IF         COND(&DOPID *EQ '1D') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKA1C0'))
             IF         COND(&DOPID *EQ '1E') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKA1D0'))
             IF         COND(&DOPID *EQ '1F') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKA1E0'))
             IF         COND(&DOPID *EQ '1G') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKA1F0'))
             IF         COND(&DOPID *EQ '21') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKI210'))
             IF         COND(&DOPID *EQ '22') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKI220'))
             IF         COND(&DOPID *EQ '23') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKI230'))
             IF         COND(&DOPID *EQ '24') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKI240'))
             IF         COND(&DOPID *EQ '25') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKI250'))
             IF         COND(&DOPID *EQ '31') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKA002C'))
             IF         COND(&DOPID *EQ '32') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKB320'))
             IF         COND(&DOPID *EQ '41') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKR4101C'))
             IF         COND(&DOPID *EQ '42') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKR4201C'))
             IF         COND(&DOPID *EQ '43') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKR4301C'))
             IF         COND(&DOPID *EQ '44') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKR4401C'))
             IF         COND(&DOPID *EQ '45') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKR4501C'))
             IF         COND(&DOPID *EQ '46') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKR4601C'))
             IF         COND(&DOPID *EQ '47') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKR4701C'))
             IF         COND(&DOPID *EQ '48') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKR4801C'))
             IF         COND(&DOPID *EQ '49') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKR4901C'))
             IF         COND(&DOPID *EQ '4A') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKR4B01C'))
             IF         COND(&DOPID *EQ '4B') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKR4C01C'))
             IF         COND(&DOPID *EQ '4C') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKR4E01C'))
             IF         COND(&DOPID *EQ '4D') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKR4A01C'))
             IF         COND(&DOPID *EQ '4E') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKR4D01C'))
             IF         COND(&DOPID *EQ '4F') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKR4I01C'))
             IF         COND(&DOPID *EQ '4G') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKR4G01C'))
             IF         COND(&DOPID *EQ '4H') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKR4H01C'))
             IF         COND(&DOPID *EQ '71') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKA001C'))
             IF         COND(&DOPID *EQ '72') THEN(CHGVAR +
                          VAR(&S0102I) VALUE('CKA220'))
             IF         COND(&DOPID *EQ '90') THEN(RETURN)
             GOTO       CHKAUT

  CHKAUT:    CALL       PGM(S#S01) PARM(&S0101I &S0102I &S0101O)
             IF         COND(&S0101O = 'Y') THEN(CALL PGM(&S0102I))
             ELSE       CMD(CHGVAR VAR(&IN98) VALUE('1'))
             GOTO       START

             ENDPGM
