     /**************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250  */
     /*                                                            */
     /*    PROGRAM-ID   : CKR4H0                                   */
     /*    PROGRAM NAME :支票登記簿                              */
     /*    AUTHOR       : A1149   MAY                              */
     /*    CREATE DATE  : 1993.11.22                               */
     /*    UPDATE DATE  :                                          */
     /*    SYSTEM       :票據系統                                */
     /**************************************************************/
             PGM

             DCL        VAR(&WHA06F)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WHA06T)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WHF72)    TYPE(*CHAR) LEN(8)
             DCL        VAR(&WHF73S)   TYPE(*CHAR) LEN(4)
             DCL        VAR(&WHF73E)   TYPE(*CHAR) LEN(4)
             DCL        VAR(&DHF02F)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DHF02T)    TYPE(*CHAR) LEN(2)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&WHA06F)   VALUE(%SST(*LDA 515 8))
             CHGVAR     VAR(&WHA06T)   VALUE(%SST(*LDA 523 8))
             CHGVAR     VAR(&WHF72)   VALUE(%SST(*LDA 531 8))
             CHGVAR     VAR(&WHF73S)   VALUE(%SST(*LDA 539 4))
             CHGVAR     VAR(&WHF73E)   VALUE(%SST(*LDA 543 4))
             CHGVAR     VAR(&DHF02F)   VALUE(%SST(*LDA 553 2))
             CHGVAR     VAR(&DHF02T)   VALUE(%SST(*LDA 555 2))

             OVRDBF     FILE(CKR4H0F) SHARE(*YES)
             OPNQRYF    FILE((CKR4H0F)) QRYSLT(' hA01 *EQ "2" & ha02 +
                          *eq %range(' *CAT &DHF02F *CAT ' ' *CAT +
                          &DHF02T *CAT ') & HA06 *EQ %RANGE(' *CAT +
                          &WHA06F *CAT ' ' *CAT &WHA06T *CAT ') & +
                          hf72 *eq (' *CAT &WHF72 *CAT ') & hf73 +
                          *eq %range(' *CAT &WHF73S *CAT ' ' *CAT +
                          &WHF73E *CAT ') ') KEYFLD((HA06) (HA03))

             OVRPRTF    FILE(CKR4H0P) CPI(13.3)
             CALL       CKR4H02
             CLOF       OPNID(CKR4H0F)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1))  RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3))  RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('CKR4H0P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
