     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : CKR450                                    */
     /*    PROGRAM NAME :票據兌現核對表                           */
     /*    AUTHOR       : A1152   ANGY                              */
     /*    CREATE DATE  : 81/10/02                                  */
     /*    UPDATE DATE  : 81/10/05                                  */
     /*    SYSTEM       :                                           */
     /***************************************************************/
             PGM
             DCL        VAR(&DHA02F)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DHA02T)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DHA01F)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DHA01T)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DHA16F)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DHA16T)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DHA15F)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DHA15T)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DHA27F)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DHA27T)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DHA59F)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DHA59T)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&STS)      TYPE(*CHAR) LEN(1)
             DCL        VAR(&DHA11S)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DHA11E)   TYPE(*CHAR) LEN(8)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DHA02F)   VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DHA02T)   VALUE(%SST(*LDA 505 2))
             CHGVAR     VAR(&DHA01F)   VALUE(%SST(*LDA 509 1))
             CHGVAR     VAR(&DHA01T)   VALUE(%SST(*LDA 510 1))
             CHGVAR     VAR(&DHA16F)   VALUE(%SST(*LDA 511 6))
             CHGVAR     VAR(&DHA16T)   VALUE(%SST(*LDA 517 6))
             CHGVAR     VAR(&DHA15F)   VALUE(%SST(*LDA 523 8))
             CHGVAR     VAR(&DHA15T)   VALUE(%SST(*LDA 531 8))
             CHGVAR     VAR(&DHA27F)   VALUE(%SST(*LDA 539 1))
             CHGVAR     VAR(&DHA27T)   VALUE(%SST(*LDA 540 1))
             CHGVAR     VAR(&DHA59F)   VALUE(%SST(*LDA 622 1))
             CHGVAR     VAR(&DHA59T)   VALUE(%SST(*LDA 623 1))
             CHGVAR     VAR(&STS)      VALUE(%SST(*LDA 541 1))
             CHGVAR     VAR(&DHA11S)   VALUE(%SST(*LDA 542 8))
             CHGVAR     VAR(&DHA11E)   VALUE(%SST(*LDA 550 8))

             OVRDBF     FILE(CKHAPF) SHARE(*YES)
             OVRPRTF    FILE(CKR450P) CPI(12)
             OPNQRYF    FILE((CKHAPF)) QRYSLT(' HA02 *EQ %RANGE("' +
                          *CAT &DHA02F *CAT '" "' *CAT &DHA02T *CAT +
                          '") & HA01 *EQ %RANGE("' *CAT &DHA01F +
                          *CAT '" "' *CAT &DHA01T *CAT +
                          '")             & HA59 *EQ %RANGE("' +
                          *CAT &DHA59F *CAT '"  "' +
                          *CAT &DHA59T *CAT +
                          '")              & WHA16 *EQ %RANGE("' +
                          *CAT &DHA16F *CAT '" "' *CAT &DHA16T *CAT +
                          '")             & HA15C *EQ %RANGE("' +
                          *CAT &DHA15F *CAT '" "' *CAT &DHA15T *CAT +
                          '")             & HA11C *EQ %RANGE("' +
                          *CAT &DHA11S *CAT '" "' *CAT &DHA11E *CAT +
                          '")             & HA27  *EQ %RANGE("' +
                          *CAT &DHA27F *CAT '" "' *CAT &DHA27T *CAT +
                          '")             & HA17 *EQ ("' *CAT &STS +
                          *CAT '") ') KEYFLD((HA01) (HA02) (HA16) +
                          (HA15) (HA03)) MAPFLD((HA15C HA15 *CHAR +
                          8) (HA11C HA11 *CHAR 8) (WHA16 '%SST(HA16 +
                          9 6)' *CHAR 6))

             CALL       CKR4502
             CLOF       OPNID(CKHAPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1))  RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3))  RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('CKR450P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
