     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : CKR4G0                                    */
     /*    PROGRAM NAME :登錄票據明細表                           */
     /*    AUTHOR       : A1061  JEANNY                             */
     /*    CREATE DATE  : 1993.04.20                                */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :票據系統                                 */
     /***************************************************************/
             PGM

             DCL        VAR(&WHF02F)   TYPE(*CHAR) LEN(4)
             DCL        VAR(&WHF02T)   TYPE(*CHAR) LEN(4)
             DCL        VAR(&WHF06F)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WHF06T)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WHF71F)   TYPE(*CHAR) LEN(4)
             DCL        VAR(&WHF71T)   TYPE(*CHAR) LEN(4)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&WHF02F)   VALUE(%SST(*LDA 501 4))
             CHGVAR     VAR(&WHF02T)   VALUE(%SST(*LDA 505 4))
             CHGVAR     VAR(&WHF06F)   VALUE(%SST(*LDA 509 8))
             CHGVAR     VAR(&WHF06T)   VALUE(%SST(*LDA 517 8))
             CHGVAR     VAR(&WHF71F)   VALUE(%SST(*LDA 525 4))
             CHGVAR     VAR(&WHF71T)   VALUE(%SST(*LDA 529 4))

     /* 排列方式　（開票日＋序號）  */
             OVRDBF     FILE(CKHFLF01) SHARE(*YES)
             OPNQRYF    FILE((CKHFLF01)) QRYSLT(' HF02 *EQ %RANGE("' +
                          *CAT &WHF02F *CAT '" "' *CAT &WHF02T *CAT +
                          '") & +
                          HF06 *EQ %RANGE(' +
                          *CAT &WHF06F *CAT ' ' *CAT &WHF06T *CAT +
                          ') & +
                          HF71 *EQ %RANGE(' +
                          *CAT &WHF71F *CAT ' ' *CAT &WHF71T *CAT +
                          ') & +
                          ( HF03 *EQ " " ) & +
                          ( HF72 *EQ 0 ) +
                          ') +
                          KEYFLD((HF02) (HF06) (HF71))
                     /*   MAPFLD((WHF06 HF06 *CHAR 8) +
                                 (WHF71 HF71 *CHAR 4))   */
             CALL       CKR4G02

             CLOF       OPNID(CKHFLF01)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1))  RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3))  RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('CKR4G0P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
