     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : CKR480                                    */
     /*    PROGRAM NAME :票據貼現作業表                           */
     /*    AUTHOR       : A1087  JOYCE                              */
     /*    CREATE DATE  : 1992.10.05                                */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :票據系統                                 */
     /***************************************************************/
             PGM

             DCL        VAR(&WHA02F)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&WHA02T)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DHA16F)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DHA16T)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&WHA15F)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WHA15T)   TYPE(*CHAR) LEN(8)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&WHA02F)   VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&WHA02T)   VALUE(%SST(*LDA 505 2))
             CHGVAR     VAR(&DHA16F)   VALUE(%SST(*LDA 509 6))
             CHGVAR     VAR(&DHA16T)   VALUE(%SST(*LDA 515 6))
             CHGVAR     VAR(&WHA15F)   VALUE(%SST(*LDA 521 8))
             CHGVAR     VAR(&WHA15T)   VALUE(%SST(*LDA 529 8))

             OVRDBF     FILE(CKHAPF) SHARE(*YES)
             OVRPRTF    FILE(CKR480P) PAGESIZE(*N 132) CPI(13.3)

             OPNQRYF    FILE((CKHAPF)) QRYSLT(' HA02 *EQ %RANGE("' +
                          *CAT &WHA02F *CAT '" "' *CAT &WHA02T *CAT +
                          '") & WHA16 *EQ %RANGE("' *CAT &DHA16F +
                          *CAT '" "' *CAT &DHA16T *CAT '") & HA15 +
                          *EQ %RANGE(' *CAT &WHA15F *CAT ' ' *CAT +
                          &WHA15T *CAT ') & (HA17 *EQ "3") & (HA01 +
                          *EQ "1") ') KEYFLD((HA02) (HA16) (HA07) +
                          (HA04) (HA03)) MAPFLD((WHA16 '%SST(HA16 9 +
                          6)'))
             CALL       CKR4802

             CLOF       OPNID(CKHAPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1))  RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3))  RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('CKR480P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
