     /**************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250  */
     /*                                                            */
     /*    PROGRAM-ID   : CKR460                                   */
     /*    PROGRAM NAME :銀行資金預測表                          */
     /*    AUTHOR       : A1149    MAY                             */
     /*    CREATE DATE  : 1992.10.05                               */
     /*    UPDATE DATE  :                                          */
     /*    SYSTEM       : 票據系統                               */
     /**************************************************************/
             PGM

             DCL        VAR(&DHA02F)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DHA02T)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DHA16F)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DHA16T)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DHA11T)   TYPE(*CHAR) LEN(8)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DHA02F)   VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DHA02T)   VALUE(%SST(*LDA 505 2))
             CHGVAR     VAR(&DHA16F)   VALUE(%SST(*LDA 509 6))
             CHGVAR     VAR(&DHA16T)   VALUE(%SST(*LDA 515 6))
             CHGVAR     VAR(&DHA11T)   VALUE(%SST(*LDA 521 8))

             OVRDBF     FILE(CKHALF06) SHARE(*YES)
             OPNQRYF    FILE((CKHALF06)) QRYSLT(' HA02 *EQ +
                          %RANGE("' *CAT &DHA02F *CAT '" "' *CAT +
                          &DHA02T *CAT '") & WHA16 *EQ %RANGE("' +
                          *CAT &DHA16F *CAT '" "' *CAT &DHA16T +
                          *CAT '") & HA11 *LE (' *CAT &DHA11T +
                          *CAT ') & HA17  *LT "4" & HA17 *NE "0" ') +
                          KEYFLD(*FILE) MAPFLD( +
                           (WHA16 '%SST(HA16 9 6)' *CHAR 6))

             OVRPRTF    FILE(CKR460P) CPI(12)
             CALL       CKR4602
             CLOF       OPNID(CKHALF06)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1))  RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3))  RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('CKR460P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
