     /**************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250  */
     /*                                                            */
     /*    PROGRAM-ID   : CKR4A0                                   */
     /*    PROGRAM NAME :銀行基本資料列印                        */
     /*    AUTHOR       : A1149   MAY                              */
     /*    CREATE DATE  : 1992.09.23                               */
     /*    UPDATE DATE  :                                          */
     /*    SYSTEM       :基本資料系統                            */
     /**************************************************************/
             PGM

             DCL        VAR(&DHB01F)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&DHB01T)   TYPE(*CHAR) LEN(7)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DHB01F)   VALUE(%SST(*LDA 501 7))
             CHGVAR     VAR(&DHB01T)   VALUE(%SST(*LDA 508 7))

             OVRDBF     FILE(CKHBPF) SHARE(*YES)
             OPNQRYF    FILE((CKHBPF)) QRYSLT(' HB01 *EQ %RANGE("' +
                          *CAT &DHB01F *CAT '" "' *CAT &DHB01T *CAT +
                          '") ') +
                          KEYFLD(*FILE)

             OVRPRTF    FILE(CKR4A0P) CPI(12)
             CALL       CKR4A02
             CLOF       OPNID(CKHBPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1))  RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3))  RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('CKR4A0P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
