     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM ID   : CKR4E0                                    */
     /*    PROGRAM NAME :其他資金預測表                           */
     /*    AUTHOR       : A1149   HUANG-SHU.MEI                     */
     /*    CREATE DATE  : 1993.02.23                                */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       : 票據系統                                */
     /***************************************************************/
             PGM

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&DSORT)    TYPE(*CHAR) LEN(1)


             RTVDTAARA  DTAARA(*LDA (524 1))  RTNVAR(&DSORT)
             RTVDTAARA  DTAARA(*LDA (219 1))  RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3))  RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)

/*******************************/
             IF         COND(&DSORT *EQ '1') THEN(DO)

             OVRPRTF    FILE(CKR4E1P)  CPI(13.3)
             CALL       CKR4E02
             DLTOVR     FILE(*ALL)

             CHGVAR     VAR(&P6401I) VALUE('CKR4E1P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)
                        ENDDO
/*******************************/
             IF         COND(&DSORT *EQ '2') THEN(DO)

             OVRPRTF    FILE(CKR4E2P)  CPI(13.3)
             CALL       CKR4E03
             DLTOVR     FILE(*ALL)

             CHGVAR     VAR(&P6401I) VALUE('CKR4E2P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)
                        ENDDO

/*******************************/
             IF         COND(&DSORT *EQ '3') THEN(DO)

             OVRPRTF    FILE(CKR4E3P)  CPI(13.3)
             CALL       CKR4E04
             DLTOVR     FILE(*ALL)

             CHGVAR     VAR(&P6401I) VALUE('CKR4E3P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)
                        ENDDO
             ENDPGM
