/********************************************************************/
/*                                                                  */
/* 5738SS1 V2R2M0 920925     RTVCLSRC Output     06/15/94 18:54:13  */
/*                                                                  */
/* Program name . . . . . . . . . . . . . . :   LSTMBRR           PN*/
/* Library name . . . . . . . . . . . . . . :   QGPL              PL*/
/* Original source file . . . . . . . . . . :   QCLSRC            SN*/
/* Library name . . . . . . . . . . . . . . :   AP3SYS            SL*/
/* Original source member . . . . . . . . . :   LSTMBRR           SM*/
/* Source file change                                               */
/*   date/time  . . . . . . . . . . . . . . :   03/23/91 13:21:10 SC*/
/* Patch option . . . . . . . . . . . . . . :   *NOPATCH          PO*/
/* User profile . . . . . . . . . . . . . . :   *USER             UP*/
/* Text . . . : Print Source Member by 198 collumn 2 Sides        TX*/
/* Owner  . . . . . . . . . . . . . . . . . :   CSUSR             OW*/
/* Patch change ID  . . . . . . . . . . . . :                     PC*/
/* Patch APAR ID  . . . . . . . . . . . . . :                     PA*/
/* User mod flag  . . . . . . . . . . . . . :   *YES              UM*/
/*                                                                ED*/
/********************************************************************/
     PGM PARM(&LIB &FILE &MBR &OUTQ)
     DCL VAR(&LIB) TYPE(*CHAR) LEN(10)
     DCL VAR(&FILE) TYPE(*CHAR) LEN(10)
     DCL VAR(&MBR) TYPE(*CHAR) LEN(10)
     DCL VAR(&OUTQ) TYPE(*CHAR) LEN(10)
     CHGDTAARA DTAARA(*LDA (30 10)) VALUE(&LIB)
     CHGDTAARA DTAARA(*LDA (40 10)) VALUE(&FILE)
     CHGDTAARA DTAARA(*LDA (50 10)) VALUE(&MBR)
     CHKOBJ OBJ(&LIB/&FILE) OBJTYPE(*FILE) MBR(&MBR)
     MONMSG MSGID(CPF9801) EXEC(DO)
     SNDPGMMSG MSG('File ' *CAT &FILE *CAT ' IN Library ' *CAT &LIB -
*CAT ' not found')
     GOTO CMDLBL(ENDPGM)
     ENDDO
     MONMSG MSGID(CPF9815) EXEC(DO)
     SNDPGMMSG MSG('Member ' *CAT &MBR *CAT ' File ' *CAT &FILE *CAT -
' in library ' *CAT &LIB *CAT ' not found')
     GOTO CMDLBL(ENDPGM)
     ENDDO
     OVRDBF FILE(QDDSSRC) TOFILE(&LIB/&FILE) MBR(&MBR)
     OVRPRTF FILE(LSTMBR) TOFILE(LSTMBR) PAGESIZE(66 198) LPI(6) -
CPI(15) OVRFLW(64) OUTQ(&OUTQ) SCHEDULE(*FILEEND) IGCDTA(*YES) -
LVLCHK(*NO)
     CALL PGM(LSTMBR)
ENDPGM:
     DLTOVR FILE(*ALL)
     ENDPGM
