             PGM        PARM(&LIB1 &LIB2)
             DCLF       FILE(QADSPOBJ)
             DCL        VAR(&LIB1) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB2) TYPE(*CHAR) LEN(10)

             DSPOBJD    OBJ(&LIB2/*ALL) OBJTYPE(*FILE) +
                          OUTPUT(*OUTFILE) OUTFILE(QTEMP/TDSPOBJDF)
             OVRDBF     FILE(QADSPOBJ) TOFILE(QTEMP/TDSPOBJDF)

 RCVFIL:     RCVF
             MONMSG     MSGID(CPF0864) EXEC(GOTO CMDLBL(ENDPGM))
             IF         COND(&ODOBAT = 'PF') THEN(DO)
             IF         COND(&ODOBNM *NE 'QDDSSRC' & %SST(&ODOBNM 7 +
                          2) *NE '@@') THEN(DO)
             IF         COND(%SST(&ODOBNM 3 2) *EQ 'WF' ) +
                        THEN(GOTO CMDLBL(CLR))
             CPYF       FROMFILE(&LIB1/&ODOBNM) TOFILE(&LIB2/&ODOBNM) +
                          MBROPT(*REPLACE) FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF2817) EXEC(GOTO CMDLBL(CLR))
             MONMSG     MSGID(CPF3133)
             GOTO       CMDLBL(END)
 CLR:        CLRPFM     FILE(&LIB2/&ODOBNM)
             MONMSG     MSGID(CPF3142)
             MONMSG     MSGID(CPF3133)
 END:        ENDDO
             ENDDO
             GOTO       CMDLBL(RCVFIL)


 ENDPGM:     ENDPGM
