             PGM
             DCL         VAR(&WRKSTN) TYPE(*CHAR) LEN(10)
             DCL         VAR(&USRPRF) TYPE(*CHAR) LEN(10)
             MONMSG      MSGID(CPF9999)
             RTVJOBA     JOB(&WRKSTN)  USER(&USRPRF)
             RMVMSG      MSGQ(&WRKSTN) CLEAR(*ALL)
             RMVMSG      MSGQ(&USRPRF) CLEAR(*ALL)
             OVRMSGF    MSGF(QCPFMSG) TOMSGF(PTFLIB/PTMF)
             CHGMSGQ    MSGQ(*WRKSTN) DLVRY(*BREAK)
             CALL       PGM(PTPLIB/P63)
  LOOP:      CALL QCMD
             GOTO LOOP
             ENDPGM
