     A*****************************************************************
     A*         CKB310F會計傳票暫存檔
     A*****************************************************************
     A          R WF0
     A            WF01      R               COLHDG('公司別')
     A                                      REFFLD(HA02 CKRF)
     A            WF02      R               COLHDG('資料日期')
     A                                      REFFLD(HA07 CKRF)
     A            WF03           1          COLHDG('類別')
     A*                                     1->應收票據兌現
     A*                                     2->應付票據兌現
     A            WF04           1          COLHDG('借貸別')
     A*                                     D->借方
     A*                                     C->貸方
     A            WF05           8          COLHDG('科目代號')
     A            WF06      R               COLHDG('票據號碼')
     A                                      REFFLD(HA03 CKRF)
     A            WF07      R               COLHDG('票據金額')
     A                                      REFFLD(HA10 CKRF)
     A            WF08          84          COLHDG('彙總KEY LIST')
     A*
     A            WFF01         10          COLHDG('票據資料０１')
     A            WFF01A         2          COLHDG('代碼欄位０１')
     A            WFF02     R               COLHDG('票據資料０２')
     A                                      REFFLD(WFF01)
     A            WFF02A    R               COLHDG('代碼欄位０２')
     A                                      REFFLD(WFF01A)
     A            WFF03     R               COLHDG('票據資料０３')
     A                                      REFFLD(WFF01)
     A            WFF03A    R               COLHDG('代碼欄位０３')
     A                                      REFFLD(WFF01A)
     A            WFF04     R               COLHDG('票據資料０４')
     A                                      REFFLD(WFF01)
     A            WFF04A    R               COLHDG('代碼欄位０４')
     A                                      REFFLD(WFF01A)
     A            WFF05     R               COLHDG('票據資料０５')
     A                                      REFFLD(WFF01)
     A            WFF05A    R               COLHDG('代碼欄位０５')
     A                                      REFFLD(WFF01A)
     A            WFF06     R               COLHDG('票據資料０６')
     A                                      REFFLD(WFF01)
     A            WFF06A    R               COLHDG('代碼欄位０６')
     A                                      REFFLD(WFF01A)
     A            WFF07     R               COLHDG('票據資料０７')
     A                                      REFFLD(WFF01)
     A            WFF07A    R               COLHDG('代碼欄位０７')
     A                                      REFFLD(WFF01A)
     A          K WF01
     A          K WF02
     A          K WF03
     A          K WF04
     A          K WF05
     A          K WF08
