     A*****************************************************************
     A*CKHALF05票據明細檔－性質＋公司＋票況＋預兌日＋票號
     A*****************************************************************
     A                                      UNIQUE
     A          R HA0                       PFILE(CKHAPF)
     A          K HA01
     A          K HA02
     A          K HA17
     A          K HA11
     A          K HA03
