     A*****************************************************************
     A*CKHALF99收款沖帳票據資料檔
     A*****************************************************************
     A                                      UNIQUE
     A          R HA0                       PFILE(CKHAPF)
     A*         K HA04
     A          K HA03
     A          S HA55                      COMP(GT 0)
     A            HA01                      COMP(EQ '1')
     A            HA28                      COMP(EQ 'Y')
