     A*****************************************************************
     A*CKHAJF06銀行調節表處理檔－公司＋帳號＋日期＋金額
     A*****************************************************************
     A          R HA0                       PFILE(CKHAPF)
     A          K HA02
     A          K HA16
     A          K HA15
     A          K HA10
     A          S HA17                      COMP(EQ '4')
     A            HA26                      COMP(NE 'Y')
     A*
     A          R HA1                       PFILE(CKHAPF1)
     A          K HA02
     A          K HA16
     A          K HA15
     A          K HA10
     A          S HA26                      COMP(NE 'Y')
