     A*****************************************************************
     A* 02      CKHAPF1銀行存提轉資料檔
     A*****************************************************************
     A                                      REF(CKRF)
     A          R HA1
     A            HA01      R               COLHDG('性質')
     A*                                     '3'  -> 存入
     A*                                     '4'  -> 提出
     A*                                     '5'  -> 轉存
     A*                                     '6'  -> 轉提
     A            HA02      R               COLHDG('公司別')
     A            HA03      R               COLHDG('票據號碼')
     A            HA10      R               COLHDG('台幣金額')
     A            HA15      R               COLHDG('處理日期')
     A            HA16      R               COLHDG('處理帳號')
     A            HA18      R               COLHDG('傳票號碼')
     A            HA19      R               COLHDG('匯率１')
     A            HA20      R               COLHDG('匯率２')
     A            HA23      R               COLHDG('來源用途')
     A            HA26      R               COLHDG('對帳記號')
     A            HA27      R               COLHDG('入帳類別')
     A*                                     'Y'  -> 須入帳
     A*                                     'N'  -> 不入帳
     A            HA28      R               COLHDG('貨款記號')
     A*                                     'Y'  -> 貨款
     A*                                     'N'  -> 非貨款
     A            HA31      R               COLHDG('序號')
     A            HA32      R               COLHDG('備註')
     A            HA34      R               COLHDG('原幣金額')
     A*
     A            HA51      R               COLHDG('存付款傳票號')
     A            HA52      R               COLHDG('備用０２')
     A            HA53      R               COLHDG('存付款傳票日')
     A            HA54      R               COLHDG('備用０４')
     A            HA55      R               COLHDG('備用０５')
     A            HA56      R               COLHDG('備用０６')
     A            HA57      R               COLHDG('備用０７')
     A            HA58      R               COLHDG('備用０８')
     A            HA59      R               COLHDG('備用０９')
     A            HA60      R               COLHDG('備用１０')
     A            HA61           1A         COLHDG('已錄傳票')
     A*                                     僅指非貨款　或
     A*                                         貨款且有補票票號
     A*                                     'Y'  -> 已產生存款傳票
     A*                                     'X'  -> 人工開立傳票
     A            HA97      R               COLHDG('異動時間')
     A            HA98      R               COLHDG('異動日期')
     A            HA99      R               COLHDG('異動人員')
