     A*****************************************************************
     A*CKHALF09票據明細檔－性質＋公司＋收票日＋客戶＋票號
     A*****************************************************************
     A          R HA0                       PFILE(CKHAPF)
     A          K HA01
     A          K HA02
     A          K HA06
     A          K HA04
     A          K HA03
     A          S HA01                      COMP(EQ '2')
     A            HA61                      COMP(EQ ' ')
