     A*****************************************************************
     A*CKHALF99收款沖帳票據資料檔
     A*****************************************************************
     A                                      UNIQUE
     A          R HA0                       PFILE(CKHAPF)
     A*         K HA04
     A          K HA03
     A          S HA01                      COMP(EQ '1')
     A            HA23                      COMP(EQ '01')
