     A*****************************************************************
     A*CKHALF09票據明細檔－公司＋傳票號碼
     A*****************************************************************
     A          R HA0                       PFILE(CKHAPF)
     A          K HA02
     A          K HA18
