     A*****************************************************************
     A*CKHALF04票據明細檔－性質＋公司＋帳號＋票況＋預兌日＋票號
     A*****************************************************************
     A                                      UNIQUE
     A          R HA0                       PFILE(CKHAPF)
     A          K HA01
     A          K HA02
     A          K HA16
     A          K HA17
     A          K HA11
     A          K HA03
