     A*****************************************************************
     A*CKHALF07票據明細檔－公司＋帳號＋預兌日＋票號
     A*****************************************************************
     A          R HA0                       PFILE(CKHAPF)
     A          K HA02
     A          K HA16
     A          K HA11
     A          K HA03
