     A*****************************************************************
     A*CKHALF99收款沖帳票據資料檔－公司＋日期＋序號
     A*****************************************************************
     A                                      UNIQUE
     A          R HA0                       PFILE(CKHAPF)
     A          K HA04
     A          K HA03
     A          O HA55                      COMP(EQ 0)
     A          S HA01                      COMP(EQ '1')
