     A*****************************************************************
     A*CKHALF99收款沖帳票據資料檔－公司＋日期＋序號
     A*****************************************************************
     A                                      UNIQUE
     A          R HA0                       PFILE(CKHAPF)
     A          K HA01
     A          K HA02
     A          K HA03
     A          S HA01                      COMP(EQ '1')
     A            HA17                      COMP(EQ '6')
