     A*****************************************************************
     A* 01      CKHAPF 票據明細檔
     A*****************************************************************
     A                                      REF(CKRF)
     A          R HA0
     A            HA01      R               COLHDG('性質')
     A*                                     '1'  -> 應收票據
     A*                                     '2'  -> 應付票據
     A            HA02      R               COLHDG('公司別')
     A            HA03      R               COLHDG('票據號碼')
    .A            HA04      R               COLHDG('客戶／廠商代號')
     A            HA05      R               COLHDG('票據類別')
     A*                                     '1'  -> 本票
     A*                                     '2'  -> 客票
     A*                                     '3'  -> 支票
     A*                                     '4'  -> 保證票
     A*                                     '5'  -> 商業本票
     A            HA06      R               COLHDG('收／開票日')
     A            HA07      R               COLHDG('到期日')
     A                                      REFFLD(HA06)
     A            HA08      R               COLHDG('付款銀行')
     A            HA09      R               COLHDG('付款帳號')
     A            HA10      R               COLHDG('台幣金額')
     A            HA11      R               COLHDG('預計兌現日')
     A            HA12      R               COLHDG('收款單號')
    .A            HA13      R               COLHDG('業務人員')
    .A            HA14      R               COLHDG('業務區')
     A            HA15      R               COLHDG('處理日期')
     A            HA16      R               COLHDG('處理帳號')
     A            HA17      R               COLHDG('票據狀況')
     A*                                     '0'  -> 作廢
     A*                                     '1'  -> 庫存
     A*                                     '2'  -> 託收
     A*                                     '3'  -> 貼現
     A*                                     '4'  -> 兌現
     A*                                     '5'  -> 退票
     A            HA18      R               COLHDG('兌現傳票號碼')
     A            HA19      R               COLHDG('匯率１')
     A            HA20      R               COLHDG('匯率２')
     A            HA23      R               COLHDG('財務用途')
     A            HA24      R               COLHDG('票據區')
     A*                                     '1'  -> 本地
     A*                                     '2'  -> 外地
     A            HA25      R               COLHDG('託收方式')
     A*                                     '1'  -> 一般
     A*                                     '2'  -> 送款
     A            HA26      R               COLHDG('對帳記號')
     A*                                     'Y'  -> 已對帳
     A*                                     'N'  -> 未對帳
     A            HA27      R               COLHDG('入帳類別')
     A*                                     'Y'  -> 須入帳
     A*                                     'N'  -> 不入帳
     A            HA28      R               COLHDG('貨款記號')
     A*                                     'Y'  -> 貨款
     A*                                     'N'  -> 非貨款
     A            HA32      R               COLHDG('備註')
     A*
     A            HA51      R               COLHDG('收開票傳票號')
     A            HA52      R               COLHDG('備用０２')
     A            HA53      R               COLHDG('收開票傳票日')
     A            HA54      R               COLHDG('備用０４')
     A            HA55      R               COLHDG('未沖金額')
     A            HA56      R               COLHDG('備用０６')
     A            HA57      R               COLHDG('補票支票號碼')
     A            HA58      R               COLHDG('補票記號')
     A*                                     'Y'  -> 補票
     A*                                     'N'  -> 非補票
     A            HA59      R               COLHDG('地區別')
     A*                                     1=台北
     A*                                     2=台中
     A*                                     3=高雄
     A            HA60      R               COLHDG('備用１０')
     A            HA61           1A         COLHDG('已錄傳票')
     A*                                     僅指非貨款部份
     A*                                     'Y'  -> 已產生收開票傳票
     A*                                     'X'  -> 人工開立傳票
     A            HA97      R               COLHDG('異動時間')
     A            HA98      R               COLHDG('異動日期')
     A            HA99      R               COLHDG('異動人員')
