     A*****************************************************************
     A*CKHALF21其他資金預測資料檔－公司＋日期＋序號
     A*****************************************************************
     A                                      UNIQUE
     A          R HA2                       PFILE(CKHAPF2)
     A          K HA02
     A          K HA11
     A          K HA41
