     A*****************************************************************
     A*CKHALF03票據明細檔－性質＋公司＋到期日＋收開票日＋票號
     A*****************************************************************
     A                                      UNIQUE
     A          R HA0                       PFILE(CKHAPF)
     A          K HA01
     A          K HA02
     A          K HA07
     A          K HA06
     A          K HA03
