     A*****************************************************************
     A*CKHBLF01銀行基本資料檔－銀行代號
     A*****************************************************************
     A                                      UNIQUE
     A          R HB0                       PFILE(CKHBPF)
     A          K HB01
