     A*****************************************************************
     A*CKHCLF01銀行對帳單資料檔－公司＋銀行帳號＋往來日期＋序號
     A*****************************************************************
     A                                      UNIQUE
     A          R HC0                       PFILE(CKHCPF)
     A          K HC01
     A          K HC02
     A          K HC03
     A          K HC04
     A          S HC07                      COMP(NE 'Y')
