     A*****************************************************************
     A*CKHDLF99銀行帳戶資料檔－公司＋帳戶簡碼
     A*****************************************************************
     A                                      UNIQUE
     A          R HD0                       PFILE(CKHDPF)
     A          K HD01
     A          K HD04
