     A*****************************************************************
     A*CKHDLF98銀行帳戶資料檔－公司＋帳戶種類＋帳號
     A*****************************************************************
     A                                      UNIQUE
     A          R HD0                       PFILE(CKHDPF)
     A          K HD01
     A          K HD04
     A          O HD05                      COMP(NE '1')
