     A*****************************************************************
     A*CKHDLF02銀行帳戶資料檔－公司別＋帳戶種類＋帳戶簡碼
     A*****************************************************************
     A                                      UNIQUE
     A          R HD0                       PFILE(CKHDPF)
     A          K HD01
     A          K HD05
     A          K HD04
