     A*****************************************************************
     A* 05      CKHEPF 票據異動檔
     A*****************************************************************
     A                                      REF(CKRF)
     A          R HE0
     A            HE01      R               COLHDG('性質')
     A*                                     '1'  -> 應收票據
     A*                                     '2'  -> 應付票據
     A            HE02      R               COLHDG('公司別')
     A            HE03      R               COLHDG('票據號碼')
     A            HE04      R               COLHDG('銀行帳號')
     A            HE05      R               COLHDG('票據狀況異動日')
     A            HE06      R               COLHDG('新票據狀況')
     A*                                     '0'  -> 作廢
     A*                                     '1'  -> 庫存
     A*                                     '2'  -> 託收
     A*                                     '3'  -> 貼現
     A*                                     '4'  -> 兌現
     A*                                     '5'  -> 退票
     A            HE07      R               COLHDG('傳票號碼')
     A            HE08      R               COLHDG('舊票據狀況')
     A*
     A            HE97      R               COLHDG('異動時間')
     A            HE98      R               COLHDG('異動日期')
     A            HE99      R               COLHDG('異動人員')
