     A*****************************************************************
     A*CKHELF01票據異動檔－性質＋公司＋票號＋票據狀況異動日
     A*****************************************************************
     A          R HE0                       PFILE(CKHEPF)
     A          K HE01
     A          K HE02
     A          K HE03
     A          K HE05
