     A*****************************************************************
     A*CKHELF03票據異動檔－公司＋異動日＋票況＋性質＋帳號＋票號
     A*****************************************************************
     A          R HE0                       PFILE(CKHEPF)
     A          K HE02
     A          K HE05
     A          K HE06
     A          K HE01
     A          K HE04
     A          K HE03
     A          S HE06                      COMP(GE '4')
     A            HE07                      COMP(EQ ' ')
