     A*****************************************************************
     A*CKHFLF01開票登錄明細檔－公司＋開票日＋序號
     A*****************************************************************
     A          R HF0                       PFILE(CKHFPF)
     A          K HF02
     A          K HF06
     A          K HF71
