     A*****************************************************************
     A*CKHFLF02開票登錄明細檔－公司＋列印日＋列印序號
     A*****************************************************************
     A          R HF0                       PFILE(CKHFPF)
     A          K HF02
     A          K HF72
     A          K HF73
     A*已列印，但尚未確認票號
     A          S HF03                      COMP(EQ ' ')
     A            HF72                      COMP(NE 0)
