     A*****************************************************************
     A*CKHFLF04開票登錄明細檔－票據號碼
     A*****************************************************************
     A          R HF0                       PFILE(CKHFPF)
     A          K HF03
     A          K HF02
