     A*****************************************************************
     A*CKHFLF05開票登錄明細檔－開票日＋開票序號
     A*****************************************************************
     A          R HF0                       PFILE(CKHFPF)
     A          K HF06
     A          K HF71
