     A*****************************************************************
     A*CKHFLF02開票登錄明細檔－廠商代號＋開票日＋開票序號
     A*****************************************************************
     A          R HF0                       PFILE(CKHFPF)
     A          K HF04
     A          K HF06
     A          K HF71
