     A*****************************************************************
     A*CKHFLF02開票登錄明細檔－公司＋列印日＋列印序號
     A*****************************************************************
     A          R HF0                       PFILE(CKHFPF)
     A          K HF02
     A          K HF06
     A          K HF71
     A*未開開票傳票
     A          S HF33                      COMP(EQ ' ')
