     A*****************************************************************
     A*CKHGLF01產生傳票－會計科目設定－公司＋會計科目
     A*****************************************************************
     A          R HG0                       PFILE(CKHGPF)
     A          K HG01
     A          K HG02
