     A*****************************************************************
     A*         CKR490F票齡分析表
     A*****************************************************************
     A                                      REF(CKRF)
     A          R WF0
     A            WF01      R               COLHDG('性質')
     A                                      REFFLD(HA01)
     A* 1-收票 2-應付
     A            WF02      R               COLHDG('公司別')
     A                                      REFFLD(HA02)
     A            WF03      R               COLHDG('帳號類別')
     A                                      REFFLD(HD05)
     A            WF04      R               COLHDG('處理帳號')
     A                                      REFFLD(HA16)
     A            WF05      R               COLHDG('銀行代碼')
     A                                      REFFLD(HB01)
     A            WF06      R               COLHDG('票據類別')
     A                                      REFFLD(HA05)
     A* 1-本票 2-客票 3-支票 4-保證票 5-商業本票
     A            WF07      R               COLHDG('帳戶餘額')
     A                                      REFFLD(HA10)
     A            WF08      R               COLHDG('小於30天')
     A                                      REFFLD(HA10)
     A            WF09      R               COLHDG('31-60天')
     A                                      REFFLD(HA10)
     A            WF10      R               COLHDG('61-90天')
     A                                      REFFLD(HA10)
     A            WF11      R               COLHDG('大於90天')
     A                                      REFFLD(HA10)
     A          K WF01
     A          K WF02
     A          K WF03
     A          K WF04
