     A*****************************************************************
     A*序號|代號 |      檔　案　名　稱      |
     A*------|-------|----------------------------|--------------------
     A*  01  |CKHAPF |票據明細檔                |
     A*  02  |CKHAPF1|銀行存提轉資料檔          |
     A*  03  |CKHAPF2|其他資金預測資料檔        |
     A*  04  |CKHBPF |銀行基本資料檔            |
     A*  05  |CKHCPF |銀行兌帳單資料檔          |
     A*  06  |CKHDPF |銀行帳戶檔資料            |
     A*  07  |CKHEPF |票據異動檔                |
     A*  08  |CKHFPF |開票登錄明細檔            |
     A*  09  |CKHGPF |產生傳票－會計科目明細設定|
     A*****************************************************************
     A          R CKRFR
     A*****************************************************************
     A*  01     CKHAPF 票據明細檔
     A*****************************************************************
     A            HA01           1          COLHDG('性質')
     A*                                     '1'  -> 應收票據
     A*                                     '2'  -> 應付票據
     A            HA02           2          COLHDG('公司別')
     A*                                     REFFLD(#B01 PTRF)
     A            HA03          10          COLHDG('票據號碼')
    .A            HA04          10          COLHDG('客戶／廠商代號')
     A            HA05           1          COLHDG('票據類別')
     A*                                     '1'  -> 本票
     A*                                     '2'  -> 客票
     A*                                     '3'  -> 支票
     A*                                     '4'  -> 保證票
     A*                                     '5'  -> 商業本票
     A            HA06           8S 0       COLHDG('收／開票日')
     A            HA07      R               COLHDG('到期日')
     A                                      REFFLD(HA06)
     A            HA08           7          COLHDG('付款銀行')
     A            HA09          14          COLHDG('付款帳號')
     A            HA10           9  0       COLHDG('台幣金額')
     A            HA11      R               COLHDG('預計兌現日')
     A                                      REFFLD(HA06)
     A            HA12          10          COLHDG('收款單號')
    .A            HA13          10          COLHDG('業務人員')
    .A            HA14          10          COLHDG('業務區')
     A            HA15      R               COLHDG('處理日期')
     A                                      REFFLD(HA06)
     A            HA16      R               COLHDG('處理帳號')
     A                                      REFFLD(HA09)
     A            HA17           1          COLHDG('票據狀況')
     A*                                     '0'  -> 作廢
     A*                                     '1'  -> 庫存
     A*                                     '2'  -> 託收
     A*                                     '3'  -> 貼現
     A*                                     '4'  -> 兌現
     A*                                     '5'  -> 退票
     A*                                     '6'  -> 抽票
     A            HA18          10          COLHDG('傳票號碼')
     A            HA19           9P 6       COLHDG('匯率１')
     A            HA20      R               COLHDG('匯率２')
     A                                      REFFLD(HA19)
     A            HA23           2          COLHDG('來源用途')
     A            HA24           1          COLHDG('票據區')
     A*                                     '1'  -> 本地
     A*                                     '2'  -> 外地
     A            HA25           1          COLHDG('託收方式')
     A*                                     '1'  -> 一般
     A*                                     '2'  -> 送款
     A            HA26           1          COLHDG('對帳記號')
     A*                                     'Y'  -> 已對帳
     A*                                     'N'  -> 未對帳
     A            HA27           1          COLHDG('入帳類別')
     A*                                     'Y'  -> 須入帳
     A*                                     'N'  -> 不入帳
     A            HA28           1          COLHDG('貨款記號')
     A*                                     'Y'  -> 貨款
     A*                                     'N'  -> 非貨款
     A            HA32          42O         COLHDG('備註')
     A*
 ATT A            HA51          10O         COLHDG('傳票號碼')
 ATT A            HA52          10O         COLHDG('兌現傳票號碼')
 ATT A            HA53           8S 0       COLHDG('傳票日期')
 ATT A            HA54           8S 0       COLHDG('兌現傳票日期')
     A            HA55           9  0       COLHDG('未沖金額')
     A            HA56          13P 2       COLHDG('備用０６')
     A            HA57          10A         COLHDG('補票支票號碼')
     A            HA58           1A         COLHDG('補票記號')
     A*                                     'Y'  -> 補票
     A*                                     ' '  -> 非補票
     A            HA59           1A         COLHDG('備用０９')
     A            HA60           1A         COLHDG('備用１０')
     A            HA61           1A         COLHDG('已錄傳票')
     A*                                     僅指非貨款部份
     A*                                     'Y'  -> 已產生收票傳票
     A*                                     'X'  -> 人工開立傳票
     A            HA97           6S 0       COLHDG('異動時間')
     A            HA98           8S 0       COLHDG('異動日期')
     A            HA99          10          COLHDG('異動人員')
     A*****************************************************************
     A* 02      CKHAPF1銀行存提轉資料檔
     A*****************************************************************
     A*           HA01           1          COLHDG('性質')
     A*                                     '3'  -> 存入
     A*                                     '4'  -> 提出
     A*                                     '5'  -> 轉存
     A*                                     '6'  -> 轉提
     A*           HA02           4          COLHDG('公司別')
     A*           HA03          10          COLHDG('票據號碼')
     A*           HA10           9  0       COLHDG('台幣金額')
     A*           HA15           8S 0       COLHDG('處理日期')
     A*           HA16          14          COLHDG('處理帳號')
     A*           HA18          10          COLHDG('傳票號碼')
     A*           HA19           9P 6       COLHDG('匯率１')
     A*           HA20           9P 6       COLHDG('匯率２')
     A*           HA23           2          COLHDG('來源用途')
     A*           HA26           1          COLHDG('對帳記號')
     A*                                     'Y'  -> 已對帳
     A*                                     'N'  -> 未對帳
     A*           HA27           1          COLHDG('入帳類別')
     A*                                     'Y'  -> 須入帳
     A*                                     'N'  -> 不入帳
     A*           HA28           1          COLHDG('貨款記號')
     A*                                     'Y'  -> 貨款
     A*                                     'N'  -> 非貨款
     A            HA31           4S 0       COLHDG('序號')
     A*           HA32          42O         COLHDG('備註')
     A            HA34          11  2       COLHDG('原幣金額')
     A*
     A*           HA51          10O         COLHDG('備用０１')
     A*           HA52          10O         COLHDG('備用０２')
     A*           HA53           8S 0       COLHDG('備用０３')
     A*           HA54           8S 0       COLHDG('備用０４')
     A*           HA55          13P 2       COLHDG('備用０５')
     A*           HA56          13P 2       COLHDG('備用０６')
     A*           HA57           1A         COLHDG('備用０７')
     A*           HA58           1A         COLHDG('備用０８')
     A*           HA59           1A         COLHDG('備用０９')
     A*           HA60           1A         COLHDG('備用１０')
     A*           HA61           1A         COLHDG('備用１１')
     A*           HA97           6S 0       COLHDG('異動時間')
     A*           HA98           8S 0       COLHDG('異動日期')
     A*           HA99          10          COLHDG('異動人員')
     A*****************************************************************
     A* 03      CKHAPF2其他資金預測資料檔
     A*****************************************************************
     A*           HA01           1          COLHDG('性質')
     A*                                     'I'  -> 存入資金
     A*                                     'O'  -> 支出資金
     A*           HA02           4          COLHDG('公司別')
     A*           HA10           9  0       COLHDG('台幣金額')
     A*           HA11           8S 0       COLHDG('資金日期')
     A*           HA16          14          COLHDG('預估帳號')
     A*           HA23           2          COLHDG('來源用途')
     A            HA41           4S 0       COLHDG('序號')
     A            HA42          42O         COLHDG('資金內容')
     A*
     A*           HA97           6S 0       COLHDG('異動時間')
     A*           HA98           8S 0       COLHDG('異動日期')
     A*           HA99          10          COLHDG('異動人員')
     A*****************************************************************
     A* 04      CKHBPF 銀行基本資料檔
     A*****************************************************************
     A            HB01           7          COLHDG('銀行代碼')
     A            HB02          10O         COLHDG('銀行簡稱')
     A            HB03          20O         COLHDG('銀行名稱')
     A            HB04          30O         COLHDG('銀行地址一')
     A            HB05          30O         COLHDG('銀行地址二')
     A            HB06          15          COLHDG('電話號碼')
     A            HB07          15          COLHDG('傳真號碼')
     A            HB08          12O         COLHDG('聯絡人')
     A            HB09           1          COLHDG('往來銀行')
     A            HB10           1          COLHDG('地區別')
     A            HB11           2S 0       COLHDG('託收交易天數')
     A            HB12           1          COLHDG('銀行類別')
     A*                                     'A'  -> 銀行
     A*                                     'B'  -> 農會
     A*                                     'C'  -> 合作社
     A*                                     'D'  -> 郵局
     A            HB13          42O         COLHDG('備註')
     A*
     A            HB97      R               COLHDG('異動時間')
     A                                      REFFLD(HA97)
     A            HB98      R               COLHDG('異動日期')
     A                                      REFFLD(HA98)
     A            HB99      R               COLHDG('異動人員')
     A                                      REFFLD(HA99)
     A*****************************************************************
     A* 05      CKHCPF 銀行對帳單資料檔
     A*****************************************************************
     A            HC01      R               COLHDG('公司別')
     A                                      REFFLD(HA02)
     A            HC02      R               COLHDG('銀行帳號')
     A                                      REFFLD(HA09)
     A            HC03      R               COLHDG('往來日期')
     A                                      REFFLD(HA06)
     A            HC04      R               COLHDG('序號')
     A                                      REFFLD(HA31)
     A            HC05      R               COLHDG('票據號碼')
     A                                      REFFLD(HA03)
     A            HC06      R               COLHDG('金額')
     A                                      REFFLD(HA10)
     A            HC07      R               COLHDG('對帳記號')
     A                                      REFFLD(HA26)
     A            HC08      R               COLHDG('性質')
     A                                      REFFLD(HA01)
     A*                                     '1'  -> 應收票據
     A*                                     '2'  -> 應付票據
     A*                                     '3'  -> 存入
     A*                                     '4'  -> 提出
     A*                                     '5'  -> 轉存
     A*                                     '6'  -> 轉提
     A            HC97      R               COLHDG('異動時間')
     A                                      REFFLD(HA97)
     A            HC98      R               COLHDG('異動日期')
     A                                      REFFLD(HA98)
     A            HC99      R               COLHDG('異動人員')
     A                                      REFFLD(HA99)
     A*****************************************************************
     A* 06      CKHDPF 銀行帳戶資料檔
     A*****************************************************************
     A            HD01      R               COLHDG('公司別')
     A                                      REFFLD(HA02)
     A            HD02      R               COLHDG('銀行帳戶')
     A                                      REFFLD(HA09)
     A            HD03      R               COLHDG('銀行代碼')
     A                                      REFFLD(HA08)
     A            HD04           6          COLHDG('帳戶簡碼')
     A            HD05           1          COLHDG('帳戶種類')
     A*                                     '1'  -> 支票存款
     A*                                     '2'  -> 活期存款
     A*                                     '3'  -> 備償帳戶
     A*                                     '5'  -> 活期儲蓄
     A*                                     '6'  -> 其他帳戶
     A*                                     '9'  -> 透支帳戶
     A            HD06           3          COLHDG('使用幣別')
     A            HD07          13  2       COLHDG('帳戶餘額－台幣')
     A            HD08           8          COLHDG('會計科目')
     A            HD09           1          COLHDG('保留帳戶')
     A                                      VALUES(' ' 'Y')
     A*                                     'Y'  -> 保留
     A*                                     'N'  -> 使用
     A            HD10          62O         COLHDG('備註')
     A            HD11           1          COLHDG('傳票入帳')
     A                                      VALUES(' ' 'Y')
     A*                                     'Y'  -> 入帳
     A*                                     'N'  -> 不入帳
     A            HD12      R               COLHDG('銀行餘額－台幣')
     A                                      REFFLD(HD07)
     A            HD13      R               COLHDG('帳戶餘額－原幣')
     A                                      REFFLD(HD07)
     A            HD14      R               COLHDG('銀行餘額－原幣')
     A                                      REFFLD(HD07)
     A*
     A            HD97      R               COLHDG('異動時間')
     A                                      REFFLD(HA97)
     A            HD98      R               COLHDG('異動日期')
     A                                      REFFLD(HA98)
     A            HD99      R               COLHDG('異動人員')
     A                                      REFFLD(HA99)
     A*****************************************************************
     A* 07      CKHEPF 票據異動檔
     A*****************************************************************
     A            HE01      R               COLHDG('性質')
     A                                      REFFLD(HA01)
     A*                                     '1'  -> 應收票據
     A*                                     '2'  -> 應付票據
     A            HE02      R               COLHDG('公司別')
     A                                      REFFLD(HA02)
     A            HE03      R               COLHDG('票據號碼')
     A                                      REFFLD(HA03)
     A            HE04      R               COLHDG('銀行帳號')
     A                                      REFFLD(HA09)
     A            HE05      R               COLHDG('票據狀況異動日')
     A                                      REFFLD(HA06)
     A            HE06      R               COLHDG('新票據狀況')
     A                                      REFFLD(HA17)
     A*                                     '0'  -> 作廢
     A*                                     '1'  -> 庫存
     A*                                     '2'  -> 託收
     A*                                     '3'  -> 貼現
     A*                                     '4'  -> 兌現
     A*                                     '5'  -> 退票
     A            HE07      R               COLHDG('傳票號碼')
     A                                      REFFLD(HA18)
     A            HE08      R               COLHDG('舊票據狀況')
     A                                      REFFLD(HA17)
     A*
     A            HE97      R               COLHDG('異動時間')
     A                                      REFFLD(HA97)
     A            HE98      R               COLHDG('異動日期')
     A                                      REFFLD(HA98)
     A            HE99      R               COLHDG('異動人員')
     A                                      REFFLD(HA99)
     A*****************************************************************
     A* 08      CKHFPF 開票登錄明細檔
     A*****************************************************************
     A            HF02      R               COLHDG('公司別')
     A                                      REFFLD(HA02)
     A            HF03      R               COLHDG('票據號碼')
     A                                      REFFLD(HA03)
     A            HF04      R               COLHDG('廠商代號')
     A                                      REFFLD(HA04)
     A            HF05      R               COLHDG('票據類別')
     A                                      REFFLD(HA05)
     A*                                     '1'  -> 本票
     A*                                     '2'  -> 客票
     A*                                     '3'  -> 支票
     A*                                     '4'  -> 保證票
     A*                                     '5'  -> 商業本票
     A            HF06      R               COLHDG('開票日')
     A                                      REFFLD(HA06)
     A            HF07      R               COLHDG('到期日')
     A                                      REFFLD(HA06)
     A            HF08      R               COLHDG('付款銀行')
     A                                      REFFLD(HA08)
     A            HF09      R               COLHDG('付款帳號')
     A                                      REFFLD(HA09)
     A            HF10      R               COLHDG('金額')
     A                                      REFFLD(HA10)
     A            HF11      R               COLHDG('預計兌現日')
     A                                      REFFLD(HA11)
     A            HF15      R               COLHDG('處理日期')
     A                                      REFFLD(HA06)
     A            HF16      R               COLHDG('處理帳號')
     A                                      REFFLD(HA16)
     A            HF17      R               COLHDG('票據狀況')
     A                                      REFFLD(HA17)
     A            HF23      R               COLHDG('財務用途')
     A                                      REFFLD(HA23)
     A            HF24      R               COLHDG('票據區')
     A                                      REFFLD(HA24)
     A                                      VALUES('1' '2')
     A*                                     '1'  -> 本地
     A*                                     '2'  -> 外地
     A            HF27      R               COLHDG('入帳類別')
     A                                      REFFLD(HA27)
     A                                      VALUES('Y' 'N')
     A*                                     'Y'  -> 須入帳
     A*                                     'N'  -> 不入帳
     A            HF28      R               COLHDG('貨款記號')
     A                                      REFFLD(HA28)
     A*                                     'Y'  -> 貨款
     A*                                     'N'  -> 非貨款
     A            HF32      R               COLHDG('備註')
     A                                      REFFLD(HA32)
     A*
     A*---------印支票用-------------------------------------------
     A            HF71      R               COLHDG('開票序號')
     A                                      REFFLD(HA31)
     A            HF72      R               COLHDG('列印日期')
     A                                      REFFLD(HA06)
     A            HF73      R               COLHDG('列印序號')
     A                                      REFFLD(HA31)
     A            HF74      R               COLHDG('加印抬頭')
     A                                      REFFLD(HA27)
     A                                      VALUES('Y' 'N')
     A            HF75      R               COLHDG('轉帳票？')
     A                                      REFFLD(HA27)
     A                                      VALUES('Y' 'N')
     A            HF76      R               COLHDG('列印票類')
     A                                      REFFLD(HA05)
     A                                      VALUES('1' '3')
     A***** MAY
ATT  A            HF77           4  0       COLHDG('郵資')
     A*--------------------------------------------------------------
     A*
     A            HF97      R               COLHDG('異動時間')
     A                                      REFFLD(HA97)
     A            HF98      R               COLHDG('異動日期')
     A                                      REFFLD(HA98)
     A            HF99      R               COLHDG('異動人員')
     A                                      REFFLD(HA99)
     A*****************************************************************
     A* 09      CKHGPF 產生傳票－會計科目明細設定
     A*****************************************************************
     A            HG01      R               COLHDG('公司別')
     A                                      REFFLD(HA02)
     A            HG02           8          COLHDG('會計科目')
     A*
     A            HG03          14          COLHDG('票據資料代碼')
     A            HG04           7P 0       COLHDG('彙總順序代碼')
     A*
     A            HG97      R               COLHDG('異動時間')
     A                                      REFFLD(HA97)
     A            HG98      R               COLHDG('異動日期')
     A                                      REFFLD(HA98)
     A            HG99      R               COLHDG('異動者')
     A                                      REFFLD(HA99)
