     A*****************************************************************
     A* 06      PT#FPF 客戶基本資料檔
     A* PKEY .... #F01+#F02                 NO-DUP
     A*****************************************************************
     A                                      REF(PTRF)
     A                                      UNIQUE
     A          R #F0
     A            #F01      R               COLHDG('公司別')
     A            #F02      R               COLHDG('客戶代號')
     A            #F03      R               COLHDG('應收帳款餘額')
     A            #F04      R               COLHDG('應收票據餘額')
     A            #F05      R               COLHDG('已收未沖餘額')
     A            #F06      R               COLHDG('信用額度金額')
     A*
     A            #F97      R               COLHDG('異動時間')
     A            #F98      R               COLHDG('異動日期')
     A            #F99      R               COLHDG('異動人員')
     A*
     A          K #F01
     A          K #F02
