     A          R #A0
     A            #A01           2          COLHDG('公司別')
     A            #A02           9          COLHDG('傳票號碼')
     A            #A03           3  0       COLHDG('傳票項次')
     A          K #A01
     A          K #A02
     A          K #A03
