     A                                      REF(GLRF)
     A          R GLWF04R
     A            WF0401    R               COLHDG('公司別')
     A                                      REFFLD(AH01)
     A            WF0402    R               COLHDG('傳票日期')
     A                                      REFFLD(AH10)
     A            WF0403         3  0       COLHDG('傳票號碼ＡＨ')
     A            WF0404         3  0       COLHDG('傳票流水號ＡＢ')
     A          K WF0401
     A          K WF0402
