     A*****************************************************************
     A*        03會計期間主檔(GLACPF)                               *
     A*****************************************************************
     A                                      REF(GLRF)
     A                                      UNIQUE
     A          R AC0
     A            AC01      R               COLHDG('公司別')
     A            AC02      R               COLHDG('年度')
     A*
     A            AC03      R               COLHDG('結帳碼１Y/  ')
     A**                                    Y -已結帳（關帳）
     A**                                   空白
     A            AC03A     R               COLHDG('期間　起1')
     A            AC03B     R               COLHDG('期間　迄1')
     A*
     A            AC04      R               COLHDG('結帳碼２Y/  ')
     A            AC04B     R               COLHDG('期間　迄2')
     A*
     A            AC05      R               COLHDG('結帳碼３Y/  ')
     A            AC05B     R               COLHDG('期間　迄3')
     A*
     A            AC06      R               COLHDG('結帳碼４Y/  ')
     A            AC06B     R               COLHDG('期間　迄4')
     A*
     A            AC07      R               COLHDG('結帳碼５Y/  ')
     A            AC07B     R               COLHDG('期間　迄5')
     A*
     A            AC08      R               COLHDG('結帳碼６Y/  ')
     A            AC08B     R               COLHDG('期間　迄6')
     A*
     A            AC09      R               COLHDG('結帳碼７Y/  ')
     A            AC09B     R               COLHDG('期間　迄7')
     A*
     A            AC10      R               COLHDG('結帳碼８Y/  ')
     A            AC10B     R               COLHDG('期間　迄8')
     A*
     A            AC11      R               COLHDG('結帳碼９Y/  ')
     A            AC11B     R               COLHDG('期間　迄9')
     A*
     A            AC12      R               COLHDG('結帳碼１０Y/  ')
     A            AC12B     R               COLHDG('期間　迄10')
     A                                      REFFLD(AA98)
     A*
     A            AC13      R               COLHDG('結帳碼１１Y/  ')
     A            AC13B     R               COLHDG('期間　迄11')
     A*
     A            AC14      R               COLHDG('結帳碼１２Y/  ')
     A            AC14B     R               COLHDG('期間　迄12')
     A*
     A            AC15      R               COLHDG('結帳碼１３Y/  ')
     A            AC15B     R               COLHDG('期間　迄13')
     A*
     A            AC97      R               COLHDG('異動時間')
     A            AC98      R               COLHDG('異動日期')
     A            AC99      R               COLHDG('異動者')
     A          K AC01
     A          K AC02
