     A*****************************************************************
     A*        03會計期間主檔(GLACPF)                               *
     A*****************************************************************
     A          R AC01R                     PFILE(GLACPF)
     A            AC01      R               COLHDG('公司別')
     A            AC03A     R               COLHDG('期間　起1')
     A            AC03B     R               COLHDG('期間　迄1')
     A            AC02      R               COLHDG('年度')
     A            AC03      R               COLHDG('結帳碼１Y/  ')
     A*
     A          K AC01
     A          K AC03A
     A*
     A          R AC02R                     PFILE(GLACPF)
     A            AC01      R               COLHDG('公司別')
     A            AC03A     R               COLHDG('期間　起2')
     A                                      RENAME(AC03B)
     A            AC03B     R               COLHDG('期間　迄2')
     A                                      RENAME(AC04B)
     A            AC02      R               COLHDG('年度')
     A            AC03      R               COLHDG('結帳碼２Y/  ')
     A                                      RENAME(AC04)
     A*
     A          K AC01
     A          K AC03A
     A*
     A          R AC03R                     PFILE(GLACPF)
     A            AC01      R               COLHDG('公司別')
     A            AC03A     R               COLHDG('期間　起3')
     A                                      RENAME(AC04B)
     A            AC03B     R               COLHDG('期間　迄3')
     A                                      RENAME(AC05B)
     A            AC02      R               COLHDG('年度')
     A            AC03      R               COLHDG('結帳碼３Y/  ')
     A                                      RENAME(AC05)
     A*
     A          K AC01
     A          K AC03A
     A*
     A          R AC04R                     PFILE(GLACPF)
     A            AC01      R               COLHDG('公司別')
     A            AC03A     R               COLHDG('期間　起4')
     A                                      RENAME(AC05B)
     A            AC03B     R               COLHDG('期間　迄4')
     A                                      RENAME(AC06B)
     A            AC02      R               COLHDG('年度')
     A            AC03      R               COLHDG('結帳碼４Y/  ')
     A                                      RENAME(AC06)
     A*
     A          K AC01
     A          K AC03A
     A*
     A          R AC05R                     PFILE(GLACPF)
     A            AC01      R               COLHDG('公司別')
     A            AC03A     R               COLHDG('期間　起5')
     A                                      RENAME(AC06B)
     A            AC03B     R               COLHDG('期間　迄5')
     A                                      RENAME(AC07B)
     A            AC02      R               COLHDG('年度')
     A            AC03      R               COLHDG('結帳碼５Y/  ')
     A                                      RENAME(AC07)
     A*
     A          K AC01
     A          K AC03A
     A*
     A          R AC06R                     PFILE(GLACPF)
     A            AC01      R               COLHDG('公司別')
     A            AC03A     R               COLHDG('期間　起6')
     A                                      RENAME(AC07B)
     A            AC03B     R               COLHDG('期間　迄6')
     A                                      RENAME(AC08B)
     A            AC02      R               COLHDG('年度')
     A            AC03      R               COLHDG('結帳碼６Y/  ')
     A                                      RENAME(AC08)
     A*
     A          K AC01
     A          K AC03A
     A*
     A          R AC07R                     PFILE(GLACPF)
     A            AC01      R               COLHDG('公司別')
     A            AC03A     R               COLHDG('期間　起7')
     A                                      RENAME(AC08B)
     A            AC03B     R               COLHDG('期間　迄7')
     A                                      RENAME(AC09B)
     A            AC02      R               COLHDG('年度')
     A            AC03      R               COLHDG('結帳碼７Y/  ')
     A                                      RENAME(AC09)
     A*
     A          K AC01
     A          K AC03A
     A*
     A          R AC08R                     PFILE(GLACPF)
     A            AC01      R               COLHDG('公司別')
     A            AC03A     R               COLHDG('期間　起8')
     A                                      RENAME(AC09B)
     A            AC03B     R               COLHDG('期間　迄8')
     A                                      RENAME(AC10B)
     A            AC02      R               COLHDG('年度')
     A            AC03      R               COLHDG('結帳碼８Y/  ')
     A                                      RENAME(AC10)
     A*
     A          K AC01
     A          K AC03A
     A*
     A          R AC09R                     PFILE(GLACPF)
     A            AC01      R               COLHDG('公司別')
     A            AC03A     R               COLHDG('期間　起9')
     A                                      RENAME(AC10B)
     A            AC03B     R               COLHDG('期間　迄9')
     A                                      RENAME(AC11B)
     A            AC02      R               COLHDG('年度')
     A            AC03      R               COLHDG('結帳碼９Y/  ')
     A                                      RENAME(AC11)
     A*
     A          K AC01
     A          K AC03A
     A*
     A          R AC10R                     PFILE(GLACPF)
     A            AC01      R               COLHDG('公司別')
     A            AC03A     R               COLHDG('期間　起10')
     A                                      RENAME(AC11B)
     A            AC03B     R               COLHDG('期間　迄10')
     A                                      RENAME(AC12B)
     A            AC02      R               COLHDG('年度')
     A            AC03      R               COLHDG('結帳碼１０Y/  ')
     A                                      RENAME(AC12)
     A*
     A          K AC01
     A          K AC03A
     A*
     A          R AC11R                     PFILE(GLACPF)
     A            AC01      R               COLHDG('公司別')
     A            AC03A     R               COLHDG('期間　起11')
     A                                      RENAME(AC12B)
     A            AC03B     R               COLHDG('期間　迄11')
     A                                      RENAME(AC13B)
     A            AC02      R               COLHDG('年度')
     A            AC03      R               COLHDG('結帳碼１１Y/  ')
     A                                      RENAME(AC13)
     A*
     A          K AC01
     A          K AC03A
     A*
     A          R AC12R                     PFILE(GLACPF)
     A            AC01      R               COLHDG('公司別')
     A            AC03A     R               COLHDG('期間　起12')
     A                                      RENAME(AC13B)
     A            AC03B     R               COLHDG('期間　迄12')
     A                                      RENAME(AC14B)
     A            AC02      R               COLHDG('年度')
     A            AC03      R               COLHDG('結帳碼１２Y/  ')
     A                                      RENAME(AC14)
     A*
     A          K AC01
     A          K AC03A
     A*
     A          R AC13R                     PFILE(GLACPF)
     A            AC01      R               COLHDG('公司別')
     A            AC03A     R               COLHDG('期間　起13')
     A                                      RENAME(AC14B)
     A            AC03B     R               COLHDG('期間　迄13')
     A                                      RENAME(AC15B)
     A            AC02      R               COLHDG('年度')
     A            AC03      R               COLHDG('結帳碼１３Y/  ')
     A                                      RENAME(AC15)
     A*
     A          K AC01
     A          K AC03A
     A*
