     A*****************************************************************
     A*          會計科目檔(GLAFLF01)     KEY=AF01+AF02             *
     A*****************************************************************
     A          R AF0                       PFILE(GLAFPF)
     A          K AF02
     A          K AF01
