     A*****************************************************************
     A*          會計科目檔(GLAFLF02)     KEY=AF01+AF02             *
     A*****************************************************************
     A          R AF0                       PFILE(GLAFPF)
     A          K AF01
     A          K AF02
     A          O AF08                      COMP(EQ '2')
     A          S AF05                      COMP(EQ '2')
