     A*****************************************************************
     A*        08會計傳票檔(GLAHPF)                                 *
     A*****************************************************************
     A                                      REFACCPTH(GLAHLF01)
     A          R AH0                       PFILE(GLAHPF)
