     A*****************************************************************
     A*        08會計傳票檔(GLAHPF) FOR A&P                         *
     A*****************************************************************
     A          R AH0                       PFILE(GLAHPF)
     A          K AH10
     A*           ('傳票日期')
     A          K AH04
     A*           ('會計科目')
     A          K AH07
     A*           ('相關號碼１')
     A          S AH04                      COMP(GE '61089999')
     A            AH04                      COMP(LE '6108    ')
     A          S AH20                      COMP(NE 'V')
     A          S AH07A                     COMP(EQ '17')
     A*           ('17=A&P')
