     A*****************************************************************
     A*        08會計傳票檔(GLAHPF)                                 *
     A*****************************************************************
     A                                      FIFO
     A          R AH0                       PFILE(GLAHPF)
     A          K AH01
     A*             ('公司別')
     A          O AH17                      COMP(NE 'RJ')
     A          S AH19                      COMP(EQ '@')
