     A*****************************************************************
     A*        09¦~«×¾lÃBÀÉ(GLAIPF)                                 *
     A*****************************************************************
     A                                      REFACCPTH(GLAILF02)
     A          R AI0                       PFILE(GLAIPF)
