     A*****************************************************************
     A*        09年度餘額檔(GLAIPF)                                 *
     A*****************************************************************
     A                                      FIFO
     A          R AI0                       PFILE(GLAIPF)
     A          K AI03
     A*             ('會計科目')
     A          K AI02
     A*             ('年度')
     A          K AI01
     A*             ('公司別')
