     A*****************************************************************
     A*        11總帳控制檔(GLAKPF)                                 *
     A*****************************************************************
     A                                      REF(GLRF)
     A                                      UNIQUE
     A          R AK0
     A            AK01      R               COLHDG('公司別')
     A            AK02      R               COLHDG('主管核對作業')
     A*                                     'V'  ->  NO    SCR DSP 'N'
     A*                                     ' '  ->  YES   SCR DSP 'Y'
     A*******     AK03      R               COLHDG('電腦編製票號碼')
     A*                                     Y/N
     A            AK04      R               COLHDG('累積盈虧科目')
     A**                                    該科目不得設輸入欄位
     A            AK05      R               COLHDG('本期損益科目')
     A**                                    該科目須為彙總科目
     A********    AK06      R               COLHDG('成本中心代號')
     A            AK07      R               COLHDG('資金代碼－來源')
     A            AK08      R               COLHDG('資金代碼－用途')
     A            AK09      R               COLHDG('年制設定')
     A*                                     '1'  -> 西元年
     A*                                     '2'  -> 中國年
     A            AK10      R               COLHDG('年度會計月數')
     A*                                     '1'  ->  12
     A*                                     '2'  ->  13
     A            AK11      R               COLHDG('日期格式')
     A*                                     SCR '1'-> YMD  FILE '1' YYMMDD
     A*                                                              AK09='1'
     A*                                                         '2' YYYMMDD
     A*                                                              AK09='2'
     A*                                         '2'-> MDY       '3' MMDDYY
     A*                                         '3'-> DMY       '4' DDMMYY
     A            AK12      R               COLHDG('已過帳日期')
     A            AK13      R               COLHDG('已結轉年度')
     A            AK14      R               COLHDG('已結轉期間')
     A*                                     會計年度||期間
     A            AK15      R               COLHDG('過帳控制')
     A*                                     Y -暫不可執行過帳作業
     A*                                     *BLANKS
     A            AK97      R               COLHDG('異動時間')
     A            AK98      R               COLHDG('異動日期')
     A            AK99      R               COLHDG('異動者')
     A          K AK01
