     A*****************************************************************
     A*        12沖帳餘額主檔(GLALLF03)                             *
     A*****************************************************************
     A                                      FIFO
     A          R AL0                       PFILE(GLALPF)
     A          K AL01
     A*             ('公司別')
     A          K AL03
     A*             ('傳票號碼')
