     A*****************************************************************
     A*        12沖帳餘額主檔(GLALLF02)                             *
     A*****************************************************************
     A                                      FIFO
     A          R AL0                       PFILE(GLALPF)
     A          K AL01
     A*             ('公司別')
     A          K AL02
     A*             ('會計科目')
     A          K AL12
     A*             ('立帳傳票日期')
