     A*****************************************************************
     A*        13沖帳餘額明細檔(GLAMLF01)                           *
     A*****************************************************************
     A                                      FIFO
     A          R AM0                       PFILE(GLAMPF)
     A          K AM01
     A**                    COLHDG('公司別')
     A          K AM09
     A**                    COLHDG('沖帳傳票號碼')
