     A*****************************************************************
     A*        16費用分攤主檔(GLAPPF)                               *
     A*****************************************************************
     A                                      REF(GLRF)
     A                                      UNIQUE
     A          R AP0
     A            AP01      R               COLHDG('公司別')
     A            AP02      R               COLHDG('會計科目')
     A            AP03      R               COLHDG('分攤組別')
     A            AP04      R               COLHDG('成本中心')
     A            AP05      R               COLHDG('分攤別')
     A*                                     '1'  -> 預設分攤
     A*                                     '2'  -> 追溯分攤
     A            AP06      R               COLHDG('啟用日期')
     A            AP07      R               COLHDG('備註')
     A*
     A            AP97      R               COLHDG('異動時間')
     A            AP98      R               COLHDG('異動日期')
     A            AP99      R               COLHDG('異動者')
     A          K AP01
     A          K AP02
     A          K AP03
     A          K AP04
     A          K AP05
