     A*****************************************************************
     A*          明細列印暫存檔(GLWF01)   KEY=WF0101-WF0108
     A*****************************************************************
     A                                      FIFO
     A                                      REF(GLRF)
     A          R GLWF01R
     A            WF0101         6A         COLHDG('成本中心')
     A            WF0102        10A         COLHDG('對象別　')
     A            WF0103    R               COLHDG('當月借方金額')
     A                                      REFFLD(AH12)
     A            WF0104    R               COLHDG('當月貨方金額')
     A                                      REFFLD(AH13)
     A            WF0105    R               COLHDG('ＹＴＤ借方金額')
     A                                      REFFLD(AH12)
     A            WF0106    R               COLHDG('ＹＴＤ貨方金額')
     A                                      REFFLD(AH13)
     A*
     A          K WF0101
     A          K WF0102
