     A*****************************************************************
     A*          未沖餘額暫存檔二(GLWF07) KEY=WF0701                *
     A*****************************************************************
     A                                      UNIQUE
     A          R GLWF07R
     A            WF0701         8          COLHDG('會計科目')
     A            WF0702         5  0       COLHDG('頁次')
     A          K WF0701
