     A*****************************************************************
     A*          沖帳明細列印暫存檔(GLWF09)   KEY=WF0901-WF0910
     A*****************************************************************
     A                                      FIFO
     A                                      REF(GLRF)
     A          R GLWF09R
     A            WF0901    R               COLHDG('會計科目')
     A                                      REFFLD(AF02)
     A            WF0902    R               COLHDG('組合一　')
     A                                      REFFLD(AH05)
     A            WF0903    R               COLHDG('組合二　')
     A                                      REFFLD(AH05)
     A            WF0904    R               COLHDG('組合三　')
     A                                      REFFLD(AH05)
     A            WF0905    R               COLHDG('組合四　')
     A                                      REFFLD(AH05)
     A            WF0906    R               COLHDG('組合五　')
     A                                      REFFLD(AH05)
     A            WF0907    R               COLHDG('傳票號碼')
     A                                      REFFLD(AH02)
     A            WF0908    R               COLHDG('立帳金額')
     A                                      REFFLD(AH12)
     A            WF0909    R               COLHDG('沖畢月份')
     A                                      REFFLD(AL11)
     A            WF0910    R               COLHDG('沖帳傳票號碼')
     A                                      REFFLD(AH02)
     A            WF0911    R               COLHDG('沖帳金額')
     A                                      REFFLD(AH13)
     A            WF0912    R               COLHDG('沖帳傳票日期')
     A                                      REFFLD(AH10)
     A          K WF0901
     A          K WF0902
     A          K WF0903
     A          K WF0904
     A          K WF0905
     A          K WF0906
     A          K WF0907
