     A*****************************************************************
     A*        08損益表工作檔(GLWF03)                               *
     A*****************************************************************
     A                                      REF(GLRF)
     A          R GLWF03R
     A            WF0301    R               COLHDG('序號')
     A                                      REFFLD(AS04)
     A            WF0302    R               COLHDG('合計碼')
     A                                      REFFLD(AS08)
     A*                                     'V'  -> 合計項
     A*                                     ' '  -> 非合計項
     A            WF0303    R               COLHDG('項目名稱')
     A                                      REFFLD(AS10)
     A            WF0304    R               COLHDG('金額１')
     A                                      REFFLD(AH12)
     A            WF0305    R               COLHDG('金額２')
     A                                      REFFLD(AH12)
     A            WF0306    R               COLHDG('金額３')
     A                                      REFFLD(AH12)
     A            WF0307    R               COLHDG('金額４')
     A                                      REFFLD(AH12)
     A            WF0308    R               COLHDG('金額５')
     A                                      REFFLD(AH12)
     A            WF0309    R               COLHDG('金額６')
     A                                      REFFLD(AH12)
     A          K WF0301
