     A*****************************************************************
     A*        08資金金額計算(GLWF05)                               *
     A*****************************************************************
     A                                      REF(GLRF)
     A          R GLWF05R
     A            WF0501         5  0       COLHDG('序號')
     A*                                     偶數－＞借方
     A*                                     奇數－＞貸方
     A            WF0502    R               COLHDG('金額')
     A                                      REFFLD(AH12)
     A            WF0503    R               COLHDG('序號')
     A                                      REFFLD(AH03)
     A            WF0504    R               COLHDG('資金代碼')
     A                                      REFFLD(AH22)
     A          K WF0501
     A          K WF0502
