     A*****************************************************************
     A*          明細列印暫存檔(GLWF17)   KEY=WF1701-WF1708
     A*****************************************************************
     A                                      FIFO
     A                                      REF(GLRF)
     A          R GLWF17R
     A            WF1701    R               COLHDG('組合一　')
     A                                      REFFLD(AH05)
     A            WF1702    R               COLHDG('組合二　')
     A                                      REFFLD(AH05)
     A            WF1703    R               COLHDG('組合三　')
     A                                      REFFLD(AH05)
     A            WF1704    R               COLHDG('組合四　')
     A                                      REFFLD(AH05)
     A            WF1705    R               COLHDG('組合五　')
     A                                      REFFLD(AH05)
     A            WF1706         8          COLHDG('傳票日期／會計科目')
     A*                                     選擇內容＝１－＞傳票日期
     A*                                     選擇內容＝２－＞會計科目
     A            WF1707    R               COLHDG('傳票號碼')
     A                                      REFFLD(AH02)
     A            WF1708         8          COLHDG('會計科目／傳票日期')
     A*                                     選擇內容＝１－＞會計科目
     A*                                     選擇內容＝２－＞傳票日期
     A            WF1709    R               COLHDG('借方金額')
     A                                      REFFLD(AH12)
     A            WF1710    R               COLHDG('貸方金額')
     A                                      REFFLD(AH13)
     A            WF1711    R               COLHDG('摘要')
     A                                      REFFLD(AH16)
     A*
     A          K WF1701
     A          K WF1702
     A          K WF1703
     A          K WF1704
     A          K WF1705
     A          K WF1708
