     A*****************************************************************
     A*        08負債工作檔(GLWF12)                                 *
     A*****************************************************************
     A                                      REF(GLRF)
     A          R GLWF12R
     A            WF1101    R               COLHDG('序號')
     A                                      REFFLD(AS04)
     A            WF1102    R               COLHDG('合計碼')
     A                                      REFFLD(AS08)
     A*                                     'V'  -> 合計項
     A*                                     ' '  -> 非合計項
     A            WF1103    R               COLHDG('項目名稱')
     A                                      REFFLD(AS10)
     A            WF1104    R               COLHDG('金額１')
     A                                      REFFLD(AH12)
     A            WF1105    R               COLHDG('金額２')
     A                                      REFFLD(AH12)
     A            WF1106    R               COLHDG('金額３')
     A                                      REFFLD(AH12)
     A            WF1107    R               COLHDG('金額４')
     A                                      REFFLD(AH12)
     A            WF1108    R               COLHDG('金額５')
     A                                      REFFLD(AH12)
     A            WF1109    R               COLHDG('金額６')
     A                                      REFFLD(AH12)
     A          K WF1101
