     A          R NC0                       PFILE(NPNCPF)
     A          K NC02
     A*           ('品牌')
     A          K NC01
     A*           ('產品組別')
