     A*****************************************************************
     A*================================================================
     A* MODI CODE | AUTHOR |  DATE  | DESCRIPTION
     A*----------------------------------------------------------------
     A*  M001     |MICHELLE|01.07.03| A&P增加控制選項
     A*----------------------------------------------------------------
     A*        04 NPNDPF品牌A&P預算實績檔
     A*****************************************************************
     A                                      REF(NPRF)
     A                                      UNIQUE
     A          R ND0
     A            ND01      R               COLHDG('公司別')
     A            ND02      R               COLHDG('年度')
     A            ND03      R               COLHDG('產品組別')
     A*                                     10=白蘭地
     A*                                     20=威士忌
     A*                                     30=葡萄酒
     A            ND04      R               COLHDG('品牌代號')
     A*                                     99=合併品牌
     A            ND05      R               COLHDG('A&P CODE')
     A            ND051     R               COLHDG('A&P CODE第一碼')
     A            ND06B     R               COLHDG('預算金額１')
     A            ND06A     R               COLHDG('實績金額１')
     A            ND07B     R               COLHDG('預算金額２')
     A            ND07A     R               COLHDG('實績金額２')
     A            ND08B     R               COLHDG('預算金額３')
     A            ND08A     R               COLHDG('實績金額３')
     A            ND09B     R               COLHDG('預算金額４')
     A            ND09A     R               COLHDG('實績金額４')
     A            ND10B     R               COLHDG('預算金額５')
     A            ND10A     R               COLHDG('實績金額５')
     A            ND11B     R               COLHDG('預算金額６')
     A            ND11A     R               COLHDG('實績金額６')
     A            ND12B     R               COLHDG('預算金額７')
     A            ND12A     R               COLHDG('實績金額７')
     A            ND13B     R               COLHDG('預算金額８')
     A            ND13A     R               COLHDG('實績金額８')
     A            ND14B     R               COLHDG('預算金額９')
     A            ND14A     R               COLHDG('實績金額９')
     A            ND15B     R               COLHDG('預算金額１０')
     A            ND15A     R               COLHDG('實績金額１０')
     A            ND16B     R               COLHDG('預算金額１１')
     A            ND16A     R               COLHDG('實績金額１１')
     A            ND17B     R               COLHDG('預算金額１２')
     A            ND17A     R               COLHDG('實績金額１２')
     A            ND18B     R               COLHDG('預算金額１３')
     A            ND18A     R               COLHDG('實績金額１３')
M001AA            ND19           2          COLHDG('費用種類')
M001AA            ND20           1          COLHDG('費用容量')
     A*
     A            ND97      R               COLHDG('異動時間')
     A            ND98      R               COLHDG('異動日期')
     A            ND99      R               COLHDG('異動者')
     A          K ND01
     A          K ND02
     A          K ND03
     A          K ND04
     A          K ND05
M001AA          K ND19
M001AA          K ND20
