     A          R ND0                       PFILE(NPNDPF)
     A          K ND01
     A*           ('公司別')
     A          K ND02
     A*           ('年度')
     A          K ND04
     A*           ('品牌代號')
     A          K ND05
     A*           ('A&P CODE')
     A          K ND03
     A*           ('產品組別')
