     A*****************************************************************
     A*        06 NPNFPF產品促銷傳票檔
     A*****************************************************************
     A                                      REF(NPRF)
     A                                      UNIQUE
     A          R NF0
     A            NF01      R               COLHDG('公司別')
     A            NF02      R               COLHDG('年度')
     A            NF02A     R               COLHDG('會計期間')
     A            NF03      R               COLHDG('產品組別')
     A*                                     10=白蘭地
     A*                                     20=威士忌
     A*                                     30=葡萄酒
     A            NF04      R               COLHDG('品牌代號')
     A*                                     99=合併品牌
     A            NF05      R               COLHDG('A&P CODE')
     A            NF051     R               COLHDG('A&P CODE第一碼')
     A            NF06      R               COLHDG('成本中心')
     A            NF06A     R               COLHDG('成本中心第一碼')
     A            NF07      R               COLHDG('客戶代號')
     A            NF08      R               COLHDG('員工代號')
     A            NF09      R               COLHDG('科目餘額')
     A            NF10      R               COLHDG('傳票日期')
     A            NF11      R               COLHDG('傳票號碼')
     A*
     A            NF97      R               COLHDG('異動時間')
     A            NF98      R               COLHDG('異動日期')
     A            NF99      R               COLHDG('異動者')
     A          K NF01
     A          K NF02
     A          K NF02A
     A          K NF03
     A          K NF04
     A          K NF05
     A          K NF06
     A          K NF07
     A          K NF08
     A          K NF10
     A          K NF11
