     A          R NF0                       PFILE(NPNFPF)
     A          K NF01
     A*           ('公司別')
     A          K NF02
     A*           ('年度')
     A          K NF06A
     A*           ('成本中心第一碼')
     A          K NF08
     A*           ('員工代號')
     A          K NF05
     A*           ('A&P CODE')
     A          K NF02A
     A*           ('會計期間')
     A          K NF10
     A*           ('傳票日期')
     A          K NF11
     A*           ('傳票號碼')
