     A*****************************************************************
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*------|------|----------------------------|--------------------|
     A*  01  |NPNAPF| A&P CODE對照檔           |                    |
     A*  02  |NPNBPF|預算會計科目檔            |                    |
     A*  03  |NPNCPF|合併品牌檔                |                    |
     A*  04  |NPNDPF|品牌A&P預算實績檔       |                    |
     A*  05  |NPNEPF|實績會計科目檔            |                    |
     A*  06  |NPNFPF|產品促銷傳票檔            |                    |
     A*****************************************************************
     A*  日期存檔格式：一律為　ＹＭＤ　西元年
     A*****************************************************************
     A                                      REF(GLRF)
     A          R NPRFR
     A*****************************************************************
     A*      01   NPNAPF A&P CODE對照檔
     A*****************************************************************
     A            NA01      R               COLHDG('年度')
     A                                      REFFLD(AC02)
     A            NA02           3A         COLHDG('A&P CODE')
     A*
     A            NA03          30A         COLHDG('A&P說明')
     A            NA04           1A         COLHDG('A&P類別')
     A*                                     T=合計   D=明細
     A            NA97      R               COLHDG('異動時間')
     A                                      REFFLD(AA97)
     A            NA98      R               COLHDG('異動日期')
     A                                      REFFLD(AA98)
     A            NA99      R               COLHDG('異動者')
     A                                      REFFLD(AA99)
     A*****************************************************************
     A*        02 NPNBPF A&P會計科目檔
     A*****************************************************************
     A            NB01      R               COLHDG('公司別')
     A                                      REFFLD(AA01)
     A            NB02      R               COLHDG('會計科目')
     A                                      REFFLD(AF02)
     A*
     A            NB97      R               COLHDG('異動時間')
     A                                      REFFLD(AA97)
     A            NB98      R               COLHDG('異動日期')
     A                                      REFFLD(AA98)
     A            NB99      R               COLHDG('異動者')
     A                                      REFFLD(AA99)
     A*****************************************************************
     A*        03 NPNCPF合併品牌檔
     A*****************************************************************
     A            NC01           2A         COLHDG('產品組別')
     A*                                     10=白蘭地
     A*                                     20=威士忌
     A*                                     30=葡萄酒
     A*                                     99=其他
     A            NC02           2A         COLHDG('品牌')
     A            NC97      R               COLHDG('異動時間')
     A                                      REFFLD(AA97)
     A            NC98      R               COLHDG('異動日期')
     A                                      REFFLD(AA98)
     A            NC99      R               COLHDG('異動者')
     A                                      REFFLD(AA99)
     A*****************************************************************
     A*        04 NPNDPF品牌A&P預算實績檔
     A*****************************************************************
     A            ND01      R               COLHDG('公司別')
     A                                      REFFLD(AA01)
     A            ND02      R               COLHDG('年度')
     A                                      REFFLD(AC02)
     A            ND03           2A         COLHDG('產品組別')
     A*                                     10=白蘭地
     A*                                     20=威士忌
     A*                                     30=葡萄酒
     A*                                     99=其他
     A            ND04           2A         COLHDG('品牌代號')
     A*                                     99=合併品牌
     A            ND05           3A         COLHDG('A&P CODE')
     A            ND051          1A         COLHDG('A&P CODE第一碼')
     A            ND06B     R               COLHDG('預算金額１')
     A                                      REFFLD(AH12)
     A            ND06A     R               COLHDG('實績金額１')
     A                                      REFFLD(AH12)
     A            ND07B     R               COLHDG('預算金額２')
     A                                      REFFLD(AH12)
     A            ND07A     R               COLHDG('實績金額２')
     A                                      REFFLD(AH12)
     A            ND08B     R               COLHDG('預算金額３')
     A                                      REFFLD(AH12)
     A            ND08A     R               COLHDG('實績金額３')
     A                                      REFFLD(AH12)
     A            ND09B     R               COLHDG('預算金額４')
     A                                      REFFLD(AH12)
     A            ND09A     R               COLHDG('實績金額４')
     A                                      REFFLD(AH12)
     A            ND10B     R               COLHDG('預算金額５')
     A                                      REFFLD(AH12)
     A            ND10A     R               COLHDG('實績金額５')
     A                                      REFFLD(AH12)
     A            ND11B     R               COLHDG('預算金額６')
     A                                      REFFLD(AH12)
     A            ND11A     R               COLHDG('實績金額６')
     A                                      REFFLD(AH12)
     A            ND12B     R               COLHDG('預算金額７')
     A                                      REFFLD(AH12)
     A            ND12A     R               COLHDG('實績金額７')
     A                                      REFFLD(AH12)
     A            ND13B     R               COLHDG('預算金額８')
     A                                      REFFLD(AH12)
     A            ND13A     R               COLHDG('實績金額８')
     A                                      REFFLD(AH12)
     A            ND14B     R               COLHDG('預算金額９')
     A                                      REFFLD(AH12)
     A            ND14A     R               COLHDG('實績金額９')
     A                                      REFFLD(AH12)
     A            ND15B     R               COLHDG('預算金額１０')
     A                                      REFFLD(AH12)
     A            ND15A     R               COLHDG('實績金額１０')
     A                                      REFFLD(AH12)
     A            ND16B     R               COLHDG('預算金額１１')
     A                                      REFFLD(AH12)
     A            ND16A     R               COLHDG('實績金額１１')
     A                                      REFFLD(AH12)
     A            ND17B     R               COLHDG('預算金額１２')
     A                                      REFFLD(AH12)
     A            ND17A     R               COLHDG('實績金額１２')
     A                                      REFFLD(AH12)
     A            ND18B     R               COLHDG('預算金額１３')
     A                                      REFFLD(AH12)
     A            ND18A     R               COLHDG('實績金額１３')
     A                                      REFFLD(AH12)
     A*
     A            ND97      R               COLHDG('異動時間')
     A                                      REFFLD(AA97)
     A            ND98      R               COLHDG('異動日期')
     A                                      REFFLD(AA98)
     A            ND99      R               COLHDG('異動者')
     A                                      REFFLD(AA99)
     A*****************************************************************
     A*        05 NPNEPF 實績會計科目檔
     A*****************************************************************
     A            NE01      R               COLHDG('公司別')
     A                                      REFFLD(AA01)
     A            NE02      R               COLHDG('會計科目')
     A                                      REFFLD(AF02)
     A*
     A            NE97      R               COLHDG('異動時間')
     A                                      REFFLD(AA97)
     A            NE98      R               COLHDG('異動日期')
     A                                      REFFLD(AA98)
     A            NE99      R               COLHDG('異動者')
     A                                      REFFLD(AA99)
     A*****************************************************************
     A*        06 NPNFPF產品促銷傳票檔
     A*****************************************************************
     A            NF01      R               COLHDG('公司別')
     A                                      REFFLD(AA01)
     A            NF02      R               COLHDG('年度')
     A                                      REFFLD(AC02)
     A            NF02A          2S 0       COLHDG('會計期間')
     A            NF03           2A         COLHDG('產品組別')
     A*                                     10=白蘭地
     A*                                     20=威士忌
     A*                                     30=葡萄酒
     A*                                     99=其他
     A            NF04           2A         COLHDG('品牌代號')
     A            NF05           3A         COLHDG('A&P CODE')
     A            NF051          1A         COLHDG('A&P CODE第一碼')
     A            NF06           6A         COLHDG('成本中心')
     A            NF06A          1A         COLHDG('成本中心第一碼')
     A            NF07           5A         COLHDG('客戶代號')
     A            NF08           6A         COLHDG('員工代號')
     A            NF09      R               COLHDG('科目餘額')
     A                                      REFFLD(AH12)
     A            NF10      R               COLHDG('傳票日期')
     A                                      REFFLD(AH10)
     A            NF11      R               COLHDG('傳票號碼')
     A                                      REFFLD(AH02)
     A*
     A            NF97      R               COLHDG('異動時間')
     A                                      REFFLD(AA97)
     A            NF98      R               COLHDG('異動日期')
     A                                      REFFLD(AA98)
     A            NF99      R               COLHDG('異動者')
     A                                      REFFLD(AA99)
