     A*  COMMITMENT FILE
     A*
     A*
     A          R WF08R                     PFILE(NPWF08)
     A          K XUX02
     A*             ('®×¸¹')
