     A*****************************************************************
     A*        NPWF01 A&P請款＋試飲＋銷售費用預算實績工作檔
     A*================================================================
     A*
     A          R WF010                     PFILE(NPWF01)
     A          K WF0101
     A          K WF0102
     A          K WF0103
     A          K WF0104
     A          K WF0105
