     A*  COMMITMENT FILE
     A*
     A*
     A          R WF09R                     PFILE(NPWF09)
     A          K YUX02
     A*             ('®×¸¹')
