     A*****************************************************************
     A*        零用金取號檔(PCCBPF)                                 *
     A*****************************************************************
     A                                      REF(GLRF)
     A                                      UNIQUE
     A          R CB0
     A*  C-X-XXXX-XXX  C-辦事處-西元年月-流水號    財務部自編
     A            CB01      R               COLHDG('公司別')
     A                                      REFFLD(AH01)
     A            CB02           1A         COLHDG('辦事處')
     A            CB03           4  0       COLHDG('年月')
     A            CB04           3S 0       COLHDG('流水號')
     A            CB97      R               COLHDG('異動時間')
     A                                      REFFLD(AH97)
     A            CB98      R               COLHDG('異動日期')
     A                                      REFFLD(AH98)
     A            CB99      R               COLHDG('異動者')
     A                                      REFFLD(AH99)
     A          K CB01
     A          K CB02
     A          K CB03
