     A*****************************************************************
     A*        零用金摘要參考檔(PCCCPF)
     A*****************************************************************
     A                                      REFACCPTH(PCCCPF)
     A          R CC0                       PFILE(PCCCPF)
