     A*****************************************************************
     A*        常用零用金傳票主檔(PCCDPF)
     A*****************************************************************
     A                                      REF(GLRF)
     A                                      UNIQUE
     A          R CD0
     A            CD02      R               COLHDG('零用金傳票代碼')
     A                                      REFFLD(AN02)
     A            CD03      R               COLHDG('備註')
     A                                      REFFLD(AN03)
     A*
     A            CD97      R               COLHDG('異動時間')
     A                                      REFFLD(AN97)
     A            CD98      R               COLHDG('異動日期')
     A                                      REFFLD(AN98)
     A            CD99      R               COLHDG('異動者')
     A                                      REFFLD(AN99)
     A          K CD02
