     A*****************************************************************
     A*        零用金常用傳票明細檔(PCCEPF)                         *
     A*****************************************************************
     A                                      REF(GLRF)
     A          R CE0
     A            CE02      R               COLHDG('零用金號碼')
     A*自編
     A                                      REFFLD(AO02)
     A            CE03      R               COLHDG('項次')
     A                                      REFFLD(AH03)
     A*
     A            CE04      R               COLHDG('會計科目')
     A                                      REFFLD(AH04)
     A*
     A            CE05      R               COLHDG('成本中心')
     A                                      REFFLD(AH05)
     A*
     A            CE06      R               COLHDG('對象別')
     A                                      REFFLD(AH06)
     A*
     A            CE07      R               COLHDG('相關號碼1')
     A                                      REFFLD(AH07)
     A*
     A            CE08      R               COLHDG('相關號碼2')
     A                                      REFFLD(AH08)
     A*
     A            CE09      R               COLHDG('日期')
     A                                      REFFLD(AH09)
     A*
     A            CE12      R               COLHDG('請款金額')
     A                                      REFFLD(AH12)
     A*
     A            CE14      R               COLHDG('數量')
     A                                      REFFLD(AH14)
     A*
     A            CE15      R               COLHDG('其它')
     A                                      REFFLD(AH15)
     A*
     A            CE16      R               COLHDG('摘要')
     A                                      REFFLD(AH16)
     A            CE97      R               COLHDG('異動時間')
     A                                      REFFLD(AH97)
     A            CE98      R               COLHDG('異動日期')
     A                                      REFFLD(AH98)
     A            CE99      R               COLHDG('異動者')
     A                                      REFFLD(AH99)
     A          K CE02
     A          K CE03
