     A*================================================================
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*======|======|============================|====================|
     A*  01  |PCCAPF|零用金傳票檔              |                    |
     A*  02  |PCCBPF|零用金流水號檔            |CB01+CB02+CB03      |
     A*  03  |PCCCPF|零用金摘要參考檔          |CC01                |
     A*  04  |PCCDPF|零用金常用傳票主檔        |CD02                |
     A*  05  |PCCEPF|零用金常用傳票明細檔      |CE02+CE03           |
     A*****************************************************************
     A                                      REF(GLRF)
     A          R PCRFR
     A*****************************************************************
     A*          零用金傳票檔  (PCCAPF)
     A*****************************************************************
     A            CA01      R               COLHDG('公司別')
     A                                      REFFLD(AH01)
     A            CA02           9A         COLHDG('零用金號碼')
     A*  C-X-XXXX-XXX  C-辦事處-西元年月-流水號財務部編碼原則
     A            CA03      R               COLHDG('項次')
     A                                      REFFLD(AH03)
     A*
     A            CA04      R               COLHDG('會計科目')
     A                                      REFFLD(AH04)
     A*
     A            CA05      R               COLHDG('成本中心')
     A                                      REFFLD(AH05)
     A            CA05A     R               COLHDG('欄位代碼')
     A                                      REFFLD(AH05A)
     A*
     A            CA06      R               COLHDG('對象別')
     A                                      REFFLD(AH06)
     A            CA06A     R               COLHDG('欄位代碼')
     A                                      REFFLD(AH06A)
     A*
     A            CA07      R               COLHDG('相關號碼1')
     A                                      REFFLD(AH07)
     A            CA07A     R               COLHDG('欄位代碼')
     A                                      REFFLD(AH07A)
     A*
     A            CA08      R               COLHDG('相關號碼2')
     A                                      REFFLD(AH08)
     A            CA08A     R               COLHDG('欄位代碼')
     A                                      REFFLD(AH08A)
     A*
     A            CA09      R               COLHDG('日期')
     A                                      REFFLD(AH09)
     A            CA09A     R               COLHDG('欄位代碼')
     A                                      REFFLD(AH09A)
     A*
     A            CA10      R               COLHDG('登帳日期')
     A                                      REFFLD(AH10)
     A            CA11      R               COLHDG('支付日期')
     A                                      REFFLD(AH10)
     A            CA12      R               COLHDG('請款金額')
     A                                      REFFLD(AH12)
     A            CA13      R               COLHDG('支付金額')
     A                                      REFFLD(AH13)
     A*
     A            CA14      R               COLHDG('數量')
     A                                      REFFLD(AH14)
     A            CA14A     R               COLHDG('欄位代碼')
     A                                      REFFLD(AH14A)
     A*
     A            CA15      R               COLHDG('其它')
     A                                      REFFLD(AH15)
     A            CA15A     R               COLHDG('欄位代碼')
     A                                      REFFLD(AH15A)
     A*
     A            CA16      R               COLHDG('摘要')
     A                                      REFFLD(AH16)
     A            CA17           1A         COLHDG('辦事處')
     A            CA18      R               COLHDG('過帳註記')
     A                                      REFFLD(AH18)
     A*                                     'V'  -> 已過總帳
     A*                                     '*'  -> 暫過總帳－跨月未撥
     A*                                             補作下月撥補
     A*                                     '@'  -> 暫過總帳－次月已撥
     A*                                             補作上月未撥
     A*                                     ' '  -> 未過帳
     A            CA20      R               COLHDG('作廢註記')
     A                                      REFFLD(AH20)
     A*                                     'V'  -> 已作廢
     A*                                     ' '  -> 未作廢
     A            CA25      R               COLHDG('製單日期')
     A                                      REFFLD(AH25)
     A            CA26      R               COLHDG('製單人　')
     A                                      REFFLD(AH26)
     A            CA28           6          COLHDG('請款人代號')
     A*                                     員工代號
     A            CA29      R               COLHDG('撥補日期')
     A                                      REFFLD(AH10)
     A            CA97      R               COLHDG('異動時間')
     A                                      REFFLD(AH97)
     A            CA98      R               COLHDG('異動日期')
     A                                      REFFLD(AH98)
     A            CA99      R               COLHDG('異動者')
     A                                      REFFLD(AH99)
     A*****************************************************************
     A*          零用金流水號檔(PCCBPF)  KEY=CB01+CB02+CB03
     A*****************************************************************
     A*  C-X-XXXX-XXX  C-辦事處-西元年月-流水號
     A            CB01      R               COLHDG('公司別')
     A                                      REFFLD(AH01)
     A            CB02           1A         COLHDG('辦事處')
     A            CB03           4  0       COLHDG('年月')
     A            CB04           3S 0       COLHDG('流水號')
     A            CB97      R               COLHDG('異動時間')
     A                                      REFFLD(AH97)
     A            CB98      R               COLHDG('異動日期')
     A                                      REFFLD(AH98)
     A            CB99      R               COLHDG('異動者')
     A                                      REFFLD(AH99)
     A*****************************************************************
     A*          零用金摘要參考檔(PCCCPF)  KEY=CC01
     A*****************************************************************
     A            CC01           3A         COLHDG('參考編號')
     A            CC02      R               COLHDG('摘要')
     A                                      REFFLD(AH16)
     A            CC97      R               COLHDG('異動時間')
     A                                      REFFLD(AH97)
     A            CC98      R               COLHDG('異動日期')
     A                                      REFFLD(AH98)
     A            CC99      R               COLHDG('異動者')
     A                                      REFFLD(AH99)
     A*****************************************************************
     A*          零用金常用傳票主檔(PCCDPF)  KEY=CD02
     A*****************************************************************
     A            CD02      R               COLHDG('零用金傳票代碼')
     A                                      REFFLD(AN02)
     A            CD03      R               COLHDG('備註')
     A                                      REFFLD(AN03)
     A*
     A            CD97      R               COLHDG('異動時間')
     A                                      REFFLD(AN97)
     A            CD98      R               COLHDG('異動日期')
     A                                      REFFLD(AN98)
     A            CD99      R               COLHDG('異動者')
     A                                      REFFLD(AN99)
     A*****************************************************************
     A*          零用金常用傳票明細檔(PCCEPF)  KEY=CE02+CE03
     A*****************************************************************
     A            CE02      R               COLHDG('零用金號碼')
     A*自編
     A                                      REFFLD(AO02)
     A            CE03      R               COLHDG('項次')
     A                                      REFFLD(AH03)
     A*
     A            CE04      R               COLHDG('會計科目')
     A                                      REFFLD(AH04)
     A*
     A            CE05      R               COLHDG('成本中心')
     A                                      REFFLD(AH05)
     A*
     A            CE06      R               COLHDG('對象別')
     A                                      REFFLD(AH06)
     A*
     A            CE07      R               COLHDG('相關號碼1')
     A                                      REFFLD(AH07)
     A*
     A            CE08      R               COLHDG('相關號碼2')
     A                                      REFFLD(AH08)
     A*
     A            CE09      R               COLHDG('日期')
     A                                      REFFLD(AH09)
     A*
     A            CE12      R               COLHDG('請款金額')
     A                                      REFFLD(AH12)
     A*
     A            CE14      R               COLHDG('數量')
     A                                      REFFLD(AH14)
     A*
     A            CE15      R               COLHDG('其它')
     A                                      REFFLD(AH15)
     A*
     A            CE16      R               COLHDG('摘要')
     A                                      REFFLD(AH16)
     A            CE97      R               COLHDG('異動時間')
     A                                      REFFLD(AH97)
     A            CE98      R               COLHDG('異動日期')
     A                                      REFFLD(AH98)
     A            CE99      R               COLHDG('異動者')
     A                                      REFFLD(AH99)
