     A*****************************************************************
     A*        零用金檔(PCWF01)                                 *
     A*****************************************************************
     A                                      REF(PCCAPF)
     A          R CA0
     A            CA01      R               COLHDG('公司別')
     A            CA02      R               COLHDG('零用金號碼')
     A*  C-X-XXXX-XXX  C-辦事處-西元年月-流水號財務部編碼原則
     A            CA03      R               COLHDG('項次')
     A*
     A            CA04      R               COLHDG('會計科目')
     A*
     A            CA05      R               COLHDG('成本中心')
     A            CA05L          3A         COLHDG('成本中心前三碼')
     A            CA05A     R               COLHDG('欄位代碼')
     A*
     A            CA06      R               COLHDG('對象別')
     A            CA06A     R               COLHDG('欄位代碼')
     A*
     A            CA07      R               COLHDG('相關號碼1')
     A            CA07A     R               COLHDG('欄位代碼')
     A*
     A            CA08      R               COLHDG('相關號碼2')
     A            CA08A     R               COLHDG('欄位代碼')
     A*
     A            CA09      R               COLHDG('日期')
     A            CA09A     R               COLHDG('欄位代碼')
     A*
     A            CA10      R               COLHDG('登帳日期')
     A            CA11      R               COLHDG('支付日期')
     A            CA12      R               COLHDG('請款金額')
     A            CA13      R               COLHDG('支付金額')
     A*
     A            CA14      R               COLHDG('數量')
     A            CA14A     R               COLHDG('欄位代碼')
     A*
     A            CA15      R               COLHDG('其它')
     A            CA15A     R               COLHDG('欄位代碼')
     A*
     A            CA16      R               COLHDG('摘要')
     A            CA17           1A         COLHDG('辦事處')
     A            CA18      R               COLHDG('過帳註記')
     A*                                     'V'  -> 已過總帳
     A*                                     '*'  -> 暫過總帳
     A*                                             下月撥補
     A*                                     ' '  -> 未過帳
     A            CA20      R               COLHDG('作廢註記')
     A*                                     'V'  -> 已作廢
     A*                                     ' '  -> 未作廢
     A            CA25      R               COLHDG('製單日期')
     A            CA26      R               COLHDG('製單人　')
     A            CA28           6          COLHDG('請款人代號')
     A*                                     員工代號
     A            CA29      R               COLHDG('撥補日期')
     A            CA97      R               COLHDG('異動時間')
     A            CA98      R               COLHDG('異動日期')
     A            CA99      R               COLHDG('異動者')
     A          K CA17
     A          K CA05L
     A          K CA05
     A          K CA04
