     A*****************************************************************
     A*              成本中心資料檔             #A01
     A*****************************************************************
     A                                      UNIQUE
     A          R #A0                       PFILE(PT#APF)
     A          K #A11
     A*             ('性質')
     A          K #A01
     A*             ('成本中心')
