     A*--------------------------------------------------------------*
     A*            泛太資訊科技開發股份有限公司－版權所有          *
     A*--------------------------------------------------------------*
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(22)
     A                                      PRINT
     A                                      CA03(03 'EOJ')
     A*--------------------------------------------------------------**
     A          R DSPC1
     A                                      OVERLAY
     A                                  1  2'<HRM000D>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            DDATE          6Y 0O  1 70EDTWRD('0  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 32'人事薪資管理系統'
     A                                      DSPATR(RI)
     A                                  5 31'01. 人事薪資管理系統'
     A                                  7 31'02. 基本資料設定作業'
     A                                  9 31'03. 安全管制系統作業'
     A                                 11 31'04. 系統資料備份作業'
     A                                      COLOR(PNK)
     A*
     A                                 20 30'請輸入選擇項目:'
     A                                      DSPATR(HI)
     A            DOPID          2A  B 20 48DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      DSPATR(MDT)
     A                                      VALUES('01' '02' '03' '04')
     A  97        ERR1          70A  O 22  6MSGID(UPY 0011 CEMF)
     A                                      DSPATR(HI)
     A  98        ERR2          70A  O 22  3MSGID(UPT 2024 PTMF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'F3 =回主畫面'
     A  31                             24  2'系統將到期，請辦理續約'
     A                                      DSPATR(RI)
     A  32                             24  2'系統已到期，請辦理續約'
     A                                      DSPATR(RI)
     A                                 24 67'【泛太資訊】'
