     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*                                                              *
     A*    PROGRAM-ID   : PYA107D                                    *
     A*    PROGRAM NAME :休假基本資料建立（一）                    *
     A*    AUTHOR       : A1232 ERIC                                 *
     A*    CREATE DATE  : 86/02/21                                   *
     A*    UPDATE DATE  : 91/12/05 A1344 ODIE                        *
     A*    SYSTEM       :人事薪資系統                              *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A                                      CSRLOC(#LIN       #COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF18(18)
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<PYA107.1>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('0  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 29'休假基本資料建立（一）'
     A                                      DSPATR(RI)
     A                                  4  1'公司編號:'
     A            DLT01     R        B  4 13REFFLD(LT01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  32                                  DSPATR(UL)
     A N32                                  DSPATR(PR)
     A                                  5  1'員工編號:'
     A                                      DSPATR(HI)
     A            DLT02     R        B  5 13REFFLD(LT02)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A            EM03      R        O  5 23REFFLD(EM03)
     A                                  6  1'年　　度:'
     A            DLT03     R   -2   B  6 13REFFLD(LT03)
     A                                      EDTWRD('0  ')
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  7  1'作業選擇:'
     A            DOPT           1Y 0B  7 13VALUES(1 2 4 5)
     A                                      EDTCDE(4)
     A                                  7 16'( 1.新增 2.修改 4.刪除 5.+
     A                                      查詢)'
     A                                  8  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03=回主畫面'
     A                                 23 19'PF04=欄位查詢'
     A                                 23 38'PF18=全頁查詢'
     A                                 24 67'【泛太資訊】'
     A*----------------------------------------------------------------
     A          R DSPD2
     A                                      CA03(03)
     A                                      CF12(12)
     A                                  1  2'<PYA107.2>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('0  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 29'休假基本資料建立（一）'
     A                                      DSPATR(RI)
     A                                  2 64'作業:'
     A            DFUN           6A  O  2 72
     A                                  4  1'公司編號:'
     A            DLT01     R        O  4 13REFFLD(LT01)
     A            DLT01N        14O  O  4 16
     A                                  5  1'員工編號:'
     A            DLT02     R        O  5 13REFFLD(LT02)
     A            EM03      R        O  5 23REFFLD(EM03)
     A                                  6  1'年　　度:'
     A            DLT03     R   -2   O  6 13REFFLD(LT03)
     A                                      EDTWRD('0  ')
     A                                  7  1'作業選擇:'
     A            DOPT           1Y 0O  7 13EDTCDE(4)
     A                                  7 16'( 1.新增 2.修改 4.刪除 5.+
     A                                      查詢)'
     A                                  8  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 10  1'<<年　　假>>'
     A*
     A                                 10 16'今年年假　　:'
     A            DLT10     R        B 10 32REFFLD(LT10)
     A                                      EDTCDE(4)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 10 38'天'
     A*
7    A*                                12 16'去年遞延　　:'
     A*           DLT13     R        O 12 32REFFLD(LT13)
     A*                                     EDTCDE(M)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A*                                12 38'天'
     A*           DLT14     R        O 12 43REFFLD(LT14)
     A*                                     EDTCDE(M)
     A* 61                                  DSPATR(PC)
     A* 61                                  DSPATR(RI)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A*                                12 46'時'
     A*
     A*                                14 16'明年可預借　:'
     A*           DLT15     R        B 14 32REFFLD(LT15)
     A*                                     EDTCDE(M)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A*                                14 38'天'
     A*           DLT16     R        B 14 43REFFLD(LT16)
     A*                                     EDTCDE(M)
     A* 62                                  DSPATR(PC)
     A* 62                                  DSPATR(RI)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A*                                14 46'時'
     A*
     A*                                16 16'去年已預借　:'
     A*           DLT17     R        B 16 32REFFLD(LT15)
     A*                                     EDTCDE(M)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A*                                16 38'天'
     A*           DLT18     R        B 16 43REFFLD(LT16)
     A*                                     EDTCDE(M)
     A* 66                                  DSPATR(PC)
     A* 66                                  DSPATR(RI)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A*                                16 46'時'
     A*
     A*                                18 16'本年已休年假:'
     A*           DLT11     R        B 18 32REFFLD(LT11)
     A*                                     EDTCDE(4)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A*                                18 38'天'
     A*           DLT12     R        B 18 43REFFLD(LT12)
     A*                                     EDTCDE(4)
     A* 60                                  DSPATR(PC)
     A* 60                                  DSPATR(RI)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A*                                18 46'時'
     A*
     A*                                20 16'本年可休年假:'
     A*           LTT1      R        O 20 32REFFLD(LT13)
     A*                                     EDTCDE(M)
     A*                                20 38'天'
     A*           LTT2      R        O 20 43REFFLD(LT14)
     A*                                     EDTCDE(M)
     A*                                20 46'時'
     A***************************************************************
     A*
     A*                                16  1'<<月　　休>>'
     A*                                16 16'月休天數:'
     A            DLT20     R        H      REFFLD(LT20)
     A*                                     EDTCDE(4)
     A* 33                                  DSPATR(UL)
     A* 33                                  DSPATR(PR)
     A*                                16 33'天'
     A*                                16 47'己休天數:'
     A            DLT21     R        H      REFFLD(LT21)
     A*                                     EDTCDE(4)
     A* 33                                  DSPATR(UL)
     A* 33                                  DSPATR(PR)
     A*                                16 64'天'
     A            DLT22     R        H      REFFLD(LT22)
     A*                                     EDTCDE(4)
     A* 63                                  DSPATR(PC)
     A* 63                                  DSPATR(RI)
     A* 33                                  DSPATR(UL)
     A* 33                                  DSPATR(PR)
     A*                                16 72'時'
     A*                                18 16'去年轉休:'
     A            DLT23     R        H      REFFLD(LT23)
     A*                                     EDTCDE(M)
     A* 33                                  DSPATR(UL)
     A* 33                                  DSPATR(PR)
     A*                                18 33'天'
     A            DLT24     R        H      REFFLD(LT24)
     A*                                     EDTCDE(M)
     A* 64                                  DSPATR(PC)
     A* 64                                  DSPATR(RI)
     A* 33                                  DSPATR(UL)
     A* 33                                  DSPATR(PR)
     A*                                18 41'時'
     A*                                18 47'未休天數:'
     A            LTT3      R        H      REFFLD(LT23)
     A*                                     EDTCDE(M)
     A*                                18 64'天'
     A            LTT4      R        H      REFFLD(LT24)
     A*                                     EDTCDE(M)
     A*                                18 72'時'
     A*                                20 16'明年預借:'
     A            DLT25     R        H      REFFLD(LT25)
     A*                                     EDTCDE(M)
     A* 33                                  DSPATR(UL)
     A* 33                                  DSPATR(PR)
     A*                                20 33'天'
     A            DLT26     R        H      REFFLD(LT26)
     A*                                     EDTCDE(M)
     A* 33                                  DSPATR(UL)
     A* 33                                  DSPATR(PR)
     A* 65                                  DSPATR(PC)
     A* 65                                  DSPATR(RI)
     A*                                20 41'時'
     A***************************************************************
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03=回主畫面'
     A                                 23 19'PF12=回前畫面'
     A                                 24 67'【泛太資訊】'
