     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*                                                              *
     A*    PROGRAM-ID   : PYA204D                                    *
     A*    PROGRAM NAME :考勤資料建立                              *
     A*    AUTHOR       : A1226 PETER                                *
     A*    CREATE DATE  : 86/01/20                                   *
     A*    UPDATE DATE  : 89/08/25 A1274 EVA                         *
     A*    SYSTEM       :人事薪資系統                              *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A                                      CSRLOC(#LIN       #COL)
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF18(18)
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A            ERRID          7A  H
     A            ERRF          10A  H
     A                                  1  2'<PYA204.1>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('0  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 34'遲到資料建立'
     A                                      DSPATR(RI)
     A                                  4  1'公司編號:'
     A            DLA01     R        B  4 13REFFLD(LA01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  32                                  DSPATR(UL)
     A N32                                  DSPATR(PR)
     A                                  5  1'員工編號:'
     A                                      DSPATR(HI)
     A            DLA02     R        B  5 13REFFLD(LA02)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  6  1'部門編號:'
     A                                      DSPATR(HI)
     A            DLA07     R        B  6 13REFFLD(LA07)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                  7  1'遲到日期:'
     A            DLA03     R   -2   B  7 13REFFLD(LA03)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                      EDTWRD('0  /  /  ')
     A                                  8  1'作業選擇:'
     A            DOPT           1Y 0B  8 13VALUES(1 2 4 5)
     A                                      EDTCDE(4)
     A                                  8 17'( 1.新增2.修改4.刪除5.查詢-
     A                                      )'
     A                                  9  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03=回主畫面'
     A                                 23 20'PF04=欄位查詢'
     A                                 23 38'PF18=全頁查詢'
     A                                 24 67'【泛太資訊】'
     A          R DSPD2
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CA12(12)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A                                  1  2'<PYA204.2>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('0  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 34'遲到資料建立'
     A                                      DSPATR(RI)
     A                                  2 64'作業:'
     A            DFUN           6A  O  2 72DSPATR(RI)
     A                                  6 27'公司編號:'
     A            DLA01     R        O  6 39REFFLD(LA01)
     A            DLA01N        14O  O  6 48
     A                                  7 27'部　　門:'
     A            DLA07     R        O  7 39REFFLD(LA07)
     A            DLA08     R        O  7 45REFFLD(LA08)
     A                                  8 27'員工編號:'
     A            DLA02     R        O  8 39REFFLD(LA02)
     A            EM03      R        O  8 48
     A                                 10 27'遲到日期:'
     A            DLA03     R   -2   O 10 39REFFLD(LA03)
     A                                      EDTWRD('0  /  /  ')
     A*                                12 19'一般遲到次／時數
     A*                                12 14'早中晚班遲到１Ｈ次數 :'
     A*                                14 13'中晚班遲到２Ｈ以上時數:'
     A*           DLA04     R        B 13 39REFFLD(LA04)
     A* 63                                  DSPATR(PC)
     A* 63                                  DSPATR(RI)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A*                                     EDTCDE(4)
     A*                                13 42'次／時'
     A*                                16 19'早班遲到２Ｈ次數:'
     A*           DLA05     R        B 16 39REFFLD(LA05)
     A* 64                                  DSPATR(PC)
     A* 64                                  DSPATR(RI)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A*                                     EDTCDE(4)
     A*                                16 42'次'
     A*                                18 23'日班遲到時數:'
     A*           DLA06     R        B 18 39REFFLD(LA06)
     A* 65                                  DSPATR(PC)
     A* 65                                  DSPATR(RI)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A*                                     EDTCDE(4)
     A*                                18 42'時'
     A*911211                          18 27'計薪年月:'
     A            DLA96          4  0H
     A* 66                                  DSPATR(PC)
     A* 66                                  DSPATR(RI)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A*                                     EDTWRD('   /  ')
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03 =回主畫面'
     A                                 23 20'PF12 =回前畫面'
     A                                 24 67'【泛太資訊】'
