     A*%%TS  SD  20040302  135604  PPSPGMRYK   REL-V4R4M0  5769-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*                                                              *
     A*    PROGRAM-ID   : PYA201D                                    *
     A*    PROGRAM NAME :加班資料建立　　　　　                    *
     A*    AUTHOR       : A1046 JOHNSON CHEN                         *
     A*    CREATE DATE  : 79/05/31                                   *
     A*    UPDATE DATE  : 91/06/17 A1336 KLAUS                       *
     A*    SYSTEM       :人事薪資系統                              *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A*-------------------------------------------------------------***
     A          R DSPD1                     CSRLOC(#LIN #COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF18(18 'FULL PAGE INQ.')
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<PYA201.1>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('0  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 34'加班資料建立'
     A                                      DSPATR(RI)
     A*
     A                                  4  1'公司編號:'
     A            DOV01     R        B  4 13REFFLD(OV01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  32                                  DSPATR(UL)
     A N32                                  DSPATR(PR)
     A                                  5  1'部門編號:'
     A                                      DSPATR(HI)
     A            DOV43     R        B  5 13REFFLD(OV43)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                  6  1'員工編號:'
     A                                      DSPATR(HI)
     A            DOV02     R        B  6 13REFFLD(OV02)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  7  1'加班日期:'
     A            DOV03     R   -2   B  7 13REFFLD(OV03)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                      EDTWRD('0  /  /  ')
     A                                  8  1'作業選擇:'
     A            DOPT           1Y 0B  8 13VALUES(1 2 4 5)
     A                                  8 16'(1.新增2.修改4.刪除5.查詢)-
     A                                      '
     A                                  9  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A*
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03 =回主畫面'
     A                                 23 20'PF04 =欄位查詢'
     A                                 23 38'PF18 =全頁查詢'
     A                                 24 67'【泛太資訊】'
     A*----------------------------------------------------------------
     A          R DSPD2
     A*%%TS  SD  20040302  135604  PPSPGMRYK   REL-V4R4M0  5769-PW1
     A                                      CSRLOC(#LIN       #COL)
     A                                      CA03(03)
     A                                      CA12(12)
     A                                      CF13(13)
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<PYA201.2>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('0  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 34'加班資料建立'
     A                                      DSPATR(RI)
     A                                  2 64'作業:'
     A            DFUN           6O  O  2 72DSPATR(RI)
     A                                  4  4'公　　司:'
     A            DOV01     R        O  4 16REFFLD(OV01)
     A            DOV01N        14O  O  4 25
     A                                  5  4'部　　門:'
     A            DOV43     R        O  5 16REFFLD(OV43)
     A            DOV44     R        O  5 22REFFLD(OV44)
     A                                  6  4'員　　工:'
     A            DOV02     R        O  6 16REFFLD(OV02)
     A            EM03      R        O  6 25REFFLD(EM03)
     A                                  7  4'加班日期:'
     A            DOV03     R   -2   O  7 16REFFLD(OV03)
     A                                      EDTWRD('0  /  /  ')
     A                                  8  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  9  2'<<實際加班>>'
     A                                  9 17'平日加班:'
     A            DOV07     R        B  9 29REFFLD(OV07)
     A                                      EDTCDE(4)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                  9 36'小時'
     A                                  9 47'超時加班:'
     A            DOV08     R        B  9 59REFFLD(OV08)
     A                                      EDTCDE(4)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  9 66'小時'
     A            DOV09     R        H      REFFLD(OV09)
     A                                 11 17'假日加班:'
     A            DOV10     R        B 11 29REFFLD(OV10)
     A                                      EDTCDE(4)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A  72                                  DSPATR(PC)
     A  72                                  DSPATR(RI)
     A                                 11 36'小時'
     A            DOV11     R        H      REFFLD(OV11)
     A                                 11 47'國定假日:'
     A            DOV17     R        B 11 59REFFLD(OV10)
     A                                      EDTCDE(4)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A  73                                  DSPATR(PC)
     A  73                                  DSPATR(RI)
     A                                 11 66'小時'
     A*                                13 17'加班轉休:'
     A*           DOV12     R        B 13 29REFFLD(OV12)
     A*                                     EDTCDE(4)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A* 63                                  DSPATR(PC)
     A* 63                                  DSPATR(RI)
     A*                                13 36'小時'
     A            DOV42     R        H      REFFLD(OV42)
     A            DOV40     R        H      REFFLD(OV40)
     A*                                15  2'<<加班費>>'
     A*                                15 17'平日加班費:'
     A*           DOV45     R   -2   B 15 31REFFLD(OV45)
     A*                                     EDTCDE(1)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A* 68                                  DSPATR(PC)
     A* 68                                  DSPATR(RI)
     A*                                15 38'元'
     A*                                15 47'超時加班費:'
     A*           DOV46     R   -2   B 15 61REFFLD(OV46)
     A*                                     EDTCDE(1)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A* 69                                  DSPATR(PC)
     A* 69                                  DSPATR(RI)
     A*                                15 68'元'
     A*                                17 17'假日加班費:'
     A*           DOV47     R   -2   B 17 31REFFLD(OV47)
     A*                                     EDTCDE(1)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A* 70                                  DSPATR(PC)
     A* 70                                  DSPATR(RI)
     A*                                17 38'元'
     A*                                17 47'國定假日費:'
     A*           DOV48     R   -2   B 17 61REFFLD(OV47)
     A*                                     EDTCDE(1)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A* 71                                  DSPATR(PC)
     A* 71                                  DSPATR(RI)
     A*                                17 68'元'
     A                                 19  2'<<計薪年月>>'
     A            DOV96          4Y 0B 19 19EDTWRD('0  /  ')
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A  67                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A            HOV96          6Y 0H
     A            DOV21     R        H      REFFLD(OV21)
     A            DOV22     R        H      REFFLD(OV22)
     A            DOV23     R        H      REFFLD(OV23)
     A            DOV24     R        H      REFFLD(OV24)
     A            DOV25     R        H      REFFLD(OV25)
     A            DOV26     R        H      REFFLD(OV26)
     A            DOV31     R        H      REFFLD(OV31)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03 =回主畫面'
     A                                 23 20'PF12 =回前畫面'
     A                                 23 38'PF13 =資料確認'
     A                                 24 67'【泛太資訊】'
