     A*%%TS  SD  19990802  155824  PPSPGMR40   REL-V3R2M0  5763-PW1
     A*  91/12/20  13:48:02    FOPGMR      REL-R03M00  5728-PW1
     A****************************************************************
     A*            泛太資訊科技開發股份有限公司－版權所有          *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : PYA217D                                    *
     A*    AUTHOR       : A1278  ROBERT                              *
     A*    CREATE DATE  : 88/08/02                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : PYA217                                     *
     A*    SYSTEM       : MIRS                                       *
     A*    SUBSYSTEM    : PY                                         *
     A*    REMARK       :遲到次數設定                              *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A*  91/12/20  13:43:04    FOPGMR      REL-R03M00  5728-PW1
     A          R DSPC1
     A*%%TS  SD  19990802  155824  PPSPGMR40   REL-V3R2M0  5763-PW1
     A                                      CHGINPDFT(CS UL)
     A                                      CA03(03 '回主畫面')
     A                                  1  2'<PYA217>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 34'遲到次數設定'
     A                                      DSPATR(RI)
     A            DOD01     R        H      REFFLD(OD01)
     A                                  7 24'遲到次數　　　:'
     A            DOD02     R        B  7 43REFFLD(OD02)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                      EDTCDE(1)
     A                                      CHECK(RB)
     A                                  7 49'次'
     A                                  9 24'遲到扣款時數  :'
     A            DOD03     R        B  9 43REFFLD(OD03)
     A                                      EDTCDE(1)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                      CHECK(RB)
     A                                  9 49'小時'
     A                                 11 24'遲到間距時數　:'
     A            DOD04     R        B 11 43REFFLD(OD04)
     A                                      EDTCDE(1)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                      CHECK(RB)
     A                                 11 49'小時'
     A                                 23  2'PF03=回主畫面'
     A            DMARK         14A  O 24 66MSGID(UMI 0001 CEMF)
     A  98        ERR1          50A  O 22  2MSGID(UPT 0080 PTMF)
     A                                      DSPATR(HI)
