     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : PYA221D                                    *
     A*    PROGRAM NAME :排班資料拷貝                              *
     A*    AUTHOR       : A1336 KLAUS                                *
     A*    CREATE DATE  : 91/07/11                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人事薪資                                  *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A*------------------------------------------------------------***
     A          R DSPD1
     A                                      CSRLOC(#LIN #COL)
     A                                      CA03(03)
     A                                      CF14(14)
     A                                      CF04(04)
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<PYA221.1>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 34'排班資料拷貝'
     A*
     A                                  6  2'自'
     A                                  6  7'公司別　:'
     A                                      DSPATR(HI)
     A            DT201F    R        B  6 19REFFLD(EM01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                  7  7'部門代號:'
     A                                      DSPATR(HI)
     A            DT206F    R        B  7 19REFFLD(T206)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  8  7'員工代號:'
     A                                      DSPATR(HI)
     A            DT202F    R        B  8 19REFFLD(T202)
     A  67                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A                                  9  7'排班年月:'
     A            DT203F    R   -1   B  9 19REFFLD(T203)
     A                                      EDTWRD('   /  ')
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                 12  2'至'
     A                                 12  7'公司別　:'
     A                                      DSPATR(HI)
     A            DT201T    R        B 12 19REFFLD(EM01)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                 13  7'部門代號:'
     A                                      DSPATR(HI)
     A            DT206T    R        B 13 19REFFLD(T206)
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A                                 14  7'員工代號:'
     A                                      DSPATR(HI)
     A            DT202T    R        B 14 19REFFLD(T202)
     A  68                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A                                 15  7'排班年月:'
     A            DT203T    R   -1   B 15 19REFFLD(T203)
     A                                      EDTWRD('   /  ')
     A  66                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A***                              17  2'選擇內容     :'
     A***         DOPT           1Y 0B 17 19EDTCDE(4)
     A***                                   VALUES(1 2 3)
     A***                              17 23'1.已存在者'
     A***                              17 36'放棄拷貝'
     A***                              18 23'2.已存在者'
     A***                              18 36'全部覆蓋無須確認'
     A***                              19 23'3.已存在者'
     A***                              19 36'逐筆確認是否覆蓋'
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'PF3 =回主畫面'
     A                                 23 27'PF14=處理作業'
     A                                 23 44'PF04=欄位查詢'
     A                                 24 67'【泛太資訊】'
     A*                                     ALWROL
     A          R DSPD2
     A*%%TS  SD  19980521  222944  PPSPGMR40   REL-V3R1M0  5763-PW1
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                 13  3'                                  -
     A                                                                       '
     A                                      DSPATR(RI)
     A                                 14  3' '
     A                                      DSPATR(RI)
     A                                 14 69' '
     A                                      DSPATR(RI)
     A                                 15  3' '
     A                                      DSPATR(RI)
     A                                 15  5' <PYA212.2> '
     A                                 15 69' '
     A                                      DSPATR(RI)
     A                                 16  3' '
     A                                      DSPATR(RI)
     A                                 16 69' '
     A                                      DSPATR(RI)
     A                                 17  3' '
     A                                      DSPATR(RI)
     A                                 17  5'員工編號:'
     A            DEM02     R        O 17 17REFFLD(EM02)
     A            DEM03     R        O 17 26REFFLD(EM03)
     A                                 17 69' '
     A                                      DSPATR(RI)
     A                                 18  3' '
     A                                      DSPATR(RI)
     A                                 18  5'請假日期:'
     A            DLV03     R   -1   O 18 17REFFLD(LV03)
     A                                      EDTWRD('   /  /  ')
     A                                 18 27'假別:'
     A            DLV04     R        O 18 35REFFLD(LV04)
     A                                 18 40'已存在'
     A                                 18 69' '
     A                                      DSPATR(RI)
     A                                 19  3' '
     A                                      DSPATR(RI)
     A                                 19  5'是否覆蓋:'
     A            COVE           1A  B 19 17VALUES('Y' 'N')
     A                                 19 22'(Y/N)'
     A                                 19 69' '
     A                                      DSPATR(RI)
     A                                 20  3' '
     A                                      DSPATR(RI)
     A                                 20 69' '
     A                                      DSPATR(RI)
     A                                 21  3'                                  -
     A                                                                       '
     A                                      DSPATR(RI)
