     A*%%TS  SD  20051226  171042  PPSPGMRYK   REL-V4R4M0  5769-PW1
     A****************************************************************
     A*            泛太資訊科技開發股份有限公司－版權所有          *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : PYA405D                                    *
     A*    AUTHOR       : A1138  DAVID.                              *
     A*    CREATE DATE  : 81/03/10                                   *
     A*    UPDATE DATE  : 90/05/18 KLAUS                             *
     A*    PROGRAM NAME : PYA405                                     *
     A*    SYSTEM       : MIRS                                       *
     A*    SUBSYSTEM    : PYS                                        *
     A*    REMARK       :公司獎金資料調整作業                      *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPC1
     A*%%TS  SD  20051226  171042  PPSPGMRYK   REL-V4R4M0  5769-PW1
     A                                      CSRLOC(#LIN       #COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF18(18)
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A            ERRID          7A  H
     A            ERRF          10A  H
     A                                  1  2'<PYA405.1>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 30'公司獎金資料調整作業'
     A                                      DSPATR(RI)
     A                                  4  1'公司編號:'
     A            DPB01     R        B  4 13REFFLD(PB01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  32                                  DSPATR(UL)
     A N32                                  DSPATR(PR)
     A                                  5  1'員工編號:'
     A                                      DSPATR(HI)
     A            DPB02     R        B  5 13REFFLD(PB02)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  6  1'獎金年度:'
     A            DPB03          3Y 0B  6 13
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                      EDTCDE(3)
     A                                  6 17'(年終獎金年度為試算年度加１)'
     A                                  6 67')'
     A                                  7  1'獎金類別:'
     A            DPB04          2A  B  7 13VALUES('01' '02' '03' '04')
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                  7 16'(01.年終獎金02.夏季獎金'
     A                                  7 44'03.紅利04.其它)'
     A                                  8  1'作業選擇:'
     A            DOPT           1A  B  8 13VALUES('1' '2' '4' '5')
     A                                  8 16'(1.新增2.修改4.刪除5.查詢)-
     A                                      '
     A                                  9  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03 =回主畫面'
     A                                 23 20'PF04 =欄位查詢'
     A                                 23 38'PF18 =全頁查詢'
     A                                 24 67'【泛太資訊】'
     A*------------------------------------------------------------***
     A          R DSPC2
     A                                      CA03(03)
     A                                      CA12(12)
     A                                      CF13(13)
     A                                  1  2'<PYA405.2>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 30'公司獎金資料調整作業'
     A                                      DSPATR(RI)
     A                                  2 64'作業:'
     A            DFUN           6O  O  2 72DSPATR(RI)
     A*
     A                                  4  1'公　　司:'
     A            DPB01     R        O  4 13REFFLD(PB01)
     A            CM02      R        O  4 22
     A                                  5  1'部　　門:'
     A            DEM04          7A  O  5 13
     A            DP02      R        O  5 22REFFLD(DP02 PYDPPF)
     A                                  6  1'員　　工:'
     A            DPB02     R        O  6 13REFFLD(PB02)
     A            EM03      R        O  6 22
     A                                  7  1'年　　度:'
     A            DPB03          3S 0O  7 13
     A                                  8  1'類　　別:'
     A            DPB04          2A  O  8 13
     A                                    +1'(01.年終獎金02.夏季獎金'
     A                                    +1'03.紅利 04.其它)'
     A*           SS02          14A  O  8 22
     A*                                 9  1'發放日期:'
     A*           DPB05          7Y 0O  9 13EDTWRD('   /  /  ')
     A*
     A*                                   +1'代扣稅款年月:'
     A*           DOS03          5  0O    +1
     A*                                     EDTWRD('   /  ')
     A                                  9  1'作業選擇:'
     A            DOPT           1A  O  9 13
     A                                  9 15'(1.新增2.修改4.刪除5.查詢)-
     A                                      '
     A                                 10  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A**920218S KLAUS
     A                                 11  1'嘉  獎:'
     A            DPB25     R        O 11 13REFFLD(PB25)
     A                                      EDTCDE(4)
     A                                 11 20'次'
     A                                 11 27'小  功:'
     A            DPB26     R        O 11 39REFFLD(PB26)
     A                                      EDTCDE(4)
     A                                 11 45'次'
     A                                 11 54'大  功:'
     A            DPB27     R        O 11 66REFFLD(PB27)
     A                                      EDTCDE(4)
     A                                 11 72'次'
     A                                 12  1'申  誡:'
     A            DPB28     R        O 12 13REFFLD(PB28)
     A                                      EDTCDE(4)
     A                                 12 20'次'
     A                                 12 27'小  過:'
     A            DPB29     R        O 12 39REFFLD(PB29)
     A                                      EDTCDE(4)
     A                                 12 45'次'
     A                                 12 54'大  過:'
     A            DPB30     R        O 12 66REFFLD(PB30)
     A                                      EDTCDE(4)
     A                                 12 72'次'
     A                                 13  1'事　　假:'
     A            DPB21     R        O 13 13REFFLD(PB21)
     A                                      EDTCDE(4)
     A                                 13 18'小時'
     A                                 13 27'曠　　職:'
     A            DPB24     R        O 13 39REFFLD(PB24)
     A                                      EDTCDE(4)
     A                                 13 43'小時'
     A                                 13 54'遲到早退:'
     A            DPB23     R        O 13 66REFFLD(PB23)
     A                                      EDTCDE(4)
     A                                 13 72'次'
     A                                 14  1'病  假:'
     A            DPB22     R        O 14 13REFFLD(PB22)
     A                                      EDTCDE(4)
     A                                 14 18'小時'
     A                                 14 27'考績等級:'
     A            DPB32     R        O 14 39REFFLD(PB32)
     A                                 14 54'計算基礎:'
     A            DPB31     R        O 14 66REFFLD(PB31)
     A                                      EDTCDE(1)
     A**920218E KLAUS
     A                                 16  1'發放金額:'
     A            DPB06     R        B 16 13REFFLD(PB06 PYPBPF)
     A                                      EDTCDE(1)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A  66                                  DSPATR(PC RI)
     A                                 16 27'獎金稅率:'
     A            DPB07     R        B 16 39REFFLD(PB07 PYPBPF)
     A                                      EDTCDE(1)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A  67                                  DSPATR(PC RI)
     A                                 16 54'扣繳稅額:'
     A            DPB08     R        B 16 66REFFLD(PB08 PYPBPF)
     A                                      EDTCDE(1)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A  68                                  DSPATR(PC RI)
     A*
     A                                 17  1'獎金月數:'
     A            DPB16     R        B 17 13REFFLD(PB16 PYPBPF)
     A                                      EDTCDE(1)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A  75                                  DSPATR(PC RI)
     A                                 17 27'年資率  :'
     A            DPB17     R        B 17 39REFFLD(PB17 PYPBPF)
     A                                      EDTCDE(1)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A  76                                  DSPATR(PC RI)
     A*
     A                                 17 54'年休補發:'
     A            DPB06F    R        B 17 66REFFLD(PB06F PYPBPF)
     A                                      EDTCDE(Q)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A  71                                  DSPATR(PC RI)
     A*
     A                                 18  1'出勤率  :'
     A            DPB18     R        B 18 13REFFLD(PB18 PYPBPF)
     A                                      EDTCDE(1)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A  77                                  DSPATR(PC RI)
     A                                 18 27'獎懲率  :'
     A            DPB19     R        B 18 39REFFLD(PB19 PYPBPF)
     A                                      EDTCDE(1)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A  78                                  DSPATR(PC RI)
     A                                 18 54'紅利N   :'
     A            DRB03          8  5O 18 66
     A                                      EDTCDE(1)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A* 79                                  DSPATR(PC RI)
     A*
     A*                                18 54'考績率  :'
     A*           DPB20     R        B 18 66REFFLD(PB20 PYPBPF)
     A*                                     EDTCDE(J)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A* 79                                  DSPATR(PC RI)
     A*
     A                                 20  1'實領總額:'
     A            DPB12     R        O 20 13REFFLD(PB12 PYPBPF)
     A                                      EDTCDE(1)
     A*
     A                                 22  1'說　明　:'
     A            DPB13     R        B 22 13REFFLD(PB13 PYPBPF)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A  73                                  DSPATR(PC RI)
     A*
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 23  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 24  2'PF03 =回主畫面'
     A                                 24 20'PF12 =回前畫面'
     A*                                24 38'PF13 =計算總額'
     A                                 24 67'【泛太資訊】'
