     A****************************************************************
     A*            泛太資訊科技開發股份有限公司－版權所有          *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : PYA303D                                    *
     A*    AUTHOR       : A1070  CHOIE                               *
     A*    CREATE DATE  : 79/06/01                                   *
     A*    UPDATE DATE  : 790629                                     *
     A*    PROGRAM NAME : PYA301                                     *
     A*    SYSTEM       : MIRS                                       *
     A*    SUBSYSTEM    : PY                                         *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPC1
     A                                      CA03(03)
     A                                      CF13(13)
     A                                  1  2'<PYA404D>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 36'檔案整理'
     A                                      DSPATR(RI)
     A*
     A                                  5 29'公司編號:'
     A            DCM01     R        B  5 41REFFLD(CM01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  32                                  DSPATR(UL)
     A N32                                  DSPATR(PR)
     A                                  7 29'年　　月:'
     A            DYM            4Y 0B  7 41
     A                                      EDTCDE(Y)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A*
     A                                 10 11'                                  -
     A                                                            '
     A                                      DSPATR(RI)
     A                                 11 11' '
     A                                      DSPATR(RI)
     A                                 11 66' '
     A                                      DSPATR(RI)
     A                                 12 11' '
     A                                      DSPATR(RI)
     A  97                             12 23'請按<Ｆ１３>鍵後開始處理'
     A                                      DSPATR(HI)
     A  96                             12 32'檔案整理中！！'
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A                                 12 66' '
     A                                      DSPATR(RI)
     A                                 13 11' '
     A                                      DSPATR(RI)
     A                                 13 66' '
     A                                      DSPATR(RI)
     A                                 14 11'                                  -
     A                                                            '
     A                                      DSPATR(RI)
     A                                 17  2'說明'
     A                                 17  9':將刪除並備份輸入年月以前（包含-
     A                                      輸入年月）所有的資料'
     A                                      DSPATR(HI)
     A                                 19  2'磁帶機　:'
     A            $TDEV         10   B 19 14
     A                                 21 28'***請準備好磁帶***'
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03 =回主畫面'
     A                                 23 20'PF13 =處理開始'
     A                                 24 67'【泛太資訊】'
