     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : PTA991                                     *
     A*    PROGRAM NAME :考績組別檔維護　                          *
     A*    AUTHOR       : A1379  MAX ALLEN LOUIS                     *
     A*    CREATE DATE  : 93.01.02                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :基本資料系統                              *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PTRF)
     A                                      PRINT
     A          R DSPD1
     A                                      CSRLOC(#LIN       #COL)
     A                                      CA03(03)
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<PTA557>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A            DDATE          6Y 0O  1 71EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 34'考績組別維護'
     A                                      DSPATR(RI)
     A                                  4  2'公司別:'
     A            DRVC01         2A  B  4 12
     A                                  5  2'考績組別:'
     A            DRVC02         2A  B  5 14
     A                                  6  2'考績項目代碼:'
     A            DRVC03         2A  B  6 18
     A            DRVB03        12O     6 21
     A                                  7  2'作業選擇:'
     A            DOPT           1Y 0B  7 14VALUES(1 4)
     A                                      EDTCDE(4)
     A                                  7 18'( 1.新增'
     A*                                 7 29'2.修改'
     A                                  7 29'4.刪除)'
     A*                                 7 38'5.查詢)'
     A                                  8  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A*
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'PF3 =回主畫面'
     A*                                23 28'PF12=回前畫面'
     A                                 24 67'【泛太資訊】'
