     A*%%TS  SD  20070409  182945  CWDEV2      REL-V4R4M0  5769-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : PYA504D                                    *
     A*    PROGRAM NAME :薪資系統參數設定                          *
     A*    AUTHOR       : A1226 PETER                                *
     A*    CREATE DATE  : 85/08/28                                   *
     A*    UPDATE DATE  : 91/07/04 A1336 KLAUS                       *
     A*    SYSTEM       :人事薪資系統                              *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A*------------------------------------------------------------***
     A          R DSPD1
     A                                      CA03(03)
     A                                  1  2'<PYA504.1>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 32'薪資系統參數設定'
     A                                      DSPATR(RI)
     A                                  4  1'公司編號:'
     A            DPM02     R        B  4 13REFFLD(PM02)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                  5  1'作業選擇:'
     A            DOPT           1  0B  5 13VALUES(1 2 4 5)
     A                                      EDTCDE(4)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  5 16'(1.新增2.修改4.刪除5.查詢)-
     A                                      '
     A                                  6  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A*
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03 =回主畫面'
     A                                 24 67'【泛太資訊】'
     A*
     A*------------------------------------------------------------***
     A          R DSPD2
     A                                      CA03(03)
     A                                      CF12(12)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A                                  1  2'<PYA504.2>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 32'薪資系統參數設定'
     A                                      DSPATR(RI)
     A                                  2 64'作業:'
     A            DFUN           6O  O  2 72DSPATR(RI)
     A                                  4 26'公司編號:'
     A            DPM02     R        O  4 38REFFLD(PM02)
     A            DPM02N    R        O  4 41REFFLD(CM02)
     A                                  6  2'<<加班參數>>'
     A                                  7  6'男免稅加班時數　　　　  :'
     A            DM113          3Y 0B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  7 41'女免稅加班時數　　　　      :'
     A            DM114          3Y 0B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  8  6'２小時內加班費薪資比率  :'
     A            DM115          3Y 2B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  8 41'２小時外加班費薪資比率      :'
     A            DM116          3Y 2B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  9  6'一般假日加班費薪資比率　:'
     A            DM117          3Y 2B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  9 41'國定假日加班費薪資比率      :'
     A            DM118          3Y 2B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 10  6'值班薪資比率　　　      :'
     A            DM119          3Y 2B    +1EDTCDE(3)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 10 41'早退薪資比率                :'
     A            DM132          3Y 2B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 11  6'遲到薪資比率　　　      :'
     A            DM131          3Y 2B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 11 41'忘打卡－每次　　　          :'
     A            DM130          3Y 0B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                    +1'元'
     A                                 13  2'<<計薪參數>>'
     A                                 14  6'福利金薪資比率　　      :'
     A            DM126          5Y 4B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 14 41'勞保職災薪資比率　          :'
     A            DM121          5Y 4B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 15  6'未休特休轉薪資比率      :'
     A            DM111          3Y 2B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 15 41'未休轉休轉薪資比率          :'
     A            DM112          3Y 2B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 16  6'外籍津貼給付之比率      :'
     A            DM342          3Y 2B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 17  2'<<特休參數>>'
     A                                 18  6'最小單位小時            :'
     A            DM107          1Y 0B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 18 41'可預借明年比率              :'
     A            DM109          3Y 2B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 19  6'特休可轉代金之比率      :'
     A            DM341          3Y 2B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03 =回主畫面'
     A                                 23 19'PF12 =回前畫面'
     A                                 24 67'【泛太資訊】'
     A*
     A*------------------------------------------------------------***
     A          R DSPD3
     A                                      CA03(03)
     A                                      CF12(12)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A                                  1  2'<PYA504.3>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 32'薪資系統參數設定'
     A                                      DSPATR(RI)
     A                                  2 64'作業:'
     A            DFUN           6O  O  2 72DSPATR(RI)
     A                                  4 26'公司編號:'
     A            DPM02     R        O  4 38REFFLD(PM02)
     A            DPM02N    R        O  4 41REFFLD(CM02)
     A                                  6  2'<<基本設定>>'
     A                                  6 18'天工作時數:'
     A            DM101          2Y 0B  6 32EDTCDE(1)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  6 39'月工作天數:'
     A            DM102          2Y 0B  6 53EDTCDE(1)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  6 61'年結月份  :'
     A            DM103          2Y 0B  6 75EDTCDE(1)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  8  2'<<假別代碼>>'
     A                                  8 18'事假:'
     A            DM104          1A  B  8 26
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  8 31'病假:'
     A            DM105          1A  B  8 39
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  8 44'年假:'
     A            DM106          1A  B  8 52
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  8 57'轉休:'
     A            DM110          1A  B  8 65
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  8 70'公傷:'
     A            DM145          1A  B  8 78
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  9 18'公假:'
     A            DM141          1A  B  9 26
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  9 31'婚假:'
     A            DM142          1A  B  9 39
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  9 44'喪假:'
     A            DM143          1A  B  9 52
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  9 57'產假:'
     A            DM144          1A  B  9 65
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  9 70'曠職:'
     A            DM127          1A  B  9 78
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 10 20' '
     A                                 12  2'<<薪資代碼>>'
     A                                 12 18'實領本薪:'
     A            DM301          2A  B 12 30
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 12 39'職務加給:'
     A            DM302          2A  B 12 51
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 12 61'專業津貼:'
     A            DM306          2A  B 12 73
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 13 18'績效獎金:'
     A            DM308          2A  B 13 30
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 13 39'交通津貼:'
     A            DM323          2A  B 13 51
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 13 61'伙食津貼:'
     A            DM314          2A  B 13 73
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 14 18'應稅加班:'
     A            DM303          2A  B 14 30
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 14 39'免稅加班:'
     A            DM304          2A  B 14 51
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 14 61'外地津貼:'
     A            DM320          2A  B 14 73
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 15 18'補發本薪:'
     A            DM305          2A  B 15 30
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 15 39'補發伙食:'
     A            DM307          2A  B 15 51
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 15 61'交通費　:'
     A            DM329          2A  B 15 73
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 16 18'上期借支:'
     A            DM312          2A  B 16 30
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 16 39'勞保費  :'
     A            DM310          2A  B 16 51
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 16 61'健保費　:'
     A            DM319          2A  B 16 73
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 17 18'所得稅  :'
     A            DM318          2A  B 17 30
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 17 39'非固定稅:'
     A            DM311          2A  B 17 51
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 17 61'生產獎金:'
     A            DM326          2A  B 17 73
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 18 18'值班費　:'
     A            DM322          2A  B 18 30
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 18 39'年假給付:'
     A            DM324          2A  B 18 51
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 18 61'住宿費　:'
     A            DM325          2A  B 18 73
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 19 18'福利金　:'
     A            DM334          2A  B 19 30
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 19 39'工會費　:'
     A            DM332          2A  B 19 51
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 19 61'全勤獎金:'
     A            DM321          2A  B 19 73
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 20 18'請假扣款:'
     A            DM327          2A  B 20 30
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A*                                20 39'病假扣款:'
     A*           DM328          2A  B 20 51
     A* 31                                  DSPATR(PR)
     A*N31                                  DSPATR(UL)
     A*                                20 61'曠工扣款:'
     A*           DM330          2A  B 20 73
     A* 31                                  DSPATR(PR)
     A*N31                                  DSPATR(UL)
     A                                 20 39'員工自提退休金:'
     A            DM352          2A  B 20 57
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 21 18'其他扣款:'
     A            DM331          2A  B 21 30
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 21 39'誤餐費　:'
     A            DM317          2A  B 21 51
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 21 61'員工貸款:'
     A            DM313          2A  B 21 73
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A*
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03 =回主畫面'
     A                                 23 19'PF12 =回前畫面'
     A                                 24 67'【泛太資訊】'
     A*-------------------------------------------------------------***
     A          R DSPD4
     A*%%TS  SD  20070409  182945  CWDEV2      REL-V4R4M0  5769-PW1
     A                                      CA03(03)
     A                                      CF12(12)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A                                  1  2'<PYA504.4>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 32'薪資系統參數設定'
     A                                      DSPATR(RI)
     A                                  2 64'作業:'
     A            DFUN           6O  O  2 72DSPATR(RI)
     A                                  4 26'公司編號:'
     A            DPM02     R        O  4 38REFFLD(PM02)
     A            DPM02N    R        O  4 41REFFLD(CM02)
     A                                  6  2'<<公司負擔>>'
     A                                  6 18'勞保費  :'
     A            DM335          2A  B  6 30
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  6 39'勞保職災:'
     A            DM336          2A  B  6 51
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  6 61'勞保墊償:'
     A            DM337          2A  B  6 73
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  7 18'團保保費:'
     A            DM338          2A  B  7 30
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  7 39'健保費　:'
     A            DM339          2A  B  7 51
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  7 61'伙食費　:'
     A            DM340          2A  B  7 73
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  9  2'<<系統設定>>'
     A                                  9 18'上期試算:'
     A            DM201          4Y 0B  9 30EDTWRD('0  /  ')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  9 39'上期確認:'
     A            DM202          4Y 0B  9 51EDTWRD('0  /  ')
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  9 61'特休年度:'
     A            DM108          3Y 0B  9 73EDTCDE(1)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 10 18'下期試算:'
     A            DM205          4Y 0B 10 30EDTWRD('0  /  ')
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 10 39'下期確認:'
     A            DM206          4Y 0B 10 51EDTWRD('0  /  ')
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 10 61'下期處理:'
     A            DM207          1A  B 10 73VALUES(' ' 'Y')
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 11 18'存入月差:'
     A            DM203          1Y 0B 11 30EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 11 39'加班輸入:'
     A            DM204          1A  B 11 51VALUES(' ' '1')
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 12 10'外勞'
     A                                 12 18'薪資試算:'
     A            DMB01          5Y 0B 12 30EDTWRD('0   /  ')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 12 39'薪資確認:'
     A            DMB02          5Y 0B 12 51EDTWRD('0   /  ')
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 11 53'(1-計薪時數即實際加班)'
     A                                 13  2'<<刷卡設定>>'
     A                                 14 30'刷卡時間'
     A                                 14 45'實際上班時段'
     A                                 15 18'上班時間:'
     A            DM181          4Y 0B 15 33EDTWRD('  :  ')
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A            DM183          4Y 0B 15 44EDTWRD('  :  ')
     A  66                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 15 50'～'
     A            DM184          4Y 0B 15 55EDTWRD('  :  ')
     A  67                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 17 18'下班時間:'
     A            DM182          4Y 0B 17 33EDTWRD('  :  ')
     A  68                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A            DM185          4Y 0B 17 44EDTWRD('  :  ')
     A  69                                  DSPATR(PC)
     A  69                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                 17 50'～'
     A            DM186          4Y 0B 17 55EDTWRD('  :  ')
     A  70                                  DSPATR(PC)
     A  70                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03 =回主畫面'
     A                                 23 19'PF12 =回前畫面'
     A                                 24 67'【泛太資訊】'
     A*------------------------------------------------------------***
     A          R DSPD5
     A                                      CA03(03)
     A                                      CF12(12)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A                                  1  2'<PYA504.5>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 32'薪資系統參數設定'
     A                                      DSPATR(RI)
     A                                  2 64'作業:'
     A            DFUN           6O  O  2 72DSPATR(RI)
     A                                  4 26'公司編號:'
     A            DPM02     R        O  4 38REFFLD(PM02)
     A            DPM02N    R        O  4 41REFFLD(CM02)
     A                                  6  2'<<獎金及紅利發放原則>>'
     A                                  8  4'考勤率:'
     A                                  8 14'事假１天減發'
     A            DM501          5Y 2B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                    +1'%'
     A                                  8 41'病假１天減發'
     A            DM502          5Y 3B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                    +1'／'
     A            DM506          5Y 2B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                  9 14'遲到１次減發'
     A            DM503          5Y 3B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                    +1'%'
     A                                  9 41'早退１次減發'
     A            DM504          5Y 3B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                    +1'%'
     A                                 10 14'曠職１天減發'
     A            DM505          5Y 3B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                    +1'%'
     A                                 13  4'獎懲率:'
     A                                 13 14'嘉獎１次加'
     A            DM601          5Y 3B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                    +1'%'
     A                                    +1'小功１次加'
     A            DM602          5Y 3B    +1EDTCDE(3)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                    +1'%'
     A                                    +1'大功１次加'
     A            DM603          5Y 3B    +1EDTCDE(3)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                    +1'%'
     A                                 14 14'申誡１次減'
     A            DM604          5Y 3B    +1EDTCDE(1)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                    +1'%'
     A                                    +1'小過１次減'
     A            DM605          5Y 3B    +1EDTCDE(3)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                    +1'%'
     A                                    +1'大過１次減'
     A            DM606          5Y 3B    +1EDTCDE(3)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                    +1'%'
     A                                 17  4'考績率:'
     A                                 17 14'特優標準加'
     A            DM701          5Y 3B    +1EDTCDE(1)
     A  71                                  DSPATR(PC)
     A  71                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                    +1'%'
     A                                 17 41'優等標準加'
     A            DM702          5Y 3B    +1EDTCDE(1)
     A  72                                  DSPATR(PC)
     A  72                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                    +1'%'
     A                                 18 14'甲等不加減'
     A            DM703          5Y 3O    +1EDTCDE(1)
     A* 31                                  DSPATR(PR)
     A*N31                                  DSPATR(UL)
     A                                    +1'%'
     A                                 18 41'乙等標準減'
     A            DM704          5Y 3B    +1EDTCDE(1)
     A  73                                  DSPATR(PC)
     A  73                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                    +1'%'
     A                                 19 14'丙等標準減'
     A            DM705          5Y 3B    +1EDTCDE(1)
     A  74                                  DSPATR(PC)
     A  74                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(UL)
     A                                    +1'%'
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03 =回主畫面'
     A                                 23 19'PF12 =回前畫面'
     A                                 24 67'【泛太資訊】'
