     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : PYA501D                                    *
     A*    PROGRAM NAME :職稱基本資料設定                          *
     A*    AUTHOR       : A1232 ERIC                                 *
     A*    CREATE DATE  : 85/12/27                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人事薪資                                  *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A                                      CA03(03 'RETURN')
     A                                      CF18(18 'FULL PAGE INQ.')
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<PYA501.1>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('0  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 32'職稱基本資料設定'
     A                                      DSPATR(RI)
     A                                  4  1'職稱編號:'
     A            DJT01     R        B  4 13REFFLD(JT01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                  5  1'作業選擇:'
     A            DOPT           1Y 0B  5 13VALUES(1 2 4 5)
     A                                  5 16'(1.新增2.修改4.刪除5.查詢)-
     A                                      '
     A                                  6  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03 =回主畫面'
     A                                 23 20'PF18 =全頁查詢'
     A                                 24 67'【泛太資訊】'
     A*----------------------------------------------------------------
     A          R DSPD2
     A                                      CA03(03 'RETURN')
     A                                      CA12(12 'PREVIOUSE')
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<PYA501.2>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('0  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 32'職稱基本資料設定'
     A                                      DSPATR(RI)
     A                                  2 64'作業:'
     A            DFUN           6A  O  2 72DSPATR(RI)
     A                                  6 27'職稱編號:'
     A            DJT01     R        O  6 39REFFLD(JT01)
     A                                  8 27'職稱名稱:'
     A            DJT02     R        B  8 39REFFLD(JT02)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A*                                10 27'加班計薪:'
     A*           DJT03     R        B 10 39REFFLD(JT03)
     A*                                     VALUES(' ' '1' '2')
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A*                                10 41'( 1-計時  2-津貼)'
     A*                                12 27'職務加給:'
     A*           DJT04     R        B 12 39REFFLD(JT04)
     A*                                     VALUES('Y' 'N')
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A*                                12 44'(Y/N)'
     A*                                13 27'　　金額:'
     A*           DJT05     R        B 13 39REFFLD(JT05)
     A*                                     EDTCDE(2)
     A* 61                                  DSPATR(PC)
     A* 61                                  DSPATR(RI)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A*                                13 46'-'
     A*           DJT06     R        B 13 48REFFLD(JT06)
     A*                                     EDTCDE(2)
     A* 61                                  DSPATR(PC)
     A* 61                                  DSPATR(RI)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A*                                15 27'全勤獎金:'
     A*           DJT07     R        B 15 39REFFLD(JT07)
     A*                                     VALUES('Y' 'N')
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A*                                15 44'(Y/N)'
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03 =回主畫面'
     A                                 23 20'PF12 =回前畫面'
     A                                 24 67'【泛太資訊】'
