     A*%%TS  SD  20020613  122227  PPSPGMREL   REL-V4R4M0  5769-PW1
     A*  90/07/31  16:19:37    A1038       REL-R02M00  5728-PW1
     A****************************************************************
     A*            泛太資訊科技開發股份有限公司－版權所有          *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : PYA510D                                    *
     A*    AUTHOR       : A1038  CATHY SUN                           *
     A*    CREATE DATE  : 79/05/19                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : PYA510                                     *
     A*    SYSTEM       : MIRS                                       *
     A*    SUBSYSTEM    : PY                                         *
     A*    REMARK       :特休假對照表設定                          *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R SFLSR                     SFL
     A                                      CHGINPDFT(CS UL)
     A            RRN            2  0O  9  4
     A                                      EDTCDE(1)
     A            DYEAR         10A  O  9  9
     A            DVA02     R        B  9 22REFFLD(VA02)
     A                                      CHECK(RB)
     A                                      EDTCDE(1)
     A                                      DSPATR(CS)
     A            DVA03     R        B  9 27REFFLD(VA03)
     A                                      CHECK(RB)
     A                                      EDTCDE(1)
     A                                      DSPATR(CS)
     A            DVA04     R        B  9 32REFFLD(VA04)
     A                                      CHECK(RB)
     A                                      EDTCDE(1)
     A                                      DSPATR(CS)
     A            DVA05     R        B  9 37REFFLD(VA05)
     A                                      CHECK(RB)
     A                                      EDTCDE(1)
     A                                      DSPATR(CS)
     A            DVA06     R        B  9 42REFFLD(VA06)
     A                                      CHECK(RB)
     A                                      DSPATR(CS)
     A                                      EDTCDE(1)
     A            DVA07     R        B  9 47REFFLD(VA07)
     A                                      CHECK(RB)
     A                                      EDTCDE(1)
     A                                      DSPATR(CS)
     A            DVA08     R        B  9 52REFFLD(VA08)
     A                                      CHECK(RB)
     A                                      EDTCDE(1)
     A                                      DSPATR(CS)
     A            DVA09     R        B  9 57REFFLD(VA09)
     A                                      CHECK(RB)
     A                                      EDTCDE(1)
     A                                      DSPATR(CS)
     A            DVA10     R        B  9 62REFFLD(VA10)
     A                                      CHECK(RB)
     A                                      EDTCDE(1)
     A                                      DSPATR(CS)
     A            DVA11     R        B  9 67REFFLD(VA11)
     A                                      CHECK(RB)
     A                                      EDTCDE(1)
     A                                      DSPATR(CS)
     A            DVA12     R        B  9 72REFFLD(VA12)
     A                                      CHECK(RB)
     A                                      EDTCDE(1)
     A                                      DSPATR(CS)
     A            DVA13     R        B  9 77REFFLD(VA13)
     A                                      CHECK(RB)
     A                                      EDTCDE(1)
     A                                      DSPATR(CS)
     A*----------------------------------------------------------------
     A          R SFLCR                     SFLCTL(SFLSR)
     A*  90/07/31  16:19:37    A1038       REL-R02M00  5728-PW1
     A                                      SFLSIZ(0032)
     A                                      SFLPAG(0011)
     A                                      OVERLAY
     A                                      CF03(03 '回主畫面')
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A                                  1  2'<PYA510D>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('0  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 31'特別休假對照表建立'
     A                                  4  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                  5 71'十'
     A                                  5 76'十'
     A                                  6 21'一'
     A                                  6 26'二'
     A                                  6 31'三'
     A                                  6 36'四'
     A                                  6 41'五'
     A                                  6 46'六'
     A                                  6 51'七'
     A                                  6 56'八'
     A                                  6 61'九'
     A                                  6 66'十'
     A                                  6 71'一'
     A                                  6 76'二'
     A                                  7  2'序號'
     A                                  7 10'年資'
     A                                  7 21'月'
     A                                  7 26'月'
     A                                  7 31'月'
     A                                  7 36'月'
     A                                  7 41'月'
     A                                  7 46'月'
     A                                  7 51'月'
     A                                  7 56'月'
     A                                  7 61'月'
     A                                  7 66'月'
     A                                  7 71'月'
     A                                  7 76'月'
     A                                  8  3'----'
     A                                  8  9'----------'
     A                                  8 22'--   --   --   --   --   --   --  -
     A                                       --   --   --   --   --'
     A          R DSPC1
     A*  90/07/31  16:19:37    A1038       REL-R02M00  5728-PW1
     A                                      OVERLAY
     A                                 20  2'==================================-
     A                                      ===================================-
     A                                      ========='
     A                                 21  2'<休假單位：天>'
     A                                 23  2'PF3=回主畫面'
     A            DMARK         14A  O 24 66MSGID(UMI 0001 CEMF)
