     A*  90/06/29  11:44:46    A1038       REL-R02M00  5728-PW1
     A****************************************************************
     A*            泛太資訊科技開發股份有限公司－版權所有          *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : PYA303D                                    *
     A*    AUTHOR       : A1070  CHOIE                               *
     A*    CREATE DATE  : 79/06/01                                   *
     A*    UPDATE DATE  : 790629                                     *
     A*    PROGRAM NAME : PYA301                                     *
     A*    SYSTEM       : MIRS                                       *
     A*    SUBSYSTEM    : PY                                         *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPC1
     A                                      CA03(03)
     A                                      CF13(13)
     A                                  1  2'<PYA702D>'
     A                                  1 26'＜＜所得稅扣繳申報處理＞＞'
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('0  /  /  ')
     A                                  2  2'<PYA702.1>'
     A                                  7 29'公司整合:'
     A            DPY01          1A  B  7 41VALUES('S' 'R' 'K')
     A                                  9 29'媒體單位:'
     A            DTD02     R        B  9 41REFFLD(TD02)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                 11 29'年　　度:'
     A            DTD01     R   -2   B 11 41REFFLD(TD01)
     A                                      EDTWRD('0  ')
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                 13 29'重新處理:'
     A            DOPT           1   B 13 41
     A                                      VALUES('Y' 'N')
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                 13 43'(Y/N)'
     A*
     A                                 15 11'                                  -
     A                                                            '
     A                                      DSPATR(RI)
     A                                 16 11' '
     A                                      DSPATR(RI)
     A                                 16 66' '
     A                                      DSPATR(RI)
     A                                 17 11' '
     A                                      DSPATR(RI)
     A  97                             17 23'請按<Ｆ１３>鍵後開始處理'
     A                                      DSPATR(HI)
     A  96                             17 30'申報資料處理中！！'
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A                                 17 66' '
     A                                      DSPATR(RI)
     A                                 18 11' '
     A                                      DSPATR(RI)
     A                                 18 66' '
     A                                      DSPATR(RI)
     A                                 19 11'                                  -
     A                                                            '
     A                                      DSPATR(RI)
     A                                 23  2'PF03 =回主畫面'
     A                                    +2'PF13 =處理開始'
     A            DMARK         14A  O 24 66MSGID(UMI 0001 CEMF)
     A                                      DSPATR(HI)
     A  95        ERR1          50A  O 22  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR2          70A  O 22  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR3          70A  O 22  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR4          70A  O 22  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR5          70A  O 22  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
