     A*%%TS  SD  19950524  190050  PYPGMR      REL-V2R3M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPC1
     A*%%TS  SD  19950524  182932  PYPGMR      REL-V2R3M0  5738-PW1
     A                                      CA03(03)
     A                                      CF18(18)
     A                                  1  2'<PYA706D>'
     A                                  1 26'＜＜銀行轉存資料調整＞＞'
     A                                      DSPATR(RI)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('  /  /  ')
     A                                  2  2'<PYA706.1>'
     A                                  5 29'公司編號:'
     A            DBT01     R        B  5 41REFFLD(BT01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                  6 29'員工編號:'
     A            DBT02     R        B  6 41REFFLD(BT02)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  7 29'所得類別:'
     A            DBT03     R        B  7 41REFFLD(BT03)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                      VALUES(' ' '1' '2' '5')
     A                                    +1'1.下期薪資'
     A                                    +1'2.上期薪資'
     A                                    +1'5.獎金'
     A                                  8 29'存入日期:'
     A            DYMD           6  0B  8 41
     A                                      EDTWRD('  /  /  ')
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                  9 29'存入銀行:'
     A            DBT061    R        B    +1REFFLD(BT061)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                 11 29'作業選擇:'
     A            DOPT           1Y 0B 11 41VALUES(1 2 4 5)
     A                                      EDTCDE(4)
     A                                 11 44'1.新增'
     A                                 12 44'2.修改'
     A                                 13 44'4.刪除'
     A                                 14 44'5.查詢'
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'PF3 =回主畫面'
     A                                 24 67'【泛太資訊】'
     A                                 23 28'PF18=全頁查詢'
     A*----------------------------------------------------------------
     A          R DSPC2
     A*%%TS  SD  19950524  190050  PYPGMR      REL-V2R3M0  5738-PW1
     A                                      CA03(03)
     A                                      CF05(05)
     A                                      CF12(12)
     A                                  1  2'<PYA706D>'
     A                                  1 26'＜＜銀行轉存資料調整＞＞'
     A                                      DSPATR(RI)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('  /  /  ')
     A                                  2  2'<PYA706.2>'
     A                                  2 64'作業:'
     A            DFUN           6A  O  2 72DSPATR(RI)
     A                                  5 29'公司編號:'
     A            DBT01     R        O  5 41REFFLD(BT01)
     A            CM02      R        O  5 44
     A                                  6 29'員工編號:'
     A            DBT02     R        O  6 41REFFLD(BT02)
     A            EM03      R        O  6 47
     A                                  7 29'所得類別:'
     A            DBT03     R        O  7 41REFFLD(BT03)
     A                                  7 43'1.下期薪資'
     A                                  7 56'2.上期薪資'
     A                                  7 69'5.獎金'
     A                                  8 29'存入日期:'
     A            DYMD           6Y 0O  8 41EDTWRD('  /  /  ')
     A                                  9 29'存入銀行:'
     A            DBT061    R        O  9 41REFFLD(BT061)
     A                                 11 29'存入金額:'
     A            DBT08     R        B 11 41REFFLD(BT08)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                      EDTCDE(1)
     A                                 12 29'存入分行:'
     A            DBT062    R        B 12 41REFFLD(BT062)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            BN04      R        O 12 46
     A                                 13 29'存入帳號:'
     A            DBT07     R        B 13 41REFFLD(BT07)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'PF3 =回主畫面'
     A                                 24 67'【泛太資訊】'
     A                                 23 28'PF12=回前畫面'
     A                                 23 45'PF5=參考資料'
