     A*%%TS  SD  19981219  084819  PPSPGMR40   REL-V3R1M0  5763-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : PYA909D                                    *
     A*    PROGRAM NAME :支援作業                                  *
     A*    AUTHOR       : B1038 SHARON                               *
     A*    CREATE DATE  : 98/11/02                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人事薪資系統                              *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19981209  161914  PPSPGMR40   REL-V3R1M0  5763-PW1
     A                                      CSRLOC(#LIN       #COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF18(18)
     A                                      RTNCSRLOC(&#REC &#FLD)
     A            #REC          10A  H
     A            #FLD          10A  H
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A            ERRID          7A  H
     A            ERRF          10A  H
     A                                  1  2'<PYA909.1>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A            DDATE          6Y 0O  1 72EDTWRD('  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 35'支援作業'
     A                                      DSPATR(RI)
     A                                  4  1'公司編號:'
     A            DXD01     R        B  4 13REFFLD(XD01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            DXD01N        14A  O  4 17
     A                                  5  1'員工代號:'
     A                                      DSPATR(HI)
     A            DXD02     R        B  5 13REFFLD(XD02)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  6  1'起始日期:'
     A            DXD07     R   -2   B  6 13REFFLD(XD07)
     A                                      EDTWRD('  /  /  ')
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  7  1'作業選擇:'
     A            DOPT           1Y 0B  7 13VALUES(1 2 4 5)
     A                                      EDTCDE(4)
     A                                  7 16'( 1.新增2.修改4.刪除5.查詢-
     A                                      )'
     A                                  8  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'F3 =回主畫面'
     A                                 23 27'F4 =欄位查詢'
     A                                 23 44'F18=全頁查詢'
     A                                 24 67'【泛太資訊】'
     A**************************************************************
     A          R DSPD2
     A*%%TS  SD  19981219  084819  PPSPGMR40   REL-V3R1M0  5763-PW1
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF05(05)
     A                                      CF12(12)
     A                                      RTNCSRLOC(&#REC &#FLD)
     A            #REC          10A  H
     A            #FLD          10A  H
     A            ERRID          7A  H
     A            ERRF          10A  H
     A                                  1  2'<PYA909.2>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A            DDATE          6Y 0O  1 72EDTWRD('  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 35'支援作業'
     A                                      DSPATR(RI)
     A                                  4  1'公司編號:'
     A            DXD01     R        O  4 13REFFLD(XD01)
     A            DXD01N        14A  O  4 17
     A                                  5  1'員工代號:'
     A            DXD02     R        O  5 13REFFLD(XD02)
     A                                  6  1'起始日期:'
     A            DXD07     R   -2   O  6 13REFFLD(XD07)
     A                                      EDTWRD('  /  /  ')
     A                                  7  1'作業選擇:'
     A            DOPT           1Y 0O  7 13EDTCDE(4)
     A                                  7 16'( 1.新增2.修改4.刪除5.查詢-
     A                                      )'
     A                                  8  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  9  1'中文姓名:'
     A            EM03      R        O  9 13REFFLD(EM03)
     A                                 10  1'英文姓名:'
     A            DEM031        30A  O 10 13
     A                                 11  1'原定工作區:'
     A            XD03      R        O 11 15REFFLD(XD03)
     A            DXD03N        30A  O 11 26
     A                                 12  1'原定工作組:'
     A            XD04      R        O 12 15REFFLD(XD04)
     A            DXD04N        30A  O 12 18
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 14  1'支援工作區:'
     A                                      DSPATR(HI)
     A            DXD05     R        B 14 15REFFLD(XD05)
     A  67                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DXD05N        30A  O 14 26
     A                                 15  1'支援工作組:'
     A                                      DSPATR(HI)
     A            DXD06     R        B 15 15REFFLD(XD06)
     A  68                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A  32                                  DSPATR(UL)
     A N32                                  DSPATR(PR)
     A            DXD06N        30A  O 15 18
     A                                 16  1'截止日期  :'
     A            DXD08     R   -2   B 16 15REFFLD(XD08)
     A                                      EDTWRD('  /  /  ')
     A  69                                  DSPATR(PC)
     A  69                                  DSPATR(RI)
     A  33                                  DSPATR(UL)
     A N33                                  DSPATR(PR)
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'F3 =回主畫面'
     A                                 23 27'F4 =欄位查詢'
     A                                 23 44'F5 =參考資料'
     A                                 23 61'F12=回前畫面'
     A                                 24 67'【泛太資訊】'
