     A*%%TS  SD  20050223  192931  REENE       REL-V4R4M0  5769-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*                                                              *
     A*    PROGRAM-ID   : PYH102D                                    *
     A*    PROGRAM NAME :退休金提撥金額檢核表                      *
     A*    AUTHOR       : A1386 SHARON                               *
     A*    CREATE DATE  : 94/04/08                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                          *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(22)
     A                                      PRINT
     A*-------------------------------------------------------------***
     A          R DSPD1
     A*%%TS  SD  20050223  192931  REENE       REL-V4R4M0  5769-PW1
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF13(13)
     A                                      CSRLOC(#LIN       #COL)
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<PYH102D>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('0  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 30'退休金提撥金額檢核表'
     A                                      DSPATR(RI)
     A                                  6 28'公司編號    :'
     A            DH601          2A  B    +1
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A  32                                  DSPATR(UL)
     A N32                                  DSPATR(PR)
     A            CM02          14A  O    +1
     A                                  8 28'部門編號　起:'
     A                                      DSPATR(HI)
     A            DEM04F         7A  B    +1
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  9 28'　　　　　迄:'
     A                                      DSPATR(HI)
     A            DEM04T         7A  B    +1
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                 11 28'員工編號　起:'
     A                                      DSPATR(HI)
     A            DEM02F         8A  B    +1
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                 12 28'　　　　　迄:'
     A                                      DSPATR(HI)
     A            DEM02T         8A  B    +1
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                 14 28'提撥年月    :'
     A            DYM            6Y 0B    +1EDTWRD('0   /  ')
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                 18  2'執行環境:'
     A            $PENV          1A  B 18 14VALUES('0' '1' '2')
     A                                 18 17'(0-查詢 1-即時 2-批次)'
     A                                 19  2'列印份數:'
     A            $CPY           3Y 0B 19 14EDTCDE(3)
     A                                      CHECK(RB)
     A                                 20  2'列表機　:'
     A                                      DSPATR(HI)
     A            $PRTCD         2A  B 20 14
     A  27                             21 30'請準備１３２格報表紙'
     A                                      DSPATR(RI)
     A  28                             21 30'報表處理中，請稍候'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03 =回主畫面'
     A                                 24 67'【泛太資訊】'
