     A          R PH1
     A                                      SKIPB(002)
     A            CM03          34A        1
     A                                      SPACEA(001)
     A                                     1
     A                                      '員工自提異動名冊'
     A                                      SPACEA(002)
     A                                    52
     A                                      '日期:'
     A            @DATE          6  0     60
     A                                      EDTWRD('0  /  /  ')
     A                                    69
     A                                      '頁次:'
     A                                    77
     A                                      PAGNBR
     A                                      SPACEA(001)
     A                                     1
     A                                      '年月:'
     A            @@DYMX         6  0      9
     A                                      EDTWRD('    /  ')
     A                                    52
     A                                      '時間:'
     A                                    60
     A                                      TIME
     A                                      EDTWRD('  :  :  ')
     A                                    70'<PYH109P>'
     A                                      SPACEA(2)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'部門'
     A                                     8'員工編號'
     A                                    21'員工姓名'
     A                                    37'身份證號'
     A                                    49'月提繳工資'
     A                                    +3'提撥率'
     A                                    +1'提撥額'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======================'
     A                                      SPACEA(1)
     A          R PD1
     A                                      SPACEA(1)
     A            EM04           7         2
     A            EM02           8        10
     A            EM03          14A       23
     A            EM31          10A       37
     A            H506           6  0     52EDTCDE(1)
     A            H505           3  2     66EDTCDE(1)
     A            @@SUM1         9  0     69EDTCDE(1)
     A          R PT2
     A                                      SPACEA(1)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      =============='
     A                                      SPACEA(001)
     A                                     1
     A                                      '合計:'
     A            @@PNUM         4  0     +1EDTCDE(1)
     A                                    +2'人'
     A            @@SUM2         9  0    +49EDTCDE(1)
     A                                    +0'元'
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
