     A****************************************************************
     A*                      <<表頭>>
     A****************************************************************
     A          R PH1
     A                                      SKIPB(002)
     A*********************<<公司名稱>>***************************
     A                                      SPACEA(001)
     A            CM03          34O       24
     A                                      SPACEA(001)
     A*********************<<檔案名稱>>***************************
     A                                    30'自提明細印表'
     A                                      SPACEA(001)
     A**********************<<日期>>******************************
     A                                    48'日期:'
     A            DDATE          6  0     55
     A                                      EDTWRD('0  /  /  ')
     A**********************<<頁次>>******************************
     A                                    64'頁次:'
     A                                    72
     A                                      PAGNBR
     A                                      SPACEA(001)
     A***********
     A                                     1'年月:'
     A            DYYMM          4S 0O    13
     A                                      EDTWRD('  /  ')
     A                                    48'時間:'
     A                                    55
     A                                      TIME
     A                                      EDTWRD('  :  :  ')
     A                                    65'<PYH307P>'
     A                                      SPACEA(002)
     A***
     A                                     1'==================================-
     A                                      =================================='
     A                                      SPACEA(001)
     A                                     1'員工代號'
     A                                    16'姓  名'
     A                                    28'身份證號'
     A                                    40'月提繳工資'
     A                                    52'自提率'
     A                                    62'自提金額'
     A                                      SPACEA(001)
     A                                     1'==================================-
     A                                      =================================='
     A                                      SPACEA(001)
     A**************************************************************************
     A          R PD1
     A**************************************************************************
     A            H602           8A        2
     A            NAME          14O       12
     A            H403          12A       28
     A            H409           6  0     40EDTCDE(1)
     A            H407           3S 2     52EDTCDE(1)
     A            H605           6S 0     63EDTCDE(1)
     A                                      SPACEA(001)
     A**************************************************************************
     A*                      <<表尾>>
     A**************************************************************************
     A***********************<<小計>>********************************
     A          R PT1
     A                                    16'小計'
     A            SUM1           8S 0     63
     A                                      EDTCDE(1)
