     A****************************************************************
     A*   獂び戈癟м秨祇Τそ⌒舦┮Τ    TEL:27313250   *
     A*                                                              *
     A*    PROGRAM-ID   : PYI108D                                    *
     A*    PROGRAM NAME :щ玂肂琩高                              *
     A*    AUTHOR       : A1413 CLOUD                                *
     A*    CREATE DATE  : 96/03/21                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :穝癶ヰ╰参                            *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A*                                     REF(*LIBL/PYFMPF)
     A                                      PRINT
     A*----------------------------------------------------------------
     A          R DSPD0                     ASSUME
     A                                  1  2' '
     A*----------------------------------------------------------------
     A          R SFLSR                     SFL
     A            RRN            4Y 0H
     A            SEL            1A  B  6  4DSPATR(CS)
     A                                      DSPATR(PC)
     A                                      DSPATR(HI)
     A            CLASS          2  0O  6  7
     A            SUM            6  0O  6 18EDTCDE(1)
     A*----------------------------------------------------------------
     A          R SFLCR                     SFLCTL(SFLSR)
     A                                      SFLSIZ(0060)
     A                                      SFLPAG(0006)
     A                                      WINDOW(3 45 13 30)
     A                                      CA12(12)
     A                                      CA03(03)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
     A                                          '))
     A                                      USRRSTDSP
     A            DRRN           4S 0H      SFLRCDNBR
     A                                  1 14' щ玂肂琩高 '
     A                                      DSPATR(HI)
     A                                  1  2' <PYI108>  '
     A                                  4  4'S'
     A                                  4  6'щ玂单'
     A                                      DSPATR(UL)
     A                                  4 18'щ玂肂'
     A                                      DSPATR(UL)
     A*           KCLASS         2A  B  5  7
     A*                                     DSPATR(CS HI)
     A            KSUM           6  0B  5 18EDTCDE(1)
     A                                      DSPATR(CS HI)
     A*----------------------------------------------------------------
     A          R DSPD1                     WINDOW(SFLCR)
     A                                      OVERLAY
     A                                 12  2' 磅︽ '
     A                                    +2'PF12= 玡礶 '
