     A****************************************************************
     A*   獂び戈癟м秨祇Τそ⌒舦┮Τ    TEL:27313250   *
     A*                                                              *
     A*    PROGRAM-ID   : PYI107D                                    *
     A*    PROGRAM NAME :ヰ安膀セ戈琩高                          *
     A*    AUTHOR       : A1355 ERIC                                 *
     A*    CREATE DATE  :
     A*    UPDATE DATE  :
     A*    SYSTEM       :ㄆ羱戈╰参                              *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R SFLSR                     SFL
     A            RRN            3Y 0H
     A            DOPT           1A  B  8  2DSPATR(CS)
     A                                      DSPATR(PC)
     A                                      DSPATR(HI)
     A            LT02      R        O  8  7
     A            EM03      R        O  8 16
     A            LT03D          3Y 0O  8 32
     A                                      EDTCDE(4)
     A            DLT10     R        O  8 38EDTCDE(4)
     A                                      REFFLD(LT10)
     A            LT11      R        O  8 47EDTCDE(4)
     A            LT12      R        O  8 52EDTCDE(4)
     A            LT13      R        O  8 58EDTCDE(4)
     A            LT14      R        O  8 63EDTCDE(4)
     A            LT15      R        O  8 68EDTCDE(4)
     A            LT16      R        O  8 74EDTCDE(4)
     A*----------------------------------------------------------------
     A          R SFLCR                     SFLCTL(SFLSR)
     A                                      SFLSIZ(0140)
     A                                      SFLPAG(0014)
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF12(12)
     A                                      ROLLUP(25)
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND(*MORE)
     A            DRRN           3S 0H      SFLRCDNBR
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<PYI107D>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'ら戳:'
     A            DDATE          6Y 0O  1 72EDTWRD('0  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 34'ヰ安膀セ戈琩高'
     A                                      DSPATR(RI)
     A                                  4  1'そ絪腹:'
     A            DLT01     R        O  4 13REFFLD(LT01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            DLT01N        14O  O  4 16
     A                                  6  2'S'
     A                                      DSPATR(UL)
     A                                  6  5'絪腹'
     A                                      DSPATR(UL)
     A                                  6 16'  ﹎  '
     A                                      DSPATR(UL)
     A                                  6 31''
     A                                      DSPATR(UL)
     A                                  5 38'安'
     A                                  6 38'ぱ计'
     A                                      DSPATR(UL)
     A                                  5 45'セヰ'
     A                                  6 45'ぱ计计'
     A                                      DSPATR(UL)
     A                                  5 56'锣ヰ'
     A                                  6 56'ぱ计计'
     A                                      DSPATR(UL)
     A                                  5 67'箇'
     A                                  6 67'ぱ计计'
     A                                      DSPATR(UL)
     A            DLT02     R        B  7  7REFFLD(LT02)
     A                                      DSPATR(CS)
     A                                      DSPATR(HI)
     A            DLT03          3Y 0B  7 32DSPATR(CS)
     A                                      DSPATR(HI)
     A                                      EDTCDE(4)
     A*----------------------------------------------------------------
     A          R DSPC1
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03=礶'
     A                                 23 20'PF12=玡礶'
     A                                 23 38'PA01='
     A                                 23 56'PA02='
     A                                 24 67'獂び戈癟'
