     A*%%TS  SD  20000930  103948  PPSPGMRYH   REL-V4R2M0  5769-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*                                                              *
     A*    PROGRAM-ID   : PYI116D                                    *
     A*    PROGRAM NAME :團體保險資料查詢                          *
     A*    AUTHOR       : A1266 HANK                                 *
     A*    CREATE DATE  : 89/09/21                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人事薪資系統                              *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R SFLSR                     SFL
     A*%%TS  SD  20000930  103948  PPSPGMRYH   REL-V4R2M0  5769-PW1
     A            RRN            3Y 0H
     A            DOPT           1A  B  8  2DSPATR(CS)
     A                                      DSPATR(PC)
     A                                      DSPATR(HI)
     A            DX102     R        O  8  5REFFLD(X102)
     A            EM03      R        O  8 15
     A            DX103     R   -2   O  8 31REFFLD(X103)
     A                                      EDTWRD('0  /  /  ')
     A            X104N          6A  O  8 41
     A            X105      R        O  8 49EDTCDE(1)
     A            X106      R        O  8 62EDTCDE(1)
     A*----------------------------------------------------------------
     A**                                    CSRLOC(#LIN #COL)
     A          R SFLCR                     SFLCTL(SFLSR)
     A*%%TS  SD  20000930  103948  PPSPGMRYH   REL-V4R2M0  5769-PW1
     A                                      SFLSIZ(0140)
     A                                      SFLPAG(0014)
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF12(12)
     A                                      ROLLUP(25)
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A            DRRN           3S 0H      SFLRCDNBR
     A                                  1  2'<PYI116D>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 32'團體保險資料查詢'
     A                                      DSPATR(RI)
     A                                  4  1'公司編號:'
     A            DX101     R        O  4 13REFFLD(X101)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            DX101N        14O  O  4 16
     A                                  5  2'S (=作業) : /-挑選'
     A                                  6  2'S'
     A                                      DSPATR(UL)
     A                                  6  4'員工編號'
     A                                      DSPATR(UL)
     A                                  6 15'  員工姓名  '
     A                                      DSPATR(UL)
     A                                  6 30'生效日期'
     A                                      DSPATR(UL)
     A                                  6 41'類別'
     A                                      DSPATR(UL)
     A                                  6 49'應繳保費'
     A                                      DSPATR(UL)
     A                                  6 60'人數'
     A                                      DSPATR(UL)
     A            KX102     R        B  7  5REFFLD(X102)
     A                                      DSPATR(CS)
     A                                      DSPATR(HI)
     A            KX103     R   -2   B  7 31REFFLD(X103)
     A                                      EDTWRD('  /  /  ')
     A                                      DSPATR(CS)
     A                                      DSPATR(HI)
     A*----------------------------------------------------------------
     A          R DSPC1
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF3 =回主畫面'
     A                                 23 19'PF12=回前畫面'
     A                                 24 67'【泛太資訊】'
     A                                 23 36'PA1 =下一頁　'
     A                                 23 53'PA2 =上一頁　'
