     A*%%TS  SD  20020726  150043  PPSPGMREL   REL-V4R4M0  5769-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : PYI411D                                    *
     A*    PROGRAM NAME :生產獎金資料查詢                          *
     A*    AUTHOR       : A1326 SANTOS                               *
     A*    CREATE DATE  : 91/07/26                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人事薪資                                  *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R SFLSR                     SFL
     A*%%TS  SD  20020726  150043  PPSPGMREL   REL-V4R4M0  5769-PW1
     A            RRN            3Y 0H
     A            DOPT           1A  B  8  2DSPATR(CS)
     A                                      DSPATR(PC)
     A                                      DSPATR(HI)
     A            DPP03          6  0O  8  6EDTWRD('    /  ')
     A            PP04           7A  O  8 17
     A            DPP04N        10A  O  8 23
     A            PP06      R        O  8 35
     A            DPP09          7Y 0O  8 39EDTCDE(2)
     A            DPP10          7Y 0O  8 50EDTCDE(2)
     A            HPP07          3Y 0H
     A            HPP08          3Y 0H
     A*----------------------------------------------------------------
     A          R SFLCR                     SFLCTL(SFLSR)
     A*%%TS  SD  20020726  150043  PPSPGMREL   REL-V4R4M0  5769-PW1
     A                                      SFLSIZ(0140)
     A                                      SFLPAG(0013)
     A                                      CSRLOC(#LIN       #COL)
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF12(12)
     A                                      ROLLUP(25)
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND(*MORE)
     A            DRRN           3S 0H      SFLRCDNBR
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<PYI411D>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 32'生產獎金資料查詢'
     A                                      DSPATR(RI)
     A                                  4  1'公司編號:'
     A            DPP01     R        O  4 13REFFLD(PY01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            DPP01N        14A  O  4 16
     A                                  6  2'S'
     A                                      DSPATR(UL)
     A                                  6  5'發放年月'
     A                                      DSPATR(UL)
     A                                  6 16'部門代碼名稱 '
     A                                      DSPATR(UL)
     A                                  6 32'註記'
     A                                      DSPATR(UL)
     A                                  6 39'應計金額'
     A                                      DSPATR(UL)
     A                                  6 50'實際金額'
     A                                      DSPATR(UL)
     A            PP03DX         5  0B  7  7
     A                                      DSPATR(CS)
     A                                      DSPATR(HI)
     A                                      EDTWRD('   /  ')
     A*----------------------------------------------------------------
     A          R DSPC1
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03=回主畫面'
     A                                 23 19'PF12=回前畫面'
     A                                 23 36'PA1=下一頁'
     A                                 23 50'PA2=上一頁'
     A                                 24 67'【泛太資訊】'
