     A****************************************************************
     A*   獂び戈癟м秨祇Τそ⌒舦┮Τ    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : PYI531D                                    *
     A*    PROGRAM NAME :σ罿单だ计砞﹚琩高                 *
     A*    AUTHOR       : TOM T.                                      *
     A*    CREATE DATE  : 00/09/13                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                              *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      PRINT
     A          R SFLSR                     SFL
     A            RRN            3Y 0H
     A            DOPT           1A  B  8  2DSPATR(CS)
     A                                      DSPATR(PC)
     A                                      DSPATR(HI)
     A            RR02      R        O  8  6
     A            RR02N          6O  O  8  8
     A            RR03      R        O  8 21
     A            RR06      R        O  8 31EDTCDE(1)
     A            RR07      R        O  8 42EDTCDE(1)
     A            RR04      R        O  8 53EDTCDE(1)
     A                                  8 60'%'
     A            RR05      R        O  8 63EDTCDE(J)
     A*----------------------------------------------------------------
     A*                                     CSRLOC(#LIN #COL)
     A          R SFLCR                     SFLCTL(SFLSR)
     A                                      SFLSIZ(0065)
     A                                      SFLPAG(0013)
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF12(12)
     A                                      ROLLUP(25)
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND(*MORE)
     A            DRRN           3S 0H      SFLRCDNBR
     A                                  1  2'<PYI531>'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A                                  1 64'ら戳:'
     A            DDATE          6Y 0O  1 72EDTWRD('0  /  /  ')
     A                                  2 28'σ罿单だ计砞﹚琩高'
     A                                      DSPATR(RI)
     A            $USERN        10A  O  2  2
     A                                  4  1'そ絪腹:'
     A            DRR01     R        O  4 13REFFLD(RR01)
     A            CM02      R        O  4 16REFFLD(CM02)
     A                                  5  1'-----------------------------------
     A                                      ------------------------------------
     A                                      --------'
     A                                  6  2'S'
     A                                      DSPATR(UL)
     A                                  6  5'σ罿兜ヘ'
     A                                      DSPATR(UL)
     A                                  6 17'σ罿单'
     A                                      DSPATR(UL)
     A                                  6 28'だ计'
     A                                      DSPATR(UL)
     A                                  6 39'だ计'
     A                                      DSPATR(UL)
     A                                  6 50'σ罿ゑ瞯'
     A                                      DSPATR(UL)
     A                                  6 64'肂'
     A                                      DSPATR(UL)
     A            DRR02     R        B  7  6REFFLD(RR02)
     A                                      DSPATR(CS)
     A                                      DSPATR(PC)
     A                                      DSPATR(HI)
     A*----------------------------------------------------------------
     A          R DSPC1
     A            ERRID          7   H
     A            ERRF          10   H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  3'磅︽'
     A                                 23 11'F3 =礶'
     A                                 23 29'F12=玡礶'
     A                                 24 67'獂び戈癟'
