     A*%%TS  SD  19970218  112537  ESPGMR      REL-V3R1M0  5763-PW1
     A****************************************************************
     A*                                                              *
     A*    PROGRAM-ID   : PYI506D                                    *
     A*    PROGRAM NAME :班別基本資料查詢                          *
     A*    AUTHOR       : A1184                                      *
     A*    CREATE DATE  : 94/10/04                                   *
     A*    UPDATE DATE  : 88/09/27 A1274 EVA                         *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R SFLSR                     SFL
     A*%%TS  SD  19970218  112537  ESPGMR      REL-V3R1M0  5763-PW1
     A            RRN            3Y 0H
     A            DOPT           1A  B  7  2DSPATR(CS)
     A                                      DSPATR(PC)
     A                                      DSPATR(HI)
     A            T101      R        O  7  5
     A            T118      R        O  7 10
     A                                  7 13':'
     A            T119      R        O  7 15
     A            T120      R        O  7 20
     A                                  7 23':'
     A            T121      R        O  7 25
     A            T122      R        O  7 30
     A                                  7 33':'
     A            T123      R        O  7 35
     A            T124      R        O  7 40
     A                                  7 43':'
     A            T125      R        O  7 45
     A            T114      R        O  7 50
     A                                  7 53':'
     A            T115      R        O  7 55
     A                                  7 60'$'
     A            T116      R        O  7 62EDTCDE(1)
     A            T117      R        O  7 73
     A                                  7 76'天'
     A*----------------------------------------------------------------
     A          R SFLCR                     SFLCTL(SFLSR)
     A*%%TS  SD  19970218  112537  ESPGMR      REL-V3R1M0  5763-PW1
     A                                      SFLSIZ(0150)
     A                                      SFLPAG(0015)
     A                                      CSRLOC(#LIN       #COL)
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF12(12)
     A                                      ROLLUP(25)
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A* 96                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN           3S 0H      SFLRCDNBR
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<PYI506>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('  /  /  ')
     A                                  2 32'班別基本資料查詢'
     A                                      DSPATR(RI)
     A            $USERN        10A  O  2  2
     A                                  4  2' 刷卡  　　第一次'
     A                                  4 35'第二次'
     A                                  5  2'S代號  上班    下班    上+
     A                                      班    下班應上班時數 輪班津+
     A                                      貼　抵休天數 '
     A                                      DSPATR(UL)
     A            DT101T         2A  B  6  5DSPATR(CS)
     A                                      DSPATR(HI)
     A*----------------------------------------------------------------
     A          R DSPC1
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03=回主畫面'
     A                                 23 18'PF12=回前畫面'
     A                                 23 34'PA1/PA2 =翻上／下頁'
     A                                 24 67'【泛太資訊】'
