     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R SFLSR                     SFL
     A            RRN            3Y 0H
     A            DOPT           1A  B  8  2DSPATR(CS)
     A                                      DSPATR(PC)
     A                                      DSPATR(HI)
     A            BC02      R        O  8  7
     A            EM03      R        O  8 17
     A            BC03      R        O  8 34
     A            BC03N          6A  O  8 36
     A            BC045          6Y 0O  8 46EDTWRD('  /  /  ')
     A            BC06      R        O  8 57
     A*----------------------------------------------------------------
     A**                                    CSRLOC(#LIN #COL)
     A          R SFLCR                     SFLCTL(SFLSR)
     A                                      SFLSIZ(0140)
     A                                      SFLPAG(0014)
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF12(12)
     A                                      ROLLUP(25)
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A* 96                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN           3S 0H      SFLRCDNBR
     A                                  1  2'<PYI710D>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 31'銀行不轉存資料查詢'
     A                                      DSPATR(RI)
     A                                  4  1'公司編號:'
     A            DBC01     R        O  4 13REFFLD(E101)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            DBC01N        14O  O  4 16
     A                                  6  2'S'
     A                                      DSPATR(UL)
     A                                  6 17'  員工姓名  '
     A                                      DSPATR(UL)
     A                                  6 33'所得類別'
     A                                      DSPATR(UL)
     A                                  6 45'存入日期'
     A                                      DSPATR(UL)
     A                                  6 57'支票號碼'
     A                                      DSPATR(UL)
     A            DBC02     R        B  7  7REFFLD(BC02)
     A                                      DSPATR(CS)
     A                                      DSPATR(HI)
     A            DBC03     R        B  7 34REFFLD(BC03)
     A                                      DSPATR(CS)
     A                                      DSPATR(HI)
     A            DBC045         6Y 0B  7 46EDTWRD('  /  /  ')
     A                                      DSPATR(CS)
     A                                      DSPATR(HI)
     A                                  6  5'員工編號'
     A                                      DSPATR(UL)
     A*----------------------------------------------------------------
     A          R DSPC1
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF3 =回主畫面'
     A                                 23 19'PF12=回前畫面'
     A                                 24 67'【泛太資訊】'
     A                                 23 36'PA1 =下一頁　'
     A                                 23 53'PA2 =上一頁　'
