     A*%%TS  SD  19950524  202349  PYPGMR      REL-V2R3M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R SFLSR                     SFL
     A*%%TS  SD  19950524  202228  PYPGMR      REL-V2R3M0  5738-PW1
     A            RRN            3Y 0H
     A            DOPT           1A  B  6  2DSPATR(CS)
     A                                      DSPATR(PC)
     A                                      DSPATR(HI)
     A            BT01      R        O  6  7
     A            BT03      R        O  6 13
     A            BT03N          6A  O  6 15
     A            BT045          8Y 0O  6 26EDTWRD('    /  /  ')
     A            BT061     R        O  6 37
     A            BN04      R        O  6 41
     A            BT02      R        O  6 57
     A            EM03      R        O  6 63
     A*----------------------------------------------------------------
     A**                                    CSRLOC(#LIN #COL)
     A          R SFLCR                     SFLCTL(SFLSR)
     A*%%TS  SD  19950524  202349  PYPGMR      REL-V2R3M0  5738-PW1
     A                                      SFLSIZ(0030)
     A                                      SFLPAG(0015)
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF12(12)
     A                                      ROLLUP(25)
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A* 96                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN           3S 0H      SFLRCDNBR
     A                                  1  2'<PYI706D>'
     A                                  1 26'＜＜銀行轉存資料查詢＞＞'
     A                                      DSPATR(RI)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('  /  /  ')
     A                                  2  2'<PYI706.1>'
     A                                  3  2'S (=作業) : /-挑選'
     A                                  4  2'S'
     A                                  4  5'公司'
     A                                      DSPATR(UL)
     A                                  4 13'所得類別'
     A                                      DSPATR(UL)
     A                                  4 25'存入日期'
     A                                      DSPATR(UL)
     A                                  4 37'   轉存銀行     '
     A                                      DSPATR(UL)
     A                                  4 57'         員工     '
     A                                      DSPATR(UL)
     A            DBT01     R        B  5  7REFFLD(BT01)
     A                                      DSPATR(CS)
     A                                      DSPATR(HI)
     A            DBT03     R        B  5 13REFFLD(BT03)
     A                                      DSPATR(CS)
     A                                      DSPATR(HI)
     A            DBT045         8Y 0B  5 26EDTWRD('    /  /  ')
     A                                      DSPATR(CS)
     A                                      DSPATR(HI)
     A            DBT061    R        B  5 37REFFLD(BT061)
     A                                      DSPATR(CS)
     A                                      DSPATR(HI)
     A            DBT02     R        B  5 57REFFLD(BT02)
     A                                      DSPATR(CS)
     A                                      DSPATR(HI)
     A*----------------------------------------------------------------
     A          R DSPC1
     A*%%TS  SD  19950216  184313  CHARLES     REL-V2R2M0  5738-PW1
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF3 =回主畫面'
     A                                 23 19'PF12=回前畫面'
     A                                 24 67'【泛太資訊】'
     A                                 23 36'PA1 =下一頁　'
     A                                 23 53'PA2 =上一頁　'
