     A*--------------------------------------------------------------*
     A*            泛太資訊科技開發股份有限公司－版權所有          *
     A*--------------------------------------------------------------*
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(22)
     A                                      PRINT
     A                                      CA03(03 'EOJ')
     A*--------------------------------------------------------------**
     A          R DSPC1
     A                                      OVERLAY
     A                                  1  2'<PYM999D>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            DDATE          6Y 0O  1 70EDTWRD('0  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 32'人事薪資管理系統'
     A                                      DSPATR(RI)
     A                                  5 32'01. 人事資料作業'
     A                                  7 32'02. 考勤資料作業'
     A                                  9 32'03. 薪資資料作業'
     A                                 11 32'04. 年度結算作業'
     A                                 13 32'05. 員工保險作業'
     A                                 15 32'06. 其它薪資作業'
     A                                 17 32'07. 福委會作業'
     A*
     A                                 21 27'請輸入選擇項目:'
     A                                      DSPATR(HI)
     A            DOPID          2A  B 21 45DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      DSPATR(MDT)
     A                                      VALUES('01' '02' '03' '04' '05' '06-
     A                                      ' '07')
     A  97        ERR1          70A  O 22  6MSGID(UPY 0011 CEMF)
     A                                      DSPATR(HI)
     A  98        ERR2          70A  O 22  3MSGID(UPT 2024 PTMF)
     A                                      DSPATR(HI)
     A  31                             24  2'系統將到期，請辦理續約'
     A                                      DSPATR(RI)
     A  32                             24  2'系統已到期，請辦理續約'
     A                                      DSPATR(RI)
     A                                 24 67'【泛太資訊】'
