     A*****************************************************************
     A*  PYPBPF  公司獎金資料檔
     A*****************************************************************
     A          R PB0
     A                                      PFILE(PYPBPF)
     A          K PB01
     A          K PB03
     A          K PB04
     A          K PB05
     A          K PB05D
     A          K PB02
