     A****************************************************************
     A*    PRTF NAME    : PYR108P                                    *
     A*    PROGRAM NAME : PYR108                                     *
     A*    AUTHOR       : A1084  DERLERN                             *
     A*    CREATE DATE  : 79/06/19                                   *
     A*    UPDATE DATE  : 89/08/25 A1274 EVA                         *
     A*    SYSTEM       : MIRS                                       *
     A*    REMARK       :留職停薪人員資料列印
     A****************************************************************
     A                                      REF(PYRF)
     A          R PH1                       SKIPB(2)
     A            CM03      R              1
     A                                    64'日期:'
     A            DDATE          6  0     72EDTWRD('0  /  /  ')
     A                                    81'頁次:'
     A                                    89PAGNBR
     A                                      SPACEA(1)
     A                                     1'留職停薪人員明細表'
     A                                    64'時間:'
     A                                    72TIME
     A                                      EDTWRD('  :  :  ')
     A                                    82'<PYR108P>'
     A                                      SPACEA(2)
     A                                     1'留職日期:'
     A            DEM171    R   -2        13REFFLD(EM17)
     A                                      EDTWRD('0  /  /  ')
     A                                    22'-'
     A            DEM172    R   -2        24REFFLD(EM17)
     A                                      EDTWRD('0  /  /  ')
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                     1'部門名稱'
     A                                    24'員工姓名'
     A                                    45'性別'
     A                                    51'留職停薪日'
     A                                    63'留職天數'
     A                                    73'復職日期'
     A                                    83'留職'
     A******                              88'長病'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============='
     A                                      SPACEA(1)
     A          R PD1                       SPACEA(1)
     A            EM041     R              1
     A            EM042     R              2
     A            EM043     R              3
     A            EM044     R              4
     A            DP02      R              8REFFLD(DP02 PYDPPF)
     A            EM02      R             +1
     A            EM03      R             33
     A            EM32      R             49
     A            PTX06     R   -2        53REFFLD(TX06)
     A                                      EDTWRD('0  /  /  ')
     A            TX11      R             65
     A                                      EDTCDE(1)
     A            PTX04     R   -2        74REFFLD(TX04)
     A                                      EDTWRD('0  /  /  ')
     A            PD11           1        86
     A******      PD12           1        90
     A*
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                     1'PYR108P--->報表結束'
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
