     A****************************************************************
     A*    PRTF NAME    : PYR102P                                    *
     A*    PROGRAM NAME : PYR102                                     *
     A*    AUTHOR       : A1084  DERLERN                             *
     A*    CREATE DATE  : 79/06/18                                   *
     A*    UPDATE DATE  : 90/07/13 KLAUS                             *
     A*    SYSTEM       : MIRS                                       *
     A*    REMARK       :調動人員資料列印                          *
     A****************************************************************
     A                                      REF(PYRF)
     A          R PH1                       SKIPB(2)
     A            CM03      R              1
     A                                      SPACEA(1)
     A                                     1'人事調動明細表－依部門別'
     A                                      SPACEA(2)
     A                                     1'調動別:'
     A            TR03N         14O       11
     A                                   168'日期:'
     A            DDATE          6  0    176EDTWRD('0  /  /  ')
     A                                   185'頁次:'
     A                                   193PAGNBR
     A                                      SPACEA(1)
     A                                     1'日　期:'
     A            DTR041    R   -2        11REFFLD(TR04)
     A                                      EDTWRD('0  /  /  ')
     A                                    20'-'
     A            DTR042    R   -2        22REFFLD(TR04)
     A                                      EDTWRD('0  /  /  ')
     A                                   168'時間:'
     A                                   176TIME
     A                                      EDTWRD('  :  :  ')
     A                                   186'<PYR102P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                    65'調動前'
     A                                   105'調動後'
     A                                      SPACEA(1)
     A                                    49'-------------------------+
     A                                       --------------'
     A                                    90'-------------------------+
     A                                       -------------------------+
     A                                       -------------------------+
     A                                       -------------------------+
     A                                       ---------'
     A                                      SPACEA(1)
     A                                     1'部門名稱'
     A                                    17'員工姓名'
     A                                    39'日期'
     A                                    49'部門'
     A                                    65'職稱'
     A                                    77'職等'
     A                                    83'職級'
     A                                    90'部門'
     A                                   106'職稱'
     A                                   117'職等'
     A                                   123'職級'
     A                                   131'工作說明'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A          R PD1                       SPACEA(1)
     A  31        PDP021    R              1REFFLD(DP02 PYDPPF)
     A  32        TR02      R             17
     A  32        EM03      R             25
     A            PTR04     R   -2        40REFFLD(TR04)
     A                                      EDTWRD('0  /  /  ')
     A            PDP022    R             49REFFLD(DP02 PYDPPF)
     A            PJT022    R             65REFFLD(JT02)
     A            TR09      R             79
     A            TR15      R             85
     A            PDP023    R             90REFFLD(DP02 PYDPPF)
     A            PJT023    R            106REFFLD(JT02)
     A            TR10      R            120
     A            TR16      R            126
     A            TR17      R            131
     A          R PD2                       SPACEA(1)
     A            TR18      R            131
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     1'PYR102P--->報表結束'
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
