     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : PYR113P                                    *
     A*    PROGRAM NAME :學歷分析表                                *
     A*    AUTHOR       : A1226 PETER                                *
     A*    CREATE DATE  : 97/08/11                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人事薪資系統                              *
     A****************************************************************
     A                                      REF(PYRF)
     A          R PH1                       SKIPB(2)
     A            CM03      R              1
     A                                      SPACEA(1)
     A                                     1'學歷分析表'
     A                                      SPACEA(2)
     A                                    49'日期:'
     A            DDATE          6  0     57EDTWRD('0  /  /  ')
     A                                    66'頁次:'
     A                                    74PAGNBR
     A                                      SPACEA(1)
     A                                    49'時間:'
     A                                    57TIME
     A                                      EDTWRD('  :  :  ')
     A                                    67'<PYR114P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'部門名稱'
     A                                    20'博士'
     A                                    26'碩士'
     A                                    32'大學'
     A                                    38'專科'
     A                                    44'高中'
     A                                    50'高職'
     A                                    56'國中'
     A                                    62'國小'
     A                                    68'男性'
     A                                    74'女性'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A*
     A          R PD1                       SPACEB(1)
     A            DP02      R              2REFFLD(DP02 PYDPPF)
     A            PD11           3  0     22EDTCDE(3)
     A            PD12           3  0     28EDTCDE(3)
     A            PD13           3  0     34EDTCDE(3)
     A            PD14           3  0     40EDTCDE(3)
     A            PD15           3  0     46EDTCDE(3)
     A            PD16           3  0     52EDTCDE(3)
     A            PD17           3  0     58EDTCDE(3)
     A            PD18           3  0     64EDTCDE(3)
     A            PD19           3  0     70EDTCDE(3)
     A            PD1A           3  0     76EDTCDE(3)
     A*
     A          R PT1                       SPACEB(1)
     A                                     2'合　　計:'
     A            PT11           3  0     22EDTCDE(3)
     A            PT12           3  0     28EDTCDE(3)
     A            PT13           3  0     34EDTCDE(3)
     A            PT14           3  0     40EDTCDE(3)
     A            PT15           3  0     46EDTCDE(3)
     A            PT16           3  0     52EDTCDE(3)
     A            PT17           3  0     58EDTCDE(3)
     A            PT18           3  0     64EDTCDE(3)
     A            PT19           3  0     70EDTCDE(3)
     A            PT1A           3  0     76EDTCDE(3)
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'PYR114P--->報表結束'
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
