     A****************************************************************
     A*    PRTF NAME    : PYR110P                                    *
     A*    PROGRAM NAME : PYR110                                     *
     A*    AUTHOR       : A1084  DERLERN                             *
     A*    CREATE DATE  : 79/06/20                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : MIRS                                       *
     A*    REMARK       :人力資源分析資料列印                      *
     A****************************************************************
     A                                      REF(PYRF)
     A          R PH1                       SKIPB(2)
     A            CM03      R              1
     A                                      SPACEA(2)
     A                                     1'人力資源分析表          '
     A                                    64'日期:'
     A            DDATE          6  0     72EDTWRD('0  /  /  ')
     A                                    81'頁次:'
     A                                    89PAGNBR
     A                                      SPACEA(1)
     A                                     1'部門編號:'
     A            DEM041         7        13
     A                                    +1'-'
     A            DEM042         7        +1
     A                                    64'時間:'
     A                                    72TIME
     A                                      EDTWRD('  :  :  ')
     A                                    82'<PYR110P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================'
     A                                      SPACEA(1)
     A                                    22'常日班'
     A                                    36'輪　班'
     A                                    47'契約及臨時'
     A                                    64'外國籍'
     A                                    79'小　　計'
     A                                      SPACEA(1)
     A                                    20'-----------'
     A                                    34'-----------'
     A                                    47'-----------'
     A                                    62'-----------'
     A                                    76'-------------------'
     A                                      SPACEA(1)
     A                                     1'部門名稱'
     A                                    21'男'
     A                                    27'女'
     A                                    35'男'
     A                                    41'女'
     A                                    49'男'
     A                                    55'女'
     A                                    63'男'
     A                                    69'女'
     A                                    77'男'
     A                                    84'女'
     A                                    91'計'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================'
     A*
     A          R PD1                       SPACEB(1)
     A            DP02      R              1REFFLD(DP02 PYDPPF)
     A            PD14           4  0     20EDTCDE(1)
     A            PD15           4  0     26EDTCDE(1)
     A            PD16           4  0     34EDTCDE(1)
     A            PD17           4  0     40EDTCDE(1)
     A            PD18           4  0     48EDTCDE(1)
     A            PD19           4  0     54EDTCDE(1)
     A            PD110          4  0     62EDTCDE(1)
     A            PD111          4  0     68EDTCDE(1)
     A            PD112          4  0     77EDTCDE(1)
     A            PD113          4  0     83EDTCDE(1)
     A            PD114          4  0     91EDTCDE(1)
     A*
     A          R PT1                       SPACEB(2)
     A                                    12'小計'
     A            PT14           4  0     20EDTCDE(1)
     A            PT15           4  0     26EDTCDE(1)
     A            PT16           4  0     34EDTCDE(1)
     A            PT17           4  0     40EDTCDE(1)
     A            PT18           4  0     48EDTCDE(1)
     A            PT19           4  0     54EDTCDE(1)
     A            PT110          4  0     62EDTCDE(1)
     A            PT111          4  0     68EDTCDE(1)
     A            PT112          4  0     77EDTCDE(1)
     A            PT113          4  0     83EDTCDE(1)
     A            PT114          4  0     91EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A          R PT2
     A                                    12'中計'
     A            PT24           4  0     20EDTCDE(1)
     A            PT25           4  0     26EDTCDE(1)
     A            PT26           4  0     34EDTCDE(1)
     A            PT27           4  0     40EDTCDE(1)
     A            PT28           4  0     48EDTCDE(1)
     A            PT29           4  0     54EDTCDE(1)
     A            PT210          4  0     62EDTCDE(1)
     A            PT211          4  0     68EDTCDE(1)
     A            PT212          4  0     77EDTCDE(1)
     A            PT213          4  0     83EDTCDE(1)
     A            PT214          4  0     91EDTCDE(1)
     A                                      SPACEA(1)
     A                                    12' ％'
     A            PT2C           4  1     77EDTWRD(' 0 . ')
     A            PT2D           4  1     83EDTWRD(' 0 . ')
     A                                      SPACEA(1)
     A*
     A          R PT3
     A                                    12'合計'
     A            PT34           4  0     20EDTCDE(1)
     A            PT35           4  0     26EDTCDE(1)
     A            PT36           4  0     34EDTCDE(1)
     A            PT37           4  0     40EDTCDE(1)
     A            PT38           4  0     48EDTCDE(1)
     A            PT39           4  0     54EDTCDE(1)
     A            PT310          4  0     62EDTCDE(1)
     A            PT311          4  0     68EDTCDE(1)
     A            PT312          4  0     77EDTCDE(1)
     A            PT313          4  0     83EDTCDE(1)
     A            PT314          4  0     91EDTCDE(1)
     A                                      SPACEA(1)
     A                                    12' ％'
     A            PT3C           4  1     77EDTWRD(' 0 . ')
     A            PT3D           4  1     83EDTWRD(' 0 . ')
     A                                      SPACEA(1)
     A*
     A          R PT4                       SPACEB(2)
     A                                    12'總計'
     A            PT44           4  0     20EDTCDE(1)
     A            PT45           4  0     26EDTCDE(1)
     A            PT46           4  0     34EDTCDE(1)
     A            PT47           4  0     40EDTCDE(1)
     A            PT48           4  0     48EDTCDE(1)
     A            PT49           4  0     54EDTCDE(1)
     A            PT410          4  0     62EDTCDE(1)
     A            PT411          4  0     68EDTCDE(1)
     A            PT412          4  0     77EDTCDE(1)
     A            PT413          4  0     83EDTCDE(1)
     A            PT414          4  0     91EDTCDE(1)
     A                                      SPACEA(1)
     A                                    12' ％'
     A            PT4C           4  1     77EDTWRD(' 0 . ')
     A            PT4D           4  1     83EDTWRD(' 0 . ')
     A                                      SPACEA(1)
     A*
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================'
     A                                      SPACEA(1)
     A                                     1'PYR110P--->報表結束'
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
