     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : PYR115P                                    *
     A*    PROGRAM NAME :人員分類分析表                            *
     A*    AUTHOR       : A1226 PETER                                *
     A*    CREATE DATE  : 97/08/11                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人事薪資系統                              *
     A****************************************************************
     A                                      REF(PYRF)
     A          R PH1                       SKIPB(2)
     A            CM03      R              1
     A                                      SPACEA(1)
     A                                     1'人員分類分析表'
     A                                      SPACEA(2)
     A                                    43'日期:'
     A            DDATE          6  0     51EDTWRD('0  /  /  ')
     A                                    60'頁次:'
     A                                    68PAGNBR
     A                                      SPACEA(1)
     A                                    43'時間:'
     A                                    51TIME
     A                                      EDTWRD('  :  :  ')
     A                                    61'<PYR115P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                     2'部門名稱'
     A                                    20'業務'
     A                                    26'廠務'
     A                                    32'管理'
     A                                    38'現場'
     A                                    44'研究'
     A                                    50'技術'
     A                                    56'其它'
     A                                    62'直接'
     A                                    68'間接'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==============='
     A*
     A          R PD1                       SPACEB(1)
     A            DP02      R              2REFFLD(DP02 PYDPPF)
     A            PD11           3  0     22EDTCDE(3)
     A            PD12           3  0     28EDTCDE(3)
     A            PD13           3  0     34EDTCDE(3)
     A            PD14           3  0     40EDTCDE(3)
     A            PD15           3  0     46EDTCDE(3)
     A            PD16           3  0     52EDTCDE(3)
     A            PD17           3  0     58EDTCDE(3)
     A            PD18           3  0     64EDTCDE(3)
     A            PD19           3  0     70EDTCDE(3)
     A*
     A          R PT1                       SPACEB(1)
     A                                     2'合計:'
     A            TOTAL          4  0     10EDTCDE(3)
     A                                    16'人'
     A            PT11           3  0     22EDTCDE(3)
     A            PT12           3  0     28EDTCDE(3)
     A            PT13           3  0     34EDTCDE(3)
     A            PT14           3  0     40EDTCDE(3)
     A            PT15           3  0     46EDTCDE(3)
     A            PT16           3  0     52EDTCDE(3)
     A            PT17           3  0     58EDTCDE(3)
     A            PT18           3  0     64EDTCDE(3)
     A            PT19           3  0     70EDTCDE(3)
     A                                      SPACEA(1)
     A                                     2' ％:'
     A            PT21           4  1     22EDTWRD(' 0 . ')
     A            PT22           4  1     28EDTWRD(' 0 . ')
     A            PT23           4  1     34EDTWRD(' 0 . ')
     A            PT24           4  1     40EDTWRD(' 0 . ')
     A            PT25           4  1     46EDTWRD(' 0 . ')
     A            PT26           4  1     52EDTWRD(' 0 . ')
     A            PT27           4  1     58EDTWRD(' 0 . ')
     A            PT28           4  1     64EDTWRD(' 0 . ')
     A            PT29           4  1     70EDTWRD(' 0 . ')
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                     1'PYR115P--->報表結束'
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
