     A****************************************************************
     A*   獂び戈癟м秨祇Τそ⌒舦┮Τ    TEL:27313250   *
     A*                                                              *
     A*    PROGRAM-ID   : PYR208P                                    *
     A*    PROGRAM NAME :σ对癘魁参璸                    *
     A*    AUTHOR       : A1226 PETER                                *
     A*    CREATE DATE  : 1997/01/15                                 *
     A*    UPDATE DATE  : 1999/10/12 A1274 EVA                       *
     A*    SYSTEM       :ㄆ羱戈                                  *
     A****************************************************************
     A                                      REF(PYRF)
     A          R PH1                       SKIPB(2)
     A            CM03      R              1
     A                                      SPACEA(1)
     A                                     1'σ对癘魁参璸'
     A                                      SPACEA(2)
     A                                     1'σ对る:'
     A            DYM            4  0     13EDTWRD('0  /  ')
     A                                    50'ら戳:'
     A            DDATE          6  0     58EDTWRD('0  /  /  ')
     A                                    67'Ω:'
     A                                    75PAGNBR
     A                                      SPACEA(1)
     A                                     1'场腹:'
     A            DEM041         7        +1
     A                                    +1'-'
     A            DEM042         7        +1
     A                                    50'丁:'
     A                                    58TIME
     A                                      EDTWRD('  :  :  ')
     A                                    68'<PYR208P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'场嘿'
     A                                    27'﹎'
     A                                    45'筐'
     A                                    52'ㄆ安'
     A                                    59'ㄆ安'
     A                                    66'痜安'
     A                                    73'痜安'
     A                                      SPACEA(1)
     A                                    45'Ω计'
     A                                    52'Ω计'
     A                                    59'计'
     A                                    66'Ω计'
     A                                    73'计'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A*
     A          R PD1                       SPACEB(1)
     A  31        EM041     R              1
     A  31        EM042     R              2
     A  31        EM043     R              3
     A  31        EM044     R              4
     A  31        DP02      R              8REFFLD(DP02 PYDPPF)
     A            EM02      R             25
     A            EM03      R             33
     A            PD11           2  0     49EDTCDE(3)
     A            PD12           2  0     54EDTCDE(3)
     A            PD13           5  2     59EDTCDE(3)
     A            PD14           2  0     68EDTCDE(3)
     A            PD15           5  2     73EDTCDE(3)
     A*
     A          R PT1                       SPACEB(2)
     A                                    33'场璸:'
     A            PT11           2  0     49EDTCDE(3)
     A            PT12           2  0     54EDTCDE(3)
     A            PT13           5  2     59EDTCDE(3)
     A            PT14           2  0     68EDTCDE(3)
     A            PT15           5  2     73EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A          R PT2                       SPACEB(2)
     A                                    33'场羆璸:'
     A            PT21           2  0     49EDTCDE(3)
     A            PT22           2  0     54EDTCDE(3)
     A            PT23           5  2     59EDTCDE(3)
     A            PT24           2  0     68EDTCDE(3)
     A            PT25           5  2     73EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A          R PT3
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'PYR208P--->厨挡'
     A          R PE9                       SPACEB(1)
     A                                    16'礚才絛瞅ぇ戈'
