     A****************************************************************
     A*   獂び戈癟м秨祇Τそ⌒舦┮Τ    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : PYR206P                                    *
     A*    PROGRAM NAME :计参璸                    *
     A*    AUTHOR       : A1226 PETER                                *
     A*    CREATE DATE  : 1997/01/15                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :ㄆ羱戈                                  *
     A****************************************************************
     A                                      REF(PYRF)
     A          R PH1                       SKIPB(2)
     A            CM03      R              1
     A                                      SPACEA(1)
     A                                     1'计参璸'
     A                                      SPACEA(2)
     A                                     1'る:'
     A            DT203     R   -2        13REFFLD(T203)
     A                                      EDTWRD('0  /  ')
     A                                    50'ら戳:'
     A            DDATE          6  0     58EDTWRD('0  /  /  ')
     A                                    67'Ω:'
     A                                    75PAGNBR
     A                                      SPACEA(1)
     A                                     1'场腹:'
     A            DEM041         7        +1
     A                                    +1'-'
     A            DEM042         7        +1
     A                                    50'丁:'
     A                                    58TIME
     A                                      EDTWRD('  :  :  ')
     A                                    67'<PYR206P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'场嘿'
     A                                    26'﹎'
     A                                    47'戈'
     A                                    54'セる计'
     A                                    64'仓璸计'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A*
     A          R PD1                       SPACEB(1)
     A  31        EM041     R              1
     A  31        EM042     R              2
     A  31        EM043     R              3
     A  31        EM044     R              4
     A  31        DP02      R              8REFFLD(DP02 PYDPPF)
     A            EM02      R             25
     A            EM03      R             34
     A            PD11           3  1     49EDTCDE(3)
     A            PD12           5  1     57EDTCDE(3)
     A            PD13           5  1     67EDTCDE(3)
     A*
     A          R PT1                       SPACEB(2)
     A                                    33'场璸:'
     A            PT12           5  1     57EDTCDE(3)
     A            PT13           5  1     67EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A          R PT2                       SPACEB(2)
     A                                    33'场羆璸:'
     A            PT22           5  1     57EDTCDE(3)
     A            PT23           5  1     67EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A          R PT3
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'PYR206P--->厨挡'
     A          R PE9                       SPACEB(1)
     A                                    16'礚才絛瞅ぇ戈'
