     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*                                                              *
     A*    PROGRAM-ID   : PYR205P                                    *
     A*    PROGRAM NAME :個人加班請假記錄表列印                    *
     A*    AUTHOR       : A1226 PETER                                *
     A*    CREATE DATE  : 1997/01/15                                 *
     A*    UPDATE DATE  : 2001/04/09 A1274 EVA                       *
     A*    SYSTEM       :人事薪資                                  *
     A****************************************************************
     A                                      REF(PYRF)
     A*------------------------------------------------------------***
     A          R PH1                       SKIPB(2)
     A            CM03      R              1
     A                                      SPACEA(1)
     A*
     A                                     1'個人加班請假記錄表'
     A                                      SPACEA(1)
     A*
     A                                     1' '
     A                                      SPACEA(1)
     A*
     A                                     1'部門代號:'
     A            DEM041         7        +1
     A                                    +1'-'
     A            DEM042         7        +1
     A                                   162'日期:'
     A            DDATE          6  0    171EDTWRD('0  /  /  ')
     A                                   180'頁次:'
     A                                   188PAGNBR
     A                                      SPACEA(1)
     A*
     A                                     1'日　　期:'
     A            POV031    R   -2        13REFFLD(OV03)
     A                                      EDTWRD('0  /  /  ')
     A                                    22'-'
     A            POV032    R   -2        24REFFLD(OV03)
     A                                      EDTWRD('0  /  /  ')
     A                                    40'考勤年度:'
     A            PYEAR          2  0     52EDTWRD('0  ')
     A                                    65'單位：天.時'
     A                                   162'時間:'
     A                                   171TIME
     A                                      EDTWRD('  :  :  ')
     A                                   180'<PYR205P>'
     A                                      SPACEA(1)
     A*
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ======================'
     A                                      SPACEA(1)
     A*
     A                                     1'部門名稱'
     A                                    21'員工編號　姓名'
     A                                    55'-----加班資料-----'
     A                                    77'-誤餐次數-'
     A                                    92'請假資料'
     A                                   183'遲到'
     A                                   191'應有'
     A                                      SPACEA(1)
     A*
     A                                    21'　　　　　到職日期'
     A                                    55'平日'
     A                                    62'超時'
     A                                    69'假日'
     A                                    77'平日'
     A                                    84'假日'
     A            PHA            6O       92
     A            PHB            6O       99
     A            PHC            6O      106
     A            PHD            6O      113
     A            PHE            6O      120
     A            PHF            6O      127
     A            PHG            6O      134
     A            PHH            6O      141
     A            PHI            6O      148
     A            PHJ            6O      155
     A            PHK            6O      162
     A            PHL            6O      169
     A            PHM            6O      176
     A                                   183'次數'
     A                                   191'年假'
     A                                      SPACEA(1)
     A*
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ======================'
     A*------------------------------------------------------------***
     A          R PD1                       SPACEB(1)
     A*
     A            EM041     R              1
     A            EM042     R              2
     A            EM043     R              3
     A            EM044     R              4
     A            DP02      R              8REFFLD(DP02 PYDPPF)
     A            EM02      R             25
     A            EM03      R             33
     A                                    47'當期：'
     A            PD11           5  1     55EDTCDE(4)
     A            PD12           5  1     62EDTCDE(4)
     A            PD13           5  1     69EDTCDE(4)
     A            PD14           5  1     77EDTCDE(4)
     A            PD15           5  1     84EDTCDE(4)
     A            PD1A           5  1     92EDTCDE(4)
     A            PD1B           5  1     99EDTCDE(4)
     A            PD1C           5  1    106EDTCDE(4)
     A            PD1D           5  1    113EDTCDE(4)
     A            PD1E           5  1    120EDTCDE(4)
     A            PD1F           5  1    127EDTCDE(4)
     A            PD1G           5  1    134EDTCDE(4)
     A            PD1H           5  1    141EDTCDE(4)
     A            PD1I           5  1    148EDTCDE(4)
     A            PD1J           5  1    155EDTCDE(4)
     A            PD1K           5  1    162EDTCDE(4)
     A            PD1L           5  1    169EDTCDE(4)
     A            PD1M           5  1    176EDTCDE(4)
     A            PD1O           5  1    183EDTCDE(4)
     A            PD1N           5  1    191EDTCDE(4)
     A                                      SPACEA(1)
     A*
     A            PEM13          6  0     32EDTWRD('0  /  /  ')
     A                                    47'年度：'
     A***         PD21           5  1     55EDTCDE(4)
     A***         PD22           5  1     62EDTCDE(4)
     A***         PD23           5  1     69EDTCDE(4)
     A***         PD24           5  1     77EDTCDE(4)
     A***         PD25           5  1     84EDTCDE(4)
     A            PD2A           5  1     92EDTCDE(4)
     A            PD2B           5  1     99EDTCDE(4)
     A            PD2C           5  1    106EDTCDE(4)
     A            PD2D           5  1    113EDTCDE(4)
     A            PD2E           5  1    120EDTCDE(4)
     A            PD2F           5  1    127EDTCDE(4)
     A            PD2G           5  1    134EDTCDE(4)
     A            PD2H           5  1    141EDTCDE(4)
     A            PD2I           5  1    148EDTCDE(4)
     A            PD2J           5  1    155EDTCDE(4)
     A            PD2K           5  1    162EDTCDE(4)
     A            PD2L           5  1    169EDTCDE(4)
     A            PD2M           5  1    176EDTCDE(4)
     A            PD2O           5  1    183EDTCDE(4)
     A            PNEW           3A      193
     A                                      SPACEA(1)
     A*
     A                                     1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ----------------------'
     A                                      SPACEA(1)
     A*------------------------------------------------------------***
     A          R PT1
     A*
     A                                    30'部門合計：'
     A            PT01           5  0     46EDTCDE(4)
     A                                    55'人'
     A                                      SPACEA(1)
     A*
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ======================'
     A                                      SPACEA(1)
     A*------------------------------------------------------------***
     A          R PE1
     A*
     A                                     1'PYR205P--->報表結束'
     A                                      SPACEA(1)
     A*------------------------------------------------------------***
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
