     A*****************************************************************
     A*  PYR223WF  对る羆⌒郎
     A*****************************************************************
     A                                      REF(PYRF)
     A          R W223
     A            W2301          2A         COLHDG('そ絪腹')
     A            W2302          5A         COLHDG('场絪腹')
     A*
     A            W2303         16O         COLHDG('场嘿')
     A*
     A            W2304          8A         COLHDG('絪腹')
     A            W2305         14O         COLHDG('﹎')
     A            W2306          4S 0       COLHDG('对る')
     A*
     A            W2308          5S 0       COLHDG('筐Ω计')
     A*
     A            W2309          5S 1       COLHDG('ㄆ安计')
     A            W2310          5S 1       COLHDG('痜安计')
     A*
     A            W2311          5S 1       COLHDG('縩安计')
     A*
     A            W2312          5S 1       COLHDG('痁计')
     A*
     A            W2313          5S 1       COLHDG('计')
     A*
     A            W2314          7S 0       COLHDG('筐(じ)')
     A            W2315          7S 0       COLHDG('ㄆ安(じ)')
     A            W2316          7S 0       COLHDG('痜安(じ)')
     A            W2317          7S 0       COLHDG('ル(じ)')
     A            W2318          7S 0       COLHDG('痁(じ)')
     A            W2319          7S 0       COLHDG('(じ)')
     A            W2320          7S 0       COLHDG('ó皑瑉禟(じ)')
     A            W2321          7S 0       COLHDG('狝叭瑉禟(じ)')
     A            W2322          7S 0       COLHDG('盝禣(じ)')
     A            W2323          7S 0       COLHDG('る秸俱(じ)')
     A            W2324          7S 0       COLHDG('竊贱(じ)')
     A            W2325          7S 0       COLHDG('ㄤ兜(じ)')
