     A****************************************************************
     A*   獂び戈癟м秨祇Τそ⌒舦┮Τ    TEL:27313250   *
     A*                                                              *
     A*    PROGRAM-ID   : PYR222P                                    *
     A*    PROGRAM NAME :对虏                    *
     A*    AUTHOR       : A1274 EVA                                  *
     A*    CREATE DATE  : 1999/07/29                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :ㄆ羱戈                                  *
     A****************************************************************
     A                                      REF(PYR222WF)
     A*------------------------------------------------------------***
     A          R PH1                       SKIPB(2)
     A            CM03      R             25REFFLD(CM03 SYCMPF)
     A                                      SPACEA(1)
     A*
     A            W2206Y         2  0     26EDTCDE(4)
     A                                    28''
     A            W2206M         2  0     33EDTCDE(4)
     A                                    35'る'
     A                                    39'对虏'
     A                                      SPACEA(2)
     A*
     A*                                    1'ㄏノ:'
     A*           $USER         10        13
     A*           $USERN        10        24
     A                                    50'ら戳:'
     A            DDATE          6  0     58
     A                                      EDTWRD('0  /  /  ')
     A                                    68'Ω:'
     A                                    75PAGNBR
     A                                      SPACEA(1)
     A*
     A                                     1'场:'
     A            W2202     R             13
     A            W2203     R             20
     A                                    50'丁:'
     A                                    58TIME
     A                                      EDTWRD('  :  :  ')
     A                                    68'<PYR222P>'
     A                                      SPACEA(1)
     A*
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*
     A                                     1'絪腹'
     A                                    11'﹎'
     A                                    21'筐'
     A                                    31'ㄆ安'
     A                                    41'痜安'
     A                                    51'縩安'
     A                                    61'痁'
     A                                    71'称爹'
     A                                      SPACEA(1)
     A*
     A                                    21'(Ω计)'
     A                                    31'(计)'
     A                                    41'(计)'
     A                                    51'(计)'
     A                                    61'(计)'
     A                                      SPACEA(1)
     A*
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A*
     A*------------------------------------------------------------***
     A          R PD1                       SPACEB(1)
     A            W2204     R              2
     A            W2205     R             11
     A            W2208     R             25EDTCDE(3)
     A            W2209     R             33EDTCDE(3)
     A            W2210     R             43EDTCDE(3)
     A            W2211     R             53EDTCDE(3)
     A            W2212     R             63EDTCDE(3)
     A*
     A*------------------------------------------------------------***
     A          R PT1                       SPACEB(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*
     A                                     2'场璸:'
     A            PTA1           5  0     25EDTCDE(3)
     A            PTA2           5  1     33EDTCDE(3)
     A            PTA3           5  1     43EDTCDE(3)
     A            PTA4           5  1     53EDTCDE(3)
     A            PTA5           5  1     63EDTCDE(3)
     A*
     A*------------------------------------------------------------***
     A          R PT2                       SPACEB(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*
     A                                     2'そ羆璸:'
     A            PTB1           5  0     25EDTCDE(3)
     A            PTB2           5  1     33EDTCDE(3)
     A            PTB3           5  1     43EDTCDE(3)
     A            PTB4           5  1     53EDTCDE(3)
     A            PTB5           5  1     63EDTCDE(3)
     A*
     A*------------------------------------------------------------***
     A          R PT3                       SPACEB(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'PYR222P--->厨挡'
     A*------------------------------------------------------------***
     A          R PE9                       SPACEB(1)
     A                                    16'礚才絛瞅ぇ戈'
