     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*                                                              *
     A*    PROGRAM-ID   : PYR202P                                    *
     A*    PROGRAM NAME :個人加班資料統計表列印                    *
     A*    AUTHOR       : A1226 PETER                                *
     A*    CREATE DATE  : 1997/01/15                                 *
     A*    UPDATE DATE  : 2001/04/16 A1274 EVA                       *
     A*    SYSTEM       :人事薪資                                  *
     A****************************************************************
     A                                      REF(PYRF)
     A*------------------------------------------------------------***
     A          R PH1
     A                                      SKIPB(002)
     A            CM03      R              1
     A*
     A                                     1
     A                                      '個人加班資料統計表      '
     A                                      SPACEB(001)
     A*
     A                                     1'統計年度:'
     A                                      SPACEB(002)
     A            DOV03Y         2  0     13
     A                                      EDTWRD('0  ')
     A                                   121'日期:'
     A            DDATE          6  0    129
     A                                      EDTWRD('0  /  /  ')
     A                                   138
     A                                      '頁次:'
     A                                   146
     A                                      PAGNBR
     A*
     A                                     1'部門代號:'
     A                                      SPACEB(001)
     A            DEM041         7        +1
     A                                    +1
     A                                      '-'
     A            DEM042         7        +1
     A                                    30'資料來源:'
     A            PSEL          20O       42
     A                                   121
     A                                      '時間:'
     A                                   129
     A                                      TIME
     A                                      EDTWRD('  :  :  ')
     A                                   138
     A                                      '<PYR202P>'
     A*
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      =========='
     A                                      SPACEB(001)
     A                                     1
     A                                      '部門名稱'
     A                                      SPACEB(001)
     A                                    21
     A                                      '員工姓名'
     A            PH11           8O       44
     A            PH12           8O       52
     A            PH13           8O       60
     A            PH14           8O       68
     A            PH15           8O       76
     A            PH16           8O       84
     A            PH17           8O       92
     A            PH18           8O      100
     A            PH19           8O      108
     A            PH1A           8O      116
     A            PH1B           8O      124
     A            PH1C           8O      132
     A                                   142
     A                                      '合計'
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      =========='
     A                                      SPACEB(001)
     A*------------------------------------------------------------***
     A          R PD1
     A                                      SPACEB(001)
     A            EM041     R              1
     A            EM042     R              2
     A            EM043     R              3
     A            EM044     R              4
     A            DP02      R              8REFFLD(DP02 PYDPPF)
     A            OV02      R             24
     A            EM03      R             32
     A            PD11           5  1     46
     A                                      EDTCDE(4)
     A            PD12           5  1     53
     A                                      EDTCDE(4)
     A            PD13           5  1     60
     A                                      EDTCDE(4)
     A            PD14           5  1     68
     A                                      EDTCDE(4)
     A            PD15           5  1     76
     A                                      EDTCDE(4)
     A            PD16           5  1     84
     A                                      EDTCDE(4)
     A            PD17           5  1     92
     A                                      EDTCDE(4)
     A            PD18           5  1    100
     A                                      EDTCDE(4)
     A            PD19           5  1    108
     A                                      EDTCDE(4)
     A            PD1A           5  1    116
     A                                      EDTCDE(4)
     A            PD1B           5  1    124
     A                                      EDTCDE(4)
     A            PD1C           5  1    132
     A                                      EDTCDE(4)
     A            PD1D           5  1    142
     A                                      EDTCDE(4)
     A*------------------------------------------------------------***
     A          R PT1
     A                                      SPACEB(002)
     A                                      SPACEA(001)
     A                                    32
     A                                      '單位小計:'
     A            PT11           5  1     46
     A                                      EDTCDE(4)
     A            PT12           5  1     53
     A                                      EDTCDE(4)
     A            PT13           5  1     60
     A                                      EDTCDE(4)
     A            PT14           5  1     68
     A                                      EDTCDE(4)
     A            PT15           5  1     76
     A                                      EDTCDE(4)
     A            PT16           5  1     84
     A                                      EDTCDE(4)
     A            PT17           5  1     92
     A                                      EDTCDE(4)
     A            PT18           5  1    100
     A                                      EDTCDE(4)
     A            PT19           5  1    108
     A                                      EDTCDE(4)
     A            PT1A           5  1    116
     A                                      EDTCDE(4)
     A            PT1B           5  1    124
     A                                      EDTCDE(4)
     A            PT1C           5  1    132
     A                                      EDTCDE(4)
     A            PT1D           5  1    142
     A                                      EDTCDE(4)
     A*------------------------------------------------------------***
     A          R PT2
     A                                      SPACEA(001)
     A                                    32
     A                                      '部門小計:'
     A            PT21           5  1     46
     A                                      EDTCDE(4)
     A            PT22           5  1     53
     A                                      EDTCDE(4)
     A            PT23           5  1     60
     A                                      EDTCDE(4)
     A            PT24           5  1     68
     A                                      EDTCDE(4)
     A            PT25           5  1     76
     A                                      EDTCDE(4)
     A            PT26           5  1     84
     A                                      EDTCDE(4)
     A            PT27           5  1     92
     A                                      EDTCDE(4)
     A            PT28           5  1    100
     A                                      EDTCDE(4)
     A            PT29           5  1    108
     A                                      EDTCDE(4)
     A            PT2A           5  1    116
     A                                      EDTCDE(4)
     A            PT2B           5  1    124
     A                                      EDTCDE(4)
     A            PT2C           5  1    132
     A                                      EDTCDE(4)
     A            PT2D           5  1    142
     A                                      EDTCDE(4)
     A*------------------------------------------------------------***
     A          R PT3
     A                                      SPACEA(001)
     A                                    32
     A                                      '部門中計:'
     A            PT31           5  1     46
     A                                      EDTCDE(4)
     A            PT32           5  1     53
     A                                      EDTCDE(4)
     A            PT33           5  1     60
     A                                      EDTCDE(4)
     A            PT34           5  1     68
     A                                      EDTCDE(4)
     A            PT35           5  1     76
     A                                      EDTCDE(4)
     A            PT36           5  1     84
     A                                      EDTCDE(4)
     A            PT37           5  1     92
     A                                      EDTCDE(4)
     A            PT38           5  1    100
     A                                      EDTCDE(4)
     A            PT39           5  1    108
     A                                      EDTCDE(4)
     A            PT3A           5  1    116
     A                                      EDTCDE(4)
     A            PT3B           5  1    124
     A                                      EDTCDE(4)
     A            PT3C           5  1    132
     A                                      EDTCDE(4)
     A            PT3D           5  1    142
     A                                      EDTCDE(4)
     A*------------------------------------------------------------***
     A          R PT4
     A                                      SPACEA(001)
     A                                    32
     A                                      '部門合計:'
     A            PT41           5  1     46
     A                                      EDTCDE(4)
     A            PT42           5  1     53
     A                                      EDTCDE(4)
     A            PT43           5  1     60
     A                                      EDTCDE(4)
     A            PT44           5  1     68
     A                                      EDTCDE(4)
     A            PT45           5  1     76
     A                                      EDTCDE(4)
     A            PT46           5  1     84
     A                                      EDTCDE(4)
     A            PT47           5  1     92
     A                                      EDTCDE(4)
     A            PT48           5  1    100
     A                                      EDTCDE(4)
     A            PT49           5  1    108
     A                                      EDTCDE(4)
     A            PT4A           5  1    116
     A                                      EDTCDE(4)
     A            PT4B           5  1    124
     A                                      EDTCDE(4)
     A            PT4C           5  1    132
     A                                      EDTCDE(4)
     A            PT4D           5  1    142
     A                                      EDTCDE(4)
     A*------------------------------------------------------------***
     A          R PT5
     A                                      SPACEB(002)
     A                                    32
     A                                      '部門總計:'
     A            PT51           5  1     46
     A                                      EDTCDE(4)
     A            PT52           5  1     53
     A                                      EDTCDE(4)
     A            PT53           5  1     60
     A                                      EDTCDE(4)
     A            PT54           5  1     68
     A                                      EDTCDE(4)
     A            PT55           5  1     76
     A                                      EDTCDE(4)
     A            PT56           5  1     84
     A                                      EDTCDE(4)
     A            PT57           5  1     92
     A                                      EDTCDE(4)
     A            PT58           5  1    100
     A                                      EDTCDE(4)
     A            PT59           5  1    108
     A                                      EDTCDE(4)
     A            PT5A           5  1    116
     A                                      EDTCDE(4)
     A            PT5B           5  1    124
     A                                      EDTCDE(4)
     A            PT5C           5  1    132
     A                                      EDTCDE(4)
     A            PT5D           5  1    142
     A                                      EDTCDE(4)
     A*
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==========='
     A                                      SPACEB(001)
     A                                     1
     A                                      'PYR202P--->報表結束'
     A                                      SPACEB(001)
     A*------------------------------------------------------------***
     A          R PE9
     A                                      SPACEB(001)
     A                                    16
     A                                      '無符合列印範圍之資料'
