     A****************************************************************/
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    */
     A*                                                              */
     A*    PROGRAM-ID   : PYA213P                                    */
     A*    PROGRAM NAME :出勤資料明細表列印                        */
     A*    AUTHOR       : A1226 PETER                                */
     A*    CREATE DATE  : 97/01/20                                   */
     A*    UPDATE DATE  :                                            */
     A*    SYSTEM       :人事薪資系統                              */
     A****************************************************************/
     A                                      REF(PYRF)
     A          R PH1                       SKIPB(002)
     A            CM03      R              1
     A                                      SPACEA(001)
     A                                     1'出勤資料明細資料表'
     A                                      SPACEA(001)
     A                                     1'部門編號:'
     A            T506      R             14
     A            DP02      R             23REFFLD(DP02 PYDPPF)
     A                                      SPACEA(001)
     A                                     1'員工編號:'
     A            T501      R             14
     A            EM03      R             22
     A                                    49'日期:'
     A            DDATE          6  0     57EDTWRD('0  /  /  ')
     A                                    66'頁次:'
     A                                    74PAGNBR
     A                                      SPACEA(001)
     A                                     1'出勤月份:'
     A            DT502          5  0     14EDTWRD('   /  ')
     A                                    49'時間:'
     A                                    57TIME
     A                                      EDTWRD('  :  :  ')
     A                                    67'<PYR213P>'
     A                                      SPACEA(001)
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ==========='
     A                                      SPACEA(001)
     A                                     1'日'
     A                                     5'週'
     A                                     9'時間'
     A                                    15'時間'
     A                                    21'時數'
     A                                    27'時間'
     A                                    33'時間'
     A                                    41'日'
     A                                    45'週'
     A                                    49'時間'
     A                                    55'時間'
     A                                    61'時數'
     A                                    67'時間'
     A                                    73'時間'
     A                                      SPACEA(001)
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ==========='
     A*
     A          R PD1                       SPACEB(001)
     A            P01            2  0      2EDTCDE(4)
     A            P02            4         5
     A            P03            4  0     10EDTWRD('  :  ')
     A            P04            4  0     16EDTWRD('  :  ')
     A            P05            3  1     22EDTCDE(4)
     A  31        P06            4  0     28EDTWRD('  :  ')
     A  32        P07            4  0     34EDTWRD('  :  ')
     A*
     A            P11            2  0     42EDTCDE(4)
     A            P12            4        45
     A            P13            4  0     50EDTWRD('  :  ')
     A            P14            4  0     56EDTWRD('  :  ')
     A            P15            3  1     62EDTCDE(4)
     A  33        P16            4  0     68EDTWRD('  :  ')
     A  34        P17            4  0     74EDTWRD('  :  ')
     A*
     A          R PT1                       SPACEB(001)
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ==========='
     A*
     A          R PE9                       SPACEB(001)
     A                                    16'無符合列印範圍之資料'
