     A****************************************************************
     A*   獂び戈癟м秨祇Τそ⌒舦┮Τ    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : PYR217P                                    *
     A*    PROGRAM NAME :对参璸                            *
     A*    AUTHOR       : A1386 SHARON                               *
     A*    CREATE DATE  : 2004/12/30                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :ㄆ羱戈                                  *
     A****************************************************************
     A                                      REF(PYRF)
     A          R PH1                       SKIPB(2)
     A            CM03      R              1
     A                                      SPACEA(1)
     A                                     1'对参璸'
     A                                      SPACEA(2)
     A                                     1'对:'
     A            DYEAR          3  0     13EDTWRD('   ')
     A                                    60'ら戳:'
     A            DDATE          6  0     68EDTWRD('0  /  /  ')
     A                                    77'Ω:'
     A                                    85PAGNBR
     A                                      SPACEA(1)
     A                                     1'场腹:'
     A            DEM041         7        +1
     A                                    +1'-'
     A            DEM042         7        +1
     A                                    60'丁:'
     A                                    68TIME
     A                                      EDTWRD('  :  :  ')
     A                                    77'<PYR217P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============================'
     A                                      SPACEA(1)
     A                                     1'场嘿'
     A                                    26'﹎'
     A                                    47'タ盽'
     A                                    57'叫安'
     A                                    67'龟悔'
     A                                    78'对瞯'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============================'
     A*
     A          R PD1                       SPACEB(1)
     A  31        EM041     R              1
     A  31        EM042     R              2
     A  31        EM043     R              3
     A  31        EM044     R              4
     A  31        DP02      R              8REFFLD(DP02 PYDPPF)
     A            PE02           8        25
     A            EM03      R             34
     A            PE04           6  2     50EDTCDE(3)
     A            PE05           6  2     59EDTCDE(3)
     A            PD11           6  2     69EDTCDE(3)
     A            PE06           5  4     79EDTCDE(1)
     A*
     A          R PT1                       SPACEB(2)
     A                                     2'计璸:'
     A            CNT            3  0     +1EDTCDE(3)
     A                                    +1''
     A                                      SPACEA(1)
     A*
     A          R PT2                       SPACEB(2)
     A                                     2'计璸:'
     A            CNT1           4  0     +1EDTCDE(3)
     A                                    +1''
     A                                      SPACEA(1)
     A*
     A          R PT3
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============================'
     A                                      SPACEA(1)
     A                                     1'PYR217P--->厨挡'
     A          R PE9                       SPACEB(1)
     A                                    16'礚才絛瞅ぇ戈'
