     A***************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   *
     A*                                                             *
     A*    PROGRAM ID   : PYR315P                                   *
     A*    PROGRAM NAME :薪資加班請假記錄表列印                   *
     A*    AUTHOR       : A1226 PETER                               *
     A*    CREATE DATE  : 85/12/14                                  *
     A*    UPDATE DATE  :                                           *
     A*    SYSTEM       : 人事薪資系統                            *
     A***************************************************************
     A                                      REF(PYRF)
     A          R PH1                       SKIPB(2)
     A            CM03      R              1
     A                                   159'日期:'
     A            DDATE          6  0    167EDTWRD('0  /  /  ')
     A                                   176'頁次:'
     A                                   184PAGNBR
     A                                      SPACEA(1)
     A                                     1'薪資加班請假記錄表      '
     A                                   159'時間:'
     A                                   167TIME
     A                                      EDTWRD('  :  :  ')
     A                                   177'<PYR315P>'
     A                                      SPACEA(2)
     A                                     1'薪資年月:'
     A            DOV96     R   -1        13REFFLD(OV96)
     A                                      EDTWRD('   /  ')
     A                                      SPACEA(1)
     A                                     1'部門代號:'
     A            DEM041         7        13
     A                                    +1'-'
     A            DEM042         7        +1
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============'
     A                                      SPACEA(1)
     A                                    45'---------'
     A                                    54'加班時數'
     A                                    64'--------'
     A                                    74'請假'
     A                                      SPACEA(1)
     A                                     1'部門名稱'
     A                                    23'員工姓名'
     A                                    44'總時數'
     A                                    53'平日'
     A                                    60'超時'
     A                                    67'假日'
     A                                    73'總時數'
     A            PH11           6O       82
     A            PH12           6O       89
     A            PH13           6O       96
     A            PH14           6O      103
     A            PH15           6O      110
     A            PH16           6O      117
     A            PH17           6O      124
     A            PH18           6O      131
     A            PH19           6O      138
     A            PH1A           6O      145
     A            PH1B           6O      152
     A            PH1C           6O      159
     A            PH1D           6O      166
     A            PH1E           6O      173
     A            PH1F           6O      180
     A            PH1G           6O      187
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============'
     A*
     A          R PD1                       SPACEB(1)
     A            EM041     R              1
     A            EM042     R              2
     A            EM043     R              3
     A            EM044     R              4
     A            DP02      R              8REFFLD(DP02 PYDPPF)
     A            EM02      R             24
     A            EM03      R             32
     A            PD11           5  2     46EDTCDE(3)
     A            PD12           5  2     53EDTCDE(3)
     A            PD13           5  2     60EDTCDE(3)
     A            PD14           5  2     67EDTCDE(3)
     A            PD15           5  2     74EDTCDE(3)
     A            PD16           5  2     82EDTCDE(4)
     A            PD17           5  2     89EDTCDE(4)
     A            PD18           5  2     96EDTCDE(4)
     A            PD19           5  2    103EDTCDE(4)
     A            PD1A           5  2    110EDTCDE(4)
     A            PD1B           5  2    117EDTCDE(4)
     A            PD1C           5  2    124EDTCDE(4)
     A            PD1D           5  2    131EDTCDE(4)
     A            PD1E           5  2    138EDTCDE(4)
     A            PD1F           5  2    145EDTCDE(4)
     A            PD1G           5  2    152EDTCDE(4)
     A            PD1H           5  2    159EDTCDE(4)
     A            PD1I           5  2    166EDTCDE(4)
     A            PD1J           5  2    173EDTCDE(4)
     A            PD1K           5  2    180EDTCDE(4)
     A            PD1L           5  2    187EDTCDE(4)
     A*
     A          R PT1                       SPACEB(2)
     A                                    30'部門小計:'
     A            PT11           5  2     46EDTCDE(3)
     A            PT12           5  2     53EDTCDE(3)
     A            PT13           5  2     60EDTCDE(3)
     A            PT14           5  2     67EDTCDE(3)
     A            PT15           5  2     74EDTCDE(3)
     A            PT16           5  2     82EDTCDE(4)
     A            PT17           5  2     89EDTCDE(4)
     A            PT18           5  2     96EDTCDE(4)
     A            PT19           5  2    103EDTCDE(4)
     A            PT1A           5  2    110EDTCDE(4)
     A            PT1B           5  2    117EDTCDE(4)
     A            PT1C           5  2    124EDTCDE(4)
     A            PT1D           5  2    131EDTCDE(4)
     A            PT1E           5  2    138EDTCDE(4)
     A            PT1F           5  2    145EDTCDE(4)
     A            PT1G           5  2    152EDTCDE(4)
     A            PT1H           5  2    159EDTCDE(4)
     A            PT1I           5  2    166EDTCDE(4)
     A            PT1J           5  2    173EDTCDE(4)
     A            PT1K           5  2    180EDTCDE(4)
     A            PT1L           5  2    187EDTCDE(4)
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============'
     A                                      SPACEA(1)
     A                                     1'PYR315P--->報表結束'
     A*
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
