     A****************************************************************
     A*    PRTF NAME    : PYR329P                                    *
     A*    PROGRAM NAME : PYR3290C                                   *
     A*    AUTHOR       : DEREK                                      *
     A*    CREATE DATE  : 103/06/27                                  *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人事薪資系統                              *
     A*    REMARK       :公司負擔成本總表                          *
     A****************************************************************
     A                                      REF(PYEMPF)
     A*---------------------------------------------------------------*
     A          R PH1
     A                                      SKIPB(002)
     A            CM03      R              1REFFLD(CM03 SYCMPF)
     A                                      CHRSIZ(2)
     A                                      SPACEA(001)
     A                                     1'公司負擔成本總表'
     A                                      CHRSIZ(2)
     A                                      SPACEA(001)
     A                                    58'列印日期:'
     A            PDATE          8  0     70EDTWRD('0    /  /  ')
     A                                      SPACEA(001)
     A                                     1'統計年月:'
     A            CDYMYY         4  0     +2
     A                                    +1'年'
     A            CDYMMM         2  0     +1
     A                                    +1'月'
     A                                    58'頁  次:'
     A                                    70PAGNBR
     A                                      SPACEA(001)
     A            LINE1         80A        1
     A                                      SPACEA(001)
     A                                     1'部門'
     A                                    18'公司負擔健保'
     A                                    34'公司負擔勞保'
     A                                    54'企業提繳'
     A                                      SPACEA(001)
     A            LINE2         80A        1
     A                                      SPACEA(001)
     A*---------------------------------------------------------------*
     A          R PD1
     A            DP02      R              1REFFLD(DP02 PYDPPF)
     A            PDW05          7  0     22EDTCDE(2)
     A            PDW07          7  0     38EDTCDE(2)
     A            PDW09          7  0     54EDTCDE(2)
     A                                      SPACEA(001)
     A*---------------------------------------------------------------*
     A          R PT2
     A            LINE4         80A        1
     A                                      SPACEA(001)
     A                                     1'總  計'
     A            PTO12          8  0     21EDTCDE(2)
     A            PTO14          8  0     37EDTCDE(2)
     A            PTO16          8  0     53EDTCDE(2)
     A                                      SPACEA(001)
     A            LINE5         80A        1
     A*---------------------------------------------------------------*
     A***       R PE1
     A***                                  1'備  註'
     A***                                 74'總經理'
     A***                                 96'副總經理'
     A***                                120'會計'
     A***                                140'人事'
     A***                                160'出納'
     A***                                180'製表'
