     A                                      REF(PYRF)
     A          R PH1
     A                                      SKIPB(002)
     A            CM03      R              1
     A                                    52
     A                                      '日期:'
     A            DDATE          6  0     60
     A                                      EDTWRD('0  /  /  ')
     A                                    69
     A                                      '頁次:'
     A                                    77
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A                                     1
     A                                      '銀行帳號對照表'
     A                                    52
     A                                      '時間:'
     A                                    60
     A                                      TIME
     A                                      EDTWRD('  :  :  ')
     A                                    70
     A                                      '<PYR310P>'
     A                                      SPACEA(002)
     A*                                    1
     A*                                     '發薪年月:'
     A*           DYM            4  0     12
     A*                                     EDTWRD('0  /  ')
     A*           DSELC         10        18
     A*                                   50
     A*                                     '存入日期:'
     A*           DPY07          6  0     62
     A*                                     EDTWRD('0  /  /  ')
     A*                                     SPACEA(001)
     A                                     1
     A                                      '銀行名稱:'
     A            BN04N     R             13
     A                                      REFFLD(BN04)
     A                                    50
     A                                      '銀行代碼:'
     A            DBN01          3A       62
     A                                    70
     A                                      '-'
     A            DBN02          3A       72
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ==============================='
     A                                      SPACEA(001)
     A                                     1
     A                                      '分行名稱'
     A                                    18
     A                                      '部門編號'
     A                                    40
     A                                      '帳　號'
     A                                    57
     A                                      '員工編號'
     A                                    78
     A                                      '身分證號'
     A*                                   90
     A*                                     '金　額'
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ==============================='
     A*
     A          R PD1
     A                                      SPACEB(001)
     A  31        BN04      R              1
     A            DR3108    R             16
     A                                      REFFLD(DP011)
     A            DR3109    R             17
     A                                      REFFLD(DP012)
     A            DR3110    R             18
     A                                      REFFLD(DP013)
     A            DR3111    R             19
     A                                      REFFLD(DP014)
     A            DP02C     R             23REFFLD(DP02 PYDPPF)
     A            R3105     R             40
     A                                      REFFLD(PY06)
     A            R3102     R             56
     A                                      REFFLD(PY02)
     A            EM03      R             64
     A            EM31      R             78
     A*           R3106          7  0     90
     A*                                     EDTCDE(1)
     A*
     A          R PT1
     A                                      SPACEB(001)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------'
     A                                      SPACEA(001)
     A                                    37
     A                                      '部門小計==>'
     A            PT11           3  0     55
     A                                      EDTCDE(1)
     A                                    59
     A                                      '人'
     A*           PAMT1          9  0     74
     A*                                     EDTCDE(1)
     A                                      SPACEA(001)
     A*
     A          R PT2
     A                                      SPACEB(001)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------'
     A                                      SPACEA(001)
     A                                     1'合　計==>'
     A            PT21           5  0     53
     A                                      EDTCDE(3)
     A                                    59
     A                                      '人'
     A*           PAMT2          9  0     74
     A*                                     EDTCDE(1)
     A                                      SPACEA(001)
     A*
     A          R PT3
     A                                      SPACEB(002)
     A                                     1
     A                                      '總　計==>'
     A            PT31           5  0     53
     A                                      EDTCDE(3)
     A                                    59
     A                                      '人'
     A*           PAMT3          9  0     74
     A*                                     EDTCDE(1)
     A*
     A          R PE1
     A                                      SPACEB(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ==============================='
     A          R PE2
     A                                      SPACEB(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ==============================='
     A                                     1
     A                                      'PYR310P--->報表結束'
     A                                      SPACEB(001)
     A          R PE9
     A                                      SPACEB(001)
     A                                    16
     A                                      '無符合列印範圍之資料'
