     A*****************************************************************
     A*  PYR324WF  獎金所得扣繳稅款繳款書－不分區工作檔
     A*****************************************************************
     A                                      REF(PYRF)
     A          R W324
     A            W324AA         2A         COLHDG('公司')
     A*-------------------------------------------------------------***
     A**薪資所得扣繳稅額繳款書
     A*固定薪資按扣繳稅額表扣繳
     A            W32411         4S 0       COLHDG('人數一')
     A            W32412         5S 0       COLHDG('扣繳年月')
     A            W32413         8S 0       COLHDG('給付所得')
     A            W32414         8S 0       COLHDG('扣繳稅額')
     A*非固定薪資及兼職薪資一律按6%扣繳
     A            W32421         4S 0       COLHDG('人數二')
     A            W32422         5S 0       COLHDG('扣繳年月')
     A            W32423         8S 0       COLHDG('給付所得')
     A            W32424         8S 0       COLHDG('扣繳稅額')
     A*給付中華民國境內居住之個人之薪資選擇按10%扣繳
     A            W32431         4S 0       COLHDG('人數三')
     A            W32432         5S 0       COLHDG('扣繳年月')
     A            W32433         8S 0       COLHDG('給付所得')
     A            W32434         8S 0       COLHDG('扣繳稅額')
     A*給付非中華民國境內居住之個人薪資按20%扣繳
     A            W32441         4S 0       COLHDG('人數四')
     A            W32442         5S 0       COLHDG('扣繳年月')
     A            W32443         8S 0       COLHDG('給付所得')
     A            W32444         8S 0       COLHDG('扣繳稅額')
     A*免扣繳人數
     A            W32451         4S 0       COLHDG('人數五')
     A            W32452         5S 0       COLHDG('扣繳年月')
     A            W32453         8S 0       COLHDG('給付所得')
     A            W32454         8S 0       COLHDG('扣繳稅額')
     A*
     A*-------------------------------------------------------------***
     A**各類所得扣繳稅額繳款書
     A*租賃: 51
     A            W324A1         4S 0       COLHDG('人數Ａ')
     A            W324A2         5S 0       COLHDG('扣繳年月')
     A            W324A3         8S 0       COLHDG('給付所得')
     A            W324A4         8S 0       COLHDG('扣繳稅額')
     A*其他利息: 5A, 5B, 5C, 5D, 5E
     A            W324B1         4S 0       COLHDG('人數Ｂ')
     A            W324B2         5S 0       COLHDG('扣繳年月')
     A            W324B3         8S 0       COLHDG('給付所得')
     A            W324B4         8S 0       COLHDG('扣繳稅額')
     A*權利金: 53
     A            W324C1         4S 0       COLHDG('人數Ｃ')
     A            W324C2         5S 0       COLHDG('扣繳年月')
     A            W324C3         8S 0       COLHDG('給付所得')
     A            W324C4         8S 0       COLHDG('扣繳稅額')
     A*盈餘: 54
     A            W324D1         4S 0       COLHDG('人數Ｄ')
     A            W324D2         5S 0       COLHDG('扣繳年月')
     A            W324D3         8S 0       COLHDG('給付所得')
     A            W324D4         8S 0       COLHDG('扣繳稅額')
     A*執行業務報酬: 9A
     A            W324E1         4S 0       COLHDG('人數Ｅ')
     A            W324E2         5S 0       COLHDG('扣繳年月')
     A            W324E3         8S 0       COLHDG('給付所得')
     A            W324E4         8S 0       COLHDG('扣繳稅額')
     A*稿費: 9B
     A            W324F1         4S 0       COLHDG('人數Ｆ')
     A            W324F2         5S 0       COLHDG('扣繳年月')
     A            W324F3         8S 0       COLHDG('給付所得')
     A            W324F4         8S 0       COLHDG('扣繳稅額')
     A*競技競賽及機會中獎獎金: 91
     A            W324G1         4S 0       COLHDG('人數Ｇ')
     A            W324G2         5S 0       COLHDG('扣繳年月')
     A            W324G3         8S 0       COLHDG('給付所得')
     A            W324G4         8S 0       COLHDG('扣繳稅額')
     A*其他所得: 92
     A            W324H1         4S 0       COLHDG('人數Ｈ')
     A            W324H2         5S 0       COLHDG('扣繳年月')
     A            W324H3         8S 0       COLHDG('給付所得')
     A            W324H4         8S 0       COLHDG('扣繳稅額')
     A*
     A          K W324AA
