     A****************************************************************/
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     A*                                                              */
     A*    PROGRAM-ID   : PYR325P                                    */
     A*    PROGRAM NAME :獎金所得扣繳稅款繳款書－工作地點          */
     A*    AUTHOR       : A1274 EVA                                  */
     A*    CREATE DATE  : 90/05/16                                   */
     A*    UPDATE DATE  :                                            */
     A*    SYSTEM       :人事薪資系統                              */
     A****************************************************************/
     A                                      REF(PYR325WF)
     A*--------------------------------------------------------------**
     A          R PH1                       SKIPB(3)
     A*
     A                                     1' '
     A                                      SPACEA(1)
     A*
     A                                    22'<<薪資及各類所得扣繳稅額繳款書>>'
     A                                      SPACEA(3)
     A*
     A                                     1'********************+
     A                                       ********************+
     A                                       ********************+
     A                                       ********************'
     A                                      SPACEA(1)
     A*
     A                                     1'工作地點:'
     A            W325PA         5        +1
     A                                    60'製表日期:'
     A            DDATE          7  0     +1EDTCDE(Y)
     A                                      SPACEA(1)
     A*
     A                                     1'員工編號:'
     A            DPH021    R             +1REFFLD(PH02 PYPHPF)
     A                                    +1'~'
     A            DPH022    R             +1REFFLD(PH02 PYPHPF)
     A            PSEL          20        60
     A                                      SPACEA(1)
     A*
     A                                     1'********************+
     A                                       ********************+
     A                                       ********************+
     A                                       ********************'
     A                                      SPACEA(1)
     A*
     A                                     2' '
     A                                      SPACEA(3)
     A*
     A                                    25'**獎金所得扣繳稅額繳款書**'
     A                                      SPACEA(1)
     A*
     A                                     2' '
     A                                      SPACEA(2)
     A*
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*
     A                                    36'員工人數'
     A                                    46'年　月'
     A                                    54'給付所得總額'
     A                                    70'應扣繳稅額'
     A                                      SPACEA(1)
     A*
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*
     A                                     1'固定薪資按扣繳稅額表扣繳'
     A            W32511         4  0     40EDTCDE(1)
     A            W32512         5  0     47EDTWRD('   /  ')
     A            W32513         8  0     57EDTCDE(1)
     A            W32514         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'非固定薪資及兼職薪資一律按6%扣+
     A                                      繳'
     A            W32521         4  0     40EDTCDE(1)
     A            W32522         5  0     47EDTWRD('   /  ')
     A            W32523         8  0     57EDTCDE(1)
     A            W32524         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'給付中華民國境內居住之個人之薪資+
     A                                      選'
     A                                      SPACEA(1)
     A                                     1'擇按10%扣繳'
     A            W32531         4  0     40EDTCDE(1)
     A            W32532         5  0     47EDTWRD('   /  ')
     A            W32533         8  0     57EDTCDE(1)
     A            W32534         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'給付非中華民國境內居住之個人薪資+
     A                                      按'
     A                                      SPACEA(1)
     A                                     1' 20%扣繳'
     A            W32541         4  0     40EDTCDE(1)
     A            W32542         5  0     47EDTWRD('   /  ')
     A            W32543         8  0     57EDTCDE(1)
     A            W32544         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'免　扣　繳　人　數'
     A            W32551         4  0     40EDTCDE(1)
     A            W32552         5  0     47EDTWRD('   /  ')
     A            W32553         8  0     57EDTCDE(1)
     A            W32554         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A                                     1'合　　　　計:'
     A            PT11           4  0     40EDTCDE(1)
     A            PTOT1          9  0     56EDTCDE(1)
     A            PTOT2          9  0     70EDTCDE(1)
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*--------------------------------------------------------------**
     A                                     2' '
     A                                      SPACEA(3)
     A*
     A                                    25'**各類所得扣繳稅額繳款書**'
     A                                      SPACEA(1)
     A*
     A                                     2' '
     A                                      SPACEA(2)
     A*
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*
     A                                     1'所得類別'
     A                                    36'員工人數'
     A                                    46'年　月'
     A                                    54'給付所得總額'
     A                                    70'應扣繳稅額'
     A                                      SPACEA(1)
     A*
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*
     A                                     1'５１：租賃'
     A            W325A1         4  0     40EDTCDE(1)
     A            W325A2         5  0     47EDTWRD('   /  ')
     A            W325A3         8  0     57EDTCDE(1)
     A            W325A4         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'５Ｘ：其他利息( 5A/5B/5C/5D/5E )'
     A            W325B1         4  0     40EDTCDE(1)
     A            W325B2         5  0     47EDTWRD('   /  ')
     A            W325B3         8  0     57EDTCDE(1)
     A            W325B4         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'５３：權利金'
     A            W325C1         4  0     40EDTCDE(1)
     A            W325C2         5  0     47EDTWRD('   /  ')
     A            W325C3         8  0     57EDTCDE(1)
     A            W325C4         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'５４：盈餘'
     A            W325D1         4  0     40EDTCDE(1)
     A            W325D2         5  0     47EDTWRD('   /  ')
     A            W325D3         8  0     57EDTCDE(1)
     A            W325D4         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'９Ａ：執行業務報酬'
     A            W325E1         4  0     40EDTCDE(1)
     A            W325E2         5  0     47EDTWRD('   /  ')
     A            W325E3         8  0     57EDTCDE(1)
     A            W325E4         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'９Ｂ：稿費'
     A            W325F1         4  0     40EDTCDE(1)
     A            W325F2         5  0     47EDTWRD('   /  ')
     A            W325F3         8  0     57EDTCDE(1)
     A            W325F4         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'９１：競技競賽及機會中獎獎金'
     A            W325G1         4  0     40EDTCDE(1)
     A            W325G2         5  0     47EDTWRD('   /  ')
     A            W325G3         8  0     57EDTCDE(1)
     A            W325G4         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'９２：其他所得'
     A            W325H1         4  0     40EDTCDE(1)
     A            W325H2         5  0     47EDTWRD('   /  ')
     A            W325H3         8  0     57EDTCDE(1)
     A            W325H4         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A                                     1'合　　　　計:'
     A            PT12           4  0     40EDTCDE(1)
     A            PTOTA          9  0     56EDTCDE(1)
     A            PTOTB          9  0     70EDTCDE(1)
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*
     A          R PT1
     A                                     1'TRR325P--->報表結束'
