     A****************************************************************
     A*    PRTF NAME    : PYR306P                                    *
     A*    PROGRAM NAME : PYR306                                     *
     A*    AUTHOR       : A1138  DAVID, CHEN.                        *
     A*    CREATE DATE  : 81/02/25                                   *
     A*    UPDATE DATE  : 90/04/13 A1274 EVA                         *
     A*    SYSTEM       : MIRS                                       *
     A*    REMARK       :其他薪資基本資料列印                      *
     A****************************************************************
     A                                      REF(PYRF)
     A*---------------------------------------------------------***
     A          R PH1                       SKIPB(2)
     A            CM03      R              1
     A                                      SPACEA(1)
     A*
     A                                     1'其他薪資資料明細表'
     A                                      SPACEA(2)
     A*
     A                                     1'部門代號:'
     A            DEM041         7        13
     A                                    +1'-'
     A            DEM042         7        +1
     A                                   115'日期:'
     A            DDATE          6  0    123EDTWRD('0  /  /  ')
     A                                   132'頁次:'
     A                                   140PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A*
     A                                     1'員工編號:'
     A            DEM021    R             +1REFFLD(EM02)
     A                                    +0'-'
     A            DEM022    R             +0REFFLD(EM02)
     A                                    +3'年月:'
     A            PYYMM          4  0     +1EDTWRD('0  /  ')
     A                                    +3'期別:'
     A            DOS04C        10        +1
     A                                   115'時間:'
     A                                   123TIME
     A                                      EDTWRD('  :  :  ')
     A                                   133'<PYR306P>'
     A                                      SPACEA(1)
     A*
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====='
     A                                      SPACEA(1)
     A*
     A                                     1'部門名稱'
     A                                    22'員工編號'
     A                                    34'員工姓名'
     A                                    50'離職碼'
     A            SS021     R             62REFFLD(SS02)
     A            SS022     R             76REFFLD(SS02)
     A            SS023     R             90REFFLD(SS02)
     A            SS024     R            104REFFLD(SS02)
     A            SS025     R            118REFFLD(SS02)
     A            SS026     R            132REFFLD(SS02)
     A*---------------------------------------------------------***
     A          R PH11                      SPACEB(1)
     A            SS021     R             62REFFLD(SS02)
     A            SS022     R             76REFFLD(SS02)
     A            SS023     R             90REFFLD(SS02)
     A            SS024     R            104REFFLD(SS02)
     A            SS025     R            118REFFLD(SS02)
     A            SS026     R            132REFFLD(SS02)
     A*---------------------------------------------------------***
     A          R PH12                      SPACEB(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====='
     A*
     A*---------------------------------------------------------***
     A          R PD1                       SPACEB(1)
     A**          EM041     R              1
     A**          EM042     R              2
     A**          EM043     R              3
     A            EM044     R              3
     A            DP02      R              6REFFLD(DP02 PYDPPF)
     A            EM02      R             23
     A            EM03      R             34
     A            EM11      R             53
     A            PD041     R             62EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PD042     R             76EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PD043     R             90EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PD044     R            104EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PD045     R            118EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PD046     R            132EDTCDE(K)
     A                                      REFFLD(PD04)
     A*
     A*---------------------------------------------------------***
     A          R PD2                       SPACEB(1)
     A            PD041     R             62EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PD042     R             76EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PD043     R             90EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PD044     R            104EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PD045     R            118EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PD046     R            132EDTCDE(K)
     A                                      REFFLD(PD04)
     A*
     A*---------------------------------------------------------***
     A          R PE1                       SPACEB(1)
     A                                     1'   '
     A**************************           1'--------------------+
     A*                                      --------------------+
     A*                                      --------------------+
     A*                                      --------------------+
     A*                                      --------------------+
     A*                                      --------------------+
     A*                                      --------------------+
     A**************************             -----'
     A*---------------------------------------------------------***
     A          R PE2                       SPACEB(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====='
     A                                      SPACEA(1)
     A*---------------------------------------------------------***
     A          R PE3                       SPACEB(1)
     A                                    23'公司總計：'
     A            PE041     R             62EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PE042     R             76EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PE043     R             90EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PE044     R            104EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PE045     R            118EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PE046     R            132EDTCDE(K)
     A                                      REFFLD(PD04)
     A*
     A*---------------------------------------------------------***
     A          R PE4                       SPACEB(1)
     A            PE041     R             62EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PE042     R             76EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PE043     R             90EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PE044     R            104EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PE045     R            118EDTCDE(K)
     A                                      REFFLD(PD04)
     A            PE046     R            132EDTCDE(K)
     A                                      REFFLD(PD04)
     A*
     A*---------------------------------------------------------***
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
