     A****************************************************************/
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    */
     A*                                                              */
     A*    PROGRAM-ID   : PYA317P                                    */
     A*    PROGRAM NAME :薪資加班明細表列印                        */
     A*    AUTHOR       : A1226 PETER                                */
     A*    CREATE DATE  : 97/01/20                                   */
     A*    UPDATE DATE  :                                            */
     A*    SYSTEM       :人事薪資系統                              */
     A****************************************************************/
     A                                      REF(PYRF)
     A          R PH1                       SKIPB(2)
     A            CM03      R              1
     A                                   122'日期:'
     A            DDATE          6  0    130EDTWRD('0  /  /  ')
     A                                   139'頁次:'
     A                                   147PAGNBR
     A                                      SPACEA(1)
     A                                     1'薪資加班資料明細表      '
     A                                   122'時間:'
     A                                   130TIME
     A                                      EDTWRD('  :  :  ')
     A                                   140'<PYR317P>'
     A                                      SPACEA(2)
     A                                     1'薪資年月:'
     A            DOV96          5  0     13
     A                                      EDTWRD('0   /  ')
     A                                      SPACEA(1)
     A                                     1'部門代號:'
     A            DEM041         7        13
     A                                    +1'-'
     A            DEM042         7        +1
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==========='
     A                                      SPACEA(1)
     A                                    55'----------'
     A                                    65'實際加班時數'
     A                                    79'----------'
     A                                    93'--------'
     A                                   101'薪資計算加班時數'
     A                                   119'--------'
     A                                   131'-'
     A                                   132'津貼次數'
     A                                   142'-'
     A                                      SPACEA(1)
     A                                     1'部門名稱'
     A                                    22'員工姓名'
     A                                    43'加班日期'
     A                                    55'平日'
     A                                    62'超時'
     A                                    69'週六'
     A                                    76'假日'
     A                                    83'值班'
     A                                    93'平日'
     A                                   100'超時'
     A                                   107'週六'
     A                                   114'假日'
     A                                   121'值班'
     A                                   130'交通'
     A                                   137'誤餐'
     A                                   146'轉休'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==========='
     A*
     A          R PD1                       SPACEB(1)
     A N31        EM041     R              1
     A N31        EM042     R              2
     A N31        EM043     R              3
     A N31        EM044     R              4
     A N31        DP02      R              8REFFLD(DP02 PYDPPF)
     A N32        OV02      R             24
     A N32        EM03      R             32
     A            OV03W     R   -1        46REFFLD(OV03)
     A                                      EDTWRD('0   /  /  ')
     A            OV07      R             56EDTCDE(3)
     A            OV08      R             63EDTCDE(3)
     A            OV09      R             70EDTCDE(3)
     A            OV10      R             77EDTCDE(3)
     A            OV11      R             84EDTCDE(3)
     A            OV21      R             92EDTCDE(3)
     A            OV22      R             99EDTCDE(3)
     A            OV23      R            106EDTCDE(3)
     A            OV24      R            113EDTCDE(3)
     A            OV25      R            120EDTCDE(3)
     A            OV40      R            131EDTCDE(3)
     A            OV42      R            138EDTCDE(3)
     A            OV26      R            145EDTCDE(3)
     A*
     A          R PT0                       SPACEB(2)
     A                                    21'員工小計==>'
     A                                    45'時數:'
     A            PT02           5  2     56EDTCDE(3)
     A            PT03           5  2     63EDTCDE(3)
     A            PT04           5  2     70EDTCDE(3)
     A            PT05           5  2     77EDTCDE(3)
     A            PT06           5  2     84EDTCDE(3)
     A            PT07           5  2     92EDTCDE(3)
     A            PT08           5  2     99EDTCDE(3)
     A            PT09           5  2    106EDTCDE(3)
     A            PT0A           5  2    113EDTCDE(3)
     A            PT0B           5  2    120EDTCDE(3)
     A            PT0C           3  0    131EDTCDE(3)
     A            PT0E           3  0    138EDTCDE(3)
     A            PT0F           5  2    145EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A          R PT1
     A                                    21'單位小計==>'
     A            PT11           3  0     35EDTCDE(1)
     A                                    38'人'
     A                                    45'時數:'
     A            PT12           5  2     56EDTCDE(3)
     A            PT13           5  2     63EDTCDE(3)
     A            PT14           5  2     70EDTCDE(3)
     A            PT15           5  2     77EDTCDE(3)
     A            PT16           5  2     84EDTCDE(3)
     A            PT17           5  2     92EDTCDE(3)
     A            PT18           5  2     99EDTCDE(3)
     A            PT19           5  2    106EDTCDE(3)
     A            PT1A           5  2    113EDTCDE(3)
     A            PT1B           5  2    120EDTCDE(3)
     A            PT1C           3  0    131EDTCDE(3)
     A            PT1E           3  0    138EDTCDE(3)
     A            PT1F           5  2    145EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A          R PT2
     A                                    21'部門小計==>'
     A            PT21           3  0     35EDTCDE(1)
     A                                    38'人'
     A                                    45'時數:'
     A            PT22           5  2     56EDTCDE(3)
     A            PT23           5  2     63EDTCDE(3)
     A            PT24           5  2     70EDTCDE(3)
     A            PT25           5  2     77EDTCDE(3)
     A            PT26           5  2     84EDTCDE(3)
     A            PT27           5  2     92EDTCDE(3)
     A            PT28           5  2     99EDTCDE(3)
     A            PT29           5  2    106EDTCDE(3)
     A            PT2A           5  2    113EDTCDE(3)
     A            PT2B           5  2    120EDTCDE(3)
     A            PT2C           3  0    131EDTCDE(3)
     A            PT2E           3  0    138EDTCDE(3)
     A            PT2F           5  2    145EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A          R PT3
     A                                    21'部門中計==>'
     A            PT31           3  0     35EDTCDE(1)
     A                                    38'人'
     A                                    45'時數:'
     A            PT32           5  2     56EDTCDE(3)
     A            PT33           5  2     63EDTCDE(3)
     A            PT34           5  2     70EDTCDE(3)
     A            PT35           5  2     77EDTCDE(3)
     A            PT36           5  2     84EDTCDE(3)
     A            PT37           5  2     92EDTCDE(3)
     A            PT38           5  2     99EDTCDE(3)
     A            PT39           5  2    106EDTCDE(3)
     A            PT3A           5  2    113EDTCDE(3)
     A            PT3B           5  2    120EDTCDE(3)
     A            PT3C           3  0    131EDTCDE(3)
     A            PT3E           3  0    138EDTCDE(3)
     A            PT3F           5  2    145EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A          R PT4
     A                                    21'部門合計==>'
     A            PT41           3  0     35EDTCDE(1)
     A                                    38'人'
     A                                    45'時數:'
     A            PT42           5  2     56EDTCDE(3)
     A            PT43           5  2     63EDTCDE(3)
     A            PT44           5  2     70EDTCDE(3)
     A            PT45           5  2     77EDTCDE(3)
     A            PT46           5  2     84EDTCDE(3)
     A            PT47           5  2     92EDTCDE(3)
     A            PT48           5  2     99EDTCDE(3)
     A            PT49           5  2    106EDTCDE(3)
     A            PT4A           5  2    113EDTCDE(3)
     A            PT4B           5  2    120EDTCDE(3)
     A            PT4C           3  0    131EDTCDE(3)
     A            PT4E           3  0    138EDTCDE(3)
     A            PT4F           5  2    145EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A          R PT5                       SPACEB(2)
     A                                    21'公司總計==>'
     A            PT51           4  0     34EDTCDE(1)
     A                                    40'筆'
     A                                    45'時數:'
     A            PT52           5  2     56EDTCDE(3)
     A            PT53           5  2     63EDTCDE(3)
     A            PT54           5  2     70EDTCDE(3)
     A            PT55           5  2     77EDTCDE(3)
     A            PT56           5  2     84EDTCDE(3)
     A            PT57           5  2     92EDTCDE(3)
     A            PT58           5  2     99EDTCDE(3)
     A            PT59           5  2    106EDTCDE(3)
     A            PT5A           5  2    113EDTCDE(3)
     A            PT5B           5  2    120EDTCDE(3)
     A            PT5C           3  0    131EDTCDE(3)
     A            PT5E           3  0    138EDTCDE(3)
     A            PT5F           5  2    145EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A**        R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==========='
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
