     A****************************************************************
     A*    PRTF NAME    : PYR302P                                    *
     A*    PROGRAM NAME : PYR302                                     *
     A*    AUTHOR       : A1037  JOSNSON                             *
     A*    CREATE DATE  : 81/02/26                                   *
     A*    UPDATE DATE  : 89/09/04 A1274 EVA                         *
     A*    SYSTEM       : MIRS                                       *
     A*    REMARK       :薪資基本資料列印                          *
     A****************************************************************
     A                                      REF(PYRF)
     A          R PH1                       SKIPB(2)
     A            CM03      R              1
     A                                   110'日期:'
     A            DDATE          6  0    118EDTWRD('0  /  /  ')
     A                                   127'頁次:'
     A                                   135PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'調薪對照表－依員工編號'
     A                                   110'時間:'
     A                                   118TIME
     A                                      EDTWRD('  :  :  ')
     A                                   128'<PYR302P>'
     A                                      SPACEA(2)
     A                                     1'部門代號:'
     A            DEM041         7        13
     A                                    +1'-'
     A            DEM042         7        +1
     A                                      SPACEA(1)
     A                                     1'員工編號:'
     A            DSH021    R             +1REFFLD(SH02)
     A                                    +1'-'
     A            DSH022    R             +1REFFLD(SH02)
     A                                    53'日期:'
     A            DSH031         7  0     +1EDTWRD('   /  /  ')
     A                                    +1'-'
     A            DSH032         7  0     +1EDTWRD('   /  /  ')
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     1'員工編號'
     A                                    12'員工姓名'
     A                                    27'日　　期'
     A                                    39'調薪原因'
     A                                      SPACEA(1)
     A                                    12'底　　薪'
     A            SS021     R             25REFFLD(SS02)
     A            SS022     R             39REFFLD(SS02)
     A            SS023     R             53REFFLD(SS02)
     A            SS024     R             67REFFLD(SS02)
     A            SS025     R             81REFFLD(SS02)
     A            SS026     R             95REFFLD(SS02)
     A            SS027     R            109REFFLD(SS02)
     A            SS028     R            123REFFLD(SS02)
     A*
     A          R PH11                      SPACEB(1)
     A            SS021     R             25REFFLD(SS02)
     A            SS022     R             39REFFLD(SS02)
     A            SS023     R             53REFFLD(SS02)
     A            SS024     R             67REFFLD(SS02)
     A            SS025     R             81REFFLD(SS02)
     A            SS026     R             95REFFLD(SS02)
     A            SS027     R            109REFFLD(SS02)
     A            SS028     R            123REFFLD(SS02)
     A*
     A          R PH12                      SPACEB(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A*
     A          R PD1                       SPACEB(1)
     A  30                                 1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ------------------'
     A                                      SPACEA(1)
     A            SH02      R              2
     A            EM03      R             12
     A            SH03P     R   -1        28REFFLD(SH03)
     A                                      EDTWRD('   /  /  ')
     A            SH04      R             40
     A            SH05      R             43
     A          R PD2                       SPACEB(1)
     A  31                                 1'調薪前'
     A  31        SH07      R             13EDTCDE(1)
     A            SD051     R             28EDTCDE(1)
     A                                      REFFLD(SD05)
     A            SD052     R             42EDTCDE(1)
     A                                      REFFLD(SD05)
     A            SD053     R             56EDTCDE(1)
     A                                      REFFLD(SD05)
     A            SD054     R             70EDTCDE(1)
     A                                      REFFLD(SD05)
     A            SD055     R             84EDTCDE(1)
     A                                      REFFLD(SD05)
     A            SD056     R             98EDTCDE(1)
     A                                      REFFLD(SD05)
     A            SD057     R            112EDTCDE(1)
     A                                      REFFLD(SD05)
     A            SD058     R            126EDTCDE(1)
     A                                      REFFLD(SD05)
     A*
     A          R PD3                       SPACEB(1)
     A  32                                 1'調薪後'
     A  32        SH08      R             13EDTCDE(1)
     A            SD061     R             28EDTCDE(1)
     A                                      REFFLD(SD06)
     A            SD062     R             42EDTCDE(1)
     A                                      REFFLD(SD06)
     A            SD063     R             56EDTCDE(1)
     A                                      REFFLD(SD06)
     A            SD064     R             70EDTCDE(1)
     A                                      REFFLD(SD06)
     A            SD065     R             84EDTCDE(1)
     A                                      REFFLD(SD06)
     A            SD066     R             98EDTCDE(1)
     A                                      REFFLD(SD06)
     A            SD067     R            112EDTCDE(1)
     A                                      REFFLD(SD06)
     A            SD068     R            126EDTCDE(1)
     A                                      REFFLD(SD06)
     A*
     A*****
     A          R PE2
     A                                      SPACEB(1)
     A                                     1'PYR302P--->報表結束'
     A                                      SPACEB(1)
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
