     A****************************************************************/
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     A*                                                              */
     A*    PROGRAM-ID   : PYA320P                                    */
     A*    PROGRAM NAME :薪資所得扣繳稅額繳款書                    */
     A*    AUTHOR       : A1226 PETER                                */
     A*    CREATE DATE  : 86/01/20                                   */
     A*    UPDATE DATE  : 89/04/06 A1274 EVA                         */
     A*    SYSTEM       :人事薪資系統                              */
     A****************************************************************/
     A                                      REF(PYRF)
     A*--------------------------------------------------------------**
     A          R PH1                       SKIPB(3)
     A*
     A                                     1' '
     A                                      SPACEA(1)
     A*
     A                                    22'<<薪資及各類所得扣繳稅額繳款書>>'
     A                                      SPACEA(3)
     A*
     A                                     1'********************+
     A                                       ********************+
     A                                       ********************+
     A                                       ********************'
     A                                      SPACEA(1)
     A*
     A                                     1'所得年月:'
     A            DYM            5  0     +1EDTWRD('0   /  ')
     A                                    60'製表日期:'
     A            DDATE          6  0     +1EDTCDE(Y)
     A                                      SPACEA(1)
     A*
     A                                     1'員工編號:'
     A            DPH021    R             +1REFFLD(PH02 PYPHPF)
     A                                    +1'~'
     A            DPH022    R             +1REFFLD(PH02 PYPHPF)
     A            PSEL          20        60
     A                                      SPACEA(1)
     A*
     A                                     1'********************+
     A                                       ********************+
     A                                       ********************+
     A                                       ********************'
     A                                      SPACEA(1)
     A*
     A                                     2' '
     A                                      SPACEA(3)
     A*
     A                                    25'**薪資所得扣繳稅額繳款書**'
     A                                      SPACEA(1)
     A*
     A                                     2' '
     A                                      SPACEA(2)
     A*
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*
     A                                    36'員工人數'
     A                                    46'年　月'
     A                                    54'給付所得總額'
     A                                    70'應扣繳稅額'
     A                                      SPACEA(1)
     A*
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*
     A                                     1'固定薪資按扣繳稅額表扣繳'
     A            W32011         4  0     40EDTCDE(1)
     A            W32012         5  0     47EDTWRD('   /  ')
     A            W32013         8  0     57EDTCDE(1)
     A            W32014         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'非固定薪資及兼職薪資一律按6%扣+
     A                                      繳'
     A            W32021         4  0     40EDTCDE(1)
     A            W32022         5  0     47EDTWRD('   /  ')
     A            W32023         8  0     57EDTCDE(1)
     A            W32024         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'給付中華民國境內居住之個人之薪資+
     A                                      選'
     A                                      SPACEA(1)
     A                                     1'擇按10%扣繳'
     A            W32031         4  0     40EDTCDE(1)
     A            W32032         5  0     47EDTWRD('   /  ')
     A            W32033         8  0     57EDTCDE(1)
     A            W32034         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'給付非中華民國境內居住之個人薪資+
     A                                      按'
     A                                      SPACEA(1)
     A                                     1' 20%扣繳'
     A            W32041         4  0     40EDTCDE(1)
     A            W32042         5  0     47EDTWRD('   /  ')
     A            W32043         8  0     57EDTCDE(1)
     A            W32044         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'免　扣　繳　人　數'
     A            W32051         4  0     40EDTCDE(1)
     A            W32052         5  0     47EDTWRD('   /  ')
     A            W32053         8  0     57EDTCDE(1)
     A            W32054         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A                                     1'合　　　　計:'
     A            PT11           4  0     40EDTCDE(1)
     A            PTOT1          9  0     56EDTCDE(1)
     A            PTOT2          9  0     70EDTCDE(1)
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*--------------------------------------------------------------**
     A                                     2' '
     A                                      SPACEA(3)
     A*
     A                                    25'**各類所得扣繳稅額繳款書**'
     A                                      SPACEA(1)
     A*
     A                                     2' '
     A                                      SPACEA(2)
     A*
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*
     A                                     1'所得類別'
     A                                    36'員工人數'
     A                                    46'年　月'
     A                                    54'給付所得總額'
     A                                    70'應扣繳稅額'
     A                                      SPACEA(1)
     A*
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*
     A                                     1'５１：租賃'
     A            W320A1         4  0     40EDTCDE(1)
     A            W320A2         5  0     47EDTWRD('   /  ')
     A            W320A3         8  0     57EDTCDE(1)
     A            W320A4         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'５Ｘ：其他利息( 5A/5B/5C/5D/5E )'
     A            W320B1         4  0     40EDTCDE(1)
     A            W320B2         5  0     47EDTWRD('   /  ')
     A            W320B3         8  0     57EDTCDE(1)
     A            W320B4         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'５３：權利金'
     A            W320C1         4  0     40EDTCDE(1)
     A            W320C2         5  0     47EDTWRD('   /  ')
     A            W320C3         8  0     57EDTCDE(1)
     A            W320C4         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'５４：盈餘'
     A            W320D1         4  0     40EDTCDE(1)
     A            W320D2         5  0     47EDTWRD('   /  ')
     A            W320D3         8  0     57EDTCDE(1)
     A            W320D4         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'９Ａ：執行業務報酬'
     A            W320E1         4  0     40EDTCDE(1)
     A            W320E2         5  0     47EDTWRD('   /  ')
     A            W320E3         8  0     57EDTCDE(1)
     A            W320E4         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'９Ｂ：稿費'
     A            W320F1         4  0     40EDTCDE(1)
     A            W320F2         5  0     47EDTWRD('   /  ')
     A            W320F3         8  0     57EDTCDE(1)
     A            W320F4         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'９１：競技競賽及機會中獎獎金'
     A            W320G1         4  0     40EDTCDE(1)
     A            W320G2         5  0     47EDTWRD('   /  ')
     A            W320G3         8  0     57EDTCDE(1)
     A            W320G4         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'９２：其他所得'
     A            W320H1         4  0     40EDTCDE(1)
     A            W320H2         5  0     47EDTWRD('   /  ')
     A            W320H3         8  0     57EDTCDE(1)
     A            W320H4         8  0     71EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A                                     1'合　　　　計:'
     A            PT12           4  0     40EDTCDE(1)
     A            PTOTA          9  0     56EDTCDE(1)
     A            PTOTB          9  0     70EDTCDE(1)
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*
     A          R PT1
     A                                     1'PYR320P--->報表結束'
