     A*****************************************************************
     A*  PYR321WF  薪資及各類所得扣繳稅款繳款書－工作檔（工作地點）
     A*****************************************************************
     A          R W321
     A            W321AA         2A         COLHDG('公司')
     A*-------------------------------------------------------------***
     A**薪資所得扣繳稅額繳款書
     A*固定薪資按扣繳稅額表扣繳
     A            W32111         4S 0       COLHDG('人數一')
     A            W32112         5S 0       COLHDG('扣繳年月')
     A            W32113         8S 0       COLHDG('給付所得')
     A            W32114         8S 0       COLHDG('扣繳稅額')
     A*非固定薪資及兼職薪資一律按6%扣繳
     A            W32121         4S 0       COLHDG('人數二')
     A            W32122         5S 0       COLHDG('扣繳年月')
     A            W32123         8S 0       COLHDG('給付所得')
     A            W32124         8S 0       COLHDG('扣繳稅額')
     A*給付中華民國境內居住之個人之薪資選擇按10%扣繳
     A            W32131         4S 0       COLHDG('人數三')
     A            W32132         5S 0       COLHDG('扣繳年月')
     A            W32133         8S 0       COLHDG('給付所得')
     A            W32134         8S 0       COLHDG('扣繳稅額')
     A*給付非中華民國境內居住之個人薪資按20%扣繳
     A            W32141         4S 0       COLHDG('人數四')
     A            W32142         5S 0       COLHDG('扣繳年月')
     A            W32143         8S 0       COLHDG('給付所得')
     A            W32144         8S 0       COLHDG('扣繳稅額')
     A*免扣繳人數
     A            W32151         4S 0       COLHDG('人數五')
     A            W32152         5S 0       COLHDG('扣繳年月')
     A            W32153         8S 0       COLHDG('給付所得')
     A            W32154         8S 0       COLHDG('扣繳稅額')
     A*
     A*-------------------------------------------------------------***
     A**各類所得扣繳稅額繳款書
     A*租賃: 51
     A            W321A1         4S 0       COLHDG('人數Ａ')
     A            W321A2         5S 0       COLHDG('扣繳年月')
     A            W321A3         8S 0       COLHDG('給付所得')
     A            W321A4         8S 0       COLHDG('扣繳稅額')
     A*其他利息: 5A, 5B, 5C, 5D, 5E
     A            W321B1         4S 0       COLHDG('人數Ｂ')
     A            W321B2         5S 0       COLHDG('扣繳年月')
     A            W321B3         8S 0       COLHDG('給付所得')
     A            W321B4         8S 0       COLHDG('扣繳稅額')
     A*權利金: 53
     A            W321C1         4S 0       COLHDG('人數Ｃ')
     A            W321C2         5S 0       COLHDG('扣繳年月')
     A            W321C3         8S 0       COLHDG('給付所得')
     A            W321C4         8S 0       COLHDG('扣繳稅額')
     A*盈餘: 54
     A            W321D1         4S 0       COLHDG('人數Ｄ')
     A            W321D2         5S 0       COLHDG('扣繳年月')
     A            W321D3         8S 0       COLHDG('給付所得')
     A            W321D4         8S 0       COLHDG('扣繳稅額')
     A*執行業務報酬: 9A
     A            W321E1         4S 0       COLHDG('人數Ｅ')
     A            W321E2         5S 0       COLHDG('扣繳年月')
     A            W321E3         8S 0       COLHDG('給付所得')
     A            W321E4         8S 0       COLHDG('扣繳稅額')
     A*稿費: 9B
     A            W321F1         4S 0       COLHDG('人數Ｆ')
     A            W321F2         5S 0       COLHDG('扣繳年月')
     A            W321F3         8S 0       COLHDG('給付所得')
     A            W321F4         8S 0       COLHDG('扣繳稅額')
     A*競技競賽及機會中獎獎金: 91
     A            W321G1         4S 0       COLHDG('人數Ｇ')
     A            W321G2         5S 0       COLHDG('扣繳年月')
     A            W321G3         8S 0       COLHDG('給付所得')
     A            W321G4         8S 0       COLHDG('扣繳稅額')
     A*其他所得: 92
     A            W321H1         4S 0       COLHDG('人數Ｈ')
     A            W321H2         5S 0       COLHDG('扣繳年月')
     A            W321H3         8S 0       COLHDG('給付所得')
     A            W321H4         8S 0       COLHDG('扣繳稅額')
     A*-------------------------------------------------------------***
     A*工作地點:EM130
     A            W321PA         5          COLHDG('工作地點')
     A*
     A          K W321AA
     A          K W321PA
