     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : PYR335D                                    *
     A*    PROGRAM NAME :薪資差異明細表-員工
     A*    AUTHOR       : A1266 HANK                                 *
     A*    CREATE DATE  : 89/11/03                                   *
     A*    UPDATE DATE  : 90/05/21 A1274 EVA                         *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A                                      REF(PYRF)
     A*------------------------------------------------------------***
     A          R PH1
     A                                      SKIPB(002)
     A                                      SPACEA(001)
     A            CM03      R             83
     A                                    86
     A                                      '薪資差異明細表－員工 '
     A                                      SPACEB(001)
     A                                     1
     A                                      '部門:'
     A                                      SPACEB(003)
     A            DEM04S         7        +1
     A                                    +1
     A                                      '-'
     A            DEM04E         7        +1
     A                                   168
     A                                      '日期:'
     A
     A            DDATE          6  0    176EDTWRD('0  /  /  ')
     A                                   185
     A                                      '頁次:'
     A                                   193
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                     1
     A                                      '員工:'
     A                                      SPACEB(001)
     A            DEM02S    R             +1
     A                                      REFFLD(EM02)
     A                                    +1
     A                                      '-'
     A            DEM02E    R             +1
     A                                      REFFLD(EM02)
     A                                    55
     A                                      '計薪年月:'
     A            PYME           4  0     67
     A                                      EDTWRD('0  /  ')
     A                                   105
     A                                      '對照年月:'
     A            PYMS           4  0    117
     A                                      EDTWRD('0  /  ')
     A                                   168
     A                                      '時間:'
     A                                   176
     A                                      TIME
     A                                      EDTWRD('  :  :  ')
     A                                   186
     A                                      '<PYR335P>'
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========================'
     A                                      SPACEB(001)
     A*
     A                                     1'部門'
     A                                      SPACEB(001)
     A*                                   20'職等'
     A                                    26'職　　稱'
     A                                    40'員工編號'
     A                                    55'入社日期'
     A                                    65'底　　薪'
     A                                    75'主管加給'
     A                                    85'職務加給'
     A                                    95'交通津貼'
     A                                   105'午餐津貼'
     A                                   115'安全津貼'
     A                                   125'特別津貼'
     A                                   135'電話津貼'
     A                                   145'休假代金'
     A                                   155'事假扣款'
     A                                   166'病假扣款'
     A                                   177'合　　計'
     A                                   189'差　　異'
     A*
     A                                    40'員工姓名'
     A                                      SPACEB(001)
     A                                    55'離職日期'
     A*
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========================'
     A                                      SPACEB(001)
     A*------------------------------------------------------------***
     A          R PD1
     A                                      SPACEB(001)
     A            EM041     R              1REFFLD(EM041 PYEMPF)
     A            EM042     R              2REFFLD(EM042 PYEMPF)
     A            EM043     R              3REFFLD(EM043 PYEMPF)
     A            EM044     R              4REFFLD(EM044 PYEMPF)
     A            EM04N         16         8
     A*           EM06      R             23
     A            EM05N         14        26
     A            EM02      R             41REFFLD(EM02 PYEMPF)
     A            PEM13          6  0     55
     A                                      EDTWRD('0  /  /  ')
     A            A01            6  0     67
     A                                      EDTCDE(1)
     A            A02            6  0     77
     A                                      EDTCDE(1)
     A            A03            6  0     87
     A                                      EDTCDE(1)
     A            A04            6  0     97
     A                                      EDTCDE(1)
     A            A05            6  0    107
     A                                      EDTCDE(1)
     A            A06            6  0    117
     A                                      EDTCDE(1)
     A            A07            6  0    127
     A                                      EDTCDE(1)
     A            A08            6  0    137
     A                                      EDTCDE(1)
     A            A09            6  0    147
     A                                      EDTCDE(1)
     A            A10            6  0    157
     A                                      EDTCDE(1)
     A            A11            6  0    168
     A                                      EDTCDE(1)
     A            ATT            7  0    177
     A                                      EDTCDE(1)
     A            ADD            7  0    189
     A                                      EDTCDE(J)
     A*
     A            EM04B          2         3
     A                                      SPACEB(001)
     A            EM04NB        16         6
     A            EM06B     R             23
     A                                      REFFLD(EM06)
     A            EM05NB        14        26
     A            EM03      R             40REFFLD(EM03 PYEMPF)
     A  90        PEM19          6  0     55
     A                                      EDTWRD('0  /  /  ')
     A            B01            6  0     67
     A                                      EDTCDE(1)
     A            B02            6  0     77
     A                                      EDTCDE(1)
     A            B03            6  0     87
     A                                      EDTCDE(1)
     A            B04            6  0     97
     A                                      EDTCDE(1)
     A            B05            6  0    107
     A                                      EDTCDE(1)
     A            B06            6  0    117
     A                                      EDTCDE(1)
     A            B07            6  0    127
     A                                      EDTCDE(1)
     A            B08            6  0    137
     A                                      EDTCDE(1)
     A            B09            6  0    147
     A                                      EDTCDE(1)
     A            B10            6  0    157
     A                                      EDTCDE(1)
     A            B11            6  0    168
     A                                      EDTCDE(1)
     A            BTT            7  0    177
     A                                      EDTCDE(1)
     A*------------------------------------------------------------***
     A          R PD2
     A                                      SPACEB(001)
     A*
     A            EM04C          2         3
     A                                      SPACEB(001)
     A            EM04CB        16         6
     A            EM06C     R             23
     A                                      REFFLD(EM06)
     A            EM05CB        14        26
     A            EM03      R             40REFFLD(EM03 PYEMPF)
     A*------------------------------------------------------------***
     A          R PT0
     A                                      SPACEB(001)
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========================'
     A                                      SPACEB(001)
     A*
     A                                    26'公司總計：'
     A                                      SPACEB(001)
     A            C01            7  0     65EDTCDE(1)
     A            C02            7  0     75EDTCDE(1)
     A            C03            7  0     85EDTCDE(1)
     A            C04            7  0     95EDTCDE(1)
     A            C05            7  0    105EDTCDE(1)
     A            C06            7  0    115EDTCDE(1)
     A            C07            7  0    125EDTCDE(1)
     A            C08            7  0    135EDTCDE(1)
     A            C09            7  0    145EDTCDE(1)
     A            C10            7  0    155EDTCDE(1)
     A            C11            7  0    166EDTCDE(1)
     A            CTT            8  0    176EDTCDE(1)
     A            CDD            8  0    188EDTCDE(J)
     A*
     A            D01            7  0     65EDTCDE(1)
     A                                      SPACEB(001)
     A            D02            7  0     75EDTCDE(1)
     A            D03            7  0     85EDTCDE(1)
     A            D04            7  0     95EDTCDE(1)
     A            D05            7  0    105EDTCDE(1)
     A            D06            7  0    115EDTCDE(1)
     A            D07            7  0    125EDTCDE(1)
     A            D08            7  0    135EDTCDE(1)
     A            D09            7  0    145EDTCDE(1)
     A            D10            7  0    155EDTCDE(1)
     A            D11            7  0    166EDTCDE(1)
     A            DTT            8  0    176EDTCDE(1)
     A*------------------------------------------------------------***
     A          R PE9
     A                                      SPACEB(001)
     A                                    16
     A                                      '無符合列印範圍之資料'
