     A*%%***********************************************************************
     A*%%TS  RD  20060110  121513  PPSPGMRYK   REL-V4R4M0  5769-PW1
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A****************************************************************
     A*    PRTF NAME    : PYR401P                                    *
     A*    PROGRAM NAME : PYR401                                     *
     A*    AUTHOR       : A1138  DAVID.                              *
     A*    CREATE DATE  : 81/03/05                                   *
     A*    UPDATE DATE  : 90/05/16 KLAUS                             *
     A*    SYSTEM       : MIRS                                       *
     A*    REMARK       :公司獎金資料列印                          *
     A****************************************************************
     A                                      REF(PYRF)
     A          R PH1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      SKIPB(002)
     A            CM03      R              1
     A                                    62
     A                                      '日期:'
     A            DDATE          6  0     70
     A                                      EDTCDE(Y)
     A                                    79
     A                                      '頁次:'
     A                                    87
     A                                      PAGNBR
     A                                      SPACEA(001)
     A                                     1
     A                                      '公司獎金薪資資料表:'
     A            SS02      R             +1
     A                                      REFFLD(SS02)
     A                                    62
     A                                      '時間:'
     A                                    70
     A                                      TIME
     A                                      EDTWRD('  :  :  ')
     A                                    80
     A                                      '<PYR401P>'
     A                                      SPACEA(002)
     A                                     1
     A                                      '部門代號:'
     A            DEM041         7        13
     A                                    +1
     A                                      '-'
     A            DEM042         7        +1
     A                                      SPACEA(001)
     A                                     1
     A                                      '獎金年度:'
     A            DPB051         3  0     +1
     A*                                     EDTWRD('   /  /  ')
     A*                                   +1'-'
     A*           DPB052         7  0     +1
     A*                                     EDTWRD('   /  /  ')
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ============================='
     A                                      SPACEA(001)
     A                                     1
     A                                      '部門編號'
     A                                      SPACEB(003)
     A                                    14
     A                                      '部門名稱'
     A                                    33
     A                                      '金　　額'
     A                                    47
     A                                      '稅　　額'
     A                                    61
     A                                      '淨  額'
     A                                    76
     A                                      '年休補發'
     A                                    88
     A                                      '實領總額'
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ============================'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 002
     A*%%CL 001
     A*%%CL 001
     A*%%CL 004
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A          R PD1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A  71        EM041     R              2
     A  71        EM042     R              3
     A  71        EM043     R              4
     A  71        EM044     R              5
     A  71        DP02      R             12
     A                                      REFFLD(DP02 PYDPPF)
     A            DPB06          9  0     31
     A                                      EDTCDE(1)
     A            DPB08          9  0     45
     A                                      EDTCDE(1)
     A            DPB11          9  0     59
     A                                      EDTCDE(1)
     A            DPB06F         9  0     73
     A                                      EDTCDE(N)
     A            DPB12          9  0     87
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A*
     A*-------------------------------------------------------------***
     A          R PT1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      SPACEB(002)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      ----------------------------'
     A                                      SPACEA(001)
     A                                     3
     A                                      '獎金類別小計:'
     A                                      SPACEB(002)
     A*           PT11           3  0     21EDTCDE(3)
     A*                                   25'人'
     A            PT12           9  0     31
     A                                      EDTCDE(1)
     A            PT13           9  0     45
     A                                      EDTCDE(1)
     A            PT18           9  0     59
     A                                      EDTCDE(1)
     A            PT16           9  0     73
     A                                      EDTCDE(N)
     A            PT17           9  0     87
     A                                      EDTCDE(1)
     A                                      SPACEA(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 003
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A*-------------------------------------------------------------***
     A          R PT3
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      ---------------------------'
     A                                      SPACEA(001)
     A                                     1
     A                                      '總   計->'
     A                                      SPACEB(001)
     A*           PT31           3  0     21EDTCDE(3)
     A*                                   25'人'
     A            PT32           9  0     31
     A                                      EDTCDE(1)
     A            PT33           9  0     45
     A                                      EDTCDE(1)
     A            PT38           9  0     59
     A                                      EDTCDE(1)
     A            PT36           9  0     73
     A                                      EDTCDE(N)
     A            PT37           9  0     87
     A                                      EDTCDE(1)
     A                                      SPACEA(002)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 002
     A*%%CL 002
     A*%%***********************************************************************
     A*
     A*---------------------------------------------------------------*
     A          R PE2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ============================'
     A                                    10
     A                                      '總經理'
     A                                      SPACEB(001)
     A                                    33
     A                                      '廠　長'
     A                                    56
     A                                      '會計'
     A                                    81
     A                                      '覆核'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R PE9
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                    16
     A                                      '無符合列印範圍之資料'
     A*%%***********************************************************************
     A*%%SS
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(PYSLIBYK/PYR401P)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       132      *N     )
     A*%%***********************************************************************
