     A*%%TS  SD  20010208  104523  PPSPGMRYH   REL-V4R2M0  5769-PW1
     A****************************************************************/
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     A*                                                              */
     A*    PROGRAM-ID   : PYR609D                                    */
     A*    PROGRAM NAME : YYY/MM貸款扣款明細表-員工              */
     A*    AUTHOR       : WILLIAMS                                   */
     A*    CREATE DATE  : 86/01/20                                   */
     A*    UPDATE DATE  : 88/10/04 A1274 EVA                         */
     A*    SYSTEM       :人事薪資系統                              */
     A****************************************************************/
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/PYRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A*  01/02/05  19:46:25    A1084       REL-R02M00  5728-PW1
     A          R DSPD1
     A*%%TS  SD  20010208  104523  PPSPGMRYH   REL-V4R2M0  5769-PW1
     A                                      CSRLOC(#LIN       #COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'<PYR609D>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            $DATE          6Y 0O  1 72EDTWRD('0  /  /  ')
     A            $USERN        10A  O  2  2
     A                                  2 30'貸款扣款明細表-員工'
     A                                      DSPATR(RI)
     A                                  5 28'公  司　:'
     A            DLN01     R        B  5 42REFFLD(LN01)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A  32                                  DSPATR(UL)
     A N32                                  DSPATR(PR)
     A                                  6 28'部　門　:'
     A                                      DSPATR(HI)
     A            DEM04S         7   B  6 42
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  6 48'-'
     A            DEM04E         7   B  6 50
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  7 28'員工編號　:'
     A                                      DSPATR(HI)
     A            DLN02S    R        B  7 42REFFLD(EM02)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                  7 54'-'
     A            DLN02E    R        B  7 58REFFLD(EM02)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                  8 28'契約編號　:'
     A            DLN12S    R        B  8 42REFFLD(LN12)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                  8 54'-'
     A            DLN12E    R        B  8 58REFFLD(LN12)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                  9 28'貸款類別　:'
     A                                      DSPATR(HI)
     A            DLN03S    R        B  9 42REFFLD(LN03)
     A                                  9 44'-'
     A            DLN03E    R        B  9 46REFFLD(LN03)
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A                                 10 28'扣款年月　:'
     A            DYM            5  0B 10 42EDTWRD('0   /  ')
     A  66                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A                                 13 28'報表排序　:'
     A            DSOPT          1A  B 13 42
     A  67                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A                                 13 45'1.部門'
     A                                 14 45'2.員工編號'
     A                                 17  2'執行環境:'
     A            $PENV          1A  B 17 14VALUES('0' '1' '2')
     A                                 17 18'(0-查詢 1-即時 2-批次)'
     A                                 18  2'列印份數:'
     A            $CPY           3Y 0B 18 14EDTCDE(3)
     A                                      CHECK(RB)
     A                                 19  2'列表機　:'
     A            $PRTCD         2A  B 19 14
     A  27                             21 27'***請準備８０格報表紙*  **'
     A                                      DSPATR(RI)
     A  28                             21 27'*** 報表處理中，請稍候 ***'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'執行'
     A                                 23 10'PF3=回主畫面'
     A                                 23 26'PF4=欄位查詢'
     A                                 24 67'【泛太資訊】'
