     A                                      REF(PYRF)
     A          R PH1                       SKIPB(2)
     A            CM03      R              1
     A                                    48'日期:'
     A            DDATE          6  0     56EDTWRD('0  /  /  ')
     A                                    65'頁次:'
     A                                    73PAGNBR
     A                                      SPACEA(1)
     A                                    48'時間:'
     A                                    56TIME
     A                                      EDTWRD('  :  :  ')
     A                                    66'<PYR623P>'
     A                                      SPACEA(1)
     A                                     1'全民健保各級人數統計表'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     3'級　數'
     A                                    25'月投保薪資'
     A                                    49'人數'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A          R PD1                       SPACEA(1)
     A                                     3'もも　員工＝'
     A            EM02      R             +1
     A                                    +2'月投保薪資＝'
     A            E105      R             +1EDTCDE(1)
     A                                    +1'無級數'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A          R PD2                       SPACEA(1)
     A                                     1'第'
     A            PE301     R             +1EDTCDE(1)
     A                                      REFFLD(E301)
     A                                    +1'級'
     A            PE302     R             25EDTCDE(1)
     A                                      REFFLD(E302)
     A            PNUM           3  0     51EDTCDE(3)
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A*
     A          R PT1                       SPACEA(1)
     A                                    36'合　計:'
     A            TNUM           5  0     49EDTCDE(3)
     A                                    +1'人'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'PYR623P--->報表結束'
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
