     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*                                                              *
     A*    PROGRAM-ID   : PYR634D                                    *
     A*    PROGRAM NAME :健保投保額人數統計表　　　　　　          *
     A*    AUTHOR       : A1491 EASON                                *
     A*    CREATE DATE  : 95/05/10                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人事薪資管理系統                          *
     A****************************************************************
     A                                      REF(PYRF)
     A*--------------------------------------------------------------**
     A          R PH1
     A*
     A                                      SKIPB(002)
     A                                      SPACEA(001)
     A            CM03      R              1
     A                                    48
     A                                      '日期:'
     A            DDATE          6  0     56
     A                                      EDTWRD('0  /  /  ')
     A                                    65
     A                                      '頁次:'
     A                                    73
     A                                      PAGNBR
     A*
     A                                     1
     A                                      '健保投保額人數統計表'
     A                                      SPACEB(001)
     A                                    48
     A                                      '時間:'
     A                                    56
     A                                      TIME
     A                                      EDTWRD('  :  :  ')
     A                                    66
     A                                      '<PYR634P>'
     A*
     A                                     1
     A                                      '部　　門:'
     A                                      SPACEB(001)
     A            DEM04S         7        13
     A                                    19
     A                                      '-'
     A            DEM04E         7        21
     A*
     A                                     1
     A                                      '處理年月:'
     A                                      SPACEB(001)
     A            DYM            4  0     13
     A                                      EDTWRD('0  /  ')
     A                                    +1
     A                                      '(西元年)'
     A*
     A                                     1
     A                                      '+----------+------------+'
     A*                                     -+------------+'
     A                                      SPACEB(001)
     A**********************************************
     A*
     A*****     R PH2
     A                                     1
     A                                      '|投保薪資'
     A                                      SPACEB(001)
     A                                    12
     A                                      '|  本月底  |'
     A*
     A                                     1
     A                                      '|等　　級'
     A                                      SPACEB(001)
     A                                    12
     A                                      '|  人　數  |'
     A*
     A*-----------------------------------------------------
     A          R PD1
     A*
     A
     A                                     1
     A                                      '+----------+------------+'
     A                                      SPACEB(001)
     A*
     A                                     1
     A                                      '|'
     A                                      SPACEB(001)
     A            RATEE          7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUMM           5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A*-------------------------------------------------------
     A          R PT1
     A                                     1
     A                                      '+----------+------------+'
     A*                                     -+------------+'
     A                                      SPACEB(001)
     A*-------------------------------------------------------
     A*                                    1
     A*                                     '本月初（前月結算）:'
     A*                                     SPACEB(001)
     A*           N1             5  0      1
     A*                                     SPACEB(001)
     A*                                    6
     A*                                     '人'
     A*           X1             9  0     13
     A*                                     EDTWRD('   ,   ,  $0')
     A*
     A                                     1
     A                                      '本月投保薪資調整:'
     A                                      SPACEB(001)
     A            N2             5  0      1
     A                                      SPACEB(001)
     A                                     6
     A                                      '人'
     A            X2             9  0     13
     A                                      EDTWRD('   ,   ,  $0')
     A*
     A                                     1
     A                                      '本月份加保:'
     A                                      SPACEB(001)
     A            N3             5  0      1
     A                                      SPACEB(001)
     A                                     6
     A                                      '人'
     A*           X3             9  0     13
     A*                                     EDTWRD('   ,   ,  $0')
     A*
     A                                     1
     A                                      '本月份退保:'
     A                                      SPACEB(001)
     A            N4             5  0      1
     A                                      SPACEB(001)
     A                                     6
     A                                      '人'
     A*           X4             9  0     13
     A*                                     EDTWRD('   ,   ,  $0')
     A*
     A*
     A*                                    1
     A*                                     '本月投保薪資小計:'
     A*                                     SPACEB(001)
     A*           SN2            5  0      1
     A*                                     EDTCDE(2)
     A*                                     SPACEB(001)
     A*                                    7
     A*                                     '人'
     A*           SX2            9  0     14
     A*                                     EDTWRD('   ,   ,  $0')
     A*
     A                                     1
     A                                      '總人數'
     A                                      SPACEB(001)
     A            SN1            5  0     13
     A                                      EDTCDE(2)
     A                                    19
     A                                      '人'
     A                                    26
     A                                      '總金額'
     A            SX1            9  0     36
     A                                      EDTWRD('   ,   ,  $0')
     A*                                   52
     A*                                     '公司負擔保費'
     A*           SXT            9  0     67
     A*                                     EDTWRD('   ,   ,  $0')
     A*
     A*--------------------------------------------------------------**
     A          R PE9
     A                                      SPACEB(001)
     A                                    16
     A                                      '無符合列印範圍之資料'
