     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*                                                              *
     A*    PROGRAM-ID   : PYR630D                                    *
     A*    PROGRAM NAME :勞保投保額人數統計表　　　　　　          *
     A*    AUTHOR       : A1274 EVA                                  *
     A*    CREATE DATE  : 89/08/22                                   *
     A*    UPDATE DATE  : 92/02/17 A1336 KLAUS                       *
     A*    SYSTEM       :人事薪資管理系統                          *
     A****************************************************************
     A                                      REF(PYRF)
     A*--------------------------------------------------------------**
     A          R PH1
     A                                      SKIPB(002)
     A                                      SPACEA(001)
     A            CM03      R              1
     A                                    48
     A                                      '日期:'
     A            DDATE          6  0     56
     A                                      EDTWRD('0  /  /  ')
     A                                    65
     A                                      '頁次:'
     A                                    73
     A                                      PAGNBR
     A*
     A                                     1
     A                                      '勞保投保額人數統計表'
     A                                      SPACEB(001)
     A                                    48
     A                                      '時間:'
     A                                    56
     A                                      TIME
     A                                      EDTWRD('  :  :  ')
     A                                    66
     A                                      '<PYR630P>'
     A*
     A                                     1
     A                                      '部　　門:'
     A                                      SPACEB(001)
     A            DEM04S         7        13
     A                                    21
     A                                      '-'
     A            DEM04E         7        23
     A*
     A                                     1
     A                                      '處理年月:'
     A                                      SPACEB(001)
     A            DYM            4  0     13
     A                                      EDTWRD('0  /  ')
     A                                    +1
     A                                      '(西元年)'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A*
     A                                     1
     A                                      '|投保薪資'
     A                                      SPACEB(001)
     A                                    12
     A                                      '|  本月底'
     A                                    25
     A                                      '|投保薪資'
     A                                    36
     A                                      '|　本月底  |'
     A*
     A                                     1
     A                                      '|等　　級'
     A                                      SPACEB(001)
     A                                    12
     A                                      '|  人　數'
     A                                    25
     A                                      '|等　　級'
     A                                    36
     A                                      '|  人　數  |'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A*
     A                                     1
     A                                      '|'
     A                                      SPACEB(001)
     A            RATE01         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM01          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE21         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM21          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A*
     A                                     1
     A                                      '|'
     A                                      SPACEB(001)
     A            RATE02         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM02          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE22         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM22          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A*
     A                                     1
     A                                      '|'
     A                                      SPACEB(001)
     A            RATE03         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM03          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE23         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM23          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A*
     A                                     1
     A                                      '|'
     A                                      SPACEB(001)
     A            RATE04         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM04          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE24         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM24          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A*
     A                                     1
     A                                      '|'
     A                                      SPACEB(001)
     A            RATE05         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM05          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE25         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM25          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A*
     A                                     1
     A                                      '|'
     A                                      SPACEB(001)
     A            RATE06         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM06          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE26         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM26          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A*
     A                                     1
     A                                      '|'
     A                                      SPACEB(001)
     A            RATE07         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM07          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE27         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM27          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A*
     A                                     1
     A                                      '|'
     A                                      SPACEB(001)
     A            RATE08         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM08          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE28         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM28          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A*
     A                                     1
     A                                      '|'
     A                                      SPACEB(001)
     A            RATE09         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM09          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE29         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM29          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A*
     A                                     1
     A                                      '|'
     A                                      SPACEB(001)
     A            RATE10         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM10          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE30         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM30          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A*
     A                                     1
     A                                      '|'
     A                                      SPACEB(001)
     A            RATE11         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM11          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE31         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM31          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A*
     A                                     1
     A                                      '|'
     A                                      SPACEB(001)
     A            RATE12         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM12          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE32         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM32          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A*
     A                                     1
     A                                      '|'
     A                                      SPACEB(001)
     A            RATE13         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM13          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE33         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM33          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A*
     A                                     1
     A                                      '|'
     A                                      SPACEB(001)
     A            RATE14         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM14          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE34         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM34          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A*
     A                                     1
     A                                      '|'
     A                                      SPACEB(001)
     A            RATE15         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM15          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE35         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM35          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A*
     A*                                   52
     A*                                     '本月初（前月結算）:'
     A*           N1             5  0     55
     A                                      SPACEA(001)
     A*                                   61
     A*                                     '人'
     A*           X1             9  0     67
     A*                                     EDTWRD('   ,   ,  $0')
     A*
     A                                     1
     A                                      '|'
     A            RATE16         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM16          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE36         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM36          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A                                    52
     A                                      '本月投保薪資調整:'
     A            N2             5  0     55
     A                                      SPACEB(001)
     A                                    61
     A                                      '人'
     A*           X2             9  0     67
     A*                                     EDTWRD('   ,   ,  $0')
     A*
     A                                     1
     A                                      '|'
     A            RATE17         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM17          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE37         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM37          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A                                    52
     A                                      '本月份加保:'
     A            N3             5  0     55
     A                                      SPACEB(001)
     A                                    61
     A                                      '人'
     A*           X3             9  0     67
     A*                                     EDTWRD('   ,   ,  $0')
     A*
     A                                     1
     A                                      '|'
     A            RATE18         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM18          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE38         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM38          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A                                    52
     A                                      '本月份退保:'
     A            N4             5  0     55
     A                                      SPACEB(001)
     A                                    61
     A                                      '人'
     A*           X4             9  0     67
     A*                                     EDTWRD('   ,   ,  $0')
     A*
     A                                     1
     A                                      '|'
     A            RATE19         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM19          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE39         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM39          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A*                                   52
     A*                                     '本月投保薪資小計:'
     A*           SN2            5  0     55
     A*                                     EDTCDE(2)
     A                                      SPACEA(001)
     A*                                   61
     A*                                     '人'
     A*           SX2            9  0     67
     A*                                     EDTWRD('   ,   ,  $0')
     A*
     A                                     1
     A                                      '|'
     A            RATE20         7  0      2
     A                                      EDTCDE(2)
     A                                    12
     A                                      '|'
     A            NUM20          5  0     16
     A                                      EDTCDE(2)
     A                                    25
     A                                      '|'
     A            RATE40         7  0     26
     A                                      EDTCDE(2)
     A                                    36
     A                                      '|'
     A            NUM40          5  0     40
     A                                      EDTCDE(2)
     A                                    49
     A                                      '|'
     A*
     A                                     1
     A                                      '+----------+------------+----------
     A                                      -+------------+'
     A                                      SPACEB(001)
     A*                                   52
     A*                                     '各區職業傷害保險金額'
     A*
     A                                     3
     A                                      '總人數'
     A                                      SPACEB(001)
     A            SN1            5  0     13
     A                                      EDTCDE(2)
     A                                    19
     A                                      '人'
     A                                    26
     A                                      '總金額'
     A            SX1            9  0     36
     A                                      EDTWRD('   ,   ,  $0')
     A*           SXT            9  0     61
     A*                                     EDTWRD('   ,   ,  $0')
     A*
     A*--------------------------------------------------------------**
     A          R PE9
     A                                      SPACEB(001)
     A                                    16
     A                                      '無符合列印範圍之資料'
