     A****************************************************************
     A*    PRTF NAME    : PYR703P                                    *
     A*    PROGRAM NAME : PYR7030C                                   *
     A*    AUTHOR       : A1037  JOSNSON                             *
     A*    CREATE DATE  : 81/03/25                                   *
     A*    UPDATE DATE  : 90/04/16 A1274 EVA                         *
     A*    SYSTEM       : MIRS                                       *
     A*    REMARK       :各類所得扣繳暨免扣繳憑單                  *
     A****************************************************************
     A                                      REF(PYRF)
     A          R PH1                       SKIPB(6)
     A            PTD09     R             72REFFLD(TD09 PYTDPF)
     A                                      SPACEA(3)
     A            TD17      R             21
     A            CM12      R             41
     A            TD02      R             56
     A            TD03      R             60
     A            TD04      R             89
     A                                      SPACEA(3)
     A            TD05      R             20
     A                                    49'V'
     A N31        TD09      R             72
     A                                      SPACEA(2)
     A  31        TD12      R             81
     A                                      SPACEA(2)
     A            TD13      R             30
     A                                      SPACEA(2)
     A            TD14      R             30
     A                                      SPACEA(4)
     A            TD151W         2  0     20
     A            TD152          2  0     28
     A            TD161W         2  0     46
     A            TD162          2  0     54
     A            TD01P          2  0     69
     A                                      SPACEA(3)
     A            TD07      R             17EDTCDE(1)
     A            TD08      R             47EDTCDE(1)
     A            TD07P     R             74REFFLD(TD07)
     A                                      EDTCDE(1)
     A                                      SPACEA(4)
     A            CM03      R             23
     A                                      SPACEA(2)
     A            CM08      R             23
     A                                      SPACEA(2)
     A            CM10      R             23CHRSIZ(2)
