     A****************************************************************
     A*    PRTF NAME    : PYR7034P                                   *
     A*    PROGRAM NAME : PYR7030C                                   *
     A*    AUTHOR       : A1386  SHARON                              *
     A*    CREATE DATE  : 94/01/19                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : HR                                         *
     A*    REMARK       :各類所得扣繳暨免扣繳憑單                  *
     A****************************************************************
     A                                      REF(PYRF)
     A          R PH1                       SKIPB(8)
     A                                    16'3'
     A            TD03P          4A       22
     A                                      SPACEA(3)
     A                                    16'V'
     A                                      SPACEA(4)
     A            TD13      R             21
     A            TD05      R             54
     A                                      SPACEA(2)
     A            TD14      R             21
     A                                      SPACEA(4)
     A            TD151W         2  0     11
     A            TD152          2  0     16
     A            TD07      R             33EDTCDE(1)
     A            TD08      R             50EDTCDE(1)
     A            TD07P     R             64REFFLD(TD07)
     A                                      EDTCDE(1)
     A                                      SPACEA(1)
     A            TD01P          2  0     23
     A                                      SPACEA(1)
     A            TD161W         2  0     11
     A            TD162          2  0     16
