     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*                                                              *
     A*    PROGRAM-ID   : PYR710P                                    *
     A*    PROGRAM NAME :各類所得扣繳資料表－彙總　　              *
     A*    AUTHOR       : A1274 EVA                                  *
     A*    CREATE DATE  : 90/07/26                                   *
     A*    UPDATE DATE  : 90/08/06 A1274 EVA                         *
     A*    SYSTEM       :人事薪資                                  *
     A****************************************************************
     A                                      REF(PYRF)
     A*------------------------------------------------------------***
     A          R PH1                       SKIPB(2)
     A            CM03      R              1
     A                                      SPACEA(1)
     A*
     A            DYEAR          3  0      2
     A                                    +1'各類所得扣繳資料表－彙總'
     A                                      SPACEA(2)
     A*
     A                                     1'作帳單位:'
     A            DEM041         7        13
     A                                    +1'-'
     A            DEM042         7        +1
     A                                    50'身份證號:'
     A            DTB051    R             +1REFFLD(TB05 PYTBPF)
     A                                    +1'-'
     A            DTB052    R             +1REFFLD(TB05 PYTBPF)
     A                                   161'日期:'
     A            DDATE          6  0    169
     A                                      EDTWRD('0  /  /  ')
     A                                   178'頁次:'
     A                                   186PAGNBR
     A                                      SPACEA(1)
     A*
     A                                     1'單　　位:'
     A            TB19      R             +1REFFLD(TB19 PYTBPF)
     A            DP02      R             +1REFFLD(DP02 PYDPPF)
     A                                    50'所得類別:'
     A            TB04      R             +1REFFLD(TB04 PYTBPF)
     A            DTB04N        24O       +1
     A                                   161'時間:'
     A                                   169TIME
     A                                      EDTWRD('  :  :  ')
     A                                   178'<PYR710P>'
     A                                      SPACEA(1)
     A*
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==================='
     A                                      SPACEA(1)
     A*
     A                                     1'姓　　名'
     A                                      SPACEB(1)
     A                                    20'身份證號'
     A                                    44'一　月'
     A                                    54'二　月'
     A                                    64'三　月'
     A                                    74'四　月'
     A                                    84'五　月'
     A                                    94'六　月'
     A                                   104'七　月'
     A                                   114'八　月'
     A                                   124'九　月'
     A                                   134'十　月'
     A                                   144'十一月'
     A                                   154'十二月'
     A                                   164'備　註'
     A                                   180'給付總額'
     A                                      SPACEA(1)
     A*
     A                                   180'扣繳稅額'
     A                                      SPACEA(1)
     A*
     A*********                          180'年度淨額'
     A*********                             SPACEA(001)
     A*
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==================='
     A*------------------------------------------------------------***
     A          R PD1                       SPACEB(001)
     A            TB13      R              1
     A            TB05      R             20
     A            PD11          10  0     42EDTCDE(3)
     A            PD12          10  0     52EDTCDE(3)
     A            PD13          10  0     62EDTCDE(3)
     A            PD14          10  0     72EDTCDE(3)
     A            PD15          10  0     82EDTCDE(3)
     A            PD16          10  0     92EDTCDE(3)
     A            PD17          10  0    102EDTCDE(3)
     A            PD18          10  0    112EDTCDE(3)
     A            PD19          10  0    122EDTCDE(3)
     A            PD1A          10  0    132EDTCDE(3)
     A            PD1B          10  0    142EDTCDE(3)
     A            PD1C          10  0    152EDTCDE(3)
     A******      PD1D          10  0    162EDTCDE(3)
     A            PD1E          10  0    180EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A            PD21          10  0     42EDTCDE(3)
     A            PD22          10  0     52EDTCDE(3)
     A            PD23          10  0     62EDTCDE(3)
     A            PD24          10  0     72EDTCDE(3)
     A            PD25          10  0     82EDTCDE(3)
     A            PD26          10  0     92EDTCDE(3)
     A            PD27          10  0    102EDTCDE(3)
     A            PD28          10  0    112EDTCDE(3)
     A            PD29          10  0    122EDTCDE(3)
     A            PD2A          10  0    132EDTCDE(3)
     A            PD2B          10  0    142EDTCDE(3)
     A            PD2C          10  0    152EDTCDE(3)
     A*********   PD2D          10  0    162EDTCDE(3)
     A            PD2E          10  0    180EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A******      PD3E          10  0    180EDTCDE(3)
     A******                                SPACEA(1)
     A*------------------------------------------------------------***
     A          R PT1                       SPACEB(1)
     A*
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==================='
     A                                      SPACEA(1)
     A*
     A                                     2'單　位　合　計:'
     A            PD41          10  0     42EDTCDE(3)
     A            PD42          10  0     52EDTCDE(3)
     A            PD43          10  0     62EDTCDE(3)
     A            PD44          10  0     72EDTCDE(3)
     A            PD45          10  0     82EDTCDE(3)
     A            PD46          10  0     92EDTCDE(3)
     A            PD47          10  0    102EDTCDE(3)
     A            PD48          10  0    112EDTCDE(3)
     A            PD49          10  0    122EDTCDE(3)
     A            PD4A          10  0    132EDTCDE(3)
     A            PD4B          10  0    142EDTCDE(3)
     A            PD4C          10  0    152EDTCDE(3)
     A********    PD4D          10  0    162EDTCDE(3)
     A            PD4E          10  0    180EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A            PD51          10  0     42EDTCDE(3)
     A            PD52          10  0     52EDTCDE(3)
     A            PD53          10  0     62EDTCDE(3)
     A            PD54          10  0     72EDTCDE(3)
     A            PD55          10  0     82EDTCDE(3)
     A            PD56          10  0     92EDTCDE(3)
     A            PD57          10  0    102EDTCDE(3)
     A            PD58          10  0    112EDTCDE(3)
     A            PD59          10  0    122EDTCDE(3)
     A            PD5A          10  0    132EDTCDE(3)
     A            PD5B          10  0    142EDTCDE(3)
     A            PD5C          10  0    152EDTCDE(3)
     A********    PD5D          10  0    162EDTCDE(3)
     A            PD5E          10  0    180EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A*****       PD6E          10  0    180EDTCDE(3)
     A*****                                 SPACEA(1)
     A*------------------------------------------------------------***
     A          R PT2                       SPACEB(001)
     A*
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==================='
     A                                      SPACEA(1)
     A*
     A                                     2'公　司　總　計:'
     A            PD71          10  0     42EDTCDE(3)
     A            PD72          10  0     52EDTCDE(3)
     A            PD73          10  0     62EDTCDE(3)
     A            PD74          10  0     72EDTCDE(3)
     A            PD75          10  0     82EDTCDE(3)
     A            PD76          10  0     92EDTCDE(3)
     A            PD77          10  0    102EDTCDE(3)
     A            PD78          10  0    112EDTCDE(3)
     A            PD79          10  0    122EDTCDE(3)
     A            PD7A          10  0    132EDTCDE(3)
     A            PD7B          10  0    142EDTCDE(3)
     A            PD7C          10  0    152EDTCDE(3)
     A*********   PD7D          10  0    162EDTCDE(3)
     A            PD7E          10  0    180EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A            PD81          10  0     42EDTCDE(3)
     A            PD82          10  0     52EDTCDE(3)
     A            PD83          10  0     62EDTCDE(3)
     A            PD84          10  0     72EDTCDE(3)
     A            PD85          10  0     82EDTCDE(3)
     A            PD86          10  0     92EDTCDE(3)
     A            PD87          10  0    102EDTCDE(3)
     A            PD88          10  0    112EDTCDE(3)
     A            PD89          10  0    122EDTCDE(3)
     A            PD8A          10  0    132EDTCDE(3)
     A            PD8B          10  0    142EDTCDE(3)
     A            PD8C          10  0    152EDTCDE(3)
     A*********   PD8D          10  0    162EDTCDE(3)
     A            PD8E          10  0    180EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A*****       PD9E          10  0    180EDTCDE(3)
     A*****                                 SPACEA(1)
     A*
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==================='
     A                                      SPACEA(001)
     A*
     A                                     1'PYR710P--->報表結束'
     A                                      SPACEA(001)
     A*------------------------------------------------------------***
     A          R PE9
     A                                      SPACEB(001)
     A                                    16'無符合列印範圍之資料'
