     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*                                                              *
     A*    PROGRAM-ID   : PYR708P                                    *
     A*    PROGRAM NAME :年度應稅所得明細表－員工                  *
     A*    AUTHOR       : A1274 EVA                                  *
     A*    CREATE DATE  : 89/12/19                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人事薪資                                  *
     A****************************************************************
     A                                      REF(PYRF)
     A*------------------------------------------------------------***
     A          R PH1                       SKIPB(2)
     A            CM03      R              1
     A                                      SPACEA(1)
     A*
     A            DYEAR          2  0      2EDTWRD('0  ')
     A                                    +1'年度應稅所得明細表－員工'
     A                                      SPACEA(2)
     A*
     A                                     1'部門編號:'
     A            DEM041         7        13
     A                                    +1'-'
     A            DEM042         7        +1
     A                                    50'員工編號:'
     A            DEM021    R             +1REFFLD(EM02 PYEMPF)
     A                                    +1'-'
     A            DEM022    R             +1REFFLD(EM02 PYEMPF)
     A                                   161'日期:'
     A            DDATE          6  0    169
     A                                      EDTWRD('0  /  /  ')
     A                                   178'頁次:'
     A                                   186PAGNBR
     A                                      SPACEA(1)
     A*
     A                                     1'部　　門:'
     A            EM041     R             +1
     A            EM042     R             +1
     A            EM043     R             +1
     A            EM044     R             +1
     A            DP02      R             +1REFFLD(DP02 PYDPPF)
     A                                   161'時間:'
     A                                   169TIME
     A                                      EDTWRD('  :  :  ')
     A                                   178'<PYR708P>'
     A                                      SPACEA(2)
     A*
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==================='
     A                                      SPACEA(1)
     A*
     A                                     1'員工編號'
     A                                    15'員工姓名'
     A                                    44'十二月'
     A                                    54'一　月'
     A                                    64'二　月'
     A                                    74'三　月'
     A                                    84'四　月'
     A                                    94'五　月'
     A                                   104'六　月'
     A                                   114'七　月'
     A                                   124'八　月'
     A                                   134'九　月'
     A                                   144'十月'
     A                                   154'十一月'
     A                                   164'獎　金'
     A                                   180'應稅所得'
     A                                      SPACEA(1)
     A*
     A                                    44'所得稅'
     A                                    54'所得稅'
     A                                    64'所得稅'
     A                                    74'所得稅'
     A                                    84'所得稅'
     A                                    94'所得稅'
     A                                   104'所得稅'
     A                                   114'所得稅'
     A                                   124'所得稅'
     A                                   134'所得稅'
     A                                   144'所得稅'
     A                                   154'所得稅'
     A                                   164'稅　額'
     A                                   180'稅金總額'
     A                                      SPACEA(1)
     A*
     A                                   180'年度淨額'
     A                                      SPACEA(001)
     A*
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==================='
     A*------------------------------------------------------------***
     A          R PD1                       SPACEB(001)
     A            EM02      R              2
     A            EM03      R             15
     A            PD11          10  0     42EDTCDE(3)
     A            PD12          10  0     52EDTCDE(3)
     A            PD13          10  0     62EDTCDE(3)
     A            PD14          10  0     72EDTCDE(3)
     A            PD15          10  0     82EDTCDE(3)
     A            PD16          10  0     92EDTCDE(3)
     A            PD17          10  0    102EDTCDE(3)
     A            PD18          10  0    112EDTCDE(3)
     A            PD19          10  0    122EDTCDE(3)
     A            PD1A          10  0    132EDTCDE(3)
     A            PD1B          10  0    142EDTCDE(3)
     A            PD1C          10  0    152EDTCDE(3)
     A            PD1D          10  0    162EDTCDE(3)
     A            PD1E          10  0    180EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A            PD21          10  0     42EDTCDE(3)
     A            PD22          10  0     52EDTCDE(3)
     A            PD23          10  0     62EDTCDE(3)
     A            PD24          10  0     72EDTCDE(3)
     A            PD25          10  0     82EDTCDE(3)
     A            PD26          10  0     92EDTCDE(3)
     A            PD27          10  0    102EDTCDE(3)
     A            PD28          10  0    112EDTCDE(3)
     A            PD29          10  0    122EDTCDE(3)
     A            PD2A          10  0    132EDTCDE(3)
     A            PD2B          10  0    142EDTCDE(3)
     A            PD2C          10  0    152EDTCDE(3)
     A            PD2D          10  0    162EDTCDE(3)
     A            PD2E          10  0    180EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A            PD3E          10  0    180EDTCDE(3)
     A                                      SPACEA(1)
     A*------------------------------------------------------------***
     A          R PT1                       SPACEB(1)
     A*
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==================='
     A                                      SPACEA(1)
     A*
     A                                     2'部　門　合　計:'
     A            PD41          10  0     42EDTCDE(3)
     A            PD42          10  0     52EDTCDE(3)
     A            PD43          10  0     62EDTCDE(3)
     A            PD44          10  0     72EDTCDE(3)
     A            PD45          10  0     82EDTCDE(3)
     A            PD46          10  0     92EDTCDE(3)
     A            PD47          10  0    102EDTCDE(3)
     A            PD48          10  0    112EDTCDE(3)
     A            PD49          10  0    122EDTCDE(3)
     A            PD4A          10  0    132EDTCDE(3)
     A            PD4B          10  0    142EDTCDE(3)
     A            PD4C          10  0    152EDTCDE(3)
     A            PD4D          10  0    162EDTCDE(3)
     A            PD4E          10  0    180EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A            PD51          10  0     42EDTCDE(3)
     A            PD52          10  0     52EDTCDE(3)
     A            PD53          10  0     62EDTCDE(3)
     A            PD54          10  0     72EDTCDE(3)
     A            PD55          10  0     82EDTCDE(3)
     A            PD56          10  0     92EDTCDE(3)
     A            PD57          10  0    102EDTCDE(3)
     A            PD58          10  0    112EDTCDE(3)
     A            PD59          10  0    122EDTCDE(3)
     A            PD5A          10  0    132EDTCDE(3)
     A            PD5B          10  0    142EDTCDE(3)
     A            PD5C          10  0    152EDTCDE(3)
     A            PD5D          10  0    162EDTCDE(3)
     A            PD5E          10  0    180EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A            PD6E          10  0    180EDTCDE(3)
     A                                      SPACEA(1)
     A*------------------------------------------------------------***
     A          R PT2                       SPACEB(001)
     A*
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==================='
     A                                      SPACEA(1)
     A*
     A                                     2'公　司　總　計:'
     A            PD71          10  0     42EDTCDE(3)
     A            PD72          10  0     52EDTCDE(3)
     A            PD73          10  0     62EDTCDE(3)
     A            PD74          10  0     72EDTCDE(3)
     A            PD75          10  0     82EDTCDE(3)
     A            PD76          10  0     92EDTCDE(3)
     A            PD77          10  0    102EDTCDE(3)
     A            PD78          10  0    112EDTCDE(3)
     A            PD79          10  0    122EDTCDE(3)
     A            PD7A          10  0    132EDTCDE(3)
     A            PD7B          10  0    142EDTCDE(3)
     A            PD7C          10  0    152EDTCDE(3)
     A            PD7D          10  0    162EDTCDE(3)
     A            PD7E          10  0    180EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A            PD81          10  0     42EDTCDE(3)
     A            PD82          10  0     52EDTCDE(3)
     A            PD83          10  0     62EDTCDE(3)
     A            PD84          10  0     72EDTCDE(3)
     A            PD85          10  0     82EDTCDE(3)
     A            PD86          10  0     92EDTCDE(3)
     A            PD87          10  0    102EDTCDE(3)
     A            PD88          10  0    112EDTCDE(3)
     A            PD89          10  0    122EDTCDE(3)
     A            PD8A          10  0    132EDTCDE(3)
     A            PD8B          10  0    142EDTCDE(3)
     A            PD8C          10  0    152EDTCDE(3)
     A            PD8D          10  0    162EDTCDE(3)
     A            PD8E          10  0    180EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A            PD9E          10  0    180EDTCDE(3)
     A                                      SPACEA(1)
     A*
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==================='
     A                                      SPACEA(001)
     A*
     A                                     1'PYR708P--->報表結束'
     A                                      SPACEA(001)
     A*------------------------------------------------------------***
     A          R PE9
     A                                      SPACEB(001)
     A                                    16'無符合列印範圍之資料'
