     A*%%***********************************************************************
     A*%%TS  RD  20001117  120026  PPSPGMRYH   REL-V4R2M0  5769-PW1
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A****************************************************************
     A*    PRTF NAME    : PYR705P                                    *
     A*    PROGRAM NAME : PYR705                                     *
     A*    AUTHOR       : K781056                                    *
     A*    CREATE DATE  : 82/01/13                                   *
     A*    UPDATE DATE  : 89/02/21 A1274 EVA                         *
     A*    SYSTEM       : S1021908                                   *
     A*    REMARK       :公司獎金彙總資料                          *
     A****************************************************************
     A                                      REF(PYRF)
     A          R PH1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      SKIPB(002)
     A            CM03      R              1
     A                                    97
     A                                      '日期:'
     A            DDATE          6  0    105
     A                                      EDTCDE(Y)
     A                                   114
     A                                      '頁次:'
     A                                   122
     A                                      PAGNBR
     A                                     1
     A                                      '公司獎金資料表（部門）:'
     A                                      SPACEB(001)
     A            SS02      R             26
     A                                      REFFLD(SS02)
     A                                    97
     A                                      '時間:'
     A                                   105
     A                                      TIME
     A                                      EDTWRD('  :  :  ')
     A                                   115
     A                                      '<PYR705P>'
     A                                     1
     A                                      '部　　門:'
     A                                      SPACEB(002)
     A            DEM041         7        13
     A                                    +1
     A                                      '-'
     A            DEM042         7        +1
     A                                     1
     A                                      '獎金年度:'
     A                                      SPACEB(001)
     A            DPB051         3  0     +1
     A                                      EDTWRD('   ')
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========================='
     A                                      SPACEB(001)
     A                                     1
     A                                      '部門名稱'
     A                                      SPACEB(001)
     A                                    26
     A                                      '扣稅／不扣稅'
     A                                    45
     A                                      '人數'
     A                                    59
     A                                      '獎　　金'
     A                                    78
     A                                      '獎金稅額'
     A*                                   72
     A*                                     '　勞保費'
     A*                                   85
     A*                                     '　健保費'
     A                                    98
     A                                      '其他扣項'
     A                                   116
     A                                      '實領總額'
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========================='
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 002
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A          R PT1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                      SPACEA(001)
     A            A2             1        32
     A            EM041     R              1
     A            EM042     R              2
     A            EM043     R              3
     A            EM044     R              4
     A            DP02      R              8
     A                                      REFFLD(DP02 PYDPPF)
     A            B2             5  0    +20
     A                                      EDTCDE(1)
     A            PT122          9  0     57
     A                                      EDTCDE(1)
     A            PT132          9  0     76
     A                                      EDTCDE(1)
     A*           PT142          9  0     70
     A*                                     EDTCDE(1)
     A*           PT152          9  0     83
     A*                                     EDTCDE(1)
     A            PT162          9  0     96
     A                                      EDTCDE(1)
     A            PT172          9  0    114
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R PT2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                      SPACEA(001)
     A*           EM041     R              2
     A*           EM042     R              3
     A*           EM043     R              4
     A*           EM044     R              5
     A*           DP02      R              8
     A*                                     REFFLD(DP02 PYDPPF)
     A            A1             1        32
     A            B1             5  0     44
     A                                      EDTCDE(1)
     A            PT121          9  0     57
     A                                      EDTCDE(1)
     A            PT131          9  0     76
     A                                      EDTCDE(1)
     A*           PT141          9  0     70
     A*                                     EDTCDE(1)
     A*           PT151          9  0     83
     A*                                     EDTCDE(1)
     A            PT161          9  0     96
     A                                      EDTCDE(1)
     A            PT171          9  0    114
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R PT3
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    30
     A                                      '合計:'
     A                                      SPACEB(001)
     A            B              5  0     44
     A                                      EDTCDE(1)
     A            PT12           9  0     57
     A                                      EDTCDE(1)
     A            PT13           9  0     76
     A                                      EDTCDE(1)
     A*           PT14           9  0     70
     A*                                     EDTCDE(1)
     A*           PT15           9  0     83
     A*                                     EDTCDE(1)
     A            PT16           9  0     96
     A                                      EDTCDE(1)
     A            PT17           9  0    114
     A                                      EDTCDE(1)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A*
     A*-------------------------------------------------------------***
     A          R PT5
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      -------------------------'
     A                                     1
     A                                      '部門總計:'
     A                                      SPACEB(001)
     A            BN             5  0    +32
     A                                      EDTCDE(1)
     A            PT52           9  0     57
     A                                      EDTCDE(1)
     A            PT53           9  0     76
     A                                      EDTCDE(1)
     A*           PT54           9  0     70
     A*                                     EDTCDE(1)
     A*           PT55           9  0     83
     A*                                     EDTCDE(1)
     A            PT56           9  0     96
     A                                      EDTCDE(1)
     A            PT57           9  0    114
     A                                      EDTCDE(1)
     A*
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========================='
     A                                      SPACEB(001)
     A                                     1
     A                                      'PYR705P===>報表結束'
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A*---------------------------------------------------------------*
     A          R PE9
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                    16
     A                                      '無符合列印範圍之資料'
     A*%%***********************************************************************
     A*%%SS
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(PYSRCLIBYH/PYR705P)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       198      *N     )
     A*%%***********************************************************************
