     A****************************************************************
     A*    PRTF NAME    : PYR703P                                    *
     A*    PROGRAM NAME : PYR7030C                                   *
     A*    AUTHOR       : A1037  JOSNSON                             *
     A*    CREATE DATE  : 81/03/25                                   *
     A*    UPDATE DATE  : 90/04/16 A1274 EVA                         *
     A*    SYSTEM       : MIRS                                       *
     A*    REMARK       :各類所得扣繳暨免扣繳憑單                  *
     A****************************************************************
     A                                      REF(PYRF)
     A          R PH1                       SKIPB(5)
     A            TD09      R             72
     A***         TD091          1        72
     A***                                   CHRSIZ(1)
     A***         TD092          2        74
     A***         TD093          2        79
     A***         TD094          7        83
     A            TD0911         1       121
     A            TD0921         2       125
     A            TD0931         2       130
     A            TD0941         7       132
     A            TD0912         1       180
     A            TD0922         2       184
     A            TD0932         2       189
     A            TD0942         7       191
     A                                      SPACEA(3)
     A            TD17      R             21
     A            CM12      R             41
     A            TD02      R             56
     A            TD03      R             60
     A            TD04      R             87
     A            TD171     R             96REFFLD(TD17)
     A            CM121     R            113REFFLD(CM12)
     A            TD021     R            122REFFLD(TD02)
     A            TD031     R            126REFFLD(TD03)
     A            TD041     R            141REFFLD(TD04)
     A            TD172     R            156REFFLD(TD17)
     A            CM122     R            172REFFLD(CM12)
     A            TD022     R            182REFFLD(TD02)
     A            TD032     R            186REFFLD(TD03)
     A            TD042     R            197REFFLD(TD04)
     A                                      SPACEA(4)
     A            TD05      R             20
     A            TD13      R             32
     A                                    50'V'
     A            TD12      R             81
     A            TD051     R             96REFFLD(TD05)
     A            TD131     R            108REFFLD(TD13)
     A            TD121     R            134REFFLD(TD12)
     A            TD052     R            155REFFLD(TD05)
     A            TD132     R            168REFFLD(TD13)
     A            TD122     R            188REFFLD(TD12)
     A                                      SPACEA(2)
     A*           TD13      R             30
     A*                                     SPACEA(2)
     A            TD14      R             30
     A            TD141         46O       90
     A            TD142         46O      150
     A                                      SPACEA(3)
     A            TD151W         2  0     23
     A            TD152          2  0     31
     A            TD161W         2  0     44
     A            TD162          2  0     53
     A            TD01P          2  0     69
     A            TD1511         2  0     95
     A            TD1521         2  0    103
     A            TD1611         2  0    112
     A            TD1621         2  0    121
     A            TD011P         2  0    131
     A            TD1512         2  0    155
     A            TD1522         2  0    162
     A            TD1612         2  0    172
     A            TD1622         2  0    180
     A            TD012P         2  0    190
     A                                      SPACEA(3)
     A            TD07      R             17EDTCDE(1)
     A            TD08      R             47EDTCDE(1)
     A            TD07P     R             74REFFLD(TD07)
     A                                      EDTCDE(1)
     A            TD071     R             92REFFLD(TD07)
     A                                      EDTCDE(1)
     A            TD081     R            110REFFLD(TD08)
     A                                      EDTCDE(1)
     A            TD07P1    R            130REFFLD(TD07)
     A                                      EDTCDE(1)
     A            TD072     R            152REFFLD(TD07)
     A                                      EDTCDE(1)
     A            TD082     R            170REFFLD(TD08)
     A                                      EDTCDE(1)
     A            TD07P2    R            188REFFLD(TD07)
     A                                      EDTCDE(1)
     A                                      SPACEA(4)
     A            CM03      R             21
     A            CM031         34        95
     A            CM032         34       155
     A                                      SPACEA(2)
     A            CM08      R             21
     A            CM082         42        95
     A            CM083         42       155
     A                                      SPACEA(2)
     A            CM10      R             21CHRSIZ(2)
     A            CM101     R             95REFFLD(CM10)
     A                                      CHRSIZ(2)
     A            CM102     R            155REFFLD(CM10)
     A                                      CHRSIZ(2)
