     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : PYR905P                                    *
     A*    PROGRAM NAME :加班時間月報表                            *
     A*    AUTHOR       : B1038                                      *
     A*    CREATE DATE  : 87/10/27                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A                                      REF(PYRF)
     A          R PH1
     A                                      SKIPB(2)
     A            CM03          22         1
     A                                   160
     A                                      'Date:'
     A            DDATE          6  0    167
     A                                      EDTWRD('0  /  /  ')
     A                                   176
     A                                      'Page:'
     A                                   183
     A                                      PAGNBR
     A                                      SPACEA(1)
     A                                     1'OVERTIME              Detail Repo+
     A                                      rt'
     A                                    37'('
     A            PMM            4        38
     A            PYY            4  0     42
     A                                    46')'
     A                                   160
     A                                      'Time:'
     A                                   167
     A                                      TIME
     A                                      EDTWRD('  :  :  ')
     A                                   176
     A                                      '<PYR905P>'
     A                                      SPACEA(3)
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ============'
     A                                      SPACEA(1)
     A                                     2'STF NO.'
     A                                    12'NAME'
     A                                    40'1    2    3    4    5    6    7'
     A                                    75'8    9   10   11   12   13   14'
     A                                   109'15   16   17   18   19   20   21'
     A                                   144'22   23   24   25   26   27   28'
     A                                   179'29   30   31'
     A                                   192'TOTAL'
     A                                      SPACEA(1)
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ============'
     A                                      SPACEA(1)
     A*
     A          R PD1
     A  31        XK03      R              2
     A  31        PEM03         30        12
     A            PXK01          3  1     37EDTCDE(1)
     A            PXK02          3  1     42EDTCDE(1)
     A            PXK03          3  1     47EDTCDE(1)
     A            PXK04          3  1     52EDTCDE(1)
     A            PXK05          3  1     57EDTCDE(1)
     A            PXK06          3  1     62EDTCDE(1)
     A            PXK07          3  1     67EDTCDE(1)
     A            PXK08          3  1     72EDTCDE(1)
     A            PXK09          3  1     77EDTCDE(1)
     A            PXK10          3  1     82EDTCDE(1)
     A            PXK11          3  1     87EDTCDE(1)
     A            PXK12          3  1     92EDTCDE(1)
     A            PXK13          3  1     97EDTCDE(1)
     A            PXK14          3  1    102EDTCDE(1)
     A            PXK15          3  1    107EDTCDE(1)
     A            PXK16          3  1    112EDTCDE(1)
     A            PXK17          3  1    117EDTCDE(1)
     A            PXK18          3  1    122EDTCDE(1)
     A            PXK19          3  1    127EDTCDE(1)
     A            PXK20          3  1    132EDTCDE(1)
     A            PXK21          3  1    137EDTCDE(1)
     A            PXK22          3  1    142EDTCDE(1)
     A            PXK23          3  1    147EDTCDE(1)
     A            PXK24          3  1    152EDTCDE(1)
     A            PXK25          3  1    157EDTCDE(1)
     A            PXK26          3  1    162EDTCDE(1)
     A            PXK27          3  1    167EDTCDE(1)
     A            PXK28          3  1    172EDTCDE(1)
     A            PXK29          3  1    177EDTCDE(1)
     A            PXK30          3  1    182EDTCDE(1)
     A            PXK31          3  1    187EDTCDE(1)
     A            PD11           3  1    193EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A          R PT1
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------'
     A                                      SPACEA(1)
     A                                     2'Total of Overtime hours:'
     A            PT101          3  1     37EDTCDE(1)
     A            PT102          3  1     42EDTCDE(1)
     A            PT103          3  1     47EDTCDE(1)
     A            PT104          3  1     52EDTCDE(1)
     A            PT105          3  1     57EDTCDE(1)
     A            PT106          3  1     62EDTCDE(1)
     A            PT107          3  1     67EDTCDE(1)
     A            PT108          3  1     72EDTCDE(1)
     A            PT109          3  1     77EDTCDE(1)
     A            PT110          3  1     82EDTCDE(1)
     A            PT111          3  1     87EDTCDE(1)
     A            PT112          3  1     92EDTCDE(1)
     A            PT113          3  1     97EDTCDE(1)
     A            PT114          3  1    102EDTCDE(1)
     A            PT115          3  1    107EDTCDE(1)
     A            PT116          3  1    112EDTCDE(1)
     A            PT117          3  1    117EDTCDE(1)
     A            PT118          3  1    122EDTCDE(1)
     A            PT119          3  1    127EDTCDE(1)
     A            PT120          3  1    132EDTCDE(1)
     A            PT121          3  1    137EDTCDE(1)
     A            PT122          3  1    142EDTCDE(1)
     A            PT123          3  1    147EDTCDE(1)
     A            PT124          3  1    152EDTCDE(1)
     A            PT125          3  1    157EDTCDE(1)
     A            PT126          3  1    162EDTCDE(1)
     A            PT127          3  1    167EDTCDE(1)
     A            PT128          3  1    172EDTCDE(1)
     A            PT129          3  1    177EDTCDE(1)
     A            PT130          3  1    182EDTCDE(1)
     A            PT131          3  1    187EDTCDE(1)
     A            PT11           4  1    192EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ============'
     A                                      SPACEA(2)
     A                                    11'Prepared by :'
     A                                    25'____________________'
     A                                    54'Certified by :'
     A                                    69'____________________'
     A                                   101'Approved by :'
     A                                   115'____________________'
     A                                      SPACEA(1)
     A*
     A          R PE9
     A                                    16
     A                                      '無符合列印範圍之資料'
     A                                      SPACEA(1)
