     A*****************************************************************
     A*  PCFILE   PC (EXCEL) --> AS400 調薪記錄轉檔資料　   A1274
     A*****************************************************************
     A          R PCF0
     A            PCD          500          COLHDG('轉檔資料')
