     A*****************************************************************
     A*PT#YLF01代碼基本資料檔
     A*****************************************************************
     A          R #Y0
     A                                      PFILE(PT#YPF)
     A          K #Y01
     A          K #Y03
     A          K #Y02
