     A*****************************************************************
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*------|------|----------------------------|--------------------|
     A*  01  |PT#APF|成本中心資料檔            |#A01                |
     A*  02  |PT#BPF|公司基本資料檔            |#B01                |
    @A*  03  |PT#CPF|銀行基本資料檔            |#C01                |
    @A*  04  |PT#DPF|銀行帳戶資料檔            |#D01+#D04           |
    @A*  05  |PT#EPF|廠商基本資料檔            |#E01+#E02           |
    @A*  06  |PT#FPF|客戶基本資料檔            |#F01+#F02           |
    @A*  07  |PT#GPF|員工基本資料檔            |#G01                |
    @A*  24  |PT#XPF|參數基本資料檔            |#X01+#X02           |
     A*  25  |PT#YPF|代碼基本資料檔            |#Y01+#Y02           |
     A*  26  |PT#ZPF|代碼欄位資料檔　          |#Z01                |
     A*****************************************************************
     A          R PTRFR
     A*****************************************************************
     A* 01      PT#APF 成本中心資料檔
     A* PKEY .... #A01                      NO-DUP
     A*****************************************************************
     A            #A01           6          COLHDG('成本中心')
     A            #A02          14O         COLHDG('中文簡稱')
     A            #A03          14O         COLHDG('英文簡稱')
     A            #A04          12          COLHDG('主管電話')
     A            #A05           3P 0       COLHDG('編制人力')
     A            #A06           1          COLHDG('費用別')
     A*                                     '1'  -> 管理
     A*                                     '2'  -> 推銷
     A*                                     '3'  -> 研發
     A*                                     '4'  -> 製造
     A*
     A            #A07          62O         COLHDG('所在位置')
     A            #A08          12          COLHDG('電話號碼')
     A            #A09          12          COLHDG('傳真號碼')
     A            #A10           1          COLHDG('類別')
     A*                                     '1'  -> 正式
     A*                                     '2'  -> 虛擬
     A*
     A            #A11           1          COLHDG('性質')
     A*                                     產品線，部門別
     A            #A97           6S 0       COLHDG('異動時間')
     A            #A98           8S 0       COLHDG('異動日期')
     A            #A99          10          COLHDG('異動人員')
     A*****************************************************************
     A* 02      PT#BPF 公司基本資料檔
     A* PKEY .... #B01                      NO-DUP
     A*****************************************************************
     A            #B01           2          COLHDG('公司編號')
     A            #B02          12O         COLHDG('公司簡稱')
     A            #B03          32O         COLHDG('公司中文全名')
     A            #B04           8          COLHDG('統一編號')
     A            #B05          10          COLHDG('稅籍編號')
     A            #B06          12          COLHDG('公司電話１')
     A            #B07          12          COLHDG('公司電話２')
     A            #B08          12          COLHDG('工廠電話１')
     A            #B09          12          COLHDG('工廠電話２')
     A            #B10          62O         COLHDG('公司地址')
     A            #B11          62O         COLHDG('工廠地址')
     A            #B12           1          COLHDG('類別')
     A*                                     '1'  -> 正式
     A*                                     '2'  -> 虛擬
     A            #B13          14O         COLHDG('所得扣繳義務人')
     A            #B14           4          COLHDG('所得扣繳媒體單位')
     A            #B15          32O         COLHDG('公司英文全名')
     A            #B16          32O         COLHDG('公司中文全名－中點')
     A            #B17          32O         COLHDG('公司英文全名－中點')
     A*
     A            #B97      R               COLHDG('異動時間')
     A                                      REFFLD(#A97)
     A            #B98      R               COLHDG('異動日期')
     A                                      REFFLD(#A98)
     A            #B99      R               COLHDG('異動人員')
     A                                      REFFLD(#A99)
     A*****************************************************************
     A* 07      PT#GPF 員工基本資料檔
     A* PKEY .... #G01                      NO-DUP
     A*****************************************************************
     A*****************************************************************
     A* 25      PT#YPF 代碼基本資料檔
     A* PKEY .... #Y01+#Y02                 NO-DUP
     A*****************************************************************
     A            #Y01          10          COLHDG('代碼欄位')
     A            #Y02          10          COLHDG('代碼編號')
     A            #Y03          32O         COLHDG('代碼說明')
     A            #Y04           1          COLHDG('維護碼')
     A*                                     'Y' -可由使用者維護
     A*                                     ELSE-須由系統維護
     A*
     A            #Y97      R               COLHDG('異動時間')
     A                                      REFFLD(#A97)
     A            #Y98      R               COLHDG('異動日期')
     A                                      REFFLD(#A98)
     A            #Y99      R               COLHDG('異動人員')
     A                                      REFFLD(#A99)
     A*****************************************************************
     A* 26      PT#ZPF 代碼欄位資料檔
     A* PKEY .... #Z01                      NO-DUP
     A*****************************************************************
     A            #Z01      R               COLHDG('代碼欄位')
     A                                      REFFLD(#Y01)
     A            #Z02          22O         COLHDG('代碼名稱')
     A            #Z03           3P 0       COLHDG('代碼長度')
     A            #Z04           3P 0       COLHDG('說明長度')
     A            #Z05           1          COLHDG('維護碼')
     A*                                     'Y' -可由使用者維護
     A*                                     ELSE-須由系統維護
     A*
     A            #Z97      R               COLHDG('異動時間')
     A                                      REFFLD(#A97)
     A            #Z98      R               COLHDG('異動日期')
     A                                      REFFLD(#A98)
     A            #Z99      R               COLHDG('異動人員')
     A                                      REFFLD(#A99)
