     A******************************************************
     A*  PY2HLF01  特別休假代金資料檔
     A******************************************************
     A          R H20
     A                                      PFILE(PY2HPF)
     A          K H201
     A          K H207
     A          K H202
     A          K H203
