     A*****************************************************************
     A*  PY2HPF  安уΩ矪瞶郎
     A*****************************************************************
     A                                      UNIQUE
     A                                      REF(PYRF)
     A          R H20
     A            H201      R               COLHDG('そ絪腹')
     A            H202      R               COLHDG('絪腹')
     A            H203      R               COLHDG('疭ヰ')
     A            H204      R               COLHDG('セ安ぱ计')
     A            H205      R               COLHDG('安ч祇⌒ぱ计')
     A            H205H     R               COLHDG('安ч祇⌒计')
     A            H206      R               COLHDG('安ч祇肂')
     A            H207      R               COLHDG('矪瞶る')
     A*
     A            H208      R               COLHDG('ヰ安⌒ぱ')
     A            H208H     R               COLHDG('ヰ安⌒')
     A            H209      R               COLHDG('ヰ安⌒ぱ')
     A            H209H     R               COLHDG('ヰ安⌒')
     A            H210      R               COLHDG('ゼヰ安⌒ぱ')
     A            H210H     R               COLHDG('ゼヰ安⌒')
     A*
     A            H211      R               COLHDG('セ肂')
     A            H212      R               COLHDG('戮叭倒')
     A            H213      R               COLHDG('ユ硄瑉禟')
     A            H214      R               COLHDG('恨倒')
     A            H215      R               COLHDG('と繺瑉禟')
     A            H216      R               COLHDG('戮る计')
     A*
     A            H297      R               COLHDG('癘魁穝ら戳')
     A            H298      R               COLHDG('癘魁穝丁')
     A            H299      R               COLHDG('ㄏノ腹')
     A*
     A          K H201
     A          K H202
     A          K H203
