     A*****************************************************************
     A*  PYA1PF  –るぱ计砞﹚郎
     A*****************************************************************
     A                                      UNIQUE
     A                                      REF(PYRF)
     A          R A10
     A            A101           4S 0       COLHDG('')
     A            A102           2S 0       COLHDG('るぱ计')
     A            A103           2S 0       COLHDG('るぱ计')
     A            A104           2S 0       COLHDG('るぱ计')
     A            A105           2S 0       COLHDG('るぱ计')
     A            A106           2S 0       COLHDG('きるぱ计')
     A            A107           2S 0       COLHDG('せるぱ计')
     A            A108           2S 0       COLHDG('るぱ计')
     A            A109           2S 0       COLHDG('るぱ计')
     A            A110           2S 0       COLHDG('るぱ计')
     A            A111           2S 0       COLHDG('るぱ计')
     A            A112           2S 0       COLHDG('るぱ计')
     A            A113           2S 0       COLHDG('るぱ计')
     A            A197           6S 0       COLHDG('癘魁穝ら戳')
     A            A198           6S 0       COLHDG('癘魁穝丁')
     A            A199          10          COLHDG('ㄏノ腹')
     A          K A101
