     A          R W20
     A            W201           2A         COLHDG('公司編號')
     A            W202           8A         COLHDG('員工編號')
     A            W203           8  0       COLHDG('排班日期')
     A            W205           2A         COLHDG('內容')
     A            W206           7A         COLHDG('部門代碼')
     A            W207          16O         COLHDG('部門簡稱')
     A*
     A          K W201
     A          K W202
     A          K W203
