     A*****************************************************************
     A*  PYAAPF  扣繳月份記錄檔
     A*****************************************************************
     A          R AA0
     A            AA01           2          COLHDG('公司編號')
     A            AA02           8          COLHDG('員工編號')
     A            AA03           6  0       COLHDG('最近申報年月')
     A*
     A          K AA01
     A          K AA02
