     A*****************************************************************
     A*  PYARPF  年度調薪(AI)規則檔(保留)
     A*****************************************************************
     A                                      UNIQUE
     A                                      REF(PYRF)
     A          R AR0
     A            AR01           2          COLHDG('公司編號')
     A            AR02           4S 0       COLHDG('生效年')
     A            AR03           2S 0       COLHDG('生效月')
     A            AR04           3          COLHDG('調薪別')
     A            AR05           8S 0       COLHDG('調薪基準日')
     A            AR06           1          COLHDG('AI超上限碼')
     A*               A:發放　B:保留C:不發
     A            AR07           1          COLHDG('AI追加扣作業碼')
     A*               A:追加＆追扣　B:追加ONLY
     A            AR08           6S 0       COLHDG('AI一次作業年月')
     A            AR09           1          COLHDG('COL超上限碼')
     A*               A:一次發放１２個月　B:按月
     A            AR10           1          COLHDG('COL追加扣作業碼')
     A*               A:追加＆追扣　B:追加ONLY
     A            AR11           6S 0       COLHDG('COL一次作業年月')
     A            AR12          10          COLHDG('維護人員代號')
     A            AR13           8S 0       COLHDG('系統日期')
     A            AR14           6S 0       COLHDG('系統時間')
     A          K AR01
     A          K AR02
     A          K AR03
     A          K AR04
