     A*****************************************************************
     A*           PYB10PF 慶豐銀行轉存檔
     A*****************************************************************
     A          R B100
     A            B1001         70          COLHDG('轉存資料')
