     A*****************************************************************
     A*  PYB12PF  台灣銀行轉存檔
     A*****************************************************************
     A                                      REF(PYRF)
     A          R B120
     A            B1201         60          COLHDG('轉存資料')
