     A*****************************************************************
     A*  PYB11PF  台北國際商銀薪資銀行轉存檔
     A*****************************************************************
     A                                      REF(PYRF)
     A          R B110
     A            B1101         50          COLHDG('轉存資料')
