     A*****************************************************************
     A*  PYB8PF  萬泰薪資銀行轉存檔
     A*****************************************************************
     A          R B80
     A            B801          80          COLHDG('轉存資料')
