     A*****************************************************************
     A*  PYB9PF  北市銀轉存檔  台北銀行
     A*****************************************************************
     A                                      REF(PYRF)
     A          R B90
     A            B901      R               COLHDG('轉存資料')
