     A*****************************************************************
     A*  PYBSPF  薪資遞延發放歷史檔
     A*****************************************************************
     A                                      UNIQUE
     A          R BS0
     A            BS01           2A         COLHDG('公司編號')
     A            BS02           8A         COLHDG('員工編號')
     A            BS03           6S 0       COLHDG('補發年月')
     A            BS04           1A         COLHDG('狀態')
     A            BS05           1A         COLHDG('期別')
     A            BS06           6S 0       COLHDG('遞延起始年月')
     A            BS07           6S 0       COLHDG('遞延截止年月')
     A            BS08          20O         COLHDG('備註')
     A            BS95          10A         COLHDG('建檔者代號')
     A            BS96           8S 0       COLHDG('建檔日期')
     A            BS97           8S 0       COLHDG('記錄更新日期')
     A            BS98           6S 0       COLHDG('記錄更新時間')
     A            BS99          10A         COLHDG('維護者代號')
     A*
     A          K BS01
     A          K BS02
     A          K BS04
     A          K BS06
