     A******************************************************
     A*  PYBTLF03 : 薪資銀行轉存歷史檔
     A******************************************************
     A          R BT0
     A                                      PFILE(PYBTPF)
     A          K BT01
     A          K BT03
     A          K BT11
     A          K BT02
