     A******************************************************
     A*  PYBTLF02 : 薪資銀行轉存歷史檔
     A******************************************************
     A          R BT0
     A                                      PFILE(PYBTPF)
     A          K BT01
     A          K BT04
     A          K BT03
