     A******************************************************
     A*  PYBTLF01 : 薪資銀行轉存歷史檔
     A******************************************************
     A          R BT0
     A                                      PFILE(PYBTPF)
     A          K BT061
     A          K BT03
     A          K BT04
     A          K BT05
     A          K BT02
