     A******************************************************
     A*           PYBUJF01  利潤獎金資料+人事主檔      *
     A******************************************************
     A          R BUJF01                    JFILE(PYBUPF PYEMPF)
     A          J                           JOIN(PYBUPF PYEMPF)
     A                                      JFLD(KEYBU KEYEM)
     A            KEYBU                     CONCAT(BU01 BU02)
     A            BU01      R
     A            BU02      R
     A            BU03      R
     A            BU04      R
     A            BU09      R
     A            BU10      R
     A            BU14      R
     A            BU11      R
     A            BU06      R
     A            BU07      R
     A            BU08      R
     A            BU12      R
     A            KEYEM                     CONCAT(EM01 EM02)
     A            EM01      R
     A            EM041     R
     A            EM042     R
     A            EM043     R
     A            EM044     R
     A            EM02      R
     A            EM03      R
