     A******************************************************
     A*  PYBULF01 : §Q¼í¼úª÷µ²ºc
     A******************************************************
     A          R BU0
     A                                      PFILE(PYBUPF)
     A          K BU01
     A          K BU02
     A          K BU03
     A          K BU04
     A          K BU05
     A          K BU05D
