     A*****************************************************************
     A* 25      PTCAPF 配車基本資料維護檔
     A*****************************************************************
     A          R CA0
     A            CA01           2          COLHDG('公司編號')
     A            CA02           8          COLHDG('員工編號')
     A            CA03          10          COLHDG('車號')
     A          K CA01
     A          K CA02
