     A******************************************************
     A*  PYCDPF  所得成本檔DETAIL
     A******************************************************
     A          R CD0
     A                                      PFILE(PYCDPF)
     A          K CD01
     A          K CD03
     A          K CD071
     A          K CD072
     A          K CD073
     A          K CD05
