     A******************************************************
     A*  PYCHPF  薪資所得成本檔HEADING
     A******************************************************
     A          R CH0
     A                                      PFILE(PYCHPF)
     A          K CH01
     A          K CH03
     A          K CH04
