     A******************************************************
     A*  PYDELF01  列印順序表
     A******************************************************
     A          R DE0
     A                                      PFILE(PYDEPF)
     A          K DE01
     A*                                     COLHDG('公司編號')
     A          K DE02
     A*                                     COLHDG('列印種類')
     A          K DE04
     A*                                     COLHDG('部門編號')
