     A*****************************************************************
     A*  PYDSPF  薪資成本分攤檔           KEY= DS01+DS02+DS03
     A*****************************************************************
     A                                      UNIQUE
     A                                      REF(PYRF)
     A          R DS0
     A            DS01      R               COLHDG('公司編號')
     A            DS02      R               COLHDG('員工編號')
     A            DS03      R               COLHDG('序號')
     A            DS041     R               COLHDG('成本中心－大類')
     A            DS042     R               COLHDG('成本中心－序號')
     A            DS043     R               COLHDG('成本中心－成本')
     A            DS05      R               COLHDG('成本分攤率')
     A*
     A            DS97      R               COLHDG('記錄更新日期')
     A            DS98      R               COLHDG('記錄更新時間')
     A            DS99      R               COLHDG('使用者代號')
     A          K DS01
     A          K DS02
     A          K DS03
