     A*****************************************************************
     A*  PYDWPF  公司負擔成本主檔
     A*****************************************************************
     A                                      UNIQUE
     A*                                     REF(PYRF)
     A          R DW0
     A            DW01           2A         COLHDG('公司編號')
     A            DW02           8A         COLHDG('員工編號')
     A            DW03           6S 0       COLHDG('負擔年月')
     A            DW04           6S 0       COLHDG('健保投保金額')
     A            DW05           6S 0       COLHDG('公司負擔健保')
     A            DW06           6S 0       COLHDG('勞保投保金額')
     A            DW07           6S 0       COLHDG('公司負擔勞保')
     A            DW08           6S 0       COLHDG('勞退投保金額')
     A            DW09           6S 0       COLHDG('企業提撥')
     A            DW97           8S 0       COLHDG('記錄更新日期')
     A            DW98           6S 0       COLHDG('記錄更新時間')
     A            DW99          10A         COLHDG('使用者代號')
     A          K DW01
     A          K DW03
     A          K DW02
