     A          R E10
     A                                      PFILE(PYE1PF)
     A          K E101
     A          K E102
     A          K E103                      DESCEND
