     A******************************************************
     A*  PYE2LF07眷屬健保投保資料檔-DETAIL
     A*  FOR 挑選PYE5PF最新資料到PYE2PF
     A******************************************************
     A          R E20
     A                                      PFILE(PYE2PF)
     A*公司編號＋員工編號＋序號
     A          K E201
     A          K E202
     A          K E204
