     A******************************************************
     A*  PYE2LF05眷屬健保投保資料檔-DETAIL
     A*  FOR 每月扣繳保費分攤用
     A******************************************************
     A          R E20
     A                                      PFILE(PYE2PF)
     A*公司編號＋員工編號＋補助碼（ＤＥＳＣＥＮＤ）
     A          K E201
     A          K E202
     A          K E211                      DESCEND
