     A******************************************************
     A*  PYE5LF01眷屬健保投保資料檔-DETAIL
     A******************************************************
     A          R E50
     A                                      PFILE(PYE5PF)
     A*公司編號＋員工編號＋眷屬生效日期+ID
     A          K E501
     A          K E502
     A          K E512
     A          K E507
