     A******************************************************
     A*  PYE6LF01°·«O¦©Ãº¾ú¥vÀÉ
     A******************************************************
     A          R E60
     A                                      PFILE(PYE6PF)
     A          K E601
     A          K E602
     A          K E615
     A          K E603
     A          K E604
