     A******************************************************
     A*  PYE6LF03°·«O¦©Ãº¾ú¥vÀÉ
     A******************************************************
     A          R E60
     A                                      PFILE(PYE6PF)
     A          K E601
     A          K E6031
     A          K E615
