     A*****************************************************************
     A*         PYEMPF  人事主檔
     A*****************************************************************
     A          R EM0
     A                                      PFILE(PYEMPF)
     A*公司＋到職日期＋員工
     A          K EM01
     A          K EM13
     A          K EM02
     A*音教老師
     A          S EM110                     COMP(EQ '4')
