     A*****************************************************************
     A*  PYEMPF  §H®∆•D¿…
     A*****************************************************************
     A          R EM0
     A                                      PFILE(PYEMPF)
     A          K EM01
     A          K EM03
     A          K EM041
     A          K EM042
     A          K EM043
     A          K EM044
