     A*****************************************************************
     A*  PYEMPF  人事主檔
     A*****************************************************************
     A          R EM0
     A                                      PFILE(PYEMPF)
     A          K EM01
     A          K EM02
     A*音教老師
     A          S EM110                     COMP(EQ '4')
