     A*****************************************************************
     A*  PYEMPF  §H®∆•D¿…
     A*****************************************************************
     A          R EM0
     A                                      PFILE(PYEMPF)
     A          K EM01
     A          K EM31
