     A*****************************************************************
     A*         PYEMPF  人事主檔
     A*****************************************************************
     A          R EM0
     A                                      PFILE(PYEMPF)
     A            EM01      R               COLHDG('公司編號')
     A            EM02      R               COLHDG('員工編號')
     A            EM87      R               COLHDG('專長－１')
     A            EM89      R               COLHDG('專長－２')
     A            EM91      R               COLHDG('專長－３')
     A          K EM01
     A          K EM02
     A*音教老師
     A          S EM01                      COMP(EQ 'YM')
