     A******************************************************
     A*  PYEMLF02  人事主檔
     A******************************************************
     A          R EM0
     A                                      PFILE(PYEMPF)
     A          K EM02
     A*                                     COLHDG('員工編號')
     A          K EM01
     A*                                     COLHDG('公司編號')
