     A*****************************************************************
     A*  PYERPF  福委會收支登錄檔       PYERLF01
     A*****************************************************************
     A          R ER0
     A                                      PFILE(PYERPF)
     A          K ER01
     A          K ER03
     A          K ER04
     A          K ER06
     A          K ER02
