     A*****************************************************************
     A*  PYERPF  褔委會收支檔
     A*****************************************************************
     A                                      UNIQUE
     A                                      REF(PYRF)
     A          R ER0
     A            ER01      R               COLHDG('公司編號')
     A            ER02      R               COLHDG('員工編號')
     A            ER03      R               COLHDG('收支日期')
     A*"1":福委會支出 "2":福委會收入
     A            ER04      R               COLHDG('收支代碼')
     A            ER05      R               COLHDG('金額')
     A*"GIFT": PT#YPF
     A            ER06      R               COLHDG('收支項目')
     A            ER07      R               COLHDG('福利年度')
     A*
     A            ER97      R               COLHDG('記錄更新日期')
     A            ER98      R               COLHDG('記錄更新時間')
     A            ER99      R               COLHDG('使用者代號')
     A*
     A          K ER01
     A          K ER02
     A          K ER03
     A          K ER04
     A          K ER06
