     A*****************************************************************
     A*  PYERLF02褔委會收支檔
     A*****************************************************************
     A          R ER0
     A                                      PFILE(PYERPF)
     A          K ER01
     A          K ER07
     A          K ER04
     A          K ER06
     A          K ER03
