     A*****************************************************************
     A*  PYERPF  福委會收支登錄檔       PYERLF02
     A*****************************************************************
     A          R ER0
     A                                      PFILE(PYERPF)
     A          K ER01
     A          K ER02
     A          K ER03                      DESCEND
