     A******************************************************
     A*           PYETJF01  全民健保+人事              *
     A******************************************************
     A          R ETJF01                    JFILE(PYEMPF PYE1PF PYTXPF)
     A          J                           JOIN(PYEMPF PYE1PF )
     A                                      JFLD(KEYEM KEYE1 )
     A          J                           JOIN(PYEMPF PYTXPF)
     A                                      JFLD(KEYEM KEYTX)
     A            KEYEM                     CONCAT(EM01 EM02)
     A            EM01      R               COLHDG('公司編號')
     A            EM02      R               COLHDG('員工編號')
     A            EM03      R
     A            EM041     R
     A            EM042     R
     A            EM043     R
     A            EM044     R
     A            EM31      R
     A            EM33      R
     A            KEYE1                     CONCAT(E101 E102)
     A            E101      R
     A            E102      R
     A            E103      R
     A            E104      R
     A            E105      R
     A            E106      R
     A            E107      R
     A            E108      R
     A            KEYTX                     CONCAT(TX01 TX02)
     A            TX04      R               COLHDG('生效日期')
     A            TX05      R               COLHDG('金額')
