     A******************************************************
     A*           PYEXJF01  團體保險投保資料檔+人事              *
     A******************************************************
     A          R EXJF01                    JFILE(PYEMPF PYX1PF)
     A          J                           JOIN(PYEMPF PYX1PF)
     A                                      JFLD(KEYEM KEYX1)
     A            KEYEM                     CONCAT(EM01 EM02)
     A            EM01      R
     A            EM02      R
     A            EM03      R
     A            EM06      R
     A            EM07      R
     A            EM13      R
     A            EM19      R
     A            EM041     R
     A            EM042     R
     A            EM043     R
     A            EM044     R
     A            EM294     R
     A            EM31      R
     A            EM32      R
     A            EM33      R
     A            EM34      R
     A            KEYX1                     CONCAT(X101 X102)
     A            X103      R
     A            X104      R
     A            X105      R
     A            X106      R
     A            X107      R
     A            X108      R
