     A*****************************************************************
     A*  PYG4PF  合庫轉存檔
     A*****************************************************************
     A*                                     REF(PYRF)
     A          R G40
     A            G401          80A         COLHDG('轉存資料')
