     A*****************************************************************
     A*  PYG5PF  合庫轉存檔
     A*****************************************************************
     A                                      REF(PYRF)
     A          R B50
     A            B501      R               COLHDG('轉存資料')
