     A*****************************************************************
     A*           PYGDPF 褔委會員工補助金明細檔  　　　　
     A*****************************************************************
     A          R GD0                       PFILE(PYGDPF)
     A*
     A*('公司編號')
     A          K GD01
     A*('員工編號')
     A          K GD02
     A*('申請日期')
     A          K GD06
     A*('申請項目')
     A          K GD07
     A*('福利年度')
     A          K GD04
