     A******************************************************
     A*           PYOSJF02  薪資異動+人事              *
     A******************************************************
     A          R GDJF01                    JFILE(PYGDPF PYEMPF)
     A          J                           JOIN(PYGDPF PYEMPF)
     A                                      JFLD(KEYGD KEYEM)
     A            KEYGD                     CONCAT(GD01 GD02)
     A            GD01      R               COLHDG('公司編號')
     A            GD02      R               COLHDG('員工編號')
     A            GD03      R               COLHDG('工作地點')
     A            GD04      R               COLHDG('福利年度')
     A            GD05      R               COLHDG('申請月份')
     A            GD06      R               COLHDG('申請日期')
     A            GD07      R               COLHDG('申請項目')
     A            GD08      R               COLHDG('申請金額')
     A            GD09      R               COLHDG('計薪年月')
     A            GD10      R               COLHDG('備註')
     A            KEYEM                     CONCAT(EM01 EM02)
     A            EM03      R               COLHDG('員工姓名')
     A            EM041     R
     A            EM042     R
     A            EM043     R
     A            EM044     R
     A            EM05      R
     A            EM06      R
     A            EM07      R
     A            EM11      R
     A            EM13      R
     A            EM19      R
     A            EM130     R
