     A*****************************************************************
     A*  PYGHLF01褔委會員工補助金主檔
     A*****************************************************************
     A          R GH0
     A                                      PFILE(PYGHPF)
     A          K GH01
     A          K GH03
