     A***************************************************************
     A*           PYGHJF01                                          *
     A***************************************************************
     A          R GHJF01                    JFILE(PYGHPF PYEMPF)
     A          J                           JOIN(PYGHPF PYEMPF)
     A                                      JFLD(KEYGH KEYEM)
     A            KEYGH                     CONCAT(GH01 GH02)
     A            GH01      R               COLHDG('公司編號')
     A            GH02      R               COLHDG('員工編號')
     A            GH03      R               COLHDG('福利年度')
     A            GH04      R               COLHDG('福利金額')
     A            GH05      R               COLHDG('在職天數')
     A            GH06      R               COLHDG('到職日期')
     A            GH07      R               COLHDG('離職日期')
     A            KEYEM                     CONCAT(EM01 EM02)
     A            EM03      R               COLHDG('員工姓名')
     A            EM041     R
     A            EM042     R
     A            EM043     R
     A            EM044     R
     A            EM05      R               COLHDG('職稱編號')
     A            EM06      R               COLHDG('職等編號')
     A            EM07      R               COLHDG('職級編號')
     A            EM11      R               COLHDG('離職碼')
     A            EM13      R               COLHDG('到職日期')
     A            EM19      R               COLHDG('離職日期')
