     A*****************************************************************
     A*     PYH3PF 退休金提撥主檔 - 員工歷史資料檔
     A*****************************************************************
     A          R H30
     A            H301           2A         COLHDG('公司編號')
     A            H302           8A         COLHDG('員工編號')
     A            H303           8S 0       COLHDG('生效日期')
     A            H304           1A         COLHDG('異動類別')
     A            H305           1A         COLHDG('退休金制度')
     A*(1.新制,2.舊制)
     A            H306           8S 0       COLHDG('新制選擇日期')
     A            H307           1A         COLHDG('企業是否提撥')
     A            H308          12A         COLHDG('退休金個人專戶')
     A*(Y.是,2.否)
     A            H309           3  2       COLHDG('員工自提率')
     A            H310           3  2       COLHDG('企業提撥率')
     A            H311           6  0       COLHDG('月提繳工資')
     A            H312           5S 0       COLHDG('自提率變更年度')
     A            H313           5S 0       COLHDG('企提率變更年度')
     A*
     A            H397           8S 0       COLHDG('記錄更新日期')
     A            H398           6S 0       COLHDG('記錄更新時間')
     A            H399          10          COLHDG('使用者代號')
     A*
     A          K H301
     A          K H302
     A          K H303
