     A******************************************************
     A*  PYH5LF01°h¥ðª÷´£¼·²§°ÊÀÉ
     A******************************************************
     A          R H50
     A                                      PFILE(PYH5PF)
     A          K H501
     A          K H502
     A          K H503
