     A                                      JDFTVAL
     A          R JJREC                     JFILE(PYH5PF PYEMPF PYDPPF)
     A*
     A          J                           JOIN(PYH5PF PYEMPF)
     A                                      JFLD(H501 EM01)
     A                                      JFLD(H502 EM02)
     A*
     A          J                           JOIN(PYEMPF PYDPPF)
     A                                      JFLD(EM041 DP011)
     A                                      JFLD(EM042 DP012)
     A                                      JFLD(EM043 DP013)
     A                                      JFLD(EM044 DP014)
     A            H501
     A            H502
     A            H503
     A            H504
     A            H505
     A            H506
     A            H507
     A*           H508
     A            H509
     A            H510
     A            H511
     A            H512
     A            H513
     A*
     A            EM01
     A            EM02
     A            EM03
     A            EM031
     A            EM041
     A            EM042
     A            EM043
     A            EM044
     A            EM05
     A            EM06
     A            EM07
     A            EM08
     A            EM09
     A            EM10
     A            EM11
     A            EM12
     A            EM13
     A            EM14
     A            EM15
     A            EM16
     A            EM17
     A            EM18
     A            EM19
     A            EM20
     A            EM21
     A            EM22
     A            EM23
     A            EM24
     A            EM25
     A            EM26
     A            EM261
     A            EM27
     A            EM28
     A            EM291
     A            EM292
     A            EM293
     A            EM294
     A            EM296
     A            EM297
     A            EM298
     A            EM299
     A            EM30
     A            EM31
     A            EM311
     A            EM32
     A            EM321
     A            EM33
     A            EM34
     A            EM35
     A            EM36
     A            EM37
     A            EM38
     A            EM39
     A            EM40
     A            EM41
     A            EM42
     A            EM43
     A            EM431
     A            EM44
     A            EM45
     A            EM46
     A            EM461
     A            EM47
     A            EM60
     A            EM61
     A            EM62
     A            EM63
     A            EM64
     A            EM65
     A            EM66
     A            EM67
     A            EM68
     A            EM69
     A            EM70
     A            EM71
     A            EM72
     A            EM73
     A            EM74
     A            EM75
     A            EM76
     A            EM77
     A            EM78
     A            EM79
     A            EM80
     A            EM81
     A            EM82
     A            EM83
     A            EM84
     A            EM85
     A            EM86
     A            EM87
     A            EM88
     A            EM89
     A            EM90
     A            EM91
     A            EM92
     A            EM93
     A            EM94
     A            EM951
     A            EM952
     A            EM953
     A            EM100
     A            EM101
     A            EM102
     A            EM103
     A            EM104
     A            EM105
     A            EM106
     A            EM107
     A            EM108
     A            EM109
     A            EM110
     A            EM111
     A            EM112
     A            EM113
     A            EM114
     A            EM115
     A            EM116
     A            EM117
     A            EM118
     A            EM119
     A            EM120
     A*誠品全勤扣款
     A            EM121
     A            EM122
     A            EM123
     A            EM124
     A            EM125
     A            EM126
     A*
     A*最近薪資申報年月．與人工轉入申報無關 A1274 890225
     A            EM127
     A            EM128
     A            EM129
     A*
     A*員工上班地點及預留欄位                            A1274 890721
     A            EM130
     A            EM131
     A*
     A            DP011
     A            DP012
     A            DP013
     A            DP014
     A            DP02
     A            DP03
     A            DP04
     A            DP05
     A            DP06
     A            DP07
     A            DP97
     A            DP98
     A            DP99
     A            DP08
     A            DP09
     A*
