     A******************************************************
     A*  PYH7LF01月提繳工資設定
     A******************************************************
     A          R H60
     A                                      PFILE(PYH6PF)
     A          K H601
     A          K H602
     A          K H603
