     A******************************************************
     A*  PYH7LF01月提繳工資設定
     A******************************************************
     A          R H70
     A                                      PFILE(PYH7PF)
     A          K H703
