     A******************************************************
     A*  PYH9LF01本月調整申報檔
     A******************************************************
     A          R H90
     A                                      PFILE(PYH9PF)
     A          K H901
     A          K H903
