     A*****************************************************************
     A*  PYHCLF01  退休金提撥明細暫存檔     KEY= HC01+HC03
     A*****************************************************************
     A          R HC0
     A                                      PFILE(PYHCPF)
     A          K HC01
     A          K HC03
