     A******************************************************
     A*  PYHDLF02  ©Ò±o¾ú¥vÀÉDETAIL
     A******************************************************
     A          R HD0
     A                                      PFILE(PYHDPF)
     A*
     A          K HD01
     A          K HD02
     A          K HD04
     A          K HD05
     A          K HD03
