     A******************************************************
     A*  PYHDLF04  ©Ò±o¾ú¥vÀÉ
     A******************************************************
     A          R HD0
     A                                      PFILE(PYHDPF)
     A*
     A          K HD01
     A          K HD02
     A          K HD03
     A          K HD04
     A          K HD05
