     A*****************************************************************
     A*  PYLALF02  ¶“∂‘•D¿…                 KEY= LA03
     A*****************************************************************
     A          R LA0
     A                                      PFILE(PYLAPF)
     A          K LA01
     A          K LA03
