     A*****************************************************************
     A*  PYLALF01  ¶“∂‘•D¿…                 KEY= LA01+LA02+LA03
     A*****************************************************************
     A          R LA0
     A                                      PFILE(PYLAPF)
     A          K LA01
     A          K LA02
     A          K LA96
