     A*****************************************************************
     A*  PYLALF03  ¶“∂‘•D¿…                 KEY= LA07
     A*****************************************************************
     A          R LA0
     A                                      PFILE(PYLAPF)
     A          K LA01
     A          K LA07
