     A*****************************************************************
     A*  PYLCPF  安膀セ戈郎
     A*****************************************************************
     A                                      UNIQUE
     A                                      REF(PYRF)
     A          R LC0
     A            LC01      R               COLHDG('安絏')
     A            LC02      R               COLHDG('安虏嘿')
     A            LC03      R               COLHDG('羱')
     A*'1'-Τ羱  '2'-礚羱
     A            LC04      R               COLHDG('璸羱ぱ计')
     A*EXAMPLE :痜安⒋ぱず璸羱
     A            LC05      R               COLHDG('璸羱ゑ瞯')
     A*EXAMPLE :痜安⒉ぱず璸羱
     A            LC06      R               COLHDG('叫')
     A*EXAMPLE :ㄆ安ぃ禬筁⒊ぱ
     A            LC07      R               COLHDG('对')
     A*'Y'-对  'N'-ぃ对
     A            LC08      R               COLHDG('Ι羱ぱ计')
     A*EXAMPLE :礚羱胢戮ぱΙ羱ぱ
     A            LC09      R               COLHDG('Ι羱ゑ瞯')
     A            LC10      R               COLHDG('璸羱ぱ计')
     A*EXAMPLE :痜安⒋ぱず璸羱
     A            LC11      R               COLHDG('璸羱ゑ瞯')
     A*EXAMPLE :痜安⒉ぱず璸羱
     A            LC12      R               COLHDG('安嘿')
     A            LC97      R               COLHDG('癘魁穝ら戳')
     A            LC98      R               COLHDG('癘魁穝丁')
     A            LC99      R               COLHDG('ㄏノ腹')
     A          K LC01
