     A*****************************************************************
     A*  PYLILF01 員工住宿主檔+申請類別
     A*****************************************************************
     A          R LI0
     A                                      PFILE(PYLIPF)
     A          K LI01
     A          K LI04
