     A******************************************************
     A*           PYLNJF01 員工貸款資料檔+人事主檔     *
     A******************************************************
     A          R LNJF01                    JFILE(PYLNPF PYEMPF)
     A          J                           JOIN(PYLNPF PYEMPF)
     A                                      JFLD(KEYLNJ KEYEMJ)
     A*
     A*PYLNPF
     A            KEYLNJ                    CONCAT(LN01 LN02)
     A            LN01      R               COLHDG('公司編號')
     A            LN02      R               COLHDG('員工編號')
     A            LN03      R               COLHDG('貸款類別')
     A            LN04      R               COLHDG('貸款總額')
     A            LN05      R               COLHDG('償還期數')
     A            LN06      R               COLHDG('第一期月份')
     A            LN07      R               COLHDG('第一期金額')
     A            LN08      R               COLHDG('每一期金額')
     A            LN09      R               COLHDG('最後一期月份')
     A            LN10      R               COLHDG('最後一期金額')
     A            LN11      R               COLHDG('貸款日期')
     A            LN12      R               COLHDG('契約編號')
     A            LN13      R               COLHDG('保證人')
     A            LN14      R               COLHDG('聯絡電話')
     A            LN15      R               COLHDG('聯絡地址')
     A            LN16      R               COLHDG('關係企業註記')
     A*PYEMPF
     A            KEYEMJ                    CONCAT(EM01 EM02)
     A            EM03      R               COLHDG('員工姓名')
     A            EM031     R               COLHDG('英文姓名')
     A            EM041     R               COLHDG('部門編號１')
     A            EM042     R               COLHDG('部門編號２')
     A            EM043     R               COLHDG('部門編號３')
     A            EM044     R               COLHDG('部門編號４')
     A            EM05      R               COLHDG('職稱編號')
     A            EM11      R               COLHDG('離職碼')
     A            EM13      R               COLHDG('到職日期')
     A            EM19      R               COLHDG('離職日期')
     A            EM110     R               COLHDG('同仁分類')
     A*
     A          K LN01
     A          K LN02
