     A******************************************************
     A*  PYLOPF  勞退健保試算檔
     A******************************************************
     A          R LO0
     A                                      PFILE(PYLOPF)
     A*公司＋生效年月＋員工編號
     A          K LO01
     A          K LO03
     A          K LO02
