     A******************************************************
     A*  PYLOPF  勞退健保試算檔
     A******************************************************
     A          R LO0
     A                                      PFILE(PYLOPF)
     A          K LO03
     A*生效年月
     A          K LO01
     A*公司
     A          K LO05
     A*部門
     A          K LO02
     A*員工編號
