     A*****************************************************************
     A*  PYLPLF01勞退健保試算明細檔
     A*****************************************************************
     A          R LP0
     A                                      PFILE(PYLPPF)
     A*KEY=公司別＋年月＋員工編號＋發薪年月
     A          K LP01
     A          K LP03
     A          K LP02
     A          K LP04
