     A******************************************************
     A*  PYLTPF  ¥ð°²¾ú¥vÀÉ
     A******************************************************
     A          R LT0
     A                                      PFILE(PYLTPF)
     A          K LT01
     A          K LT03
     A          K LT02
