     A******************************************************
     A*  PYLTPF  ¥ð°²¾ú¥vÀÉ
     A******************************************************
     A          R LT0
     A                                      PFILE(PYLTPF)
     A          K LT96
