     A*****************************************************************
     A*  PYLUPF  ¥[¯ZÂà¥ð¾ú¥vÀÉ
     A*****************************************************************
     A          R LU0
     A                                      PFILE(PYLUPF)
     A          K LU01
     A          K LU03
     A          K LU02
