     A******************************************************
     A*  PYLVPF  請假主檔
     A*  FOR :薪資處理                 <*REBLD>
     A******************************************************
     A          R LV0
     A                                      PFILE(PYLVPF)
     A          K LV01
     A          K LV02
     A          K LV96
     A          K LV04
     A          K LV03
