     A******************************************************
     A*  PYLVLF04  請假主檔  FOR考勤轉入
     A******************************************************
     A          R LV0
     A                                      PFILE(PYLVPF)
     A          K LV03
     A          K LV01
     A          K LV02
     A          K LV04
