     A******************************************************
     A*           PYLVJF01  ½Ð°²+¤H¨Æ                  *
     A******************************************************
     A          R LVJF01                    JFILE(PYEMPF PYLVPF)
     A          J                           JOIN(PYEMPF PYLVPF)
     A                                      JFLD(KEYEM KEYLV)
     A            KEYLV                     CONCAT(LV01 LV02)
     A            LV01      R
     A            LV02      R
     A            LV03      R
     A            LV04      R
     A            LV05      R
     A            LV06      R
     A            LV07      R
     A            LV08      R
     A            LV09      R
     A            LV96      R
     A            KEYEM                     CONCAT(EM01 EM02)
     A            EM03      R
     A            EM041     R
     A            EM042     R
     A            EM043     R
     A            EM044     R
     A            EM13      R
     A            EM19      R
     A            EM113     R
     A*           EM48      R
     A*           EM49      R
     A*           EM50      R
     A*           EM511     R
     A*           EM512     R
     A*           EM52      R
     A*           EM53      R
     A*           EM54      R
     A*           EM55      R
