     A******************************************************
     A*  PYLVLF07  Ω–∞≤•D¿…
     A******************************************************
     A          R LV0
     A                                      PFILE(PYLVPF)
     A          K LV01
     A          K LV04
