     A******************************************************
     A*  PYLVPF  請假主檔
     A*  FOR REPORT :請假明細表                 <*REBLD>
     A******************************************************
     A          R LV0
     A                                      PFILE(PYLVPF)
     A          K LV01
     A          K LV02
     A          K LV03
