     A******************************************************
     A*  PYLVLF06  Ω–∞≤•D¿…
     A******************************************************
     A          R LV0
     A                                      PFILE(PYLVPF)
     A          K LV04
     A          K LV01
     A          K LV02
     A          K LV03
