     A*****************************************************************
     A*  PYMVPF  差勤／加班申請紀錄檔     KEY= MV01+MV02+MV03+MV10+MV04
     A*****************************************************************
     A                                      UNIQUE
     A                                      REF(PYRF)
     A          R MV0
     A*
     A            MV01      R               COLHDG('公司編號')
     A            MV02      R               COLHDG('員工編號')
     A            MV03      R               COLHDG('起始日期')
     A            MV04      R               COLHDG('假別')
     A            MV05      R               COLHDG('終止日期')
     A            MV06      R               COLHDG('起始時間')
     A            MV07      R               COLHDG('終止時間')
     A            MV08      R               COLHDG('時數')
     A            MV09      R               COLHDG('天數')
     A            MV10      R               COLHDG('申請項目')
     A*MV10:1.差勤2.加班
     A            MV11      R               COLHDG('申請日期')
     A            MV12      R               COLHDG('申請時間')
     A            MV13      R               COLHDG('次數')
     A            MV14      R               COLHDG('薪資處理月份')
     A*
     A            MV97      R               COLHDG('記錄更新日期')
     A            MV98      R               COLHDG('記錄更新時間')
     A            MV99      R               COLHDG('使用者代號')
     A*
     A          K MV01
     A          K MV02
     A          K MV03
     A          K MV10
     A          K MV04
