     A******************************************************
     A* PYOSLF01  薪資異動檔
     A******************************************************
     A          R OS0
     A                                      PFILE(PYOSPF)
     A*公司＋年月＋期別＋項目
     A          K OS01
     A          K OS03
     A          K OS04
     A          K OS05
