     A******************************************************
     A* PYOSLF02  薪資異動檔
     A******************************************************
     A          R OS0
     A                                      PFILE(PYOSPF)
     A*公司＋薪資項目＋年月＋期別＋員工
     A          K OS01
     A          K OS03
     A          K OS04
     A          K OS02
     A          K OS05
