     A*****************************************************************
     A*  PYOVLF01  •[ØZ•D¿…                 KEY= OV01+OV02+OV03
     A*****************************************************************
     A          R OV0
     A                                      PFILE(PYOVPF)
     A          K OV01
     A          K OV02
     A          K OV96
     A          K OV43
