     A*****************************************************************
     A*         PYP1PFX 教師基本資料轉檔    PC: EMPL
     A*****************************************************************
     A          R P10X
     A            P1X01         10          COLHDG('身份証號')
     A            P1X02          1          COLHDG('身份證號識別碼')
     A            P1X3A         14          COLHDG('員工姓名')
     A            P1X3B         40          COLHDG('英文姓名A')
     A            P1X3C         22          COLHDG('英文姓名B')
     A            P1X04         62          COLHDG('地址')
     A* F-本國   M-外籍
     A            P1X05          1          COLHDG('國籍')
     A                                      VALUES('L' 'F')
     A* 1-一般2-10% 3-20% 5- 6%
     A            P1X06          1          COLHDG('所得扣繳')
     A                                      VALUES('1' '2' '3' '5')
     A* F-女   M-男
     A            P1X07          1          COLHDG('性別')
     A                                      VALUES('F' 'M')
     A*
     A            P1X08          1          COLHDG('扣繳勞保費')
     A            P1X09          1          COLHDG('扣繳健保費')
     A            P1X10          1          COLHDG('扣抵所得稅')
     A* 1-台銀 2-彰銀 3-一銀 4-慶豐銀
     A            P1X11          1          COLHDG('銀行別')
     A                                      VALUES('1' '2' '3' '4')
     A*
     A            P1X12          7          COLHDG('銀行代號')
     A            P1X13         12          COLHDG('存入帳號')
     A*
     A          K P1X01
