     A*****************************************************************
     A*  PYP1PF  教師基本資料檔( PC端轉存)
     A*****************************************************************
     A          R P10
     A            P101           8          COLHDG('員工編號')
     A            P102          10          COLHDG('身份証號')
     A            P103           1          COLHDG('身份證號識別碼')
     A            P104A         14O         COLHDG('員工姓名')
     A            P104B         62          COLHDG('英文姓名')
     A            P105A         62O         COLHDG('通訊地址')
     A            P105B         62O         COLHDG('戶籍地址')
     A*
     A            P106           1          COLHDG('國籍')
     A                                      VALUES('L' 'F')
     A*                                     F-本國   M-外籍
     A            P107           1          COLHDG('所得扣繳')
     A*                                     1-一般2-10% 3-20% 5- 6%
     A            P108           1          COLHDG('性別')
     A                                      VALUES('F' 'M')
     A*                                     F-女   M-男
     A            P109           1          COLHDG('扣繳勞保費')
     A            P1010          1          COLHDG('扣繳健保費')
     A            P1011          1          COLHDG('扣抵所得稅')
     A            P1012          3          COLHDG('銀行總行代號')
     A            P1013          4          COLHDG('銀行分行代號')
     A            P1014         12          COLHDG('存入帳號')
     A            P1015          1          COLHDG('銀行別')
     A            P1016          1          COLHDG('有無基本資料')
     A                                      VALUES('Y' 'N')
     A*顯示於人事主檔中是否已有資料存在   Y-是   N-否
     A*
     A            P1097          8S 0       COLHDG('記錄更新日期')
     A            P1098          6S 0       COLHDG('記錄更新時間')
     A            P1099         10          COLHDG('使用者代號')
     A*
     A          K P102
     A          K P101
