     A*****************************************************************
     A*  PYP2PF  教師薪金資料檔( PC端轉存)
     A*****************************************************************
     A          R P20
     A            P201           8          COLHDG('員工編號')
     A            P202          10          COLHDG('身份証號')
     A            P203           1          COLHDG('身份證號識別碼')
     A            P204A         14O         COLHDG('員工姓名')
     A            P204B         62          COLHDG('英文姓名')
     A            P2051          1          COLHDG('部門代碼一')
     A            P2052          1          COLHDG('部門代碼二')
     A            P2053          1          COLHDG('部門代碼三')
     A            P2054          2          COLHDG('部門代碼四')
     A*
     A            P206           1          COLHDG('國籍')
     A                                      VALUES('L' 'F')
     A*                                     F-本國   M-外籍
     A            P207           1          COLHDG('所得扣繳')
     A*                                     1-一般2-10% 3-20% 5- 6%
     A            P208           8S 0       COLHDG('薪資發放日期')
     A            P209           1          COLHDG('扣繳勞保費')
     A            P2010          1          COLHDG('扣繳健保費')
     A            P2011          1          COLHDG('扣抵所得稅')
     A            P2012         10          COLHDG('課程項目')
     A            P2013         10          COLHDG('期別')
     A            P2014          8S 0       COLHDG('日期')
     A            P2015         14          COLHDG('班級')
     A            P2016         20          COLHDG('期間')
     A            P2017          5S 2       COLHDG('堂數')
     A            P2018          5S 2       COLHDG('堂時數')
     A            P2019          5S 2       COLHDG('總時數')
     A            P2020          6S 0       COLHDG('鐘點費')
     A            P2021          6S 0       COLHDG('金額')
     A            P2022          1          COLHDG('有無基本資料')
     A                                      VALUES('Y' 'N')
     A*顯示於人事主檔中是否已有資料存在   Y-是   N-否
     A*
     A*
     A            P2097          8S 0       COLHDG('記錄更新日期')
     A            P2098          6S 0       COLHDG('記錄更新時間')
     A            P2099         10          COLHDG('使用者代號')
     A*
     A          K P202
     A          K P201
