     A*****************************************************************
     A*PYPBLF03公司獎金資料檔
     A*****************************************************************
     A          R PB0
     A                                      PFILE(PYPBPF)
     A*('公司編號')
     A          K PB01
     A*('獎金年度')
     A          K PB03
     A*('工作地點')
     A          K PB15
     A*('部門代碼')
     A          K PB141
     A          K PB142
     A          K PB143
     A          K PB144
