     A****************************************************************
     A*PYPBJF04  公司獎金＋部門主檔＋公司主檔                      *
     A****************************************************************
     A          R PBJF04                    JFILE(PYPBPF PYDPPF +
     A                                           SYCMPF)
     A*-----------------------------------------------------------****
     A          J                           JOIN(PYPBPF PYDPPF)
     A                                      JFLD(PB15   KEYDP2)
     A          J                           JOIN(PYDPPF SYCMPF)
     A                                      JFLD(DP09 CM01)
     A*-----------------------------------------------------------****
     A            PB01      R
     A            PB02      R
     A            PB03      R
     A            PB04      R
     A            PB05      R
     A            PB05D     R
     A            PB06      R
     A            PB07      R
     A            PB08      R
     A            PB09      R
     A            PB10      R
     A            PB11      R
     A            PB12      R
     A            PB13      R
     A            PB141     R
     A            PB142     R
     A            PB143     R
     A            PB144     R
     A            PB15      R
     A            PB96      R
     A*-----------------------------------------------------------****
     A            KEYDP2                    CONCAT(DP011 DP012 +
     A                                            DP013 DP014)
     A            DP011     R
     A            DP012     R
     A            DP013     R
     A            DP014     R
     A            DP02      R
     A            DP09      R
     A*-----------------------------------------------------------****
     A            CM01      R
     A            CM02      R
     A            CM03      R
     A            CM04      R
     A            CM05      R
     A            CM06      R
     A            CM08      R
     A            CM10      R
     A            CM11      R
     A            CM12      R
     A*-----------------------------------------------------------****
     A
