     A*****************************************************************
     A*  PYPBPF  公司獎金資料檔
     A*****************************************************************
     A          R PB0
     A                                      PFILE(PYPBPF)
     A          K PB01
     A          K PB04
