     A******************************************************
     A*  PYPDLF1Á~¸ê¥DÀÉ¡Ð¢Ò¢Ó¢â¢Ï¢×¢Ú
     A******************************************************
     A          R PD0
     A                                      PFILE(PYPDPF)
     A          K PD01
     A          K PD03
     A          K PD02
