     A******************************************************
     A*  PYPD1LF1加班基礎薪資項目檔
     A******************************************************
     A          R PD10
     A                                      PFILE(PYPD1PF)
     A          K PD101
     A          K PD103
     A          K PD102
