     A*****************************************************************
     A*  PYPEPF  公司獎金出勤資料檔
     A*****************************************************************
     A          R PE0
     A                                      PFILE(PYPEPF)
     A          K PE01
     A          K PE03
     A          K PE02
