     A*****************************************************************
     A*  PYPHPF  Á~¸ê¾ú¥vÀÉHEADING
     A*****************************************************************
     A          R PH0
     A                                      PFILE(PYPHPF)
     A          K PH01
     A          K PH03
     A          K PH04
