     A****************************************************************
     A*PYPHJF06  薪資歷史＋人事主檔＋部門主檔＋公司主檔            *
     A****************************************************************
     A          R PHJF06                    JFILE(PYEMPF PYPHPF +
     A                                           PYDPPF SYCMPF)
     A*-----------------------------------------------------------****
     A          J                           JOIN(PYEMPF PYPHPF)
     A                                      JFLD(KEYEM1 KEYPH1)
     A          J                           JOIN(PYPHPF PYDPPF)
     A                                      JFLD(PH35   KEYDP2)
     A          J                           JOIN(PYDPPF SYCMPF)
     A                                      JFLD(DP09 CM01)
     A*-----------------------------------------------------------****
     A            KEYPH1                     CONCAT(PH01 PH02)
     A            PH01      R
     A            PH02      R
     A            PH03      R
     A            PH04      R
     A            PH05      R
     A            PH07      R
     A            PH14      R
     A            PH15      R
     A            PH16      R
     A            PH17      R
     A            PH18      R
     A            PH19      R
     A            PH20      R
     A            PH24      R
     A            PH26      R
     A            PH27      R
     A            PH28      R
     A            PH29      R
     A            PH30      R
     A            PH31      R
     A            PH32      R
     A            PH33      R
     A            PH341     R
     A            PH342     R
     A            PH343     R
     A            PH344     R
     A            PH35      R
     A*-----------------------------------------------------------****
     A            KEYEM1                    CONCAT(EM01 EM02)
     A            EM01      R
     A            EM02      R
     A            EM03      R
     A            EM041     R
     A            EM042     R
     A            EM043     R
     A            EM044     R
     A            EM13      R
     A            EM19      R
     A            EM31      R
     A            EM311     R
     A            EM321     R
     A            EM39      R
     A            EM127     R
     A*-----------------------------------------------------------****
     A            KEYDP2                    CONCAT(DP011 DP012 +
     A                                            DP013 DP014)
     A            DP011     R
     A            DP012     R
     A            DP013     R
     A            DP014     R
     A            DP02      R
     A            DP09      R
     A*-----------------------------------------------------------****
     A            CM01      R
     A            CM02      R
     A            CM03      R
     A            CM04      R
     A            CM05      R
     A            CM06      R
     A            CM08      R
     A            CM10      R
     A            CM11      R
     A            CM12      R
     A*-----------------------------------------------------------****
     A
