     A*****************************************************************
     A*  PYPQPF  生產獎金資料明細檔
     A*****************************************************************
     A          R PQ0
     A                                      PFILE(PYPQPF)
     A          K PQ03
     A          K PQ05
     A          K PQ01
