     A*****************************************************************
     A*  PYPTPF  工讀生薪資主檔           KEY= PT01+PT02+PT03
     A*****************************************************************
     A                                      UNIQUE
     A*                                     REF(PYRF)
     A          R PT0
     A            PT01           2A         COLHDG('公司編號')
     A            PT02          10A         COLHDG('身分証編號')
     A            PT03           6S 0       COLHDG('計薪年月')
     A            PT04           6S 0       COLHDG('給付年月')
     A            PT05           8S 0       COLHDG('基本薪')
     A            PT06           8S 0       COLHDG('獎金')
     A            PT07           6S 0       COLHDG('稅額')
     A            PT08           6S 0       COLHDG('勞保')
     A            PT09           6S 0       COLHDG('健保')
     A            PT10           6S 0       COLHDG('勞退')
     A            PT97           8S 0       COLHDG('記錄更新日期')
     A            PT98           6S 0       COLHDG('記錄更新時間')
     A            PT99          10A         COLHDG('使用者代號')
     A          K PT01
     A          K PT03
     A          K PT04
     A          K PT02
