     A******************************************************
     A*  PYPWLF01
     A******************************************************
     A          R PW0
     A                                      PFILE(PYPWPF)
     A          K PW01
     A          K PW02
     A          K PW03
     A          K PW04
