     A*****************************************************************
     A*****************************************************************
     A                                      UNIQUE
     A          R QQ0
     A            QQ01           5A         COLHDG('物流點代號')
     A            QQ02           9A         COLHDG('調出產品代號')
     A            QQ03           9S 0       COLHDG('調整數量')
     A          K QQ01
     A          K QQ02
