     A*****************************************************************
     A*  PYR222WF  对虏⌒郎A1274
     A*****************************************************************
     A                                      REF(PYRF)
     A          R W222
     A            W2201          2A         COLHDG('そ絪腹')
     A            W2202          5A         COLHDG('场絪腹')
     A            W2203         14O         COLHDG('场嘿')
     A            W2204          8A         COLHDG('絪腹')
     A            W2205         14O         COLHDG('﹎')
     A            W2206          4S 0       COLHDG('对る')
     A****        W2207          2S 0       COLHDG('对る')
     A            W2208          5S 0       COLHDG('筐Ω计')
     A            W2209          5S 1       COLHDG('ㄆ安计')
     A            W2210          5S 1       COLHDG('痜安计')
     A            W2211          5S 1       COLHDG('縩安计')
     A            W2212          5S 1       COLHDG('痁计')
     A            W2213         60O         COLHDG('称爹')
     A*
     A          K W2201
     A          K W2202
     A          K W2204
