     A******************************************************
     A*  PYR2PF  員工理賠資料檔 R201+R203
     A******************************************************
     A          R R20
     A                                      PFILE(PYR2PF)
     A          K R201
     A          K R204
