     A*****************************************************************
     A*  PYR320WF  薪資及各類所得扣繳稅款繳款書－工作檔
     A*****************************************************************
     A                                      REF(PYRF)
     A          R W320
     A            W320AA         2A         COLHDG('公司')
     A*-------------------------------------------------------------***
     A**薪資所得扣繳稅額繳款書
     A*固定薪資按扣繳稅額表扣繳
     A            W32011         4S 0       COLHDG('人數一')
     A            W32012         5S 0       COLHDG('扣繳年月')
     A            W32013         8S 0       COLHDG('給付所得')
     A            W32014         8S 0       COLHDG('扣繳稅額')
     A*非固定薪資及兼職薪資一律按6%扣繳
     A            W32021         4S 0       COLHDG('人數二')
     A            W32022         5S 0       COLHDG('扣繳年月')
     A            W32023         8S 0       COLHDG('給付所得')
     A            W32024         8S 0       COLHDG('扣繳稅額')
     A*給付中華民國境內居住之個人之薪資選擇按10%扣繳
     A            W32031         4S 0       COLHDG('人數三')
     A            W32032         5S 0       COLHDG('扣繳年月')
     A            W32033         8S 0       COLHDG('給付所得')
     A            W32034         8S 0       COLHDG('扣繳稅額')
     A*給付非中華民國境內居住之個人薪資按20%扣繳
     A            W32041         4S 0       COLHDG('人數四')
     A            W32042         5S 0       COLHDG('扣繳年月')
     A            W32043         8S 0       COLHDG('給付所得')
     A            W32044         8S 0       COLHDG('扣繳稅額')
     A*免扣繳人數
     A            W32051         4S 0       COLHDG('人數五')
     A            W32052         5S 0       COLHDG('扣繳年月')
     A            W32053         8S 0       COLHDG('給付所得')
     A            W32054         8S 0       COLHDG('扣繳稅額')
     A*
     A*-------------------------------------------------------------***
     A**各類所得扣繳稅額繳款書
     A*租賃: 51
     A            W320A1         4S 0       COLHDG('人數Ａ')
     A            W320A2         5S 0       COLHDG('扣繳年月')
     A            W320A3         8S 0       COLHDG('給付所得')
     A            W320A4         8S 0       COLHDG('扣繳稅額')
     A*其他利息: 5A, 5B, 5C, 5D, 5E
     A            W320B1         4S 0       COLHDG('人數Ｂ')
     A            W320B2         5S 0       COLHDG('扣繳年月')
     A            W320B3         8S 0       COLHDG('給付所得')
     A            W320B4         8S 0       COLHDG('扣繳稅額')
     A*權利金: 53
     A            W320C1         4S 0       COLHDG('人數Ｃ')
     A            W320C2         5S 0       COLHDG('扣繳年月')
     A            W320C3         8S 0       COLHDG('給付所得')
     A            W320C4         8S 0       COLHDG('扣繳稅額')
     A*盈餘: 54
     A            W320D1         4S 0       COLHDG('人數Ｄ')
     A            W320D2         5S 0       COLHDG('扣繳年月')
     A            W320D3         8S 0       COLHDG('給付所得')
     A            W320D4         8S 0       COLHDG('扣繳稅額')
     A*執行業務報酬: 9A
     A            W320E1         4S 0       COLHDG('人數Ｅ')
     A            W320E2         5S 0       COLHDG('扣繳年月')
     A            W320E3         8S 0       COLHDG('給付所得')
     A            W320E4         8S 0       COLHDG('扣繳稅額')
     A*稿費: 9B
     A            W320F1         4S 0       COLHDG('人數Ｆ')
     A            W320F2         5S 0       COLHDG('扣繳年月')
     A            W320F3         8S 0       COLHDG('給付所得')
     A            W320F4         8S 0       COLHDG('扣繳稅額')
     A*競技競賽及機會中獎獎金: 91
     A            W320G1         4S 0       COLHDG('人數Ｇ')
     A            W320G2         5S 0       COLHDG('扣繳年月')
     A            W320G3         8S 0       COLHDG('給付所得')
     A            W320G4         8S 0       COLHDG('扣繳稅額')
     A*其他所得: 92
     A            W320H1         4S 0       COLHDG('人數Ｈ')
     A            W320H2         5S 0       COLHDG('扣繳年月')
     A            W320H3         8S 0       COLHDG('給付所得')
     A            W320H4         8S 0       COLHDG('扣繳稅額')
     A*
     A          K W320AA
