     A*****************************************************************
     A*  PYR618WF     勞工保險投保資料工作檔
     A*****************************************************************
     A                                      REF(PYRF)
     A          R WF0
     A            WF011     R               COLHDG('部門編號１')
     A                                      REFFLD(EM041)
     A            WF012     R               COLHDG('部門編號２')
     A                                      REFFLD(EM042)
     A            WF013     R               COLHDG('部門編號３')
     A                                      REFFLD(EM043)
     A            WF014     R               COLHDG('部門編號４')
     A                                      REFFLD(EM044)
     A            WF02      R               COLHDG('部門簡稱')
     A                                      REFFLD(DP02 *LIBL/PYDPPF)
     A            WF03      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            WF04      R               COLHDG('員工姓名')
     A                                      REFFLD(EM03)
     A            WF05      R               COLHDG('身份證號')
     A                                      REFFLD(EM31)
     A            WF06      R               COLHDG('出生日期')
     A                                      REFFLD(EM33)
     A            WF07      R               COLHDG('異動類別')
     A                                      REFFLD(L307 *LIBL/PYL3PF)
     A            WF08      R               COLHDG('生效日期')
     A                                      REFFLD(L303 *LIBL/PYL3PF)
     A            WF09      R               COLHDG('投保金額')
     A                                      REFFLD(L304 *LIBL/PYL3PF)
     A*
     A            WF91           3S 0       COLHDG('部門順序')
     A            WF92           1S 0       COLHDG('異動順序')
     A*
     A*         K WF91
