     A*****************************************************************
     A*  PYR643WF  勞工保險費證明表－工作檔　　　　　　
     A*****************************************************************
     A                                      REF(PYRF)
     A          R WF0
     A            WF01      R               COLHDG('公司編號')
     A                                      REFFLD(EM01)
     A            WF02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            WF03      R               COLHDG('員工姓名')
     A                                      REFFLD(EM03)
     A            WF04      R               COLHDG('身份証號')
     A                                      REFFLD(EM31)
     A            WF05           7P 0       COLHDG('勞保費金額')
     A            WF06      R               COLHDG('備　註')
     A                                      REFFLD(E102)
     A            WF07           3S 0       COLHDG('年　度')
     A            WF08           7A         COLHDG('部門代碼')
     A            WF09           3S 0       COLHDG('順序')
     A*
     A          K WF01
     A          K WF02
     A          K WF07
