     A*****************************************************************
     A*  PYR619XF     健保保險投保資料工作檔-眷屬
     A*****************************************************************
     A                                      REF(PYRF)
     A          R WF1
     A            WF103     R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A*
     A            WF11      R               COLHDG('眷屬姓名')
     A                                      REFFLD(E206 *LIBL/PYE2PF)
     A            WF12      R               COLHDG('身份證號')
     A                                      REFFLD(E207 *LIBL/PYE2PF)
     A            WF13      R               COLHDG('出生日期')
     A                                      REFFLD(E208 *LIBL/PYE2PF)
     A            WF14      R               COLHDG('異動類別')
     A                                      REFFLD(E513 *LIBL/PYE5PF)
     A            WF15      R               COLHDG('眷屬生效日期')
     A                                      REFFLD(E512 *LIBL/PYE5PF)
     A            WF16      R               COLHDG('補助碼')
     A                                      REFFLD(E511 *LIBL/PYE5PF)
     A            WF17      R               COLHDG('眷屬稱謂')
     A                                      REFFLD(E509 *LIBL/PYE5PF)
     A*
     A            WF91           3S 0       COLHDG('部門順序')
     A            WF92           1S 0       COLHDG('異動順序')
     A            WF93           1S 0       COLHDG('眷屬異動順序')
     A*
     A          K WF103
     A          K WF12
     A          K WF15
