     A*****************************************************************
     A*                MIRS-->人事薪資管理系統
     A*==============================================================*
     A*序號|檔　案　名　稱
     A*==============================================================*
     A*  01  |SYBNPF|銀行主檔
     A*  02  |SYCMPF|公司主檔
     A*  03  |SYFAPF|所得扣繳媒體單位資料檔
     A*  04  |PYJTPF|職稱基本資料檔
     A*  05  |PYDPPF|部門基本資料檔
     A*  06  |PYCCPF|成本中心基本資料檔
     A*  07  |PYPSPF|核薪標準（職等）資料檔
     A*  08  |PYTAPF|稅率參數檔
     A*  09  |PYTCPF|稅率控制參數檔
     A*  10  |PYPGPF|保費對照表
     A*  11  |PYQJPF|離職原因代碼檔
     A*  12  |PYEMPF|人事主檔
     A*  13  |PYTRPF|人事調動主檔
     A*  14  |PYTXPF|人事異動主檔
     A*  15  |PYCSPF|改薪（計薪方式）主檔
     A*  16  |PYEDPF|教育訓練主檔
     A*  17  |PYR1PF|年齡、年資分析報表控制檔
     A*  18  |PYLCPF|假別主檔
     A*  19  |PYOVPF|加班主檔
     A*  20  |PYLVPF|請假主檔
     A*  21  |PYWHPF|時薪人員上班時數資料建立檔
     A*  22  |PYLAPF|遲到主檔
     A*  23  |PYPMPF|人事薪資參數主檔
     A*  24  |PYLTPF|特休假歷史記錄檔
     A*  25  |PYSSPF|薪資結構參數檔
     A*  26  |PYPYPF|薪資主檔 HEADING
     A*  27  |PYPDPF|薪資主檔 DETAIL
     A*  28  |PYOSPF|其它薪資主檔
     A*  29  |PYSHPF|調薪主檔 HEADING
     A*  30  |PYSDPF|調薪主檔 DETAIL
     A*  31  |PYLNPF|員工貸款資料檔
     A*  32  |PYPWPF|所得工作檔 HEADING
     A*  33  |PYWDPF|所得工作檔 DETAIL
     A*  34  |PYPHPF|所得歷史檔 HEADING
     A*  35  |PYHDPF|所得歷史檔 DETAIL
     A*  36  |PYCHPF|所得成本檔 HEADING
     A*  37  |PYCDPF|所得成本檔 DETAIL
     A*  38  |PYPBPF|公司獎金資料檔
     A*  39  |PYBCPF|所得銀行不轉存工作檔
     A*  40  |PYBTPF|所得銀行轉存工作檔
     A*  41  |PYB1PF|一銀銀行轉存檔
     A*  42  |PYB2PF|彰銀銀行轉存檔
     A*  43  |PYB3PF|臺灣中小企業銀行轉存檔
     A*  44  |PYB4PF|北市銀行轉存檔
     A*  45  |PYB5PF|合庫轉存檔
     A*  46  |PYB6PF|郵局轉存檔
     A*  47  |PYVAPF|特別休假參數檔
     A*  48  |PYPCPF|公司獎金成本檔
     A*  49  |PYDSPF|薪資成本分攤檔
     A*  50  |PYLIPF|員工住宿主檔
     A*  51  |PYLPPF|員工住宿費用明細檔
     A*==============================================================*
     A*  41  |PYEGPF|福委會發放資料檔
     A*  42  |PYSBPF|銷售獎金資料檔
     A*  43  |PYMBPF|管理獎金資料檔
     A*  44  |PYMSPF|管理獎金成本檔
     A*  45  |PYEPPF|臨時人員基本資料檔
     A*  46  |PYPAPF|臨時人員薪資發放資料檔
     A*  47  |PYCBPF|薪資預算資料－成本中心
     A*  48  |PYPVPF|考績資料檔
     A*==============================================================*
     A*      |PYTBPF|其他所得課稅資料檔
     A*      |PYTDPF|所得稅課稅申報資料檔
     A*      |PYTTPF|所得稅課稅申報磁帶檔－英
     A*      |PYTUPF|所得稅課稅申報磁帶檔－中 TAPE
     A*      |PYTUPF|所得稅課稅申報磁帶檔－中 AS400->PC FLOPPY
     A*==============================================================*
8402 A*      |PYE1PF|全民健保投保資料-HEADING
9002 A*      |PYE2PF|全民健保投保資料-DETAIL
8402 A*      |PYE3PF|全民健保投保級數
8402 A*      |PYE4PF|全民健保投保參數
9106 A*      |PYE5PF|眷屬健保投保歷史檔
9106 A*      |PYE6PF|健保扣繳歷史檔
9106 A*      |PYE7PF|各縣市健保額補助檔
     A*==============================================================*
8908 A*      |PYL1PF|勞保投保級數參數檔
8908 A*      |PYL2PF|勞保費率參數檔
     A*==============================================================*
8908 A*      |PYX1PF|團體保險投保資料-HEADING
8908 A*      |PYX2PF|團體保險投保資料-DETAIL
8908 A*      |PYX9PF|團保費率設定檔
     A*==============================================================*
     A*  70  PYT1PF刷卡時間資料檔
     A*  71  PYT2PF員工排班資料檔
     A*  72  PYT5PF員工刷卡資料檔
     A*  73  PYT5PFX員工刷卡原始資料檔
     A*  74  PYT6PF員工刷卡異常資料檔
     A*  75  PYT7PF休假日資料檔FOR不輪班
     A*  77  PYNOPF自動編號檔
     A*==============================================================*
     A*  81  PYAIPF年度調薪(AI)公式檔
     A*  81  |PYARPF|年度調薪(AI)規則檔(保留)
     A*  81  PYXAPF工作區檔
     A*  81  PYXBPF工作組檔
     A*  81  PYXCPF工作組成員檔
     A*  81  PYXDPF小組成員支援檔
     A*  81  PYXEPF小組成員調組檔
     A*  81  PYXFPF班別設定檔
     A*  81  PYXGPF勤別設定檔
     A*  81  PYXHPF週班設定檔
     A*  81  PYXIPF排班異動檔
     A*  81  PYXJPF飛機勤務設定檔
     A*  81  PYXKPF出勤日異動作業檔
     A*  81  PYXLPF月結作業檔
8801 A*  82  PYBXPF薪資項目彙總檔
     A*  83  |PYBGPF|薪資月彙總檔
     A*  84  |PYODPF|遲到次數設定檔
     A*==============================================================*
8903 A*  CREATE FOR *YM USE ONLY
     A*  85  PYP1PF　教師基本資料檔(AS/400)
     A*  86  PYP1PFX 教師基本資料原始檔(PC)
     A*  87  PYP2PF　教師薪金資料檔(AS/400)
     A*  88  PYP2PFX 教師薪金資料原始檔(PC)
     A*  89  PYRRPF　考績比率檔　　　　　　　　　　　
     A*  90  PYRVPF　員工考績檔　　　　　　　　
     A*  91  PYR2PF　員工理賠資料檔　　　　　　
     A*==============================================================*
8905 A*  CREATE FOR *YH USE ONLY
     A*      PYERPF褔委會收支檔
     A*      PYOFPF差勤加班申請檔
     A*      PYD1PF人事基本資料備註檔
     A*      PYD2PF員工工作內容資料輸入記錄檔
     A*      PYD3PF員工專長資料檔
     A*      PYD4PF員工意向調查資料記錄檔
     A*      PYMVPF差勤／加班申請紀錄檔　
     A*      |PYDTA1|  員工人事資料轉檔
     A*      PYGHPF褔委會員工補助金主檔
     A*      PYGDPF褔委會員工補助金明細檔
     A*==============================================================*
     A*      PY2HPF年假批次處理檔
     A*      PYH3PF特休遞延資料檔
     A*      PYBUPF利潤獎金資料檔
     A*==============================================================*
9107 A*  CREATE FOR *EL USE ONLY
     A*  01  PYPPPF生產獎金資料主檔
     A*  02  PYPQPF生產獎金資料明細檔
     A*  03  PYT8PF人事晉升資料檔
     A*  04  |PYS1PF|  薪資項目歸屬檔
     A*==============================================================*
     A          R PYRFR
     A*****************************************************************
     A*  SYBNPF  銀行名稱資料檔           KEY=BN01                  *
     A*****************************************************************
     A            BN011          3          COLHDG('銀行總行代號')
     A            BN012          4          COLHDG('銀行分行代號')
     A            BN02          32O         COLHDG('銀行名稱－中文')
     A            BN03          32          COLHDG('銀行名稱－英文')
     A            BN04          14O         COLHDG('銀行簡稱')
     A            BN05          62O         COLHDG('銀行地址－中文')
     A            BN06          62          COLHDG('銀行地址－英文')
     A            BN07          15          COLHDG('電話')
     A            BN08          15          COLHDG('傳真機')
     A            BN09          15          COLHDG('電報號碼')
     A            BN10           1          COLHDG('本地銀行')
     A* 'L'=本地銀行
     A            BN97           8S 0       COLHDG('記錄更新日期')
     A            BN98           6S 0       COLHDG('記錄更新時間')
     A            BN99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  SYCMPF  公司主檔                 KEY= CM01
     A*****************************************************************
     A            CM01           2          COLHDG('公司編號')
     A            CM02          14O         COLHDG('公司簡稱')
     A            CM03          34O         COLHDG('公司全名')
     A            CM04           8          COLHDG('統一編號')
     A            CM05          10          COLHDG('稅籍編號')
     A            CM06          15          COLHDG('公司電話')
     A            CM07          15          COLHDG('工廠電話')
     A            CM08          62O         COLHDG('公司地址')
     A            CM09          62O         COLHDG('工廠地址')
     A            CM10          12O         COLHDG('所得扣繳義務人')
     A            CM11           4          COLHDG('所得扣繳媒體單位')
    @A            CM12           3          COLHDG('稽徵機關')
     A            CM13           2          COLHDG('薪資組別')
     A            CM14           1          COLHDG('日期格式')
     A            CM15           1          COLHDG('日期曆別')
     A            CM97           8S 0       COLHDG('記錄更新日期')
     A            CM98           6S 0       COLHDG('記錄更新時間')
     A            CM99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  SYFAPF  所得扣繳媒體申報單位資料
     A*****************************************************************
     A            FA01           4          COLHDG('媒體單位')
     A            FA02           1          COLHDG('縣市代號')
     A            FA03           2          COLHDG('總分處')
     A            FA04           7  0       COLHDG('流水號')
     A            FA97           8S 0       COLHDG('記錄更新日期')
     A            FA98           6S 0       COLHDG('記錄更新時間')
     A            FA99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYJTPF  職稱基本資料檔
     A*****************************************************************
     A            JT01           3          COLHDG('職稱編號')
     A            JT02          14O         COLHDG('職稱名稱')
     A            JT03           1          COLHDG('加班計薪')
     A*'1'-計時    '2'-津貼
     A            JT04           1          COLHDG('職務加給')
     A*'Y/N'-職務加給有無
     A            JT05           5  0       COLHDG('職務加給起')
     A            JT06           5  0       COLHDG('職務加給迄')
     A            JT07           1          COLHDG('全勤獎金')
     A*'Y/N'-全勤獎金有無
     A            JT97           8S 0       COLHDG('記錄更新日期')
     A            JT98           6S 0       COLHDG('記錄更新時間')
     A            JT99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYCCPF  成本中心基本資料檔
     A*****************************************************************
     A            CC011          1          COLHDG('成本中心－大類')
     A*區分公司、工廠
     A            CC012          3          COLHDG('成本中心－序號')
     A            CC013          1          COLHDG('成本中心－成本')
     A*區分直接、間接成本
     A            CC02          14O         COLHDG('成本中心名稱')
     A            CC97           8S 0       COLHDG('記錄更新日期')
     A            CC98           6S 0       COLHDG('記錄更新時間')
     A            CC99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYDPPF  部門基本資料檔
     A*****************************************************************
     A            DP011          1          COLHDG('部門代碼１')
     A            DP012          1          COLHDG('部門代碼２')
     A*區分公司、工廠
     A            DP013          1          COLHDG('部門代碼３')
     A*區分公司下之處與工廠下之部
     A            DP014          4          COLHDG('部門代碼４')
     A*區分公司下之部與工廠下之工作區域
     A            DP02          16O         COLHDG('部門簡稱')
     A            DP03           7  0       COLHDG('區域津貼')
     A*TMC駐外津貼
     A            DP04           1          COLHDG('代碼類別')
     A*'1'-明細    '2'-彙總（彙總不可為員工所屬部門別）
     A            DP05           7  0       COLHDG('房屋津貼')
     A            DP06           3  0       COLHDG('最高可計加班時數')
     A            DP07           1          COLHDG('加班費計算方式')
     A*'1'-一般  '2'-師傅
     A            DP08          40O         COLHDG('部門名稱')
     A            DP09           2          COLHDG('稅籍歸屬公司')
     A*
     A            DP97           8S 0       COLHDG('記錄更新日期')
     A            DP98           6S 0       COLHDG('記錄更新時間')
     A            DP99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYPSPF  核薪標準參數檔           KEY= PS01 + PS04
     A*****************************************************************
     A            PS01           2          COLHDG('職等')
     A            PS02           7  0       COLHDG('職等金額')
     A            PS03           7  0       COLHDG('職級金額')
     A            PS04           3  0       COLHDG('職級')
     A            PS05           7  0       COLHDG('職務加給金額')
     A            PS06           7  0       COLHDG('主管加給金額')
     A            PS07           7  0       COLHDG('調整級差金額')
     A            PS08           3  1       COLHDG('利潤獎金點數')
     A            PS09           7  0       COLHDG('每職級金額')
     A            PS10           5  0       COLHDG('績效獎金')
     A*
     A            PS97           8S 0       COLHDG('記錄更新日期')
     A            PS98           6S 0       COLHDG('記錄更新時間')
     A            PS99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYTAPF  稅率參數檔               KEY= TA01
     A*****************************************************************
     A            TA01           1          COLHDG('ＫＥＹ')
     A            TA02           7  0       COLHDG('個人免稅額')
     A            TA03           7  0       COLHDG('配偶免稅額')
     A            TA04           7  0       COLHDG('撫養親屬寬減額')
     A            TA05           7  0       COLHDG('標準扣除額')
     A            TA06           7  0       COLHDG('薪資扣除額')
     A            TA07           5  3       COLHDG('獎金稅率')
     A            TA08           5  0       COLHDG('最低稅額')
     A            TA09           5  3       COLHDG('勞保費率')
     A            TA10           5  3       COLHDG('員工負擔比率')
     A            TA11           5  4       COLHDG('墊償比率')
     A            TA12           5  3       COLHDG('公司負擔比率')
     A            TA97           8S 0       COLHDG('記錄更新日期')
     A            TA98           6S 0       COLHDG('記錄更新時間')
     A            TA99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYTCPF  稅率控制參數檔           KEY= TC03
     A*****************************************************************
     A            TC02           9S 0       COLHDG('所得稅上限')
     A            TC03           9S 0       COLHDG('所得稅下限')
     A            TC04           5  3       COLHDG('所得稅率')
     A            TC05           7  0       COLHDG('累進差額')
     A            TC97           8S 0       COLHDG('記錄更新日期')
     A            TC98           6S 0       COLHDG('記錄更新時間')
     A            TC99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYPGPF  保費對照表               KEY= PG01+PG02
     A*****************************************************************
     A            PG01           1          COLHDG('保費類別')
     A*'M'-南山醫療險   'C'-防癌保險
     A            PG02           5S 0       COLHDG('員工負擔保費')
     A            PG03           5  0       COLHDG('公司負擔保費')
     A            PG97           8S 0       COLHDG('記錄更新日期')
     A            PG98           6S 0       COLHDG('記錄更新時間')
     A            PG99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYQJPF  離職原因代碼檔           KEY= QJ01
     A*****************************************************************
     A            QJ01           2          COLHDG('離職代碼')
     A            QJ02          32O         COLHDG('離職原因')
     A            QJ97           8S 0       COLHDG('記錄更新日期')
     A            QJ98           6S 0       COLHDG('記錄更新時間')
     A            QJ99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYEMPF  人事主檔                 KEY= EM01+EM02
     A*****************************************************************
     A            EM01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            EM02           8          COLHDG('員工編號')
     A            EM03          14O         COLHDG('員工姓名')
     A            EM031         62          COLHDG('英文姓名')
     A*職務資料*
     A            EM041     R               COLHDG('部門編號１')
     A                                      REFFLD(DP011)
     A            EM042     R               COLHDG('部門編號２')
     A                                      REFFLD(DP012)
     A            EM043     R               COLHDG('部門編號３')
     A                                      REFFLD(DP013)
     A            EM044     R               COLHDG('部門編號４')
     A                                      REFFLD(DP014)
     A            EM05      R               COLHDG('職稱編號')
     A                                      REFFLD(JT01)
     A            EM051     R               COLHDG('副職稱編號')
     A                                      REFFLD(JT01)
     A            EM06      R               COLHDG('職等編號')
     A                                      REFFLD(PS01)
     A            EM07      R               COLHDG('職級編號')
     A                                      REFFLD(PS04)
     A            EM08           1          COLHDG('班別代號')
     A                                      VALUES('1' '2' '3' '4' '5')
     A* 1-常日 2-輪班  3-日班  4-中班  5-夜班
     A            EM09           1          COLHDG('編制代號')
     A                                      VALUES('1' '2')
     A* 1-正式員工 2-試用員工
     A            EM10           1          COLHDG('計薪代號')
     A                                      VALUES('1' '2' '3')
     A* 1-本國籍 2-董監事顧問 3-外國籍
     A            EM11           1          COLHDG('離職碼')
     A* ' '-在職 */Y-離職(*-未核薪 Y-已核薪)  R-留職停薪 S-長病
     A            EM12           1          COLHDG('是否有全勤獎金')
     A            EM13           8S 0       COLHDG('到職日期')
     A            EM14           8S 0       COLHDG('勞保投保日期')
     A            EM15           8S 0       COLHDG('勞保調整日期')
     A            EM16           8S 0       COLHDG('勞保退保日期')
     A            EM17           8S 0       COLHDG('留職停薪日')
     A            EM18           8S 0       COLHDG('復職日期')
     A            EM19           8S 0       COLHDG('離職日期')
     A            EM20           8S 0       COLHDG('試用期滿日')
     A            EM21           8S 0       COLHDG('最近調陞日')
     A            EM22           8S 0       COLHDG('最近調薪日')
     A            EM23           7  0       COLHDG('勞保投保金額')
     A            EM24           1          COLHDG('福委會加入')
     A                                      VALUES('Y' 'N')
     A            EM25           1          COLHDG('工會加入')
     A                                      VALUES('Y' 'N')
     A            EM26           5  0       COLHDG('留職天數')
     A            EM261          5  0       COLHDG('留職天數累計')
     A            EM27           3  0       COLHDG('特加年資')
     A            EM28           7  0       COLHDG('每月代扣所得稅')
     A            EM291          8S 0       COLHDG('團保一投保日')
     A            EM292          5  0       COLHDG('團保一員工負擔保費')
     A            EM293          8S 0       COLHDG('團保一調整日期')
     A            EM294          8S 0       COLHDG('團保一退保日期')
     A            EM296          8S 0       COLHDG('團保二投保日')
     A            EM297          5  0       COLHDG('團保二員工負擔保費')
     A            EM298          8S 0       COLHDG('團保二調整日期')
     A            EM299          8S 0       COLHDG('團保二退保日期')
     A*基本資料*
     A            EM30           2          COLHDG('血型')
     A            EM31          10          COLHDG('身份証號')
     A            EM311          1          COLHDG('身份證號識別碼')
     A*'1'-證號錯誤  '2'-外籍人士
     A            EM32           1          COLHDG('性別')
     A                                      VALUES('F' 'M')
     A*                                     F-女   M-男
     A            EM321          1          COLHDG('國籍')
     A                                      VALUES('L' 'F')
     A*'F'-本國  'M'-外籍
     A            EM33           8S 0       COLHDG('出生日期')
     A            EM34           1          COLHDG('婚姻狀況')
     A                                      VALUES('S' 'M')
     A*                                     S-未婚 M-已婚
     A            EM35           2S 0       COLHDG('撫養人數')
     A            EM36           1          COLHDG('兵役')
     A                                      VALUES('1' '2' '3')
     A*1-未役 2-已役 3-免役
     A            EM37          22O         COLHDG('籍貫')
     A            EM38          62O         COLHDG('通訊地址')
     A            EM39          62O         COLHDG('戶籍地址')
     A            EM40          15          COLHDG('通訊電話１')
     A            EM401         15          COLHDG('通訊電話２')
     A            EM41          15          COLHDG('戶籍電話')
     A            EM42          14O         COLHDG('連絡人')
     A            EM43          14O         COLHDG('保証人１')
     A            EM431         14O         COLHDG('保証人２')
     A            EM44          14O         COLHDG('介紹人')
     A            EM45          15          COLHDG('連絡人電話１')
     A            EM451         15          COLHDG('連絡人電話２')
     A            EM452         15          COLHDG('連絡人電話３')
     A            EM46          15          COLHDG('保証人電話１')
     A            EM461         15          COLHDG('保証人電話２')
     A            EM47          15          COLHDG('介紹人電話')
     A*DEL EM48-EM55
     A*DEL EM561-EM593
     A*履歷資料*
     A            EM60          22O         COLHDG('學校名稱－１')
     A            EM61          22O         COLHDG('科系－１')
     A            EM62           6S 0       COLHDG('入校年月－１')
     A            EM63           6S 0       COLHDG('離校年月－１')
     A            EM64           1          COLHDG('畢／肄－１')
     A            EM65      R               COLHDG('學校名稱－２')
     A                                      REFFLD(EM60)
     A            EM66      R               COLHDG('科系－２')
     A                                      REFFLD(EM61)
     A            EM67      R               COLHDG('入校年月－２')
     A                                      REFFLD(EM62)
     A            EM68      R               COLHDG('離校年月－２')
     A                                      REFFLD(EM63)
     A            EM69      R               COLHDG('畢／肄－２')
     A                                      REFFLD(EM64)
     A            EM70      R               COLHDG('學校名稱－３')
     A                                      REFFLD(EM60)
     A            EM71      R               COLHDG('科系－３')
     A                                      REFFLD(EM61)
     A            EM72      R               COLHDG('入校年月－３')
     A                                      REFFLD(EM62)
     A            EM73      R               COLHDG('離校年月－３')
     A                                      REFFLD(EM63)
     A            EM74      R               COLHDG('畢／肄－３')
     A                                      REFFLD(EM64)
     A            EM75          22O         COLHDG('機關名稱－１')
     A            EM76          22O         COLHDG('職務－１')
     A            EM77           6S 0       COLHDG('任職年月－１')
     A            EM78           6S 0       COLHDG('離職年月－１')
     A            EM79      R               COLHDG('機關名稱－２')
     A                                      REFFLD(EM75)
     A            EM80      R               COLHDG('職務－２')
     A                                      REFFLD(EM76)
     A            EM81      R               COLHDG('任職年月－２')
     A                                      REFFLD(EM77)
     A            EM82      R               COLHDG('離職年月－２')
     A                                      REFFLD(EM78)
     A            EM83      R               COLHDG('機關名稱－３')
     A                                      REFFLD(EM75)
     A            EM84      R               COLHDG('職務－３')
     A                                      REFFLD(EM76)
     A            EM85      R               COLHDG('任職年月－３')
     A                                      REFFLD(EM77)
     A            EM86      R               COLHDG('離職年月－３')
     A                                      REFFLD(EM78)
     A            EM87          22O         COLHDG('專長－１')
     A            EM88          22O         COLHDG('語文－１')
     A            EM89      R               COLHDG('專長－２')
     A                                      REFFLD(EM87)
     A            EM90      R               COLHDG('語文－２')
     A                                      REFFLD(EM88)
     A            EM91      R               COLHDG('專長－３')
     A                                      REFFLD(EM87)
     A            EM92      R               COLHDG('語文－３')
     A                                      REFFLD(EM88)
     A            EM93           1          COLHDG('學歷代碼')
     A*'1'-小學 '2'-初中 '3'-高中   '4'-專科
     A*'5'-大學 '6'-碩士 '7'-博士
     A            EM94           1          COLHDG('新進碼')
     A*' '-新進未核薪   'Y'-新進已核薪  (復職亦同')
     A*到職或復職日期為上個月且本欄位為空白者計算上月工作日數與薪資
     A            EM951          8S 0       COLHDG('長病假')
     A            EM952          8S 0       COLHDG('長病假復職')
     A            EM953          5  0       COLHDG('長病假日數')
     A*
     A            EM100          1          COLHDG('報稅地點')
     A            EM101          1          COLHDG('所得扣繳')
     A*1一般2-10% 3-20% 4-固定金額5- 6%
     A            EM102          5S 0       COLHDG('所得扣繳金額')
     A            EM103          1          COLHDG('是否刷卡')
     A            EM104          1          COLHDG('是否輪班')
     A            EM105          8          COLHDG('輪班班表')
     A            EM106          1          COLHDG('是否下班刷卡')
     A            EM107          1          COLHDG('是否月休')
     A            EM108          3S 0       COLHDG('月休單月天數')
     A            EM109          1          COLHDG('人員分類')
     A*1-直接2-間接
     A            EM110          1          COLHDG('同仁分類')
     A*1-正職2-兼職3-約聘4-講師
     A            EM111          1          COLHDG('工作類別')
     A*1-管理2-幕僚3-業務4-工程5-門市6-兼職
     A            EM112          1          COLHDG('加班計薪')
     A*1-計時2-津貼
     A            EM113          8S 0       COLHDG('特休基準日')
     A            EM114         15          COLHDG('聯絡電話')
     A            EM115          6S 0       COLHDG('薪資－１')
     A            EM116          6S 0       COLHDG('薪資－２')
     A            EM117          6S 0       COLHDG('薪資－３')
     A            EM118         22O         COLHDG('訓練－１')
     A            EM119         22O         COLHDG('訓練－１')
     A            EM120         22O         COLHDG('訓練－２')
     A*誠品全勤扣款
     A            EM121          4S 0       COLHDG('遲到一')
     A            EM122          4S 0       COLHDG('遲到二')
     A            EM123          4S 0       COLHDG('遲到三')
     A            EM124          4S 0       COLHDG('遲到')
     A            EM125          4S 0       COLHDG('事假')
     A            EM126          4S 0       COLHDG('病假')
     A*最近薪資申報年月．與人工轉入申報無關              A1274 890225
     A            EM127          6S 0       COLHDG('最近申報年月')
     A            EM128          8          COLHDG('會計科目一')
     A            EM129          8          COLHDG('會計科目二')
     A*員工上班地點及預留欄位                            A1274 890721
     A            EM130          5          COLHDG('上班地點')
     A            EM131         80          COLHDG('欄位擴充')
     A            EM132         10O         COLHDG('連絡人關係')
     A            EM133          1          COLHDG('生產獎金註記')
     A            EM134          3          COLHDG('副職稱編號')
     A*
     A            EM97           8S 0       COLHDG('記錄更新日期')
     A            EM98           6S 0       COLHDG('記錄更新時間')
     A            EM99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYTRPF  人事調動主檔             KEY= TR01+TR02+TR04+TR03
     A*****************************************************************
     A            TR01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            TR01N     R               COLHDG('公司名稱')
     A                                      REFFLD(CM03)
     A            TR011     R               COLHDG('公司（自）')
     A                                      REFFLD(CM01)
     A            TR011N    R               COLHDG('公司名稱（自）')
     A                                      REFFLD(CM03)
     A            TR012     R               COLHDG('公司（至）')
     A                                      REFFLD(CM01)
     A            TR012N    R               COLHDG('公司名稱（至）')
     A                                      REFFLD(CM03)
     A            TR02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            TR03           1          COLHDG('調動類別')
     A*                                     1-升職 2-降職 3-轉調
     A            TR04           8S 0       COLHDG('生效日期')
     A            TR051     R               COLHDG('部門（自）１')
     A                                      REFFLD(DP011)
     A            TR052     R               COLHDG('部門（自）２')
     A                                      REFFLD(DP012)
     A            TR053     R               COLHDG('部門（自）３')
     A                                      REFFLD(DP013)
     A            TR054     R               COLHDG('部門（自）４')
     A                                      REFFLD(DP014)
     A            TR05N     R               COLHDG('部門簡稱（自）')
     A                                      REFFLD(DP02)
     A            TR061     R               COLHDG('部門（至）１')
     A                                      REFFLD(DP011)
     A            TR062     R               COLHDG('部門（至）２')
     A                                      REFFLD(DP012)
     A            TR063     R               COLHDG('部門（至）３')
     A                                      REFFLD(DP013)
     A            TR064     R               COLHDG('部門（至）４')
     A                                      REFFLD(DP014)
     A            TR06N     R               COLHDG('部門簡稱（至）')
     A                                      REFFLD(DP02)
     A            TR07      R               COLHDG('職稱（自）')
     A                                      REFFLD(EM05)
     A            TR07N     R               COLHDG('職稱說明（自）')
     A                                      REFFLD(JT02)
     A            TR08      R               COLHDG('職稱（至）')
     A                                      REFFLD(EM05)
     A            TR08N     R               COLHDG('職稱說明（至）')
     A                                      REFFLD(JT02)
     A            TR09      R               COLHDG('職等（自）')
     A                                      REFFLD(EM06)
     A            TR10      R               COLHDG('職等（至）')
     A                                      REFFLD(EM06)
     A            TR11      R               COLHDG('薪制（自）')
     A                                      REFFLD(EM10)
     A            TR12      R               COLHDG('薪制（至）')
     A                                      REFFLD(EM10)
     A            TR13      R               COLHDG('班別（自）')
     A                                      REFFLD(EM08)
     A            TR14      R               COLHDG('班別（至）')
     A                                      REFFLD(EM08)
     A            TR15      R               COLHDG('職級（自）')
     A                                      REFFLD(EM07)
     A            TR16      R               COLHDG('職級（至）')
     A                                      REFFLD(EM07)
     A            TR17          62O         COLHDG('工作內容（自）')
     A            TR18          62O         COLHDG('工作內容（至）')
     A            TR19      R               COLHDG('副職稱（自）')
     A                                      REFFLD(EM05)
     A            TR19N     R               COLHDG('副職稱說明（自）')
     A                                      REFFLD(JT02)
     A            TR20      R               COLHDG('副職稱（至）')
     A                                      REFFLD(EM05)
     A            TR20N     R               COLHDG('副職稱說明（至）')
     A                                      REFFLD(JT02)
     A            TR211     R               COLHDG('成本中心（自）１')
     A                                      REFFLD(CC011)
     A            TR212     R               COLHDG('成本中心（自）２')
     A                                      REFFLD(CC012)
     A            TR213     R               COLHDG('成本中心（自）３')
     A                                      REFFLD(CC013)
     A            TR21SN    R               COLHDG('成本中心說明（自）')
     A                                      REFFLD(CC02)
     A            TR214     R               COLHDG('成本中心（至）１')
     A                                      REFFLD(CC011)
     A            TR215     R               COLHDG('成本中心（至）２')
     A                                      REFFLD(CC012)
     A            TR216     R               COLHDG('成本中心（至）３')
     A                                      REFFLD(CC013)
     A            TR21EN    R               COLHDG('成本中心說明（至）')
     A                                      REFFLD(CC02)
     A            TR221     R               COLHDG('工作類別（自）' )
     A                                      REFFLD(EM111)
     A            TR221N        10O         COLHDG('工作類別說明（自）' )
     A            TR222     R               COLHDG('工作類別（至）' )
     A                                      REFFLD(EM111)
     A            TR222N        10O         COLHDG('工作類別說明（至）' )
     A            TR231     R               COLHDG('生產獎金註記（自）')
     A                                      REFFLD(EM133)
     A            TR231N        16O         COLHDG('生產獎金說明（自）')
     A            TR232     R               COLHDG('生產獎金註記（至）')
     A                                      REFFLD(EM133)
     A            TR232N        16O         COLHDG('生產獎金說明（至）')
     A            TR131     R               COLHDG('工作地點（自）')
     A                                      REFFLD(EM130)
     A            TR131N    R               COLHDG('工作地點說明（自）')
     A                                      REFFLD(DP02)
     A            TR132     R               COLHDG('工作地點（自）')
     A                                      REFFLD(EM130)
     A            TR132N    R               COLHDG('工作地點說明（至）')
     A                                      REFFLD(DP02)
     A            TR96           1          COLHDG('主檔更新')
     A*'U'-主檔已更新
     A            TR97           8S 0       COLHDG('記錄更新日期')
     A            TR98           6S 0       COLHDG('記錄更新時間')
     A            TR99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYTXPF  人事異動主檔       KEY= TX01+TX02+TX031+TX04+TX032
     A*****************************************************************
     A            TX01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            TX02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            TX031          1          COLHDG('異動大類')
     A            TX032          1          COLHDG('異動細目')
     A*'A1'-勞保投保   'A2'-勞保調整    'A3'-勞保退保
     A*'B1'-團保一投保 'B2'-團保一調整  'B3'-團保一退保
     A*'C1'-團保二投保 'C2'-團保二調整  'C3'-團保二退保
     A*'D1'-留職停薪   'D2'-留職復職
     A*'D5'-長病假     'D6'-長病假復職
     A*'Z1'-離職
     A            TX04           8S 0       COLHDG('生效日期')
     A            TX05           7  0       COLHDG('金額')
     A*'勞保投保金額，南山防癌個人負擔保費
     A            TX06      R               COLHDG('異動前日期１')
     A                                      REFFLD(TX04)
     A*保險投保前退保日，留職前復職日，復職前留職日
     A            TX07      R               COLHDG('留職天數')
     A                                      REFFLD(EM26)
     A            TX08      R               COLHDG('異動前日期２')
     A                                      REFFLD(TX04)
     A*同一異動上次日期
     A            TX09      R               COLHDG('異動前離職碼')
     A                                      REFFLD(EM11)
     A*除復職為復職前新進核新碼外皆為異動前離職碼
     A            TX10      R               COLHDG('異動前金額')
     A                                      REFFLD(TX05)
     A            TX11      R               COLHDG('異動前天數')
     A                                      REFFLD(TX07)
     A            TX12           2          COLHDG('離職原因')
     A            TX96           1          COLHDG('主檔更新')
     A*'U'-主檔已更新
     A            TX97           8S 0       COLHDG('記錄更新日期')
     A            TX98           6S 0       COLHDG('記錄更新時間')
     A            TX99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYCSPF  改薪主檔                 KEY= CS01+CS02+CS03+CS04
     A*****************************************************************
     A            CS01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            CS02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            CS03           6S 0       COLHDG('改薪年月')
     A            CS04           2S 0       COLHDG('改薪日')
     A            CS05      R               COLHDG('原計薪代號')
     A                                      REFFLD(EM10)
     A* 1-月薪 2-日薪技術員 3-日薪操作員
     A            CS06      R               COLHDG('新計薪代號')
     A                                      REFFLD(EM10)
     A            CS96           1          COLHDG('主檔更新')
     A*'U'-主檔已更新
     A            CS97           8S 0       COLHDG('記錄更新日期')
     A            CS98           6S 0       COLHDG('記錄更新時間')
     A            CS99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYEDPF  教育訓練主檔             KEY= ED01+ED02+ED03
     A*****************************************************************
     A            ED01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            ED02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            ED03           8S 0       COLHDG('受訓日期（自）')
     A            ED04      R               COLHDG('受訓日期（至）')
     A                                      REFFLD(ED03)
     A            ED05           5          COLHDG('課程代碼')
     A            ED06           7  0       COLHDG('金額')
     A            ED07           7  0       COLHDG('公司負擔金額')
     A            ED08           7  0       COLHDG('員工負擔金額')
     A            ED09           4  1       COLHDG('時數')
     A            ED10          18O         COLHDG('訓練主辦單位')
     A            ED11           1          COLHDG('訓練類別')
     A            ED97           8S 0       COLHDG('記錄更新日期')
     A            ED98           6S 0       COLHDG('記錄更新時間')
     A            ED99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYECPF  課程主檔                 KEY= EC01+EC02
     A*****************************************************************
     A            EC01           5          COLHDG('課程編號')
     A            EC02          20O         COLHDG('課程簡稱')
     A            EC03          50O         COLHDG('課程名稱')
     A            EC97           8S 0       COLHDG('記錄更新日期')
     A            EC98           6S 0       COLHDG('記錄更新時間')
     A            EC99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYR1PF  年齡、年資報表控制檔          KEY : R101+R102
     A*****************************************************************
     A            R101          10          COLHDG('報表名稱')
     A*'PYR111'-年齡分析表
     A*'PYR112'-年資分析表
     A            R102           2S 0       COLHDG('序號')
     A            R103           2S 0       COLHDG('起值')
     A            R104           2S 0       COLHDG('迄值')
     A            R197           8S 0       COLHDG('記錄更新日期')
     A            R198           6S 0       COLHDG('記錄更新時間')
     A            R199          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYLCPF  假別基本資料檔
     A*****************************************************************
     A            LC01           1          COLHDG('假別代碼')
     A            LC02           6O         COLHDG('假別簡稱')
     A            LC03           1          COLHDG('薪別')
     A*'1'-有薪  '2'-無薪
     A            LC04           3  0       COLHDG('計薪天數')
     A*EXAMPLE :病假１５天內計薪
     A            LC05           3  2       COLHDG('計薪比率')
     A*EXAMPLE :病假３０天內計半薪
     A            LC06           3  0       COLHDG('全年可請')
     A*EXAMPLE :事假全年不可超過１４天
     A            LC07           1          COLHDG('全勤')
     A*'Y'-全勤  'N'-不為全勤
     A            LC08           3  0       COLHDG('扣薪天數')
     A*EXAMPLE :無薪時曠職一天扣薪三天
     A            LC09           3  2       COLHDG('扣薪比率')
     A            LC10           3  0       COLHDG('計薪天數')
     A*EXAMPLE :病假１５天內計薪
     A            LC11           3  2       COLHDG('計薪比率')
     A* LC09=0 :無薪無超扣
     A            LC12          30O         COLHDG('假別名稱')
     A            LC97           8S 0       COLHDG('記錄更新日期')
     A            LC98           6S 0       COLHDG('記錄更新時間')
     A            LC99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYOVPF  加班主檔                 KEY= OV01+OV02+OV03
     A*****************************************************************
     A            OV01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            OV02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            OV03           8S 0       COLHDG('加班日期')
     A            OV04           4S 0       COLHDG('時間（起）')
     A            OV05           4S 0       COLHDG('時間（迄）')
     A            OV06      R               COLHDG('班別代號')
     A                                      REFFLD(EM08)
     A*實際
     A            OV07           5  2       COLHDG('平日－實際')
     A            OV08           5  2       COLHDG('超時－實際')
     A            OV09           5  2       COLHDG('週六－實際')
     A            OV10           5  2       COLHDG('假日－實際')
     A            OV11           5  2       COLHDG('值班－實際')
     A            OV12           5  2       COLHDG('轉休時數－實際')
     A            OV13           5  2       COLHDG('遲到時數')
     A            OV14           5  2       COLHDG('早退時數')
     A            OV15           3  0       COLHDG('忘打卡次數')
     A            OV16           3  0       COLHDG('TELEX次數')
     A            OV17           5  2       COLHDG('假日超時－實際')
     A*計薪
     A            OV21           5  2       COLHDG('平日－計薪')
     A            OV22           5  2       COLHDG('超時－計薪')
     A            OV23           5  2       COLHDG('週六－計薪')
     A            OV24           5  2       COLHDG('假日－計薪')
     A            OV25           5  2       COLHDG('值班－計薪')
     A            OV26           5  2       COLHDG('轉休時數－計薪')
     A            OV27           5  2       COLHDG('遲到時數')
     A            OV28           5  2       COLHDG('早退時數')
     A            OV29           3  0       COLHDG('忘打卡次數')
     A            OV30           3  0       COLHDG('TELEX次數')
     A            OV31           5  2       COLHDG('假日超時－計薪')
     A*津貼
     A            OV40           3  0       COLHDG('平日交通津貼')
     A            OV41           3  0       COLHDG('假日交通津貼')
     A            OV42           3  0       COLHDG('誤餐費')
     A            OV43           7A         COLHDG('部門代碼'         )
     A            OV44          16O         COLHDG('部門簡稱')
     A            OV45           7  0       COLHDG('平日加班費')
     A            OV46           7  0       COLHDG('超時加班費')
     A            OV47           7  0       COLHDG('假日加班費')
     A            OV48           7  0       COLHDG('假日超時加班費')
     A            OV95      R               COLHDG('加班計薪')
     A                                      REFFLD(JT03)
     A            OV96           6S 0       COLHDG('薪資處理月份')
     A*薪資處理後UPDATE,薪資處理完後不可變動資料
     A            OV97           8S 0       COLHDG('記錄更新日期')
     A            OV98           6S 0       COLHDG('記錄更新時間')
     A            OV99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYLVPF  請假主檔                 KEY= LV01+LV02+LV03+LV04
     A*****************************************************************
     A            LV01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            LV02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            LV03           8S 0       COLHDG('起始日期')
     A            LV04      R               COLHDG('假別')
     A                                      REFFLD(LC01)
     A            LV05           8S 0       COLHDG('終止日期')
     A            LV06           4S 0       COLHDG('起始時間')
     A            LV07           4S 0       COLHDG('終止時間')
     A            LV08           4  2       COLHDG('時數')
     A            LV09           3  0       COLHDG('天數')
     A            LV10           4  2       COLHDG('時數－轉入')
     A            LV11           3  0       COLHDG('天數－轉入')
     A            LV12           2  0       COLHDG('扣除交通津貼次數')
     A            LV13           7A         COLHDG('部門代碼'         )
     A            LV14          16O         COLHDG('部門簡稱')
     A            LV15           7  0       COLHDG('請假扣款')
     A            LV96           6S 0       COLHDG('薪資處理月份')
     A*薪資處理後UPDATE,薪資處理完後不可變動資料
     A            LV97           8S 0       COLHDG('記錄更新日期')
     A            LV98           6S 0       COLHDG('記錄更新時間')
     A            LV99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYWHPF  時薪人員上班時數資料建立檔
     A*****************************************************************
     A            WH01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            WH02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            WH03           6S 0       COLHDG('上班月份')
     A            WH04           4  1       COLHDG('上班時數')
     A            WH05           4  1       COLHDG('夜班津貼時數')
     A            WH06           3  0       COLHDG('健保月數')
     A            WH07           3  0       COLHDG('勞保天數')
     A            WH96           6S 0       COLHDG('薪資處理月份')
     A            WH97           8S 0       COLHDG('記錄更新日期')
     A            WH98           6S 0       COLHDG('記錄更新時間')
     A            WH99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYLAPF 遲到主檔
     A*****************************************************************
     A            LA01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            LA02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            LA03           8S 0       COLHDG('考勤日期')
     A            LA04           2  0       COLHDG('遲到次數')
     A            LA05           2  0       COLHDG('早退次數')
     A            LA06           2  0       COLHDG('忘刷卡次數')
     A            LA07           7          COLHDG('部門代碼'         )
     A            LA08          16O         COLHDG('部門簡稱')
     A            LA96           6S 0       COLHDG('薪資處理年月')
     A            LA97           8S 0       COLHDG('記錄更新日期')
     A            LA98           6S 0       COLHDG('記錄更新時間')
     A            LA99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYDA01  人事控制參數
     A*****************************************************************
     A*  PYD011                X(1)         1-1 異動資料主檔更新
     A*                                         'U'-主檔立即更新
     A*                                         ' '- BATCH UPDATE
     A*  PYD012                9(2)         2-3 試用階段月份= '03'
     A*  PYD013                9(2)         4-5 試用階段月份= '06'
     A*  PYD014                9(2)         6-7 薪資項目最多個數 48
     A*  PYD015                9(2)         8-9 薪資項目已設定數
     A*  PYD016                9(2)        10-11成本項目最多個數 64
     A*  PYD017                9(2)        12-13成本項目已設定數
     A*  PYD018                9(2)        14-15福委會發放項目MAX 9
     A*  PYD019                9(2)        16-17福委會發放項目已定數
     A*  PYD01A                X(24)       18-41薪資單上扣款項目順序
     A*****************************************************************
     A*  PYDA02  銀行轉存參數
     A*****************************************************************
     A*  PYD021                X(3)         1-3 一銀銀行代碼  007
     A*一銀帳號為九位數字
     A*  PYD022                X(3)         4-6 彰銀代碼      009
     A*  PYD023                X(3)         7-9 臺企銀行代碼  050
     A*帳號為十一位(分行別+科目別+流水號+檢號)
     A*****************************************************************
     A*  PYDA03  所得扣繳媒體申報
     A*****************************************************************
     A*  PYD031                X(2)*15      1-30 所得代碼
     A*                                    '50515A5B5C5D5E53549A9B9192'
     A*  PYD032                X(16)*15    31-270所得名稱
     A*  PYD033                X(2)       300-301租賃代碼     51
     A*  PYD034                X(2)       302-303薪資代碼     50
     A*  PYD035                X(1)       304-304福委會公司    1
     A*  PYD036                X(2)       305-306福委會類別   92
     A*****************************************************************
     A*  PYPMPF  人事薪資參數檔
     A*****************************************************************
     A            PM01           2          COLHDG('類別')
     A            PM02      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            PM03         256          COLHDG('內容一')
     A*獎金、紅利發放參數
     A            PM04          80          COLHDG('內容二')
     A            PM05          80          COLHDG('內容三')
     A            PM97           8S 0       COLHDG('記錄更新日期')
     A            PM98           6S 0       COLHDG('記錄更新時間')
     A            PM99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYLTPF  休假歷史記錄檔
     A*****************************************************************
     A            LT01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            LT02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            LT03           4S 0       COLHDG('年度')
     A            LT10           4  1       COLHDG('本年度特休年假')
     A            LT11           3  0       COLHDG('本年已休年假－天')
     A            LT12           1  0       COLHDG('本年已休年假－時')
     A            LT13           3  0       COLHDG('去年轉休年假－天')
     A            LT14           1  0       COLHDG('去年轉休年假－時')
     A            LT15           3  0       COLHDG('明年預借年假－天')
     A            LT16           1  0       COLHDG('明年預借年假－時')
     A            LT17           3  0       COLHDG('去年已借年假－天')
     A            LT18           1  0       COLHDG('去年已借年假－時')
     A            LT20           3  0       COLHDG('本年度月休')
     A            LT21           3  0       COLHDG('本年已休月休－天')
     A            LT22           1  0       COLHDG('本年已休月休－時')
     A            LT23           3  0       COLHDG('去年轉休月休－天')
     A            LT24           1  0       COLHDG('去年轉休月休－時')
     A            LT25           3  0       COLHDG('明年預借月休－天')
     A            LT26           1  0       COLHDG('明年預借月休－時')
     A            LT96           6S 0       COLHDG('薪資處理月份')
     A*薪資處理後UPDATE
     A            LT97           8S 0       COLHDG('記錄更新日期')
     A            LT98           6S 0       COLHDG('記錄更新時間')
     A            LT99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYLUPF  休假歷史記錄檔
     A*****************************************************************
     A            LU01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            LU02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            LU03           4S 0       COLHDG('年度')
     A            LU04           2S 0       COLHDG('月份')
     A            LU05           5  1       COLHDG('本月加班轉休時數')
     A            LU06           5  1       COLHDG('本月轉休已休時數')
     A            LU97           8S 0       COLHDG('記錄更新日期')
     A            LU98           6S 0       COLHDG('記錄更新時間')
     A            LU99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYSSPF  薪資結構參數檔           KEY= SS01 + SS18
     A*****************************************************************
     A            SS01           2          COLHDG('薪資代碼')
     A            SS02          14O         COLHDG('薪資名稱')
     A            SS03           1          COLHDG('應免稅別')
     A*                                     Y-應稅 N-免稅
     A            SS04           1          COLHDG('加減項別')
     A*                                     A-加項 B-減項
     A            SS05           1          COLHDG('項目別')
     A*                                     0-系統設定
     A*                                     1-固定項目2-變動項目
     A*'0', '1'-如有上期薪資時，上期設定成免稅項目，下期處理時，
     A*以員工借支減項扣除
     A*'2'-應稅非獎金時，所得稅下期一併處理
     A            SS06           1          COLHDG('薪資別')
     A*                                     A-固定金額B-薪資比率
     A*                                     C-變動金額
     A            SS07           7  0       COLHDG('固定金額')
     A            SS08           3  2       COLHDG('薪資比率')
     A            SS09           1          COLHDG('項目屬性')
     A*                                     1-薪資
     A*                                     2-成本
     A*                                     3-公司負擔
     A*                                     5-年終獎金
     A            SS10           1          COLHDG('輸入方式')
     A*變動項目每月輸入方式
     A* 1-金額  '2'-單位（次、時）
     A            SS11           1          COLHDG('扣稅方式')
     A*                                     1-薪資 2-獎金
     A            SS12           2S 0       COLHDG('下期薪資總表')
     A* 0-48 0=不列印
     A            SS13           2S 0       COLHDG('下期薪資單')
     A* 0-48 0=不列印
     A            SS14           2A         COLHDG('成本薪資項目')
     A            SS15           2S 0       COLHDG('上期薪資總表')
     A* 0-48 0=不列印
     A            SS16           2S 0       COLHDG('上期薪資單')
     A* 0-48 0=不列印
     A            SS17           1          COLHDG('上期項目')
     A*'A:上期借支,B:上期其它,' ':非上期項目
     A            SS18           2          COLHDG('薪資組別')
     A            SS19           5S 0       COLHDG('每次金額')
     A            SS97           8S 0       COLHDG('記錄更新日期')
     A            SS98           6S 0       COLHDG('記錄更新時間')
     A            SS99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYPYPF  薪資主檔HEADING
     A*****************************************************************
     A            PY01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            PY02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            PY03           7  0       COLHDG('底薪')
     A            PY04      R               COLHDG('存入銀行－總行')
     A                                      REFFLD(BN011)
     A            PY05      R               COLHDG('存入銀行－分行')
     A                                      REFFLD(BN012)
     A            PY06          14A         COLHDG('存入帳號')
     A            PY061         14A         COLHDG('外勞代扣稅帳號')
     A            PY07           2S         COLHDG('下期存入日期')
     A** 99=月底日
     A            PY08           2S         COLHDG('上期存入日期')
     A** 99=月底日
     A            PY09           1          COLHDG('銀行別')
     A            PY10           8S 0       COLHDG('帳號起用日')
     A            PY97           8S 0       COLHDG('記錄更新日期')
     A            PY98           6S 0       COLHDG('記錄更新時間')
     A            PY99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYPDPF  薪資主檔DETAIL
     A*****************************************************************
     A            PD01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            PD02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            PD03      R               COLHDG('薪資項目')
     A                                      REFFLD(SS01)
     A            PD04           7  0       COLHDG('金額')
     A*****************************************************************
     A*  PYOSPF  其它薪資主檔
     A*****************************************************************
     A            OS01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            OS02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            OS03           6S 0       COLHDG('年月')
     A            OS04           1          COLHDG('期別')
     A            OS05      R               COLHDG('薪資項目')
     A                                      REFFLD(SS01)
     A            OS06           7  0       COLHDG('金額')
     A            OS07           5  2       COLHDG('次數')
     A            OS08           7  0       COLHDG('每次金額')
     A            OS97           8S 0       COLHDG('記錄更新日期')
     A            OS98           6S 0       COLHDG('記錄更新時間')
     A            OS99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYSHPF  調薪主檔HEADING
     A*****************************************************************
     A            SH01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            SH02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            SH03           8S 0       COLHDG('生效日期')
     A            SH04           1          COLHDG('調薪原因代碼')
     A            SH05          14O         COLHDG('調薪原因')
     A            SH06           8S 0       COLHDG('核定日期')
     A*                                     '0'-未核定
     A            SH07      R               COLHDG('調薪前底薪')
     A                                      REFFLD(PY03)
     A            SH08      R               COLHDG('調薪後底薪')
     A                                      REFFLD(PY03)
     A            SH97           8S 0       COLHDG('記錄更新日期')
     A            SH98           6S 0       COLHDG('記錄更新時間')
     A            SH99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYSDPF  調薪主檔DETAIL
     A*****************************************************************
     A            SD01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            SD02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            SD03      R               COLHDG('生效日期')
     A                                      REFFLD(SH03)
     A            SD04      R               COLHDG('調薪項目')
     A                                      REFFLD(SS01)
     A            SD05      R               COLHDG('調薪前金額')
     A                                      REFFLD(PD04)
     A            SD06      R               COLHDG('調薪後金額')
     A                                      REFFLD(PD04)
     A*****************************************************************
     A*  PYLNPF  員工貸款資料檔
     A*****************************************************************
     A            LN01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            LN02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            LN03           1          COLHDG('貸款類別')
     A*#Y='LN'
     A            LN04           7  0       COLHDG('貸款總額')
     A            LN05           3  0       COLHDG('償還期數')
     A            LN06           6S 0       COLHDG('第一期月份')
     A            LN07      R               COLHDG('第一期金額')
     A                                      REFFLD(LN04)
     A            LN08      R               COLHDG('每一期金額')
     A                                      REFFLD(LN04)
     A            LN09      R               COLHDG('最後一期月份')
     A                                      REFFLD(LN06)
     A            LN10      R               COLHDG('最後一期金額')
     A                                      REFFLD(LN04)
     A            LN11           8S 0       COLHDG('貸款日期')
     A            LN12           8          COLHDG('契約編號')
     A            LN13          14O         COLHDG('保證人')
     A            LN14          15          COLHDG('聯絡電話')
     A            LN15          62O         COLHDG('聯絡地址')
     A            LN16           1          COLHDG('關係企業註記')
     A*
     A            LN97           8S 0       COLHDG('記錄更新日期')
     A            LN98           6S 0       COLHDG('記錄更新時間')
     A            LN99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYPWPF  所得工作檔HEADING
     A*****************************************************************
     A            PW01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            PW02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            PW03      R               COLHDG('年月')
     A                                      REFFLD(OS03)
     A            PW04      R               COLHDG('期別')
     A                                      REFFLD(OS04)
     A*'2'-上期薪資  '1'-下期薪資
     A            PW05      R               COLHDG('底薪')
     A                                      REFFLD(PY03)
     A            PW07           5  2       COLHDG('計薪天數')
     A            PW14           5  1       COLHDG('請假扣薪時數')
     A            PW15      R               COLHDG('所得稅率')
     A                                      REFFLD(TC04)
     A            PW16           7  0       COLHDG('免稅加項')
     A            PW17           7  0       COLHDG('應稅加項（薪資）')
     A            PW18           7  0       COLHDG('免稅減項')
     A            PW19           7  0       COLHDG('勞保費')
     A            PW20      R               COLHDG('離職碼')
     A                                      REFFLD(EM11)
     A            PW22           3  0       COLHDG('勞保天數')
 8402A            PW24           7  0       COLHDG('健保費')
 8402A*投保金額Ｘ費率Ｘ天數
 8402A            PW26           1  0       COLHDG('健保投保人數')
     A            PW27           7  0       COLHDG('應稅加項（獎金）')
     A            PW28           7  0       COLHDG('應稅減項（薪資）')
     A            PW29           7  0       COLHDG('應稅減項（獎金）')
     A            PW30           7  0       COLHDG('上期借支')
     A*
     A*時數
     A            PW31           5  1       COLHDG('應稅加班')
     A            PW32           5  1       COLHDG('免稅加班')
     A            PW33           5  1       COLHDG('值班')
     A            PW34          62O         COLHDG('發放說明')
     A            PW97           8S 0       COLHDG('記錄更新日期')
     A            PW98           6S 0       COLHDG('記錄更新時間')
     A            PW99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYWDPF  所得工作檔DETAIL
     A*****************************************************************
     A            WD01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            WD02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            WD03      R               COLHDG('年月')
     A                                      REFFLD(OS03)
     A            WD04      R               COLHDG('期別')
     A                                      REFFLD(OS04)
     A            WD05      R               COLHDG('薪資項目')
     A                                      REFFLD(SS01)
     A            WD06           7  0       COLHDG('薪資金額')
     A*****************************************************************
     A*  PYPHPF  所得歷史檔HEADING
     A*****************************************************************
     A            PH01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            PH02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            PH03      R               COLHDG('年月')
     A                                      REFFLD(OS03)
     A            PH04      R               COLHDG('期別')
     A                                      REFFLD(OS04)
     A            PH05      R               COLHDG('底薪')
     A                                      REFFLD(PY03)
     A            PH07      R               COLHDG('計薪天數')
     A                                      REFFLD(PW07)
     A            PH14      R               COLHDG('請假扣薪時數')
     A                                      REFFLD(PW14)
     A            PH15      R               COLHDG('所得稅率')
     A                                      REFFLD(TC04)
     A            PH16      R               COLHDG('免稅加項')
     A                                      REFFLD(PW16)
     A            PH17      R               COLHDG('應稅加項（薪資）')
     A                                      REFFLD(PW17)
     A            PH18      R               COLHDG('免稅減項')
     A                                      REFFLD(PW18)
     A            PH19      R               COLHDG('勞保費')
     A                                      REFFLD(PW19)
     A            PH20      R               COLHDG('離職碼')
     A                                      REFFLD(EM11)
 8402A            PH24      R               COLHDG('健保費')
     A                                      REFFLD(PW24)
 8402A            PH26      R               COLHDG('健保投保人數')
     A                                      REFFLD(PW26)
     A            PH27      R               COLHDG('應稅加項（獎金）')
     A                                      REFFLD(PW27)
     A            PH28      R               COLHDG('應稅減項（薪資）')
     A                                      REFFLD(PW28)
     A            PH29      R               COLHDG('應稅減項（獎金）')
     A                                      REFFLD(PW29)
     A            PH30      R               COLHDG('上期借支')
     A                                      REFFLD(PW30)
     A*時數
     A            PH31      R               COLHDG('應稅加班')
     A                                      REFFLD(PW31)
     A            PH32      R               COLHDG('免稅加班')
     A                                      REFFLD(PW32)
     A            PH33      R               COLHDG('值班')
     A                                      REFFLD(PW33)
     A*891228 A1274 EVA
     A            PH341          1          COLHDG('部門代碼一')
     A            PH342          1          COLHDG('部門代碼二')
     A            PH343          1          COLHDG('部門代碼三')
     A            PH344          4          COLHDG('部門代碼四')
     A*
     A            PH35           1          COLHDG('報稅地點')
     A*
     A            PH97           8S 0       COLHDG('記錄更新日期')
     A            PH98           6S 0       COLHDG('記錄更新時間')
     A            PH99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYHDPF  所得歷史檔DETAIL
     A*****************************************************************
     A            HD01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            HD02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            HD03      R               COLHDG('年月')
     A                                      REFFLD(OS03)
     A            HD04      R               COLHDG('期別')
     A                                      REFFLD(OS04)
     A            HD05      R               COLHDG('薪資項目')
     A                                      REFFLD(SS01)
     A            HD06           7  0       COLHDG('薪資金額')
     A*****************************************************************
     A*  PYCHPF  所得成本檔HEADING
     A*****************************************************************
     A            CH01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            CH02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            CH03      R               COLHDG('年月')
     A                                      REFFLD(OS03)
     A            CH04      R               COLHDG('期別')
     A                                      REFFLD(OS04)
     A            CH05      R               COLHDG('底薪')
     A                                      REFFLD(PY03)
     A            CH061     R               COLHDG('成本中心１')
     A                                      REFFLD(CC011)
     A            CH062     R               COLHDG('成本中心２')
     A                                      REFFLD(CC012)
     A            CH063     R               COLHDG('成本中心３')
     A                                      REFFLD(CC013)
     A            CH07      R               COLHDG('計薪天數')
     A                                      REFFLD(PW07)
     A            CH14      R               COLHDG('請假扣薪時數')
     A                                      REFFLD(PW14)
     A            CH16      R               COLHDG('免稅加項')
     A                                      REFFLD(PW16)
     A            CH17      R               COLHDG('應稅加項（薪資）')
     A                                      REFFLD(PW17)
     A            CH18      R               COLHDG('免稅減項')
     A                                      REFFLD(PW18)
     A            CH20      R               COLHDG('離職碼')
     A                                      REFFLD(EM11)
     A            CH24           5  2       COLHDG('分攤率')
     A            CH27      R               COLHDG('應稅加項（獎金）')
     A                                      REFFLD(PW27)
     A            CH28      R               COLHDG('應稅減項（薪資）')
     A                                      REFFLD(PW28)
     A            CH29      R               COLHDG('應稅減項（獎金）')
     A                                      REFFLD(PW29)
     A            CH30      R               COLHDG('上期借支')
     A                                      REFFLD(PW30)
     A*時數
     A            CH31      R               COLHDG('應稅加班')
     A                                      REFFLD(PW31)
     A            CH32      R               COLHDG('免稅加班')
     A                                      REFFLD(PW32)
     A            CH33      R               COLHDG('值班')
     A                                      REFFLD(PW33)
     A            CH97           8S 0       COLHDG('記錄更新日期')
     A            CH98           6S 0       COLHDG('記錄更新時間')
     A            CH99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYCDPF  所得成本檔DETAIL
     A*****************************************************************
     A            CD01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            CD02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            CD03      R               COLHDG('年月')
     A                                      REFFLD(OS03)
     A            CD04      R               COLHDG('期別')
     A                                      REFFLD(OS04)
     A            CD05      R               COLHDG('薪資項目')
     A                                      REFFLD(SS01)
     A            CD06           7  0       COLHDG('薪資金額')
     A            CD071     R               COLHDG('成本中心１')
     A                                      REFFLD(CC011)
     A            CD072     R               COLHDG('成本中心２')
     A                                      REFFLD(CC012)
     A            CD073     R               COLHDG('成本中心３')
     A                                      REFFLD(CC013)
     A*****************************************************************
     A*  PYPBPF  公司獎金資料檔
     A*****************************************************************
     A            PB01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            PB02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            PB03           4S 0       COLHDG('獎金年度')
     A            PB04           2          COLHDG('獎金類別')
     A            PB05           6S 0       COLHDG('發放年月')
     A            PB05D          2S 0       COLHDG('發放日期')
     A            PB06           7S 0       COLHDG('獎金／發放金額')
     A            PB06F          7S 0       COLHDG('免稅獎金')
     A            PB07           6S 3       COLHDG('獎金稅率')
     A            PB08           7S 0       COLHDG('獎金／扣繳稅額')
     A            PB09           7S 0       COLHDG('勞保費')
     A            PB10           7S 0       COLHDG('健保費')
     A            PB11           7S 0       COLHDG('其他扣項')
     A            PB12           7S 0       COLHDG('實領總額')
     A            PB13          62O         COLHDG('發放說明')
     A*891228 A1274 EVA
     A            PB141          1          COLHDG('部門代碼一')
     A            PB142          1          COLHDG('部門代碼二')
     A            PB143          1          COLHDG('部門代碼三')
     A            PB144          4          COLHDG('部門代碼四')
     A*
     A*報稅地點ＡORＢ
     A            PB15           1          COLHDG('報稅地點')
     A*
     A            PB16           8  6       COLHDG('基數')
     A            PB17           5  4       COLHDG('在職率')
     A            PB18           5  4       COLHDG('考勤率')
     A            PB19           3  2       COLHDG('獎懲率')
     A            PB20           3  2       COLHDG('考績率')
     A*
     A            PB21           4  0       COLHDG('事假')
     A            PB22           4  0       COLHDG('病假')
     A            PB23           3  0       COLHDG('遲到早退')
     A            PB24           3  0       COLHDG('曠職')
     A            PB25           3  0       COLHDG('嘉獎')
     A            PB26           3  0       COLHDG('小功')
     A            PB27           3  0       COLHDG('大功')
     A            PB28           3  0       COLHDG('申誡')
     A            PB29           3  0       COLHDG('小過')
     A            PB30           3  0       COLHDG('大過')
     A            PB31           7  0       COLHDG('計算基礎')
     A            PB32           2          COLHDG('考績等級')
     A*
     A            PB96           8S 0       COLHDG('核定日期')
     A            PB97           8S 0       COLHDG('記錄更新日期')
     A            PB98           6S 0       COLHDG('記錄更新時間')
     A            PB99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYBCPF  薪資銀行不轉存檔
     A*****************************************************************
     A            BC01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            BC02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            BC03           1          COLHDG('所得類別')
     A*'1'-下期薪資  '2'-上期薪資   '5'-獎金
     A            BC04      R               COLHDG('存入月份')
     A                                      REFFLD(OS03)
     A            BC05           2S 0       COLHDG('存入日期')
     A            BC06          10          COLHDG('支票號碼')
     A            BC97           8S 0       COLHDG('記錄更新日期')
     A            BC98           6S 0       COLHDG('記錄更新時間')
     A            BC99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYBTPF  薪資銀行轉存工作檔
     A*****************************************************************
     A            BT01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            BT02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            BT03           1          COLHDG('所得類別')
     A*'1'-下期薪資  '2'-上期薪資   '5'-獎金
     A*'A'-補助金                                *YAMAHA 900517 A1274
     A            BT04      R               COLHDG('存入月份')
     A                                      REFFLD(OS03)
     A            BT05           2S 0       COLHDG('存入日期')
     A            BT061     R               COLHDG('存入銀行－總行')
     A                                      REFFLD(BN011)
     A            BT062     R               COLHDG('存入銀行－分行')
     A                                      REFFLD(BN012)
     A            BT07      R               COLHDG('存入帳號')
     A                                      REFFLD(PY06)
     A            BT08           7  0       COLHDG('存入金額')
     A            BT09          12          COLHDG('公司帳號')
     A            BT10          10          COLHDG('企業編號')
     A*                                             轉帳組別
     A**          BT11      R               COLHDG('受理分行')
     A**                                    REFFLD(BN012)
     A            BT97           8S 0       COLHDG('記錄更新日期')
     A            BT98           6S 0       COLHDG('記錄更新時間')
     A            BT99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYB1PF  一銀薪資銀行轉存檔
     A*****************************************************************
     A            B10D          75          COLHDG('轉存資料')
     A*****************************************************************
     A*  PYB2PF  彰銀薪資銀行轉存檔       UPDATE 89/03/30 *YM
     A*****************************************************************
     A            B201         120          COLHDG('轉存資料')
     A*內容請參照PYB2DS01
     A*****************************************************************
     A*  PYB3PF  臺企薪資銀行轉存檔(FLOPPY)臺灣中小企業銀行轉存檔
     A*****************************************************************
     A            B301         128          COLHDG('轉存資料')
     A*內容請參照PYB3DS01
     A*****************************************************************
     A*  PYB4PF  北市銀資銀行轉存檔(FLOPPY)
     A*****************************************************************
     A            B401          80          COLHDG('轉存資料')
     A*內容請參照PYB4DS01
     A*****************************************************************
     A*  PYB5PF  合庫轉存檔(FLOPPY)
     A*****************************************************************
     A            B501          80          COLHDG('轉存資料')
     A*內容請參照PYB5DS01
     A*****************************************************************
     A*  PYB6PF  郵局轉存檔
     A*****************************************************************
     A            B601          80          COLHDG('轉存資料')
     A*內容請參照PYB6DS01
     A*****************************************************************
     A*  PYVAPF  特別休假參數檔           KEY= VA01
     A*  EX.滿VA01年未滿3個月有VA04天休假
     A*****************************************************************
     A            VA01           4  0       COLHDG('年資')
     A            VA02           3  1       COLHDG('一月休假天數')
     A            VA03           3  1       COLHDG('二月休假天數')
     A            VA04           3  1       COLHDG('三月休假天數')
     A            VA05           3  1       COLHDG('四月休假天數')
     A            VA06           3  1       COLHDG('五月休假天數')
     A            VA07           3  1       COLHDG('六月休假天數')
     A            VA08           3  1       COLHDG('七月休假天數')
     A            VA09           3  1       COLHDG('八月休假天數')
     A            VA10           3  1       COLHDG('九月休假天數')
     A            VA11           3  1       COLHDG('十月休假天數')
     A            VA12           3  1       COLHDG('十一月休假天數')
     A            VA13           3  1       COLHDG('十二月休假天數')
     A*****************************************************************
     A*  PYPCPF  公司獎金成本檔
     A*****************************************************************
     A            PC01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            PC02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            PC03      R               COLHDG('獎金年度')
     A                                      REFFLD(PB03)
     A            PC04      R               COLHDG('獎金類別')
     A                                      REFFLD(PB04)
     A            PC05      R               COLHDG('發放年月')
     A                                      REFFLD(PB05)
@5/4@A            PC05D     R               COLHDG('發放日期')
     A                                      REFFLD(PB05D)
     A            PC06      R               COLHDG('獎金／發放金額')
     A                                      REFFLD(PB06)
     A            PC08      R               COLHDG('獎金／扣繳稅額')
     A                                      REFFLD(PB08)
     A* 890222 A1274
     A            PC11      R               COLHDG('勞保費')
     A                                      REFFLD(PB09)
     A            PC12      R               COLHDG('健保費')
     A                                      REFFLD(PB10)
     A            PC13      R               COLHDG('其他扣項')
     A                                      REFFLD(PB11)
     A            PC14      R               COLHDG('實領金額')
     A                                      REFFLD(PB12)
     A* 890222 A1274
     A            PC091     R               COLHDG('成本中心１')
     A                                      REFFLD(CC011)
     A            PC092     R               COLHDG('成本中心２')
     A                                      REFFLD(CC012)
     A            PC093     R               COLHDG('成本中心３')
     A                                      REFFLD(CC013)
     A            PC10           5  2       COLHDG('分攤率')
     A            PC97           8S 0       COLHDG('記錄更新日期')
     A            PC98           6S 0       COLHDG('記錄更新時間')
     A            PC99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYEGPF  福委會發放資料檔
     A*****************************************************************
     A            EG01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            EG02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            EG03      R               COLHDG('發放類別')
     A                                      REFFLD(SS01)
     A            EG04           6S 0       COLHDG('發放日期－年月')
     A            EG05           2S 0       COLHDG('發放日期－日')
     A            EG06           7  0       COLHDG('發放金額')
     A            EG07      R               COLHDG('發放稅率')
     A                                      REFFLD(TA07)
     A            EG08           7  0       COLHDG('扣繳稅額')
     A            EG09          22O         COLHDG('備註')
     A            EG97           8S 0       COLHDG('記錄更新日期')
     A            EG98           6S 0       COLHDG('記錄更新時間')
     A            EG99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYSBPF  銷售獎金資料檔
     A*****************************************************************
     A            SB01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            SB02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            SB03      R               COLHDG('發放類別')
     A                                      REFFLD(SS01)
     A            SB04           6S 0       COLHDG('發放日期－年月')
     A            SB05           2S 0       COLHDG('發放日期－日')
     A            SB06           7  0       COLHDG('發放金額')
     A            SB07      R               COLHDG('發放稅率')
     A                                      REFFLD(TA07)
     A            SB08           7  0       COLHDG('扣繳稅額')
     A            SB97           8S 0       COLHDG('記錄更新日期')
     A            SB98           6S 0       COLHDG('記錄更新時間')
     A            SB99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYMBPF  管理獎金資料檔
     A*****************************************************************
     A            MB01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            MB02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            MB03      R               COLHDG('發放類別')
     A                                      REFFLD(SS01)
     A            MB04           6S 0       COLHDG('發放日期－年月')
     A            MB05           2S 0       COLHDG('發放日期－日')
     A            MB06           7  0       COLHDG('發放金額')
     A            MB07      R               COLHDG('發放稅率')
     A                                      REFFLD(TA07)
     A            MB08           7  0       COLHDG('扣繳稅額')
     A            MB97           8S 0       COLHDG('記錄更新日期')
     A            MB98           6S 0       COLHDG('記錄更新時間')
     A            MB99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYMSPF  管理獎金成本檔
     A*****************************************************************
     A            MS01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            MS02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            MS03      R               COLHDG('發放類別')
     A                                      REFFLD(SS01)
     A            MS04           6S 0       COLHDG('發放日期－年月')
     A            MS05           2S 0       COLHDG('發放日期－日')
     A            MS06           7  0       COLHDG('發放金額')
     A            MS08           7  0       COLHDG('扣繳稅額')
     A            MS091     R               COLHDG('成本中心１')
     A                                      REFFLD(CC011)
     A            MS092     R               COLHDG('成本中心２')
     A                                      REFFLD(CC012)
     A            MS093     R               COLHDG('成本中心３')
     A                                      REFFLD(CC013)
     A            MS10           5  2       COLHDG('分攤率')
     A            MS97           8S 0       COLHDG('記錄更新日期')
     A            MS98           6S 0       COLHDG('記錄更新時間')
     A            MS99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYEPPF  臨時人員基本資料檔
     A*****************************************************************
     A            EP01      R               COLHDG('身份證號')
     A                                      REFFLD(EM31)
     A*後２碼若為空白則為統一編號
     A            EP02      R               COLHDG('證號識別')
     A                                      REFFLD(EM311)
     A*１－證號錯誤　２－外籍人士
     A            EP03          62O         COLHDG('姓名')
     A            EP04           8S 0       COLHDG('出生日期')
     A            EP05          62O         COLHDG('通訊地址')
     A            EP06          62O         COLHDG('戶籍地址')
     A            EP07          15          COLHDG('通訊電話')
     A            EP08           1          COLHDG('房屋稅籍－縣市')
     A            EP09           2          COLHDG('房屋稅籍－鄉鎮')
     A            EP10           2          COLHDG('房屋稅籍－村里')
     A            EP11           7          COLHDG('房屋稅籍－棟戶號')
     A            EP97           8S 0       COLHDG('記錄更新日期')
     A            EP98           6S 0       COLHDG('記錄更新時間')
     A            EP99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYPAPF  臨時人員薪資發放資料檔
     A*****************************************************************
     A            PA01      R               COLHDG('身份證號')
     A                                      REFFLD(EP01)
     A            PA021          6S 0       COLHDG('發放日期－年月')
     A            PA022          2S 0       COLHDG('發放日期－日')
     A            PA03           2          COLHDG('所得類別')
     A*50-薪資  51-租賃  5A-5E利息  53-權利金   54-盈餘
     A*9A-執行業務報酬     9B-稿費    91-競技獎金 92-其它所得
     A            PA04           9  0       COLHDG('所得金額')
     A            PA05           1          COLHDG('扣繳類別')
     A*'1'-固定薪資  '2'- 6%扣繳  '3'-10%扣繳  '4'-15%扣繳
     A*'5'-20%扣繳   '9'-免扣繳
     A            PA06           7  0       COLHDG('扣繳稅額')
     A            PA07      R               COLHDG('扣繳單位')
     A                                      REFFLD(CM01)
     A*即公司編碼
     A            PA97           8S 0       COLHDG('記錄更新日期')
     A            PA98           6S 0       COLHDG('記錄更新時間')
     A            PA99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYCBPF  薪資預算－成本中心
     A*****************************************************************
     A            CB01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            CB02           4S 0       COLHDG('年度')
     A            CB031     R               COLHDG('成本中心１')
     A                                      REFFLD(CC011)
     A            CB032     R               COLHDG('成本中心２')
     A                                      REFFLD(CC012)
     A            CB033     R               COLHDG('成本中心３')
     A                                      REFFLD(CC013)
     A            CB04           2S 0       COLHDG('月份')
     A            CB05           9  0       COLHDG('底薪總額')
     A            CB06           9  0       COLHDG('薪資總額')
     A            CB07           7  1       COLHDG('加班時數')
     A            CB08           3  0       COLHDG('員工人數')
     A            CB97           8S 0       COLHDG('記錄更新日期')
     A            CB98           6S 0       COLHDG('記錄更新時間')
     A            CB99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYPVPF  考績資料檔
     A*****************************************************************
     A            PV01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            PV02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            PV03           4S 0       COLHDG('考績年度')
     A            PV04           5  2       COLHDG('考績分數')
     A            PV97           8S 0       COLHDG('記錄更新日期')
     A            PV98           6S 0       COLHDG('記錄更新時間')
     A            PV99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYTBPF  其他所得課稅資料檔
     A*****************************************************************
     A            TB01           4S 0       COLHDG('年度')
     A            TB02           4A         COLHDG('媒體單位')
     A            TB03           7S 0       COLHDG('申報流水號')
     A            TB04           2A         COLHDG('格式代號')
     A            TB05          10A         COLHDG('身份證號')
     A            TB06           1A         COLHDG('證號別')
     A            TB07           9P 0       COLHDG('給付總額')
     A            TB08           9P 0       COLHDG('扣繳稅額')
     A            TB09          12A         COLHDG('特定編號')
     A            TB10           1A         COLHDG('錯誤註記')
     A            TB11           2A         COLHDG('公司編碼')
     A            TB12          10A         COLHDG('員工編碼')
     A            TB13          14O         COLHDG('所得者姓名')
     A            TB14          62O         COLHDG('所得者地址')
     A            TB15           6S 0       COLHDG('所得月份－起')
     A            TB16           6S 0       COLHDG('所得月份－迄')
     A            TB17           8A         COLHDG('扣繳單位統一編號')
     A            TB18           8S 0       COLHDG('所得日期')
     A            TB19           7          COLHDG('作帳單位')
     A            TB20           3          COLHDG('機徵機關')
     A*作帳單位：部門
     A            TB96           8S 0       COLHDG('核定日期')
     A            TB97           8S 0       COLHDG('記錄更新日期')
     A            TB98           6S 0       COLHDG('記錄更新時間')
     A            TB99          10A         COLHDG('使用者代號')
     A*****************************************************************
     A*  PYTDPF  所得稅課稅申報資料檔
     A*****************************************************************
     A            TD01           4S 0       COLHDG('年度')
     A            TD02      R               COLHDG('媒體單位')
     A                                      REFFLD(FA01)
     A            TD03           7S 0       COLHDG('申報流水號')
     A            TD04      R               COLHDG('格式代號')
     A                                      REFFLD(PA03)
     A*即所得類別
     A            TD05      R               COLHDG('身份證號')
     A                                      REFFLD(EP01)
     A*後２碼若為空白則為統一編號
     A            TD06           1          COLHDG('證號別')
     A*'1'-統一編號'3'-外籍無地址'4'- 外籍有地址' '-身份證號
     A            TD07           9  0       COLHDG('給付總額')
     A            TD08           9  0       COLHDG('扣繳稅額')
     A**          TD091          1          COLHDG('房屋稅籍－縣市')
     A**          TD092          2          COLHDG('房屋稅籍－鄉鎮')
     A**          TD093          2          COLHDG('房屋稅籍－村里')
     A**          TD094          7          COLHDG('房屋稅籍－棟戶號')
     A            TD09          12          COLHDG('特定編號')
     A*執行業務所得業別代號／房屋稅籍／所得人代號
     A            TD10           1          COLHDG('錯誤註記')
     A*' '-證號無誤  'A'-證號錯誤   'B'-無從查對
     A            TD11      R               COLHDG('公司編碼')
     A                                      REFFLD(CM01)
     A            TD12          10          COLHDG('員工編碼')
     A*一般員工為員工編號，臨時員工為身份證號
     A            TD13          14O         COLHDG('所得者姓名')
     A            TD14          62O         COLHDG('所得者地址')
     A            TD15           6S 0       COLHDG('所得月份－起')
     A            TD16           6S 0       COLHDG('所得月份－迄')
     A            TD17           8          COLHDG('扣繳單位統一編號')
     A* A1274 890223 :當年度課稅累計次數
     A            TD18           2S 0       COLHDG('課稅次數編碼')
     A*第一碼：縣市代號　第二～三碼：總分處
     A            TD19           3          COLHDG('機徵機關')
     A            TD96           8S 0       COLHDG('核定日期')
     A            TD97           8S 0       COLHDG('記錄更新日期')
     A            TD98           6S 0       COLHDG('記錄更新時間')
     A            TD99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYTTPF  所得稅課稅申報磁帶檔
     A*****************************************************************
     A            TT01           3          COLHDG('稽徵機關')
     A            TT03           4          COLHDG('媒體單位')
     A            TT04           7S 0       COLHDG('流水號')
     A            TT06           1          COLHDG('註記')
     A            TT07           2          COLHDG('格式代號')
     A            TT08          10          COLHDG('身份證號')
     A            TT09           1          COLHDG('證號別')
     A            TT10           8          COLHDG('扣繳單位統一編號')
     A            TT11          10S 0       COLHDG('給付總額')
     A            TT12          10S 0       COLHDG('扣繳稅額')
     A            TT13          10S 0       COLHDG('給付淨額')
     A            TT14          12          COLHDG('房屋稅籍或所得代號')
     A            TT15           1          COLHDG('空白')
     A            TT16           1          COLHDG('錯誤註記')
     A*****************************************************************
     A*  PYTUPF  所得稅課稅申報磁帶檔
     A*****************************************************************
     A            TU01           3          COLHDG('稽徵機關')
     A            TU03           4          COLHDG('媒體單位')
     A            TU04           7S 0       COLHDG('流水號')
     A            TU08          10          COLHDG('身份證號')
     A            TU21          12          COLHDG('中文姓名')
     A            TU22          60          COLHDG('中文地址')
     A*****************************************************************
     A*  PYE1PF  全民健保投保資料檔-HEADING
     A*****************************************************************
     A            E101      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            E102      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            E103           8S 0       COLHDG('生效日期')
     A            E104           1          COLHDG('異動類別')
     A*1-投保 '2'-調整  '3'-停保  '4'-復保  '9'-退保
     A            E105           7  0       COLHDG('投保金額')
     A            E106           3  0       COLHDG('投保人數')
     A*1+眷屬人數 (MUST <= 6)不含停保
     A            E107           1          COLHDG('停保')
     A*'Y'-本人停保
     A            E108           1          COLHDG('補助碼')
     A*'0'-全額1/1 ,'2'-1/2, '4'-1/4, 'A'-顧主全額付
     A**比率記錄於#Y, #Y01='INSR'
     A            E109           2          COLHDG('健保地區')
     A            E114           7  0       COLHDG('應繳保費')
     A            E197           8S 0       COLHDG('記錄更新日期')
     A            E198           6S 0       COLHDG('記錄更新時間')
     A            E199          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYE2PF  全民健保投保資料檔-DETAIL
     A*****************************************************************
     A            E201      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            E202      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            E203      R               COLHDG('生效日期')
     A                                      REFFLD(E103)
     A            E204           3S 0       COLHDG('序號')
     A            E205      R               COLHDG('停保')
     A                                      REFFLD(E107)
     A*'Y'-停保
     A            E206          14O         COLHDG('眷屬姓名')
     A            E207          10          COLHDG('身份證號')
     A            E208           8S 0       COLHDG('出生日期')
     A            E209           1          COLHDG('眷屬稱謂')
     A*#Y='RELATION'
     A            E210           1          COLHDG('民國前出生')
     A*'Y'-民國前
     A            E211           1          COLHDG('補助碼')
     A*'0'-全額1/1 ,'2'-1/2, '4'-1/4, 'A'-顧主全額付
     A**比率記錄於#Y, #Y01='INSR'
     A            E212          62O         COLHDG('說明註解')
     A            E213           7  0       COLHDG('投保金額')
     A            E214           7  0       COLHDG('應繳保費')
     A            E215           2          COLHDG('健保地區')
     A            E297           8S 0       COLHDG('記錄更新日期')
     A            E298           6S 0       COLHDG('記錄更新時間')
     A            E299          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYE3PF  全民健保級數參照檔
     A*****************************************************************
     A            E301           2S 0       COLHDG('級數')
     A            E302           7  0       COLHDG('月投保金額')
     A*
     A*被保險人及眷屬負擔金額（負擔比率３０％）
     A            E303           7  0       COLHDG('本人')
     A            E304           7  0       COLHDG('本人＋１眷口')
     A            E305           7  0       COLHDG('本人＋２眷口')
     A            E306           7  0       COLHDG('本人＋３眷口')
     A*
     A*投保單位負擔金額（負擔比率６０％）
     A            E307           7  0       COLHDG('投保單位負擔')
     A*
     A*政府補助金額（補助比率１０％）
     A            E308           7  0       COLHDG('政府補助金額')
     A*
     A            E397           8S 0       COLHDG('記錄更新日期')
     A            E398           6S 0       COLHDG('記錄更新時間')
     A            E399          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYE4PF  全民健保參數檔
     A*****************************************************************
     A            E400           1          COLHDG('ＫＥＹ０')
     A            E401           5  4       COLHDG('費率')
     A            E402           5  3       COLHDG('員工負擔率')
     A            E403           5  3       COLHDG('公司負擔率')
     A            E404           5  4       COLHDG('公司負擔平均人數')
     A            E405           1  0       COLHDG('員工最多負擔人數')
     A            E497           8S 0       COLHDG('記錄更新日期')
     A            E498           6S 0       COLHDG('記錄更新時間')
     A            E499          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYE5PF  全民健保眷屬投保歷史檔
     A*****************************************************************
     A            E501      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            E502      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            E503      R               COLHDG('生效日期')
     A                                      REFFLD(E103)
     A            E504           3S 0       COLHDG('序號')
     A            E505      R               COLHDG('異動別')
     A                                      REFFLD(E104)
     A*1-投保'3'-停保'4'-復保'5'-轉出'6'-轉入'9'-退保
     A            E506          14O         COLHDG('眷屬姓名')
     A            E507          10          COLHDG('身份證號')
     A            E508           8S 0       COLHDG('出生日期')
     A            E509           1          COLHDG('眷屬稱謂')
     A*#Y='RELATION'
     A            E510           1          COLHDG('民國前出生')
     A*'Y'-民國前
     A            E511           1          COLHDG('補助碼')
     A*'0'-全額1/1 ,'2'-1/2, '4'-1/4, 'A'-顧主全額付
     A**比率記錄於#Y, #Y01='INSR'
     A            E512          62O         COLHDG('說明註解')
     A            E513           7  0       COLHDG('投保金額')
     A            E514           7  0       COLHDG('應繳保費')
     A            E515           6S 0       COLHDG('薪資年月')
     A            E516           2          COLHDG('健保地區')
     A            E597           8S 0       COLHDG('記錄更新日期')
     A            E598           6S 0       COLHDG('記錄更新時間')
     A            E599          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYE6PF  健保扣繳歷史檔
     A*****************************************************************
     A            E601      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            E602      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            E603      R               COLHDG('生效日期')
     A                                      REFFLD(E103)
     A            E6031          6S 0       COLHDG('扣繳年月')
     A            E604           3S 0       COLHDG('序號')
     A            E605      R               COLHDG('異動別')
     A                                      REFFLD(E104)
     A*1-投保'3'-停保'4'-復保'5'-轉出'6'-轉入'9'-退保
     A            E606      R               COLHDG('眷屬姓名')
     A                                      REFFLD(E506)
     A            E607      R               COLHDG('身份證號')
     A                                      REFFLD(E507)
     A            E608      R               COLHDG('出生日期')
     A                                      REFFLD(E508)
     A            E609      R               COLHDG('眷屬稱謂')
     A                                      REFFLD(E509)
     A* 0-本身
     A* 1-配偶
     A* 2-父母
     A* 3-子女
     A* 4-祖父母
     A* 5-孫子女
     A* 6-外祖父母
     A* 7-外孫子女
     A* 8-曾祖父母
     A* 9-外曾祖父母
     A            E610      R               COLHDG('民國前出生')
     A                                      REFFLD(E510)
     A            E611      R               COLHDG('補助碼')
     A                                      REFFLD(E511)
     A            E612      R               COLHDG('說明註解')
     A                                      REFFLD(E512)
     A            E613      R               COLHDG('投保金額')
     A                                      REFFLD(E513)
     A            E614      R               COLHDG('應繳保費')
     A                                      REFFLD(E514)
     A            E615      R               COLHDG('薪資年月')
     A                                      REFFLD(E515)
     A            E616      R               COLHDG('健保地區')
     A                                      REFFLD(E516)
     A            E697      R               COLHDG('記錄更新日期')
     A                                      REFFLD(E597)
     A            E698      R               COLHDG('記錄更新時間')
     A                                      REFFLD(E598)
     A            E699      R               COLHDG('使用者代號')
     A                                      REFFLD(E599)
     A*****************************************************************
     A*  PYE7PF  各縣市健保額補助檔　　
     A*****************************************************************
     A            E701           5          COLHDG('郵遞區號')
     A            E702          20O         COLHDG('地區名稱')
     A            E703           4  0       COLHDG('補助金額')
     A            E704          80          COLHDG('欄位擴充')
     A            E797           8S 0       COLHDG('記錄更新日期')
     A            E798           6S 0       COLHDG('記錄更新時間')
     A            E799          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYL1PF  勞保投保級數參照檔
     A*****************************************************************
     A            L101           2S 0       COLHDG('級數')
     A            L102           7  0       COLHDG('月投保金額')
     A            L103           7  0       COLHDG('日投保金額')
     A*
     A            L197           8S 0       COLHDG('記錄更新日期')
     A            L198           6S 0       COLHDG('記錄更新時間')
     A            L199          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYL2PF  勞保費率參數檔
     A*****************************************************************
     A            L200           1          COLHDG('ＫＥＹ')
     A            L201           5  3       COLHDG('勞保費率')
     A            L2012          5  3       COLHDG('勞保費率B')
     A            L202           5  3       COLHDG('員工負擔比率')
     A            L203           5  5       COLHDG('墊償比率')
     A            L204           5  3       COLHDG('公司負擔比率')
     A            L205           5  5       COLHDG('職災比率')
     A*
     A            L297           8S 0       COLHDG('記錄更新日期')
     A            L298           6S 0       COLHDG('記錄更新時間')
     A            L299          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYX1PF  團體保險投保資料檔-HEADING
     A*****************************************************************
     A            X101      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            X102      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            X103           8S 0       COLHDG('生效日期')
     A            X104           1          COLHDG('異動類別')
     A*1-投保 '2'-調整  '3'-停保  '4'-復保  '9'-退保
     A            X105           7  0       COLHDG('應繳保費總額')
     A            X106           3  0       COLHDG('投保人數')
     A*1+眷屬人數：不含停保
     A            X107           1          COLHDG('停保')
     A*'Y'-本人停保
     A            X108          14O         COLHDG('受益人')
     A*
     A            X197           8S 0       COLHDG('記錄更新日期')
     A            X198           6S 0       COLHDG('記錄更新時間')
     A            X199          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYX2PF  團體保險投保資料檔-DETAIL
     A*****************************************************************
     A            X201      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            X202      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            X203      R               COLHDG('生效日期')
     A                                      REFFLD(E103)
     A            X204           3S 0       COLHDG('序號')
     A            X205      R               COLHDG('停保')
     A                                      REFFLD(E107)
     A*'Y'-停保
     A            X206          14O         COLHDG('眷屬姓名')
     A            X207          10          COLHDG('身份證號')
     A            X208           8S 0       COLHDG('出生日期')
     A            X209           1          COLHDG('眷屬稱謂')
     A*#Y='RELATION'
     A            X210           1          COLHDG('民國前出生')
     A*'Y'-民國前
     A            X211          14O         COLHDG('受益人')
     A*
     A            X297           8S 0       COLHDG('記錄更新日期')
     A            X298           6S 0       COLHDG('記錄更新時間')
     A            X299          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYX3PF  員工保險計劃明細檔-DETAIL
     A*****************************************************************
     A            X301      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            X302      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            X303      R               COLHDG('生效日期')
     A                                      REFFLD(E103)
     A            X304           3          COLHDG('保險代號')
     A            X305           5          COLHDG('計劃代號')
     A            X397           8S 0       COLHDG('記錄更新日期')
     A            X398           6S 0       COLHDG('記錄更新時間')
     A            X399          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYX9PF  團保費率設定檔
     A*****************************************************************
     A            X901           3A         COLHDG('保險代號')
     A*910621     X902           5A         COLHDG('計劃代號')
     A            X903           5  2       COLHDG('薪資倍數')
     A            X904           5  2       COLHDG('投保費率%')
     A            X905          11  2       COLHDG('投保金額')
     A            X906           5  2       COLHDG('折扣費率%')
     A            X907           5  2       COLHDG('折扣年數')
     A            X908           3  0       COLHDG('投保人數')
     A            X909          32O         COLHDG('說明')
     A            X910          11  2       COLHDG('應繳保費')
     A*
     A            X997           8S 0       COLHDG('記錄更新日期')
     A            X998           6S 0       COLHDG('記錄更新時間')
     A            X999          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYT1PF  刷卡時間基本資料檔
     A*****************************************************************
     A            T101           2A         COLHDG('刷卡代號')
     A            T102           2S 0       COLHDG('第一次上班刷卡－時')
     A            T103      R               COLHDG('第一次上班刷卡－時')
     A                                      REFFLD(T102)
     A            T104      R               COLHDG('第一次遲到補班－時')
     A                                      REFFLD(T102)
     A            T105      R               COLHDG('第一次遲到補班－分')
     A                                      REFFLD(T102)
     A            T106      R               COLHDG('第一次下班刷卡－時')
     A                                      REFFLD(T102)
     A            T107      R               COLHDG('第一次下班刷卡－時')
     A                                      REFFLD(T102)
     A            T108      R               COLHDG('第二次上班刷卡－時')
     A                                      REFFLD(T102)
     A            T109      R               COLHDG('第二次上班刷卡－時')
     A                                      REFFLD(T102)
     A            T110      R               COLHDG('第二次遲到補班－時')
     A                                      REFFLD(T102)
     A            T111      R               COLHDG('第二次遲到補班－分')
     A                                      REFFLD(T102)
     A            T112      R               COLHDG('第二次下班刷卡－時')
     A                                      REFFLD(T102)
     A            T113      R               COLHDG('第二次下班刷卡－時')
     A                                      REFFLD(T102)
     A            T114      R               COLHDG('應上班時數－時')
     A                                      REFFLD(T102)
     A            T115      R               COLHDG('應上班時數－分')
     A                                      REFFLD(T102)
     A            T116           4  0       COLHDG('出勤津貼')
     A            T117           1  0       COLHDG('抵休天數')
     A            T118      R               COLHDG('第一次上班－時')
     A                                      REFFLD(T102)
     A            T119      R               COLHDG('第一次上班－分')
     A                                      REFFLD(T102)
     A            T120      R               COLHDG('第一次下班－時')
     A                                      REFFLD(T102)
     A            T121      R               COLHDG('第一次下班－分')
     A                                      REFFLD(T102)
     A            T122      R               COLHDG('第二次上班－時')
     A                                      REFFLD(T102)
     A            T123      R               COLHDG('第二次上班－分')
     A                                      REFFLD(T102)
     A            T124      R               COLHDG('第二次下班－時')
     A                                      REFFLD(T102)
     A            T125      R               COLHDG('第二次下班－分')
     A                                      REFFLD(T102)
     A            T126           4  0       COLHDG('交通補助')
     A*
     A            T197      R               COLHDG('記錄更新日期')
     A                                      REFFLD(EM97)
     A            T198      R               COLHDG('記錄更新時間')
     A                                      REFFLD(EM98)
     A            T199      R               COLHDG('使用者代號')
     A                                      REFFLD(EM99)
     A*****************************************************************
     A*  PYT2PF  員工排班資料檔
     A*****************************************************************
     A            T201      R               COLHDG('公司編號')
     A                                      REFFLD(EM01)
     A            T202      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            T203           6S 0       COLHDG('排班年月')
     A            T205          62          COLHDG('內容')
     A*存放每月至多卅一日之刷卡別
     A*
     A*910711 A1336 KLAUS
     A            T206           7          COLHDG('部門代碼')
     A*
     A            T296      R               COLHDG('考勤確認日期')
     A                                      REFFLD(EM97)
     A*考勤確認後，此檔案之資料即不可修改
     A            T297      R               COLHDG('記錄更新日期')
     A                                      REFFLD(EM97)
     A            T298      R               COLHDG('記錄更新時間')
     A                                      REFFLD(EM98)
     A            T299      R               COLHDG('使用者代號')
     A                                      REFFLD(EM99)
     A*****************************************************************
     A*  PYT4PF  員工臨時卡資料檔
     A*****************************************************************
     A            T401      R               COLHDG('臨時卡號')
     A                                      REFFLD(EM02)
     A            T402      R               COLHDG('生效起日')
     A                                      REFFLD(EM97)
     A            T403      R               COLHDG('公司編號')
     A                                      REFFLD(EM01)
     A            T404      R               COLHDG('員工代號')
     A                                      REFFLD(EM02)
     A            T405      R               COLHDG('原因代號')
     A                                      REFFLD(QJ01)
     A            T406      R               COLHDG('身份証號')
     A                                      REFFLD(EM31)
     A*
     A            T497      R               COLHDG('記錄更新日期')
     A                                      REFFLD(EM97)
     A            T498      R               COLHDG('記錄更新時間')
     A                                      REFFLD(EM98)
     A            T499      R               COLHDG('使用者代號')
     A                                      REFFLD(EM99)
     A*****************************************************************
     A*  PYT5PF  員工每天刷卡資料檔  PYT5PFX -> PYT5PF
     A*****************************************************************
     A            T501      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            T502      R               COLHDG('刷卡日期')
     A                                      REFFLD(EM97)
     A            T503           2  0       COLHDG('刷卡時間－時')
     A            T504           2  0       COLHDG('刷卡時間－分')
     A            T505      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            T506           7A         COLHDG('部門代碼')
     A*'0'-上班 '2'-下班
     A            T507           1          COLHDG('上／下班別')
     A            T508           2          COLHDG('機號')
     A*
     A            T597      R               COLHDG('記錄更新日期')
     A                                      REFFLD(EM97)
     A            T598      R               COLHDG('記錄更新時間')
     A                                      REFFLD(EM98)
     A            T599      R               COLHDG('使用者代號')
     A                                      REFFLD(EM99)
     A*****************************************************************
     A*  PYT5PFX 員工刷卡原始資料檔  PC->400(PYT5PFX)
     A*****************************************************************
     A*** 880807 A1274 EVA
     A            T501X         40A         COLHDG('內容')
     A*PYT5DS01
     A*****************************************************************
     A*  PYT6PF  員工異常資料檔
     A*****************************************************************
     A            T601      R               COLHDG('刷卡日期')
     A                                      REFFLD(EM97)
     A            T602      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            T603      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A*無上班刷卡資料－*       無下班刷卡資料－#
     A*無排班表－N       早退－E              遲到－L
     A            T604      R               COLHDG('實際狀態碼')
     A                                      REFFLD(LC01)
     A*大於應上班刷卡時間或小於下班應刷卡時間
     A            T605           2  0       COLHDG('異常時間－時')
     A            T606           2  0       COLHDG('異常時間－分')
     A*忘刷卡－F          簽到－T   遲到－L    早退－E
     A*不處理－N          交通車誤點－C
     A*可輸入假別代號
     A            T607      R               COLHDG('更正狀態碼')
     A                                      REFFLD(LC01)
     A*異常確認作業後，即依更正狀態作處理
     A*欲修改請至請假檔作個別之處理
     A            T608      R               COLHDG('系統處理狀態')
     A                                      REFFLD(LC01)
     A*
     A            T611      R               COLHDG('班別代號')
     A                                      REFFLD(T101)
     A            T612           4S 0       COLHDG('實際上班刷卡時間')
     A            T613           4S 0       COLHDG('實際下班刷卡時間')
     A            T614           4S 0       COLHDG('應上班刷卡時間')
     A            T615           4S 0       COLHDG('應下班刷卡時間')
     A*
     A            T696      R               COLHDG('異常確認日期')
     A                                      REFFLD(EM97)
     A            T697      R               COLHDG('記錄更新日期')
     A                                      REFFLD(EM97)
     A            T698      R               COLHDG('記錄更新時間')
     A                                      REFFLD(EM98)
     A            T699      R               COLHDG('使用者代號')
     A                                      REFFLD(EM99)
     A*****************************************************************
     A*  PYT7PF  假日資料檔
     A*****************************************************************
     A            T701      R               COLHDG('休假日期')
     A                                      REFFLD(EM97)
     A            T702          30O         COLHDG('休假說明')
     A*
     A            T797      R               COLHDG('記錄更新日期')
     A                                      REFFLD(EM97)
     A            T798      R               COLHDG('記錄更新時間')
     A                                      REFFLD(EM98)
     A            T799      R               COLHDG('使用者代號')
     A                                      REFFLD(EM99)
     A*****************************************************************
     A*  PYNOPF  員工自動編號檔
     A*****************************************************************
     A            NO01           2          COLHDG('公司編號')
     A            NO02           4  0       COLHDG('編號年度')
     A            NO03           8  0       COLHDG('序號')
     A*
     A            NO97      R               COLHDG('記錄更新日期')
     A                                      REFFLD(EM97)
     A            NO98      R               COLHDG('記錄更新時間')
     A                                      REFFLD(EM98)
     A            NO99      R               COLHDG('使用者代號')
     A                                      REFFLD(EM99)
     A*****************************************************************
     A*  PYDSPF  薪資成本分攤檔
     A*****************************************************************
     A            DS01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            DS02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            DS03           3  0       COLHDG('序號')
     A            DS041     R               COLHDG('成本中心－大類'  )
     A                                      REFFLD(CC011)
     A            DS042     R               COLHDG('成本中心－序號'  )
     A                                      REFFLD(CC012)
     A            DS043     R               COLHDG('成本中心－成本'  )
     A                                      REFFLD(CC013)
     A            DS05           5  2       COLHDG('成本分攤率')
     A*
     A            DS97      R               COLHDG('記錄更新日期')
     A                                      REFFLD(EM97)
     A            DS98      R               COLHDG('記錄更新時間')
     A                                      REFFLD(EM98)
     A            DS99      R               COLHDG('使用者代號')
     A                                      REFFLD(EM99)
     A*****************************************************************
     A*  PYA1PF  每月工作天數設定檔
     A*****************************************************************
     A            A101           4S 0       COLHDG('年度')
     A            A102           2S 0       COLHDG('一月份天數')
     A            A103           2S 0       COLHDG('二月份天數')
     A            A104           2S 0       COLHDG('三月份天數')
     A            A105           2S 0       COLHDG('四月份天數')
     A            A106           2S 0       COLHDG('五月份天數')
     A            A107           2S 0       COLHDG('六月份天數')
     A            A108           2S 0       COLHDG('七月份天數')
     A            A109           2S 0       COLHDG('八月份天數')
     A            A110           2S 0       COLHDG('九月份天數')
     A            A111           2S 0       COLHDG('十月份天數')
     A            A112           2S 0       COLHDG('十一月份天數')
     A            A113           2S 0       COLHDG('十二月份天數')
     A            A197           8S 0       COLHDG('記錄更新日期')
     A            A198           6S 0       COLHDG('記錄更新時間')
     A            A199          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYXAPF  工作區檔
     A*****************************************************************
     A            XA01           2          COLHDG('公司別')
     A            XA02          10          COLHDG('工作區代碼')
     A            XA03          30O         COLHDG('工作區說明')
     A            XA04           1          COLHDG('區域碼')
     A                                      DFT('1')
     A            XA97           8S 0       COLHDG('記錄更新日期')
     A            XA98           6S 0       COLHDG('記錄更新時間')
     A            XA99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYXBPF  工作組檔
     A*****************************************************************
     A            XB01           2          COLHDG('公司別')
     A            XB02           2          COLHDG('工作組代碼')
     A            XB03          30O         COLHDG('工作組說明')
     A            XB04          10          COLHDG('工作區代碼')
     A            XB05           2          COLHDG('起始週班別')
     A            XB06           8S 0       COLHDG('起始生效日期')
     A            XB96           1          COLHDG('使用中')
     A*                                          ** YES:'1'  NO:'0' **
     A            XB97           8S 0       COLHDG('記錄更新日期')
     A            XB98           6S 0       COLHDG('記錄更新時間')
     A            XB99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYXCPF  工作組成員檔
     A*****************************************************************
     A            XC01           2          COLHDG('公司別')
     A            XC02           2          COLHDG('工作組代碼')
     A            XC03           8          COLHDG('工作組成員代碼')
     A            XC04           8S 0       COLHDG('生效日期')
     A            XC05           1          COLHDG('支援碼')
     A*                                    **'O'支援他組'I'被支援組
     A*                                      ' '正常**
     A*****************************************************************
     A*  PYXDPF  小組成員支援檔
     A*****************************************************************
     A            XD01           2          COLHDG('公司別')
     A            XD02           8          COLHDG('員工代碼')
     A            XD03          10          COLHDG('原工作區')
     A            XD04           2          COLHDG('原工作組')
     A            XD05          10          COLHDG('支援工作區')
     A            XD06           2          COLHDG('支援工作組')
     A            XD07           8S 0       COLHDG('起始日期')
     A            XD08           8S 0       COLHDG('截止日期')
     A            XD09           1          COLHDG('支援結束碼')
     A*                                          ** '&'結束支援**
     A            XD97           8S 0       COLHDG('記錄更新日期')
     A            XD98           6S 0       COLHDG('記錄更新時間')
     A            XD99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYXEPF  小組成員調組檔
     A*****************************************************************
     A            XE01           2          COLHDG('公司別')
     A            XE02           8          COLHDG('員工代碼')
     A            XE03          10          COLHDG('原工作區')
     A            XE04           2          COLHDG('原工作組')
     A            XE05          10          COLHDG('新工作區')
     A            XE06           2          COLHDG('新工作組')
     A            XE07           8S 0       COLHDG('生效日期')
     A            XE97           8S 0       COLHDG('記錄更新日期')
     A            XE98           6S 0       COLHDG('記錄更新時間')
     A            XE99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYXFPF  班別設定檔
     A*****************************************************************
     A            XF01           2          COLHDG('公司別')
     A            XF02           2          COLHDG('班別代碼')
     A            XF03          30O         COLHDG('班別說明')
     A            XF04           4S 0       COLHDG('上班時間')
     A            XF05           4S 0       COLHDG('下班時間')
     A            XF06           2S 1       COLHDG('輪班津貼碼')
     A            XF07           2S 1       COLHDG('計程車費碼')
     A            XF08           2S 1       COLHDG('交通津貼-台北')
     A            XF09           2S 1       COLHDG('交通津貼-其它')
     A            XF10           2S 1       COLHDG('其他津貼率')
     A            XF11           8S 0       COLHDG('生效日期')
     A            XF12           3S 1       COLHDG('上班時數')
     A            XF96           1          COLHDG('使用中')
     A            XF97           8S 0       COLHDG('記錄更新日期')
     A            XF98           6S 0       COLHDG('記錄更新時間')
     A            XF99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYXGPF  勤別設定檔
     A*****************************************************************
     A            XG01           2          COLHDG('公司別')
     A            XG02           2          COLHDG('勤別代碼')
     A            XG03          30O         COLHDG('勤別說明')
     A            XG04           1          COLHDG('休假碼')
     A            XG05           2S 1       COLHDG('輪班津貼碼')
     A            XG06           2S 1       COLHDG('計程車費碼')
     A            XG07           2S 1       COLHDG('交通津貼-台北')
     A            XG08           2S 1       COLHDG('交通津貼-其它')
     A            XG09           2S 1       COLHDG('其他津貼率')
     A            XG10           8S 0       COLHDG('生效日期')
     A            XG96           1          COLHDG('使用中')
     A            XG97           8S 0       COLHDG('記錄更新日期')
     A            XG98           6S 0       COLHDG('記錄更新時間')
     A            XG99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYXHPF  週班設定檔
     A*****************************************************************
     A            XH01           2          COLHDG('公司別')
     A            XH02          10          COLHDG('工作區代碼')
     A            XH03           2          COLHDG('週班代碼')
     A            XH04           2          COLHDG('週日班')
     A            XH05           2          COLHDG('週一班')
     A            XH06           2          COLHDG('週二班')
     A            XH07           2          COLHDG('週三班')
     A            XH08           2          COLHDG('週四班')
     A            XH09           2          COLHDG('週五班')
     A            XH10           2          COLHDG('週六班')
     A            XH11           8S 0       COLHDG('生效日期')
     A            XH96           1          COLHDG('使用中')
     A            XH97           8S 0       COLHDG('記錄更新日期')
     A            XH98           6S 0       COLHDG('記錄更新時間')
     A            XH99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYXIPF  排班異動檔
     A*****************************************************************
     A            XI01           2          COLHDG('公司別')
     A            XI02           2          COLHDG('工作組代碼')
     A            XI03           2          COLHDG('週班別')
     A            XI04           8S 0       COLHDG('起始生效日期')
     A            XI05           8S 0       COLHDG('截止日期')
     A            XI06          10          COLHDG('工作區')
     A            XI97           8S 0       COLHDG('記錄更新日期')
     A            XI98           6S 0       COLHDG('記錄更新時間')
     A            XI99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYXJPF  飛機勤務設定檔
     A*****************************************************************
     A            XJ01           2          COLHDG('公司別')
     A            XJ02           8S 0       COLHDG('起始生效日期')
     A            XJ03          40          COLHDG('週日')
     A            XJ04          40          COLHDG('週一')
     A            XJ05          40          COLHDG('週二')
     A            XJ06          40          COLHDG('週三')
     A            XJ07          40          COLHDG('週四')
     A            XJ08          40          COLHDG('週五')
     A            XJ09          40          COLHDG('週六')
     A            XJ97           8S 0       COLHDG('記錄更新日期')
     A            XJ98           6S 0       COLHDG('記錄更新時間')
     A            XJ99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYXKPF  出勤日異動作業檔
     A*****************************************************************
     A            XK01           2          COLHDG('公司別')
     A            XK02           2          COLHDG('組別')
     A            XK03           8          COLHDG('員工代碼')
     A            XK04           8S 0       COLHDG('出勤日期')
     A            XK05           2          COLHDG('原班別')
     A            XK06           2          COLHDG('勤別')
     A            XK07           2S 1       COLHDG('輪班津貼碼')
     A            XK08           2S 1       COLHDG('計程車費碼')
     A            XK09           2S 1       COLHDG('交通津貼-台北')
     A            XK10           2S 1       COLHDG('交通津貼-其它')
     A            XK11           2S 1       COLHDG('其他津貼率')
     A            XK12           3S 1       COLHDG('加班時間')
     A            XK13           3S 0       COLHDG('遲到時間')
     A            XK14           3S 0       COLHDG('早退時間')
     A            XK15          10          COLHDG('工作區代碼')
     A            XK97           8S 0       COLHDG('記錄更新日期')
     A            XK98           6S 0       COLHDG('記錄更新時間')
     A            XK99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYXLPF  月結作業檔
     A*****************************************************************
     A            XL01           2          COLHDG('公司編號')
     A            XL02           6S 0       COLHDG('年月')
     A            XL03           1A         COLHDG('月結碼')
     A            XL04           8S 0       COLHDG('月結日期')
     A            XL97           8S 0       COLHDG('記錄更新日期')
     A            XL98           6S 0       COLHDG('記錄更新時間')
     A            XL99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYAIPF  年度調薪(AI)公式檔
     A*****************************************************************
     A            AI01           2          COLHDG('公司編號')
     A            AI02           4S 0       COLHDG('生效年')
     A            AI03           2S 0       COLHDG('生效月')
     A            AI04           3          COLHDG('調薪別')
     A            AI05           8S 0       COLHDG('調薪基準日')
     A            AI06           1          COLHDG('調薪基礎別')
     A            AI07           4S 2       COLHDG('調整百分比')
     A            AI08           6S 0       COLHDG('固定調整金額')
     A            AI09           1          COLHDG('狀態碼')
     A            AI10          10          COLHDG('維護人員代號')
     A            AI11           8  0       COLHDG('系統日期')
     A            AI12           6  0       COLHDG('系統時間')
     A*****************************************************************
     A*  PYABPF  年度調薪(AI)基礎自訂檔(保留)
     A*****************************************************************
     A            AB01           2          COLHDG('公司編號')
     A            AB02           4S 0       COLHDG('生效年')
     A            AB03           2S 0       COLHDG('生效月')
     A            AB04           3          COLHDG('調薪別')
     A            AB05           8S 0       COLHDG('調薪基準日')
     A            AB06           1          COLHDG('調薪基礎別')
     A            AB07           1          COLHDG('本薪項')
     A            AB08           1          COLHDG('膳食津貼')
     A            AB09           1          COLHDG('交通津貼')
     A            AB10           1          COLHDG('保留一')
     A            AB11           1          COLHDG('保留二')
     A            AB12           1          COLHDG('保留三')
     A            AB13           1          COLHDG('保留四')
     A            AB14           1          COLHDG('保留五')
     A            AB15           1          COLHDG('保留六')
     A            AB16           1          COLHDG('保留七')
     A            AB17           1          COLHDG('保留八')
     A            AB18           1          COLHDG('保留九')
     A            AB19           1          COLHDG('保留十')
     A*****************************************************************
     A*  PYARPF  年度調薪(AI)規則檔(保留)
     A*****************************************************************
     A            AR01           2          COLHDG('公司編號')
     A            AR02           4S 0       COLHDG('生效年')
     A            AR03           2S 0       COLHDG('生效月')
     A            AR04           3          COLHDG('調薪別')
     A            AR05           8S 0       COLHDG('調薪基準日')
     A            AR06           1          COLHDG('AI超上限碼')
     A*               A:發放　B:保留C:不發
     A            AR07           1          COLHDG('AI追加扣作業碼')
     A*               A:追加＆追扣　B:追加ONLY
     A            AR08           6S 0       COLHDG('AI一次作業年月')
     A            AR09           1          COLHDG('COL超上限碼')
     A*               A:一次發放１２個月　B:按月
     A            AR10           1          COLHDG('COL追加扣作業碼')
     A*               A:追加＆追扣　B:追加ONLY
     A            AR11           6S 0       COLHDG('COL一次作業年月')
     A            AR12          10          COLHDG('維護人員代號')
     A            AR13           8S 0       COLHDG('系統日期')
     A            AR14           6S 0       COLHDG('系統時間')
     A*****************************************************************
     A*  PYATPF  年度調薪(AI)試算記錄檔
     A*****************************************************************
     A            AT01           2          COLHDG('公司編號')
     A            AT02           4S 0       COLHDG('生效年')
     A            AT03           2S 0       COLHDG('生效月')
     A            AT04           3          COLHDG('調薪別')
     A            AT05           8S 0       COLHDG('調薪基準日')
     A            AT06           1S 0       COLHDG('尾數處理碼')
     A*               1:個位數2:十位數3:百位數4:千位數
     A            AT07           1          COLHDG('進位碼')
     A*               H:四捨五入P:無條件進位M:無條件捨去
     A            AT08           1          COLHDG('產生個人試算檔')
     A*               Y:產生N:不產生
     A            AT09           1          COLHDG('列印碼')
     A*               Y:列印N:不列印
     A            AT10          10          COLHDG('試算人員代號')
     A            AT11           8S 0       COLHDG('系統日期')
     A            AT12           6S 0       COLHDG('系統時間')
     A*****************************************************************
     A*  PYAPPF  年度調薪(AI)個人試算資料檔
     A*****************************************************************
     A            AP01           2          COLHDG('公司編號')
     A            AP02           4S 0       COLHDG('生效年')
     A            AP03           2S 0       COLHDG('生效月')
     A            AP04           3          COLHDG('調薪別')
     A            AP05           8  0       COLHDG('員工編號')
     A            AP06           6S 0       COLHDG('原基本薪')
     A            AP07           6S 0       COLHDG('調後基本薪')
     A            AP08           6S 0       COLHDG('可調上限')
     A            AP09           6S 0       COLHDG(' FINAL基本薪')
     A            AP10           6S 0       COLHDG('超上限金額')
     A            AP11          10          COLHDG('試算人員代號')
     A            AP12           8S 0       COLHDG('系統日期')
     A            AP13           6S 0       COLHDG('系統時間')
     A*****************************************************************
     A*  PYBXPF  薪資項目彙總檔           KEY=BX01+BX02
     A*****************************************************************
     A            BX01           2A         COLHDG('公司編號')
     A            BX02           2A         COLHDG('薪資彙總項目')
     A            BX03           6A         COLHDG('會計科目代號')
     A            BX97           8S 0       COLHDG('系統日期')
     A            BX98           6S 0       COLHDG('系統時間')
     A            BX99          10A         COLHDG('USERID')
     A*****************************************************************
     A*  PYBGPF  薪資月彙總檔
     A*****************************************************************
     A            BG01           2A         COLHDG('公司編號')
     A            BG021          1A         COLHDG('成本中心１')
     A            BG022          3A         COLHDG('成本中心２')
     A            BG023          1A         COLHDG('成本中心３')
     A            BG03           6S 0       COLHDG('彙總年月')
     A            BG04           2A         COLHDG('新資彙總實際項目')
     A            BG05           9S 0       COLHDG('彙總金額')
     A            BG97           8S 0       COLHDG('系統日期')
     A            BG98           6S 0       COLHDG('系統時間')
     A            BG99          10A         COLHDG('USERID')
     A*
     A*****************************************************************
     A*  PYODPF  遲到次數設定檔
     A*****************************************************************
     A            OD01           1A         COLHDG('KEY')
     A            OD02           2  0       COLHDG('遲到次數')
     A            OD03           3  1       COLHDG('遲到扣款時數')
     A            OD04           3  1       COLHDG('遲到間距時數')
     A            OD97           8S 0       COLHDG('記錄更新日期')
     A            OD98           6S 0       COLHDG('記錄更新時間')
     A            OD99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYP1PF  教師基本資料檔( PC端轉存)
     A*****************************************************************
     A            P101           8          COLHDG('員工編號')
     A            P102          10          COLHDG('身份証號')
     A            P103           1          COLHDG('身份證號識別碼')
     A            P104A         14O         COLHDG('員工姓名')
     A            P104B         62          COLHDG('英文姓名')
     A            P105A         62O         COLHDG('通訊地址')
     A            P105B         62O         COLHDG('戶籍地址')
     A*
     A            P106           1          COLHDG('國籍')
     A                                      VALUES('L' 'F')
     A*                                     F-本國   M-外籍
     A            P107           1          COLHDG('所得扣繳')
     A*                                     1-一般2-10% 3-20% 5- 6%
     A            P108           1          COLHDG('性別')
     A                                      VALUES('F' 'M')
     A*                                     F-女   M-男
     A            P109           1          COLHDG('扣繳勞保費')
     A            P1010          1          COLHDG('扣繳健保費')
     A            P1011          1          COLHDG('扣抵所得稅')
     A            P1012          3          COLHDG('銀行總行代號')
     A            P1013          4          COLHDG('銀行分行代號')
     A            P1014         12          COLHDG('存入帳號')
     A            P1015          1          COLHDG('銀行別')
     A            P1016          1          COLHDG('有無基本資料')
     A                                      VALUES('Y' 'N')
     A*顯示於人事主檔中是否已有資料存在   Y-是   N-否
     A*
     A            P1097          8S 0       COLHDG('記錄更新日期')
     A            P1098          6S 0       COLHDG('記錄更新時間')
     A            P1099         10          COLHDG('使用者代號')
     A*
     A*****************************************************************
     A*  PYP1PFX 教師基本資料轉檔
     A*****************************************************************
     A            P101X        200A         COLHDG('轉檔內容')
     A*
     A*****************************************************************
     A*  PYP2PF  教師薪金資料檔( PC端轉存)
     A*****************************************************************
     A            P201           8          COLHDG('員工編號')
     A            P202          10          COLHDG('身份証號')
     A            P203           1          COLHDG('身份證號識別碼')
     A            P204A         14O         COLHDG('員工姓名')
     A            P204B         62          COLHDG('英文姓名')
     A            P2051          1          COLHDG('部門代碼一')
     A            P2052          1          COLHDG('部門代碼二')
     A            P2053          1          COLHDG('部門代碼三')
     A            P2054          4          COLHDG('部門代碼四')
     A*
     A            P206           1          COLHDG('國籍')
     A                                      VALUES('L' 'F')
     A*                                     F-本國   M-外籍
     A            P207           1          COLHDG('所得扣繳')
     A*                                     1-一般2-10% 3-20% 5- 6%
     A            P208           8S 0       COLHDG('薪資發放日期')
     A            P209           1          COLHDG('扣繳勞保費')
     A            P2010          1          COLHDG('扣繳健保費')
     A            P2011          1          COLHDG('扣抵所得稅')
     A            P2012         10          COLHDG('課程項目')
     A            P2013         10          COLHDG('期別')
     A            P2014          8S 0       COLHDG('日期')
     A            P2015         14          COLHDG('班級')
     A            P2016         20          COLHDG('期間')
     A            P2017          5S 2       COLHDG('堂數')
     A            P2018          5S 2       COLHDG('堂時數')
     A            P2019          5S 2       COLHDG('總時數')
     A            P2020          6S 0       COLHDG('鐘點費')
     A            P2021          6S 0       COLHDG('金額')
     A            P2022          1          COLHDG('有無基本資料')
     A                                      VALUES('Y' 'N')
     A*顯示於人事主檔中是否已有資料存在   Y-是   N-否
     A            P2097          8S 0       COLHDG('記錄更新日期')
     A            P2098          6S 0       COLHDG('記錄更新時間')
     A            P2099         10          COLHDG('使用者代號')
     A*
     A*****************************************************************
     A*  PYP2PFX 教師薪金資料檔
     A*****************************************************************
     A            P201X        200A         COLHDG('轉檔內容')
     A*
     A*****************************************************************
     A*  PYRRPF  考績比率檔               KEY= RR01+RR02+RR03
     A*****************************************************************
     A            RR01           2A         COLHDG('公司編號')
     A            RR02           1A         COLHDG('考績項目')
     A            RR03           2A         COLHDG('考績等級')
     A            RR04           5S 2       COLHDG('考績比率')
     A            RR05           5S         COLHDG('金額')
     A            RR06           5S 2       COLHDG('分數上限')
     A            RR07           5S 2       COLHDG('分數下限')
     A*
     A*****************************************************************
     A*  PYRVPF  員工考績檔               KEY= RV01+RV02+RV03+RV04
     A*****************************************************************
     A            RV01           2A         COLHDG('公司編號')
     A            RV02           8A         COLHDG('員工編號')
     A            RV03           4  0       COLHDG('考績年度')
     A            RV04           1          COLHDG('考績種類')
     A            RV05           2          COLHDG('主管考績')
     A            RV06           2          COLHDG('人評會考績')
     A            RV07           5  2       COLHDG('考績率')
     A            RV08           7          COLHDG('部門編號')
     A            RV09          16O         COLHDG('部門簡稱')
     A*****************************************************************
     A*  PYERPF  褔委會收支檔             KEY= ER01+ER02+ER03+ER04
     A*****************************************************************
     A            ER01           2A         COLHDG('公司編號')
     A            ER02           8A         COLHDG('員工編號')
     A            ER03           8S 0       COLHDG('收支日期')
     A*"1":福委會支出 "2":福委會收入
     A            ER04           1A         COLHDG('收支代碼')
     A            ER05           6S 0       COLHDG('金額')
     A*"GIFT": PT#YPF
     A*"A1,2":年度補助金
     A*"A2,1":補助金發放
     A*"B1,2":薪資福利金
     A*"ON,1":各類禮金及其他
     A            ER06           2A         COLHDG('收支項目')
     A*
     A            ER07           4S 0       COLHDG('福利年度')
     A*
     A            ER97           8S 0       COLHDG('記錄更新日期')
     A            ER98           6S 0       COLHDG('記錄更新時間')
     A            ER99          10A         COLHDG('使用者代號')
     A*****************************************************************
     A*  PYOFPF  差勤加班申請檔
     A*****************************************************************
     A            OF01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            OF02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            OF03           8S 0       COLHDG('申請日期')
     A            OF04           4S 0       COLHDG('申請時間')
     A            OF05      R               COLHDG('假別')
     A                                      REFFLD(LC01)
     A            OF06           8S 0       COLHDG('起始日期')
     A            OF07           4S 0       COLHDG('起始時間')
     A            OF08           8S 0       COLHDG('終止日期')
     A            OF09           4S 0       COLHDG('終止時間')
     A            OF10           3  0       COLHDG('天數')
     A            OF11           3  1       COLHDG('時數')
     A            OF12           1          COLHDG('核准碼')
     A            OF96           6S 0       COLHDG('薪資處理月份')
     A*
     A            OF97           8S 0       COLHDG('記錄更新日期')
     A            OF98           6S 0       COLHDG('記錄更新時間')
     A            OF99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYD1PF  人事基本資料備註檔
     A*****************************************************************
     A            D101      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            D102      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            D103          62O         COLHDG('備註內容')
     A            D104          62O         COLHDG('備註內容')
     A            D105          62O         COLHDG('備註內容')
     A            D106          62O         COLHDG('備註內容')
     A            D107          62O         COLHDG('備註內容')
     A            D108          62O         COLHDG('備註內容')
     A            D109          62O         COLHDG('備註內容')
     A            D110          62O         COLHDG('備註內容')
     A            D111          62O         COLHDG('備註內容')
     A            D112          62O         COLHDG('備註內容')
     A            D113          62O         COLHDG('備註內容')
     A            D114          62O         COLHDG('備註內容')
     A            D115          62O         COLHDG('備註內容')
     A            D116          62O         COLHDG('備註內容')
     A            D197           8S 0       COLHDG('記錄更新日期')
     A            D198           6S 0       COLHDG('記錄更新時間')
     A            D199          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYD2PF員工工作內容資料輸入記錄檔
     A*****************************************************************
     A            D201      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            D202      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            D203          62O         COLHDG('備註內容')
     A            D204          62O         COLHDG('備註內容')
     A            D205          62O         COLHDG('備註內容')
     A            D206          62O         COLHDG('備註內容')
     A            D207          62O         COLHDG('備註內容')
     A            D208          62O         COLHDG('備註內容')
     A            D209          62O         COLHDG('備註內容')
     A            D210          62O         COLHDG('備註內容')
     A            D211          62O         COLHDG('備註內容')
     A            D212          62O         COLHDG('備註內容')
     A            D213          62O         COLHDG('備註內容')
     A            D214          62O         COLHDG('備註內容')
     A            D215          62O         COLHDG('備註內容')
     A            D216          62O         COLHDG('備註內容')
     A            D297           8S 0       COLHDG('記錄更新日期')
     A            D298           6S 0       COLHDG('記錄更新時間')
     A            D299          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYD3PF  員工專長資料檔
     A*****************************************************************
     A            D301      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            D302      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            D303          62O         COLHDG('備註內容')
     A            D304          62O         COLHDG('備註內容')
     A            D305          62O         COLHDG('備註內容')
     A            D306          62O         COLHDG('備註內容')
     A            D307          62O         COLHDG('備註內容')
     A            D308          62O         COLHDG('備註內容')
     A            D309          62O         COLHDG('備註內容')
     A            D310          62O         COLHDG('備註內容')
     A            D311          62O         COLHDG('備註內容')
     A            D312          62O         COLHDG('備註內容')
     A            D313          62O         COLHDG('備註內容')
     A            D314          62O         COLHDG('備註內容')
     A            D315          62O         COLHDG('備註內容')
     A            D316          62O         COLHDG('備註內容')
     A            D397           8S 0       COLHDG('記錄更新日期')
     A            D398           6S 0       COLHDG('記錄更新時間')
     A            D399          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYD4PF員工意向調查資料記錄檔
     A*****************************************************************
     A            D401      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            D402      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            D403         930O         COLHDG('備註內容')
     A            D497           8S 0       COLHDG('記錄更新日期')
     A            D498           6S 0       COLHDG('記錄更新時間')
     A            D499          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYMVPF  差勤／加班申請紀錄檔     KEY= MV01+MV02+MV03+MV04+MV05
     A*****************************************************************
     A            MV01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            MV02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            MV03           8S 0       COLHDG('起始日期')
     A            MV04      R               COLHDG('假別')
     A                                      REFFLD(LC01)
     A            MV05           8S 0       COLHDG('終止日期')
     A            MV06           4S 0       COLHDG('起始時間')
     A            MV07           4S 0       COLHDG('終止時間')
     A            MV08           5  1       COLHDG('時數')
     A            MV09           3  0       COLHDG('天數')
     A            MV10           1          COLHDG('申請項目')
     A            MV11           8S 0       COLHDG('申請日期')
     A            MV12           6S 0       COLHDG('申請時間')
     A            MV13           3S 0       COLHDG('次數')
     A            MV14           6S 0       COLHDG('薪資處理月份')
     A*
     A            MV97           8S 0       COLHDG('記錄更新日期')
     A            MV98           6S 0       COLHDG('記錄更新時間')
     A            MV99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYDTA1  員工人事資料轉檔         *YAMAHA USE ONLY
     A*****************************************************************
     A            TDS01          2          COLHDG('公司')
     A            TDS02          8          COLHDG('員工編號')
     A            TDS03         14O         COLHDG('員工姓名')
     A            TDS04          1          COLHDG('部門一')
     A            TDS05          6          COLHDG('部門二三')
     A            TDS06          3          COLHDG('職稱編號')
     A            TDS07          2          COLHDG('職等職級')
     A            TDS08          1          COLHDG('編制代號')
     A            TDS09          1          COLHDG('計薪代碼')
     A            TDS10          1          COLHDG('離職碼')
     A            TDS11          8          COLHDG('到職日期')
     A            TDS12          8          COLHDG('勞保投保日')
     A            TDS13          8          COLHDG('勞保調整日')
     A            TDS14          8          COLHDG('勞保退保日')
     A            TDS15          8          COLHDG('離職日期')
     A            TDS16          8          COLHDG('最近調陞日')
     A            TDS17          8          COLHDG('最近調薪日')
     A            TDS18          7          COLHDG('勞保投保金額')
     A            TDS19          8          COLHDG('團保投保日')
     A            TDS20          5          COLHDG('團保員工負擔保費')
     A            TDS21          8          COLHDG('團保退保日期')
     A            TDS22         10O         COLHDG('身分證號')
     A            TDS23          1          COLHDG('性別')
     A            TDS24          1          COLHDG('國籍')
     A            TDS25          8          COLHDG('出生日期')
     A            TDS26          1          COLHDG('婚姻')
     A            TDS27          2          COLHDG('扶養人數')
     A            TDS28         22O         COLHDG('籍貫')
     A            TDS29         60O         COLHDG('通訊地址')
     A            TDS30         60O         COLHDG('戶籍地址')
     A            TDS31         15          COLHDG('通訊電話')
     A            TDS32         15          COLHDG('戶籍電話')
     A            TDS33         14O         COLHDG('聯絡人')
     A            TDS34         14O         COLHDG('保證人一')
     A            TDS35         14O         COLHDG('保證人二')
     A            TDS36         15          COLHDG('聯絡人電話')
     A            TDS37         15          COLHDG('保證人電話一')
     A            TDS38         15          COLHDG('保證人電話二')
     A            TDS39          3          COLHDG('學校名稱－一')
     A            TDS40         22O         COLHDG('科系－一')
     A            TDS41          6          COLHDG('入校年月－一')
     A            TDS42          6          COLHDG('離校年月－一')
     A            TDS43          1          COLHDG('畢／肆－一')
     A            TDS44          3          COLHDG('學校名稱－二')
     A            TDS45         22O         COLHDG('科系－二')
     A            TDS46          6          COLHDG('入校年月－二')
     A            TDS47          6          COLHDG('離校年月－二')
     A            TDS48          1          COLHDG('畢／肆－二')
     A            TDS49          3          COLHDG('學校名稱－三')
     A            TDS50         22O         COLHDG('科系－三')
     A            TDS51          6          COLHDG('入校年月－三')
     A            TDS52          6          COLHDG('離校年月－三')
     A            TDS53          1          COLHDG('畢／肆－三')
     A            TDS54         22O         COLHDG('機關名稱－一')
     A            TDS55         22O         COLHDG('職務－一')
     A            TDS56          6          COLHDG('任職年月－一')
     A            TDS57          6          COLHDG('離職年月－一')
     A            TDS58         22O         COLHDG('機關名稱－二')
     A            TDS59         22O         COLHDG('職務－二')
     A            TDS60          6          COLHDG('任職年月－二')
     A            TDS61          6          COLHDG('離職年月－二')
     A            TDS62         22O         COLHDG('機關名稱－三')
     A            TDS63         22O         COLHDG('職務－三')
     A            TDS64          6          COLHDG('任職年月－三')
     A            TDS65          6          COLHDG('離職年月－三')
     A            TDS66          1          COLHDG('學歷代碼')
     A            TDS67          1          COLHDG('所得扣繳')
     A            TDS68          1          COLHDG('是否刷卡')
     A            TDS69          1          COLHDG('是否下班刷卡')
     A            TDS70          8          COLHDG('特休基準日')
     A            TDS71         15          COLHDG('聯絡電話')
     A            TDS72          1          COLHDG('上班地點')
     A            TDS73          8          COLHDG('記錄更新日期')
     A            TDS74          6          COLHDG('記錄更新時間')
     A            TDS75         10O         COLHDG('使用者代號')
     A*****************************************************************
     A*           PYGHPF 褔委會員工補助金主檔  　　　　
     A*****************************************************************
     A            GH01           2          COLHDG('公司編號')
     A            GH02           8          COLHDG('員工編號')
     A            GH03           4  0       COLHDG('福利年度')
     A            GH04           7S 0       COLHDG('福利金額')
     A            GH05           6S 0       COLHDG('在職天數')
     A            GH06           8S 0       COLHDG('到職日期')
     A            GH07           8S 0       COLHDG('離職日期')
     A*
     A            GH97           8S 0       COLHDG('記錄更新日期')
     A            GH98           6S 0       COLHDG('記錄更新時間')
     A            GH99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*           PYGDPF 褔委會員工補助金明細檔　　　　
     A*****************************************************************
     A            GD01           2          COLHDG('公司編號')
     A            GD02           8          COLHDG('員工編號')
     A            GD03           5          COLHDG('工作地點')
     A            GD04           4S 0       COLHDG('福利年度')
     A            GD05           6S 0       COLHDG('申請月份')
     A            GD06           8S 0       COLHDG('申請日期')
     A*"GRANT"
     A            GD07           2          COLHDG('申請項目')
     A            GD08           7S 0       COLHDG('申請金額')
     A            GD09           6S 0       COLHDG('計薪年月')
     A            GD10          62O         COLHDG('備註')
     A*
     A            GD97           8S 0       COLHDG('記錄更新日期')
     A            GD98           6S 0       COLHDG('記錄更新時間')
     A            GD99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PY2HPF  年假批次處理檔
     A*****************************************************************
     A            H201      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            H202      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            H203           4S 0       COLHDG('特休年度')
     A*           H204           3  0       COLHDG('本年度年假天數')
     A            H204           4  1       COLHDG('本年度年假天數')
     A            H205           3  0       COLHDG('年假折發－天數')
     A            H205H          1  0       COLHDG('年假折發－時數')
     A            H206           7  0       COLHDG('年假折發金額')
     A            H207           6  0       COLHDG('處理年月')
     A            H208           3  0       COLHDG('去年可休年假－天')
     A            H208H          1  0       COLHDG('去年可休年假－時')
     A            H209           3  0       COLHDG('去年已休年假－天')
     A            H209H          1  0       COLHDG('去年已休年假－時')
     A            H210           3  0       COLHDG('去年未休年假－天')
     A            H210H          1  0       COLHDG('去年未休年假－時')
     A*
     A            H211           7S 0       COLHDG('本俸金額')
     A            H212           7S 0       COLHDG('職務加給')
     A            H213           7S 0       COLHDG('交通津貼')
     A            H214           7S 0       COLHDG('主管加給')
     A            H215           7S 0       COLHDG('午餐津貼')
     A            H216           3S 0       COLHDG('在職月數')
     A*
     A            H297           8S 0       COLHDG('記錄更新日期')
     A            H298           6S 0       COLHDG('記錄更新時間')
     A            H299          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYBUPF  利潤獎金資料檔
     A*****************************************************************
     A            BU01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            BU02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            BU03           4S 0       COLHDG('獎金年度')
     A            BU04           2          COLHDG('獎金類別')
     A            BU05           6S 0       COLHDG('發放年月')
     A            BU05D          2S 0       COLHDG('發放日')
     A            BU06           7S 0       COLHDG('獎金金額')
     A            BU07           6S 3       COLHDG('獎金稅率')
     A            BU08           7S 0       COLHDG('獎金稅額')
     A            BU09      R               COLHDG('職等')
     A                                      REFFLD(PS01)
     A            BU10      R               COLHDG('職級')
     A                                      REFFLD(PS01)
     A            BU11           4S 1       COLHDG('獎金點數')
     A            BU12           7S 0       COLHDG('實領總額')
     A            BU13          62O         COLHDG('發放說明')
     A            BU14           3S         COLHDG('在職月數')
     A*
     A            BU96           8S 0       COLHDG('核定日期')
     A            BU97           8S 0       COLHDG('記錄更新日期')
     A            BU98           6S 0       COLHDG('記錄更新時間')
     A            BU99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYXXPF  獎懲主檔                 KEY= XX01+XX02+XX03+XX04
     A*****************************************************************
     A            XX01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            XX02           7A         COLHDG('部門編號')
     A            XX03          16O         COLHDG('部門簡稱')
     A            XX04      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            XX05           8S 0       COLHDG('獎懲日期')
     A            XX06           2A         COLHDG('獎懲代號')
     A            XX07          30O         COLHDG('獎懲原因')
     A            XX08           2S 0       COLHDG('獎懲次數')
     A            XX09          10A         COLHDG('文件代號')
     A*
     A            XX97           8S 0       COLHDG('記錄更新日期')
     A            XX98           6S 0       COLHDG('記錄更新時間')
     A            XX99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYLIPF  員工住宿主檔             KEY= LI01+LI02
     A*****************************************************************
     A            LI01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            LI02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            LI03           1          COLHDG('申請類別')
     A*                                     1-住宿 2-退宿
     A            LI04           8S 0       COLHDG('生效日期')
     A            LI05           8S 0       COLHDG('住宿日期')
     A            LI06           8S 0       COLHDG('退宿日期')
     A            LI07           1          COLHDG('備註碼')
     A            LI08          10O         COLHDG('備註')
     A            LI09           7  0       COLHDG('月租費金額')
     A*
     A            LI97           8S 0       COLHDG('記錄更新日期')
     A            LI98           6S 0       COLHDG('記錄更新時間')
     A            LI99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYLPPF  員工住宿費用明細檔             KEY= LI01+LI02
     A*****************************************************************
     A            LP01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            LP02      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            LP03           6S 0       COLHDG('住宿年月')
     A            LP04           2S 0       COLHDG('本月住宿天數')
     A            LP05           4S 0       COLHDG('住宿金額')
     A            LP06           8S 0       COLHDG('退宿日期')
     A            LP07           1          COLHDG('備註碼')
     A            LP08          10O         COLHDG('備註')
     A*
     A            LP97           8S 0       COLHDG('記錄更新日期')
     A            LP98           6S 0       COLHDG('記錄更新時間')
     A            LP99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYPPPF  生產獎金資料主檔
     A*****************************************************************
     A            PP01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            PP02           4S 0       COLHDG('獎金年度')
     A            PP03           6S 0       COLHDG('發放年月')
     A            PP03D          2S 0       COLHDG('發放日期')
     A            PP041          1          COLHDG('部門代碼一')
     A            PP042          1          COLHDG('部門代碼二')
     A            PP043          1          COLHDG('部門代碼三')
     A            PP044          4          COLHDG('部門代碼四')
     A            PP06           1          COLHDG('獎金註記')
     A            PP07           9S 2       COLHDG('應計總工時')
     A            PP08           9S 2       COLHDG('實際總工時')
     A            PP09          10S 2       COLHDG('應計總金額')
     A            PP10          10S 2       COLHDG('實際總金額')
     A            PP11          62O         COLHDG('發放說明')
     A*
     A            PP12          10          COLHDG('保留欄位一')
     A            PP13          10S 2       COLHDG('保留欄位二')
     A*
     A            PP95           1          COLHDG('獎金確認')
     A            PP96           8S 0       COLHDG('核定日期')
     A            PP97           8S 0       COLHDG('記錄更新日期')
     A            PP98           6S 0       COLHDG('記錄更新時間')
     A            PP99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYPQPF  生產獎金資料明細檔
     A*****************************************************************
     A            PQ01      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            PQ02           4S 0       COLHDG('獎金年度')
     A            PQ03           6S 0       COLHDG('發放年月')
     A            PQ03D          2S 0       COLHDG('發放日期')
     A            PQ041          1          COLHDG('部門代碼一')
     A            PQ042          1          COLHDG('部門代碼二')
     A            PQ043          1          COLHDG('部門代碼三')
     A            PQ044          4          COLHDG('部門代碼四')
     A            PQ05      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A*           PQ06           1          COLHDG('獎金註記')
     A            PQ07           6S 2       COLHDG('應計工時')
     A            PQ08           6S 2       COLHDG('實際工時')
     A            PQ09          10S 2       COLHDG('應計獎金')
     A            PQ10          10S 2       COLHDG('實際獎金')
     A*
     A            PQ12          10          COLHDG('保留欄位一')
     A            PQ13          10S 2       COLHDG('保留欄位二')
     A*
     A            PQ97           8S 0       COLHDG('記錄更新日期')
     A            PQ98           6S 0       COLHDG('記錄更新時間')
     A            PQ99          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYR2PF  員工理賠資料檔           KEY= R201+R202+R203+R204
     A*****************************************************************
     A            R201      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            R202      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            R203           1A         COLHDG('理賠險種')
     A            R204           8S 0       COLHDG('申請日期')
     A            R205           8  0       COLHDG('申請金額')
     A            R206          30O         COLHDG('理賠事由')
     A*
     A            R297           8S 0       COLHDG('記錄更新日期')
     A            R298           6S 0       COLHDG('記錄更新時間')
     A            R299          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYT8PF  人事晉升資料檔
     A*****************************************************************
     A            T801      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            T8011     R               COLHDG('公司（自）')
     A                                      REFFLD(CM01)
     A            T8012     R               COLHDG('公司（至）')
     A                                      REFFLD(CM01)
     A            T802      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            T803      R               COLHDG('調動類別')
     A                                      REFFLD(TR03)
     A*                                     1-晉升
     A            T804      R               COLHDG('生效日期')
     A                                      REFFLD(TR04)
     A            T8051     R               COLHDG('部門（自）１')
     A                                      REFFLD(DP011)
     A            T8052     R               COLHDG('部門（自）２')
     A                                      REFFLD(DP012)
     A            T8053     R               COLHDG('部門（自）３')
     A                                      REFFLD(DP013)
     A            T8054     R               COLHDG('部門（自）４')
     A                                      REFFLD(DP014)
     A            T8061     R               COLHDG('部門（至）１')
     A                                      REFFLD(DP011)
     A            T8062     R               COLHDG('部門（至）２')
     A                                      REFFLD(DP012)
     A            T8063     R               COLHDG('部門（至）３')
     A                                      REFFLD(DP013)
     A            T8064     R               COLHDG('部門（至）４')
     A                                      REFFLD(DP014)
     A            T807      R               COLHDG('職稱（自）')
     A                                      REFFLD(EM05)
     A            T808      R               COLHDG('職稱（至）')
     A                                      REFFLD(EM05)
     A            T809      R               COLHDG('職等（自）')
     A                                      REFFLD(EM06)
     A            T810      R               COLHDG('職等（至）')
     A                                      REFFLD(EM06)
     A            T811      R               COLHDG('薪制（自）')
     A                                      REFFLD(EM10)
     A            T812      R               COLHDG('薪制（至）')
     A                                      REFFLD(EM10)
     A            T813      R               COLHDG('班別（自）')
     A                                      REFFLD(EM08)
     A            T814      R               COLHDG('班別（至）')
     A                                      REFFLD(EM08)
     A            T815      R               COLHDG('職級（自）')
     A                                      REFFLD(EM07)
     A            T816      R               COLHDG('職級（至）')
     A                                      REFFLD(EM07)
     A            T817      R               COLHDG('工作（自）')
     A                                      REFFLD(TR17)
     A            T818      R               COLHDG('工作（至）')
     A                                      REFFLD(TR18)
     A            T819      R               COLHDG('副職稱（自）')
     A                                      REFFLD(EM05)
     A            T820      R               COLHDG('副職稱（至）')
     A                                      REFFLD(EM05)
     A            T8211     R               COLHDG('成本中心（自）１')
     A                                      REFFLD(CC011)
     A            T8212     R               COLHDG('成本中心（自）２')
     A                                      REFFLD(CC012)
     A            T8213     R               COLHDG('成本中心（自）３')
     A                                      REFFLD(CC013)
     A            T8214     R               COLHDG('成本中心（至）１')
     A                                      REFFLD(CC011)
     A            T8215     R               COLHDG('成本中心（至）２')
     A                                      REFFLD(CC012)
     A            T8216     R               COLHDG('成本中心（至）３')
     A                                      REFFLD(CC013)
     A            T8221     R               COLHDG('工作類別（自）' )
     A                                      REFFLD(EM111)
     A            T8222     R               COLHDG('工作類別（至）' )
     A                                      REFFLD(EM111)
     A            T8231     R               COLHDG('生產獎金註記（自）' )
     A                                      REFFLD(EM133)
     A            T8232     R               COLHDG('生產獎金註記（至）' )
     A                                      REFFLD(EM133)
     A            T8131     R               COLHDG('生產獎金註記（自）' )
     A                                      REFFLD(EM130)
     A            T8132     R               COLHDG('生產獎金註記（至）' )
     A                                      REFFLD(EM130)
     A            T896      R               COLHDG('主檔更新')
     A                                      REFFLD(TR96)
     A*'U'-主檔已更新
     A            T897           8S 0       COLHDG('記錄更新日期')
     A            T898           6S 0       COLHDG('記錄更新時間')
     A            T899          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYH3PF  特休遞延資料檔
     A*****************************************************************
     A            H301      R               COLHDG('公司編號')
     A                                      REFFLD(CM01)
     A            H302           4S 0       COLHDG('特休年度')
     A            H303      R               COLHDG('員工編號')
     A                                      REFFLD(EM02)
     A            H304      R               COLHDG('員工姓名')
     A                                      REFFLD(EM03)
     A            H397           8S 0       COLHDG('記錄更新日期')
     A            H398           6S 0       COLHDG('記錄更新時間')
     A            H399          10          COLHDG('使用者代號')
     A*****************************************************************
     A*  PYS1PF  薪資項目歸屬檔
     A*****************************************************************
     A            S101      R               COLHDG('薪資組別')
     A                                      REFFLD(SS18)
     A            S102      R               COLHDG('原薪資項目')
     A                                      REFFLD(SS01)
     A            S103      R               COLHDG('歸屬項目')
     A                                      REFFLD(SS01)
     A*****************************************************************
