     A******************************************************
     A*  PYRVLF04  ­û¤u¦ÒÁZÀÉ RV01+RV08+RV03+RV04+RV02
     A*
     A******************************************************
     A          R RV0
     A                                      PFILE(PYRVPF)
     A          K RV01
     A          K RV08
     A          K RV03
     A          K RV04
     A          K RV02
