     A*****************************************************************
     A*  PYRVPF  員工考績檔           KEY= RVA01+RVA02+RVA03+RVA04
     A*****************************************************************
     A          R RVB0
     A            RVB01          2A         COLHDG('公司編號')
     A            RVB02          2A         COLHDG('考績項目代號')
     A*****
     A            RVB03         12O         COLHDG('考績名稱')
     A          K RVB01
     A          K RVB02
