     A******************************************************
     A*  PYRRPF  ­û¤u¦ÒÁZÀÉ RV01+RV03(DESC)+RV04+RV02
     A*                                              A1274
     A******************************************************
     A          R RV0
     A                                      PFILE(PYRVPF)
     A          K RV01
     A          K RV03                      DESCEND
     A          K RV04
     A          K RV02
