     A******************************************************
     A*  PYRV4L01¶“¡Z≤ß∞ ¿…
     A******************************************************
     A                                      UNIQUE
     A          R RVD0
     A                                      PFILE(PYRV4PF)
     A          K RVD01
     A          K RVD02
     A          K RVD04
