     A******************************************************
     A*  PYSDLF01  Ω’¡~•D¿…DETAIL
     A******************************************************
     A          R SD0
     A                                      PFILE(PYSDPF)
     A          K SD01
     A          K SD02
     A          K SD03                      DESCEND
     A          K SD04
