     A******************************************************
     A*  PYSHLF02  Ω’¡~•D¿…HEADING
     A*****************************************************************
     A          R SH0
     A                                      PFILE(PYSHPF)
     A          K SH01
     A          K SH02
