     A*****************************************************************
     A*  PYSMPF  薪資月彙總檔
     A*****************************************************************
     A                                      UNIQUE
     A*                                     REF(PYRF)
     A          R SM0
     A            SM01           2A         COLHDG('公司編號')
     A            SM021          1A         COLHDG('成本中心１')
     A            SM022          3A         COLHDG('成本中心２')
     A            SM023          1A         COLHDG('成本中心３')
     A            SM03           6S 0       COLHDG('彙總年月')
     A            SM04           2A         COLHDG('薪資彙總實際項目')
     A            SM05           9S 0       COLHDG('彙總金額')
     A            SM97           8S 0       COLHDG('系統日期')
     A            SM98           6S 0       COLHDG('系統時間')
     A            SM99          10A         COLHDG('USERID')
     A*
     A          K SM01
     A          K SM03
     A          K SM021
     A          K SM022
     A          K SM023
     A          K SM04
