     A******************************************************
     A*  PYSSLF02 : Á~¸êµ²ºc
     A******************************************************
     A          R SS0
     A                                      PFILE(PYSSPF)
     A          K SS09
     A          K SS04
     A          K SS03                      DESCEND
     A          K SS18
     A          K SS01
