     A******************************************************
     A*  PYSSLF05 : 薪資結構薪資代碼
     A******************************************************
     A          R SS0
     A                                      PFILE(PYSSPF)
     A          K SS05
     A          K SS18
     A          K SS01
