     A******************************************************
     A*  PYSSLF01 : Á~¸êµ²ºc
     A******************************************************
     A          R SS0
     A                                      PFILE(PYSSPF)
     A          K SS09
     A          K SS05
     A          K SS18
     A          K SS01
