     A*****************************************************************
     A*  PYT2LF04員工排班資料檔
     A*****************************************************************
     A          R T20
     A                                      PFILE(PYT2PF)
     A          K T201
     A*                                     COLHDG('公司編號')
     A          K T203
     A*                                     COLHDG('排班年月')
