     A******************************************************
     A*  PYT4PF  員工臨時資料檔
     A******************************************************
     A          R T40
     A                                      PFILE(PYT4PF)
     A          K T403
     A          K T404
     A          K T402
