     A******************************************************
     A*  PYT4PF  員工臨時資料檔
     A*  FOR PYA211 :刷卡異常資料處理          <*REBLD>
     A******************************************************
     A          R T40
     A                                      PFILE(PYT4PF)
     A          K T402
     A          K T403
     A          K T401
