     A******************************************************
     A*  PYT4LF03員工臨時資料檔  T406+T402
     A******************************************************
     A          R T40
     A                                      PFILE(PYT4PF)
     A          K T406
     A          K T402
