     A*****************************************************************
     A*  PYT5PFX 考勤轉檔
     A*****************************************************************
     A          R T50X
     A            T501X         60O         COLHDG('轉檔內容')
