     A*****************************************************************
     A*  PYT5PF  刷卡資料檔
     A*****************************************************************
     A          R T50
     A                                      PFILE(PYT5PF)
     A*員工編號＋上／下班別＋刷卡日期＋刷卡時＋刷卡分
     A          K T505
     A          K T501
     A          K T507
     A          K T502
     A          K T503
     A          K T504
