     A******************************************************
     A*           PYT6LF04  刷卡異常資料查詢              *
     A******************************************************
     A          R T60
     A                                      PFILE(PYT6PF)
     A*公司＋日期
     A          K T602
     A          K T603
     A          K T601
     A          K T604
