     A******************************************************
     A*           PYT6LF01  異常FOR全頁查詢             *
     A******************************************************
     A          R T60
     A                                      PFILE(PYT6PF)
     A*公司＋日期
     A          K T602
     A          K T696
