     A*****************************************************************
     A*  PYT7LF01°²¤é¸ê®ÆÀÉ
     A*****************************************************************
     A          R T70
     A                                      PFILE(PYT7PF)
     A*
     A          K T700
     A          K T701
