     A*****************************************************************
     A*  PYT9PF  全年工作時數檔
     A*****************************************************************
     A          R T90
     A            T901           2          COLHDG('公司編號')
     A            T902           4S 0       COLHDG('年度')
     A            T903           5S 1       COLHDG('總工作時數')
     A*
     A          K T901
     A          K T902
