     A*****************************************************************
     A*  PYTBLF05其他所得課稅申報資料檔
     A*****************************************************************
     A          R TB0
     A                                      PFILE(PYTBPF)
     A          K TB11
     A          K TB05
