     A*****************************************************************
     A*  PYTBPF  其他所得稅課稅資料檔(人工轉入)
     A*****************************************************************
     A          R TB0
     A                                      PFILE(PYTBPF)
     A          K TB11
     A          K TB16
     A          K TB04
     A          K TB05
