     A*****************************************************************
     A*  PYTBLF03其他所得稅課稅申報資料檔
     A*****************************************************************
     A          R TB0
     A                                      PFILE(PYTBPF)
     A          K TB11
     A          K TB15
     A          K TB12
     A          K TB04
