     A*****************************************************************
     A*  PYTBLF04其他所得課稅申報資料檔
     A*****************************************************************
     A          R TB0
     A                                      PFILE(PYTBPF)
     A          K TB11
     A          K TB01
     A          K TB05
     A          K TB12
     A          K TB19
     A          K TB18
     A          K TB04
