     A*****************************************************************
     A*  PYTBPF  其他所得稅課稅申報資料檔
     A*****************************************************************
     A          R TB0
     A                                      PFILE(PYTBPF)
     A          K TB11
     A          K TB01
     A          K TB02
     A          K TB04
     A          K TB12
