     A****************************************************************
     A*PYTBJF01  其他所得＋部門主檔＋公司主檔                      *
     A****************************************************************
     A          R TBJF01                    JFILE(PYTBPF PYDPPF +
     A                                           SYCMPF)
     A*-----------------------------------------------------------****
     A          J                           JOIN(PYTBPF PYDPPF)
     A                                      JFLD(TB19 KEYDP2)
     A          J                           JOIN(PYDPPF SYCMPF)
     A                                      JFLD(DP09 CM01)
     A*-----------------------------------------------------------****
     A            TB01      R
     A            TB02      R
     A            TB03      R
     A            TB04      R
     A            TB05      R
     A            TB06      R
     A            TB07      R
     A            TB08      R
     A            TB09      R
     A            TB10      R
     A            TB11      R
     A            TB12      R
     A            TB13      R
     A            TB14      R
     A            TB15      R
     A            TB16      R
     A            TB17      R
     A            TB18      R
     A            TB19      R
     A            TB96      R
     A*-----------------------------------------------------------****
     A            KEYDP2                    CONCAT(DP011 DP012 +
     A                                            DP013 DP014)
     A            DP011     R
     A            DP012     R
     A            DP013     R
     A            DP014     R
     A            DP02      R
     A            DP09      R
     A*-----------------------------------------------------------****
     A            CM01      R
     A            CM02      R
     A            CM03      R
     A            CM04      R
     A            CM05      R
     A            CM06      R
     A            CM08      R
     A            CM10      R
     A            CM11      R
     A            CM12      R
     A*-----------------------------------------------------------****
     A
