     A*****************************************************************
     A*  PYTDLF04  所得稅課稅申報資料檔
     A*****************************************************************
     A          R TD0
     A                                      PFILE(PYTDPF)
     A*('公司編碼')
     A          K TD11
     A*('年度')
     A          K TD01
     A*('扣繳單位統一編號'
     A          K TD17
     A*('格式代號')
     A          K TD04
     A*('身份證號')
     A          K TD05
