     A*****************************************************************
     A*  PYTDPF  所得稅課稅申報資料檔
     A*****************************************************************
     A          R TD0
     A                                      PFILE(PYTDPF)
     A          K TD11
     A          K TD01
     A          K TD04
     A          K TD05
     A*         K TD18
