     A******************************************************
     A*  PYITLF01  年月健保費明細檔
     A******************************************************
     A          R TI0
     A                                      PFILE(PYTIPF)
     A          K TI01
     A*                                     COLHDG('公司編號')
     A          K TI03
     A*                                     COLHDG('員工編號')
