     A*****************************************************************
     A*  PYTRPF  §H®∆•D¿…
     A*****************************************************************
     A          R TR0
     A                                      PFILE(PYTRPF)
     A          K TR01
     A          K TR012
     A          K TR061
     A          K TR062
     A          K TR063
     A          K TR064
     A          K TR02
     A          K TR04
