     A******************************************************
     A*           PYTRJF01  人事調動+人事              *
     A******************************************************
     A          R TRJF01                    JFILE(PYEMPF PYTRPF)
     A          J                           JOIN(PYEMPF PYTRPF)
     A                                      JFLD(KEYEM KEYTR)
     A            KEYTR                     CONCAT(TR01 TR02)
     A            TR01      R
     A            TR02      R
     A            TR03      R
     A            TR04      R
     A            TR051     R
     A            TR052     R
     A            TR053     R
     A            TR054     R
     A            TR061     R
     A            TR062     R
     A            TR063     R
     A            TR064     R
     A            TR07      R
     A            TR08      R
     A            TR09      R
     A            TR10      R
     A            TR11      R
     A            TR12      R
     A            TR13      R
     A            TR14      R
     A            TR15      R
     A            TR16      R
     A            TR17      R
     A            TR18      R
     A            TR131          5
     A            TR132          5
     A            KEYEM                     CONCAT(EM01 EM02)
     A            EM03      R
     A            EM041     R
     A            EM042     R
     A            EM043     R
     A            EM044     R
