     A*****************************************************************
     A*  PYTRPF  §H®∆•D¿…
     A*****************************************************************
     A          R TR0
     A                                      PFILE(PYTRPF)
     A          K TR01
     A          K TR011
     A          K TR051
     A          K TR052
     A          K TR053
     A          K TR054
     A          K TR02
     A          K TR04
