     A*****************************************************************
     A*  PYTTPF  所得稅課稅申報磁帶檔
     A*****************************************************************
     A                                      REF(PYRF)
     A          R TT0
     A            TTDS          82          COLHDG('資料內容')
     A            TTDS1         12O         COLHDG('資料內容')
     A            TTDS2         60O         COLHDG('資料內容')
     A            TTDS3          6          COLHDG('資料內容')
