     A*****************************************************************
     A*  PYTUPF  所得稅課稅申報磁帶檔
     A*****************************************************************
     A          R TU0
     A            TUDS         101          COLHDG('資料內容')
