     A*****************************************************************
     A*  PYTVPF  所得稅課稅申報磁帶檔
     A*****************************************************************
     A          R TV0
     A            TVDS         100          COLHDG('資料內容')
