     A          R TX0
     A                                      PFILE(PYTXPF)
     A          K TX01
     A          K TX04
     A          K TX02
     A          S TX031                     COMP(EQ 'A')
