     A******************************************************
     A*           PYTXJF01  人事調動+人事              *
     A******************************************************
     A*                                     JDFTVAL
     A          R TXJF01                    JFILE(PYEMPF PYTXPF)
     A          J                           JOIN(PYEMPF PYTXPF)
     A                                      JFLD(KEYEM KEYTX)
     A            KEYTX                     CONCAT(TX01 TX02)
     A            TX01      R
     A            TX02      R
     A            TX031     R
     A            TX032     R
     A            TX04      R
     A            TX05      R
     A            TX06      R
     A            TX07      R
     A            TX12      R
     A            KEYEM                     CONCAT(EM01 EM02)
     A            EM03      R
     A            EM041     R
     A            EM042     R
     A            EM043     R
     A            EM044     R
