     A          R TX0
     A                                      PFILE(PYTXPF)
     A          K TX01
     A          K TX02
     A          K TX04                      DESCEND
