     A          R TX0
     A                                      PFILE(PYTXPF)
     A          K TX01
     A          K TX02
     A          K TX031
     A          K TX032
