     A          R TX0
     A                                      PFILE(PYTXPF)
     A          K TX01
     A          K TX031
     A          K TX032
     A          S TX031                     COMP(EQ 'A')
     A            TX032                     COMP(EQ '3')
