     A*****************************************************************
     A*  PYWDLF02¡~∏Í§uß@¿…
     A*****************************************************************
     A          R WD0
     A                                      PFILE(PYWDPF)
     A          K WD01
     A          K WD03
     A          K WD04
     A          K WD02
     A          K WD05
