     A*****************************************************************
     A*  PYWDLF01薪資工作檔+員工基本檔
     A*****************************************************************
     A          R WH0
     A                                      PFILE(PYWHPF)
     A          K WH01
     A          K WH03
     A          K WH02
