     A*****************************************************************
     A*  PYWHPF  時薪人員上班時數資料建立檔  KEY=WH01+WH02+WH03
     A*****************************************************************
     A                                      UNIQUE
     A                                      REF(PYRF)
     A          R WH0
     A            WH01      R               COLHDG('公司編號')
     A            WH02      R               COLHDG('員工編號')
     A            WH03      R               COLHDG('上班月份')
     A            WH04      R               COLHDG('工作時數')
     A            WH05      R               COLHDG('夜班津貼時數')
     A            WH06      R               COLHDG('健保月數')
     A            WH07      R               COLHDG('勞保天數')
     A            WH96      R               COLHDG('薪資處理月份')
     A            WH97      R               COLHDG('記錄更新日期')
     A            WH98      R               COLHDG('記錄更新時間')
     A            WH99      R               COLHDG('使用者代號')
     A          K WH01
     A          K WH02
     A          K WH03
