     A*****************************************************************
     A*  PYWHLF01Æ…¡~Æ…º∆¿…
     A*****************************************************************
     A          R WH0
     A                                      PFILE(PYWHPF)
     A          K WH01
     A          K WH03
     A          K WH02
