     A*****************************************************************
     A*  PYWWPF 下載至PC的路徑檔
     A*****************************************************************
     A                                      UNIQUE
     A          R WW0
     A            WW01           2A         COLHDG('公司')
     A            WW02          64O         COLHDG('路徑')
     A            WW03          64O         COLHDG('備註')
     A          K WW01
