     A*****************************************************************
     A*  PYX1PF  團體保險投保資料檔
     A*****************************************************************
     A          R X10
     A                                      PFILE(PYX1PF)
     A          K X101
     A          K X102
     A          K X104
