     A******************************************************
     A*           PYX1JF01  團保投保+人事主檔          *
     A******************************************************
     A          R X1JF01                    JFILE(PYX1PF PYEMPF)
     A          J                           JOIN(PYX1PF PYEMPF)
     A                                      JFLD(KEYE1 KEYEM)
     A            KEYEM                     CONCAT(EM01 EM02)
     A            EM01      R
     A            EM041     R
     A            EM042     R
     A            EM043     R
     A            EM044     R
     A            EM02      R
     A            EM03      R
     A            EM31      R
     A            EM33      R
     A            KEYE1                     CONCAT(X101 X102)
     A            X104      R
     A            X103      R
     A            X105      R
     A            X108      R
     A            X107      R
     A            X106      R
