     A*****************************************************************
     A*  PYXBLF01工作組檔
     A*****************************************************************
     A          R XB0
     A                                      PFILE(PYXBPF)
     A          K XB01
     A*                                     COLHDG('公司別')
     A          K XB02
     A*                                     COLHDG('工作組代碼')
     A          K XB06
     A*                                     COLHDG('起始生效日')
