     A*****************************************************************
     A*  PYXCLF01工作組檔- 公司+員工+生效日
     A*****************************************************************
     A          R XC0
     A                                      PFILE(PYXCPF)
     A          K XC01
     A          K XC02
     A          K XC03
