     A*****************************************************************
     A*  PYXCLF02工作組檔- 公司+員工
     A*****************************************************************
     A          R XC0
     A                                      PFILE(PYXCPF)
     A          K XC01
     A          K XC03
     A          K XC02
