     A*****************************************************************
     A*  PYXDLF01工作組檔- 公司+成員+截止日
     A*****************************************************************
     A          R XD0
     A                                      PFILE(PYXDPF)
     A          K XD01
     A          K XD02
     A          K XD08
