     A*****************************************************************
     A*  PYXHLF08工作組檔-公司+週班　
     A*****************************************************************
     A          R XH0
     A                                      PFILE(PYXHPF)
     A          K XH01
     A          K XH03
