     A*****************************************************************
     A*  PYXHLF03工作組檔- 公司+週二
     A*****************************************************************
     A          R XH0
     A                                      PFILE(PYXHPF)
     A          K XH01
     A          K XH06
