     A*****************************************************************
     A*  PYXHLF04工作組檔-公司+週三　
     A*****************************************************************
     A          R XH0
     A                                      PFILE(PYXHPF)
     A          K XH01
     A          K XH07
