     A*****************************************************************
     A*  PYXHLF05工作組檔-公司+週四　
     A*****************************************************************
     A          R XH0
     A                                      PFILE(PYXHPF)
     A          K XH01
     A          K XH08
