     A*****************************************************************
     A*  PYXHLF07工作組檔-公司+週六　
     A*****************************************************************
     A          R XH0
     A                                      PFILE(PYXHPF)
     A          K XH01
     A          K XH10
