     A*****************************************************************
     A*  PYXHLF01工作組檔- 公司+週日班
     A*****************************************************************
     A          R XH0
     A                                      PFILE(PYXHPF)
     A          K XH01
     A          K XH04
