     A*****************************************************************
     A*  PYXHLF06工作組檔- 公司+週五
     A*****************************************************************
     A          R XH0
     A                                      PFILE(PYXHPF)
     A          K XH01
     A          K XH09
