     A*****************************************************************
     A*  PYXILF01排班異動檔- 公司+工作組+起日
     A*****************************************************************
     A          R XI0
     A                                      PFILE(PYXIPF)
     A          K XI01
     A          K XI02
