     A*****************************************************************
     A*  PYXKPF  出勤日異動作業檔
     A*****************************************************************
     A          R XK0
     A                                      PFILE(PYXKPF)
     A          K XK01
     A*                                     COLHDG('公司別')
     A          K XK06
     A*                                     COLHDG('勤別')
