     A*****************************************************************
     A*  PYXKPF  出勤日異動作業檔
     A*****************************************************************
     A                                      REF(PYRF)
     A                                      UNIQUE
     A          R XK0
     A            XK01           2          COLHDG('公司別')
     A            XK02           2          COLHDG('組別')
     A            XK03           8          COLHDG('員工代碼')
     A            XK04           8S 0       COLHDG('出勤日期')
     A            XK05           2          COLHDG('原班別')
     A            XK06           2          COLHDG('勤別')
     A            XK07           2S 1       COLHDG('輪班津貼碼')
     A            XK08           2S 1       COLHDG('計程車費碼')
     A            XK09           2S 1       COLHDG('交通津貼-台北')
     A            XK10           2S 1       COLHDG('交通津貼-其它')
     A            XK11           2S 1       COLHDG('其他津貼率')
     A            XK12           3S 1       COLHDG('加班時間')
     A            XK13           3S 0       COLHDG('遲到時間')
     A            XK14           3S 0       COLHDG('早退時間')
     A            XK15          10          COLHDG('工作區代碼')
     A            XK97           8S 0       COLHDG('記錄更新日期')
     A            XK98           6S 0       COLHDG('記錄更新時間')
     A            XK99          10          COLHDG('使用者代號')
     A          K XK01
     A          K XK04
     A          K XK02
     A          K XK03
