     A*****************************************************************
     A*  PYZBPF  薪資主檔DETAIL
     A*****************************************************************
     A                                      UNIQUE
     A*                                     REF(PYRF)
     A          R ZB0
     A            ZB01           2A         COLHDG('公司編號')
     A            ZB02           8A         COLHDG('員工編號')
     A            ZB021         12O         COLHDG('員工姓名')
     A            ZB03           6S 0       COLHDG('年月')
     A            ZB04           1A         COLHDG('期別')
     A            ZB05           2A         COLHDG('薪資項目')
     A            ZB051         14O         COLHDG('薪資項目名稱')
     A            ZB06           7S 0       COLHDG('金額')
     A*
     A          K ZB01
     A          K ZB02
     A          K ZB03
     A          K ZB04
     A          K ZB05
