     A******************************************************
     A*  SYCMPF  §Ω•q•D¿…
     A******************************************************
     A          R CM0
     A                                      PFILE(SYCMPF)
     A          K CM11
     A          K CM12
