     A******************************************************
     A*  SYFAPF  媒體單位代號主檔
     A******************************************************
     A          R FA0
     A                                      PFILE(SYFAPF)
     A          K FA01
