     A*****************************************************************
     A*  PCFILE   PC (EXCEL) --> AS400 調薪記錄轉檔資料　   A1274
     A*****************************************************************
     A          R PCF0
     A            RCD          260          COLHDG('生效日期')
