     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*                                                              *
     A*    DSPF NAME    : KIP019D                                    *
     A*    AUTHOR       : DEREK                                      *
     A*    CREATE DATE  : 2016/12/12                                 *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : KIP019                                     *
     A*    SYSTEM       :茂世進銷存                                *
     A*    SUBSYSTEM    :專櫃進銷存系統                            *
     A*    REMARK       :業績獎金計算                              *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A                                      CSRLOC(#LIN  #COL)
     A                                      OVERLAY
     A                                      CA03(03)
     A                                      CF13(13)
     A  28                                  FRCDTA
     A  28                                  LOCK
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'KIP019'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 31'業績獎金計算'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  6 26'銷售年月:'
     A                                      COLOR(BLU)
     A            DBA01          4  0B  6 38
     A                                      EDTWRD('  /  ')
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  6 46'(MM/YY)'
     A                                      COLOR(BLU)
     A                                 16 26'執行環境:'
     A                                      COLOR(BLU)
     A            $EVR           1Y 0B 16 38VALUES(1 2)
     A                                      EDTCDE(3)
     A                                      CHECK(RB)
     A                                 16 43'(1-即時 2-批次)'
     A                                      COLOR(BLU)
     A  28                             20 28'獎金計算中，請稍候'
     A                                      DSPATR(BL)
     A  96        ERR1          63A  O 24  2MSGID(UPT 5008 PTMF)
     A                                      DSPATR(HI)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  2'PF03 =回主畫面'
     A                                      COLOR(BLU)
     A                                 23 20'PF13 =處理開始'
     A                                      COLOR(BLU)
     A                                 24 67'【泛太資訊】'
