     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*                                                              *
     A*    PROGRAM-ID   : KIR040P                                    *
     A*    PROGRAM NAME :供應商請款銷售報表                        *
     A*    AUTHOR       : DEREK                                      *
     A*    CREATE DATE  : 2016/12/19                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :茂世進銷存                                *
     A*    SUBSYSTEM    :專櫃進銷存系統                            *
     A****************************************************************
     A          R PH1
     A                                      SKIPB(2)
     A                                    80'供應商請款銷售報表'
     A                                      SPACEA(2)
     A                                     2'年月:'
     A            DEE01          4  0     10EDTWRD('  /  ')
     A                                    16'(MM/YY)'
     A                                   168'日期:'
     A            DDATE          6  0    176EDTWRD('0  /  /  ')
     A                                   185'頁次:'
     A                                   193PAGNBR
     A                                      SPACEA(1)
     A                                     2'金額單位元'
     A                                   168'時間:'
     A                                   176TIME
     A                                      EDTWRD('  :  :  ')
     A                                   186'<KIR040P>'
     A                                      SPACEA(1)
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ======================'
     A                                      SPACEA(1)
     A                                     2'產品編號'
     A                                    12'產品名稱'
     A                                    29'單瓶獎金'
     A                                    39'供應商'
     A                                    56'銷售總量'
     A            WHSA           5A       68
     A            WHSB           5A       79
     A            WHSC           5A       90
     A            WHSD           5A      101
     A            WHSE           5A      112
     A            WHSF           5A      123
     A            WHSG           5A      134
     A            WHSH           5A      145
     A            WHSI           5A      156
     A            WHSJ           5A      167
     A            WHSK           5A      178
     A            WHSL           5A      189
     A                                      SPACEA(1)
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ======================'
     A*----------------------------------------------------------------
     A          R PD1
     A                                      SPACEB(1)
     A            EE03      R              2REFFLD(EE03 W3EEPF)
     A            DMA03     R             12REFFLD(MA03 MTMAPF)
     A**          DMA02     R             12REFFLD(MA02 MTMAPF)
     A            EE06      R             31REFFLD(EE06 W3EEPF)
     A                                      EDTCDE(1)
     A**          DMB03         12O       43
     A            DMB03     R             39REFFLD(MB03 MTMBPF)
     A            PEE07          6  0     58EDTCDE(1)
     A            QTYA           4S 0     66EDTCDE(4)
     A            BONA           5S 0     71EDTCDE(4)
     A            QTYB           4S 0     77EDTCDE(4)
     A            BONB           5S 0     82EDTCDE(4)
     A            QTYC           4S 0     88EDTCDE(4)
     A            BONC           5S 0     93EDTCDE(4)
     A            QTYD           4S 0     99EDTCDE(4)
     A            BOND           5S 0    104EDTCDE(4)
     A            QTYE           4S 0    110EDTCDE(4)
     A            BONE           5S 0    115EDTCDE(4)
     A            QTYF           4S 0    121EDTCDE(4)
     A            BONF           5S 0    126EDTCDE(4)
     A            QTYG           4S 0    132EDTCDE(4)
     A            BONG           5S 0    137EDTCDE(4)
     A            QTYH           4S 0    143EDTCDE(4)
     A            BONH           5S 0    148EDTCDE(4)
     A            QTYI           4S 0    154EDTCDE(4)
     A            BONI           5S 0    159EDTCDE(4)
     A            QTYJ           4S 0    165EDTCDE(4)
     A            BONJ           5S 0    170EDTCDE(4)
     A            QTYK           4S 0    176EDTCDE(4)
     A            BONK           5S 0    181EDTCDE(4)
     A            QTYL           4S 0    187EDTCDE(4)
     A            BONL           5S 0    192EDTCDE(4)
     A*----------------------------------------------------------------
     A          R PT1
     A                                      SPACEB(1)
     A                                     1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ----------------------'
     A                                      SPACEA(1)
     A                                    39'獎金小計'
     A            BONTOT         6S 0     50EDTCDE(4)
     A            QTYAT          4S 0     66EDTCDE(4)
     A            BONAT          5S 0     71EDTCDE(4)
     A            QTYBT          4S 0     77EDTCDE(4)
     A            BONBT          5S 0     82EDTCDE(4)
     A            QTYCT          4S 0     88EDTCDE(4)
     A            BONCT          5S 0     93EDTCDE(4)
     A            QTYDT          4S 0     99EDTCDE(4)
     A            BONDT          5S 0    104EDTCDE(4)
     A            QTYET          4S 0    110EDTCDE(4)
     A            BONET          5S 0    115EDTCDE(4)
     A            QTYFT          4S 0    121EDTCDE(4)
     A            BONFT          5S 0    126EDTCDE(4)
     A            QTYGT          4S 0    132EDTCDE(4)
     A            BONGT          5S 0    137EDTCDE(4)
     A            QTYHT          4S 0    143EDTCDE(4)
     A            BONHT          5S 0    148EDTCDE(4)
     A            QTYIT          4S 0    154EDTCDE(4)
     A            BONIT          5S 0    159EDTCDE(4)
     A            QTYJT          4S 0    165EDTCDE(4)
     A            BONJT          5S 0    170EDTCDE(4)
     A            QTYKT          4S 0    176EDTCDE(4)
     A            BONKT          5S 0    181EDTCDE(4)
     A            QTYLT          4S 0    187EDTCDE(4)
     A            BONLT          5S 0    192EDTCDE(4)
     A                                      SPACEA(1)
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ======================'
     A***                                   SPACEA(1)
     A***                                  1'KIR040P--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9
     A                                      SPACEB(1)
     A                                    16'無符合列印範圍之資料'
