     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : KIS000DD                                   *
     A*    AUTHOR       : DEREK                                      *
     A*    CREATE DATE  : 105/12/31                                  *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : KIS000C4                                   *
     A*    SYSTEM       :茂世後台                                  *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :專櫃業績獎金管理主畫面                    *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPC1
     A                                      OVERLAY
     A                                      CA03(03 '結束執行')
     A                                  1  2'KIS000C4'
     A                                  1 25MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 27'專櫃業績獎金管理主畫面 '
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70DSPATR(UL)
     A                                  5  5'維護作業'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6  2'01.產品抽成設定'
     A                                  7  2'02.單瓶獎金設定'
     A                                  5 27'批次作業'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6 24'21.業績獎金計算'
     A                                  5 50'報表作業'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6 47'31.茂世業績獎金銷售總表'
     A                                  7 47'32.供應商獎金銷售總表'
     A                                  8 47'33.單店獎金表'
     A                                  9 47'34.供應商請款銷售報表'
     A                                 10 47'35.每月新增產品明細表'
     A                                 20 29'請輸入選擇項目:'
     A            DOPID          2A  B 20 47DSPATR(UL)
     A                                      VALUES('01' '02' '21' '31' '32' '33-
     A                                      ' '34' '35')
     A                                 23  2'執行   F3 = 回主畫面'
     A                                      COLOR(BLU)
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
