     A*%%TS  SD  19920730  131713  REPGMRP     REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*    DSPF NAME    : WDS044D                                    *
     A*    AUTHOR       : KEVIN                                      *
     A*    CREATE DATE  : 112/07/19                                  *
     A*    PROGRAM NAME : WDS044                                     *
     A*    REMARK       :客戶代碼查詢 (未拋轉神通)               *
     A*   需求單號    : 1120456                                    *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      PRINT
     A          R DSPC0                     ASSUME
     A                                  2  2' '
     A          R DSPC1
     A*%%TS  SD  19920730  131713  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      CA03(03)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      OVERLAY
     A                                      PROTECT
     A                                      CLRL(*NO)
     A                                  4 29'                                  -
     A                                            '
     A                                      DSPATR(RI)
     A                                  5 29' '
     A                                      DSPATR(RI)
     A                                  5 30' '
     A                                  5 31'客戶代號                        -
     A                                      '
     A                                  5 68' '
     A                                      DSPATR(RI)
     A                                  6 29' '
     A                                      DSPATR(RI)
     A                                  7 31'OP : / -挑選                    -
     A                                        '
     A                                  6 68' '
     A                                      DSPATR(RI)
     A                                  7 29' '
     A                                      DSPATR(RI)
     A                                  8 31'OP客戶代號　客戶簡稱        '
     A                                      DSPATR(UL)
     A                                  7 68' '
     A                                      DSPATR(RI)
     A                                  8 29' '
     A                                      DSPATR(RI)
     A            D1011          1A  B  9 31VALUES('/' ' ')
     A  61                                  DSPATR(ND)
     A  61                                  DSPATR(PR)
     A                                  8 32' '
     A            D1012         32A  O  9 34
     A                                  8 68' '
     A                                      DSPATR(RI)
     A                                  9 29' '
     A                                      DSPATR(RI)
     A            D1021          1A  B 10 31VALUES('/' ' ')
     A  62                                  DSPATR(ND)
     A  62                                  DSPATR(PR)
     A                                  9 32' '
     A            D1022         32A  O 10 34
     A                                  9 68' '
     A                                      DSPATR(RI)
     A                                 10 29' '
     A                                      DSPATR(RI)
     A            D1031          1A  B 11 31VALUES('/' ' ')
     A  63                                  DSPATR(ND)
     A  63                                  DSPATR(PR)
     A                                 10 32' '
     A            D1032         32A  O 11 34
     A                                 10 68' '
     A                                      DSPATR(RI)
     A                                 11 29' '
     A                                      DSPATR(RI)
     A            D1041          1A  B 12 31VALUES('/' ' ')
     A  64                                  DSPATR(ND)
     A  64                                  DSPATR(PR)
     A                                 11 32' '
     A            D1042         32A  O 12 34
     A                                 11 68' '
     A                                      DSPATR(RI)
     A                                 12 29' '
     A                                      DSPATR(RI)
     A            D1051          1A  B 13 31VALUES('/' ' ')
     A  65                                  DSPATR(ND)
     A  65                                  DSPATR(PR)
     A                                 12 32' '
     A            D1052         32A  O 13 34
     A                                 12 68' '
     A                                      DSPATR(RI)
     A                                 13 29' '
     A                                      DSPATR(RI)
     A            D1061          1A  B 14 31VALUES('/' ' ')
     A  66                                  DSPATR(ND)
     A  66                                  DSPATR(PR)
     A                                 13 32' '
     A            D1062         32A  O 14 34
     A                                 13 68' '
     A                                      DSPATR(RI)
     A                                 14 29' '
     A                                      DSPATR(RI)
     A            D1071          1A  B 15 31VALUES('/' ' ')
     A  67                                  DSPATR(ND)
     A  67                                  DSPATR(PR)
     A                                 14 32' '
     A            D1072         32A  O 15 34
     A                                 14 68' '
     A                                      DSPATR(RI)
     A                                 15 29' '
     A                                      DSPATR(RI)
     A            D1081          1A  B 16 31VALUES('/' ' ')
     A  68                                  DSPATR(ND)
     A  68                                  DSPATR(PR)
     A                                 15 32' '
     A            D1082         32A  O 16 34
     A                                 15 68' '
     A                                      DSPATR(RI)
     A                                 16 29' '
     A                                      DSPATR(RI)
     A                                 16 68' '
     A                                      DSPATR(RI)
     A                                 17 29' '
     A                                      DSPATR(RI)
     A                                  6 31'起始值...'
     A            DMJ01          5A  B  6 43DSPATR(UL)
     A                                 17 31'                                  -
     A                                      '
     A                                 17 68' '
     A                                      DSPATR(RI)
     A                                 18 29' '
     A                                      DSPATR(RI)
     A                                 18 31'執行  F3 =退出　　            -
     A                                      '
     A                                 18 68' '
     A                                      DSPATR(RI)
     A                                 19 29'                                  -
     A                                            '
     A                                      DSPATR(RI)
     A                                  6 53'          '
