     H****************************************************************
     H* PROGRAM ID : P68                                             *
     H* SYSTEM ID  : PTPLIB                                          *
     H* FUNTCTION  :計算起時～迄時相距時數(二十四時制)           *
     H*                                                              *
     H* PARAMETER : SEQ  FIELD    I/O  TYPE   LEN   DESCRIPTION      *
     H*             ===  =======  ===  =====  ====  ===========      *
     H*             01   P6801I    I   *DEC    4 0 起時            *
     H*             02   P6802I    I   *DEC    4 0 迄時            *
     H*             03   P6811O    O   *DEC    9 0 相距時數...     *
     H*                                                              *
     H****************************************************************
     I           IDS
     I                                        1   40P6801
     I                                        1   20P6801H
     I                                        3   40P6801M
     I           IDS
     I                                        1   40P6802
     I                                        1   20P6802H
     I                                        3   40P6802M
     C*--------------------------------------------------------------*
     C*                    MAIN PROGRAM                              *
     C*--------------------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P6801I  40
     C                     PARM           P6802I  40
     C                     PARM           P6811O  90
     C*
     C                     Z-ADDP6801I    P6801
     C                     Z-ADDP6802I    P6802
     C*
     C           P6802M    IFLT P6801M
     C           60        SUB  P6801M    MM      20
     C                     ADD  P6802M    MM
     C                     SUB  1         P6802H
     C           P6802H    IFLT P6801H
     C           24        SUB  P6801H    HH      20
     C                     ADD  P6802H    HH
     C                     ELSE
     C           P6802H    SUB  P6801H    HH
     C                     END
     C                     ELSE
     C           P6802M    SUB  P6801M    MM
     C           P6802H    IFLT P6801H
     C           24        SUB  P6801H    HH      20
     C                     ADD  P6802H    HH
     C                     ELSE
     C           P6802H    SUB  P6801H    HH
     C                     END
     C                     END
     C*
     C                     Z-ADD*ZERO     P6811O
     C           HH        MULT 60        P6811O
     C                     ADD  MM        P6811O
     C*
     C                     RETRN
