     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : PTA912                                     *
     A*    PROGRAM NAME :能力資格等級維護                          *
     A*    AUTHOR       : A1397  BARRY                               *
     A*    CREATE DATE  : 93.04.20                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :基本資料系統                              *
     A****************************************************************
     FPYSJPF  UF  E           K        DISK                      A
     FSYCMPF  IF  E           K        DISK
     FPYJTPF  IF  E           K        DISK
     FPTA912D CF  E                    WORKSTN      KINFDS DSPFDS
     I*---------------------------------------------------------------
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      201 2080$A8YMD
     I                                      217 2220DDATE
     I                                      209 2160$C8YMD
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYCM     KLIST
     C                     KFLD           DSJ01
     C           KEYSJ     KLIST
     C                     KFLD           DSJ01
     C                     KFLD           DSJ02
     C                     KFLD           DSJ03
     C                     KFLD           DSJ04
     C                     KFLD           DSJ05
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SDID      CASEQ'SD01'    R1000
    C           SDID      CASEQ'SD02'    R2000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     MOVE 'SD01'    SDID    4
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     Z-ADD$C8YMD    DDATE
|    C* SD01 FIELD INITIALIZE *--------------------------------------*
|    C                     Z-ADD1         DOPT
|    C                     MOVEL*BLANK    DSJ01
|    C                     MOVEL*BLANK    CM02
|    C                     MOVEL*BLANK    DSJ02
|    C                     MOVEL*BLANK    DSJ03
|    C                     MOVEL*BLANK    DSJ04
|    C                     MOVEL*BLANK    DSJ05
|    C                     Z-ADD0         DSJ06
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SD01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     SETOF                     32
|    C                     WRITEDSPD2
|    C                     WRITEDSBTTM
|    C                     EXFMTDSPD1
|    C                     MOVEL*BLANKS   ERRID
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'                        *PROMPT
|   C                     EXSR R1E00
|   C                     GOTO E1000
| 02-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 04-C           *IN99     IFEQ '0'                        *SCR CHK OK
|   C                     EXSR R1C00                      *PRE-SC02
|   C                     MOVEL'SD02'    SDID
| 04-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1B00 .... 'SD01' SCREEN CHECK
     C*==============================================================*
04===C           R1B00     BEGSR
     C*
     C           DSJ01     IFEQ *BLANK
     C                     MOVEL'UPT0010' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                     6099
     C                     END
     C   99                GOTO E1B00
     C*帶公司名稱
     C           KEYCM     CHAINCM0                  40
     C           *IN40     IFEQ '1'
     C                     MOVEL'UPT0030' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                     6099
     C                     END
     C   99                GOTO E1B00
     C                     MOVELCM02      CM02
     C*
     C           DSJ02     IFNE 'M'
     C           DSJ02     ANDNE'F'
     C                     MOVEL'UPT0030' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                     6199
     C                     END
     C   99                GOTO E1B00
     C*
     C           DSJ03     CHAINJT0                  40
     C           *IN40     IFEQ '1'
     C                     MOVEL'UPT0030' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                     6299
     C                     END
     C   99                GOTO E1B00
     C                     MOVELJT02      DSJ03N
     C*
     C           DSJ04     IFEQ *BLANK
     C                     MOVEL'UPT0010' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                     6399
     C                     END
     C   99                GOTO E1B00
     C*
     C           DSJ05     IFEQ *BLANK
     C                     MOVEL'UPT0010' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                     6499
     C                     END
     C   99                GOTO E1B00
     C*
     C           DOPT      IFEQ 1
     C           KEYSJ     CHAINSJ0                  40
     C           *IN40     IFEQ '0'
     C                     MOVEL'UPT3002' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                     6599
     C                     END
     C                     END
     C   99                GOTO E1B00
     C*
     C           DOPT      IFNE 1
     C           KEYSJ     CHAINSJ0                 N40
     C           *IN40     IFEQ '1'
     C                     MOVEL'UPT3001' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                     6599
     C                     END
     C                     END
     C   99                GOTO E1B00
     C*
     C           DOPT      IFEQ 1
     C                     Z-ADD0         DSJ06
     C                     ELSE
     C                     Z-ADDSJ06      DSJ06
     C                     END
     C*
04===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....INIT 'SD02'
     C*==============================================================*
05===C           R1C00     BEGSR
|    C*
| 01-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 2                          *UPD
|   C                     SETON                     31    *CAN INPUT
| 01*C                     ELSE                            *DEL, INQ
|   C                     SETOF                     31    *INP PROTECT
| 01-C                     END
|    C*
|    C*
| 02-C           DOPT      IFEQ 1                          *ADD
|   C                     EXSR R1C10
| 02*C                     ELSE
|   C                     EXSR R1C20                      *UPD,DEL,INQ
| 02-C                     END
|    C*
05===C           E1C00     ENDSR
     C*==============================================================*
     C*          R1C10 ....'SD02' FIELD INIT : ADD
     C*==============================================================*
06===C           R1C10     BEGSR
|    C*
|    C                     MOVELDSJ01     SJ01
|    C                     MOVELDSJ02     SJ02
|    C                     MOVELDSJ03     SJ03
|    C                     MOVELDSJ04     SJ04
|    C                     MOVELDSJ05     SJ05
|    C                     Z-ADD0         DSJ06
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*  R1C20 ....'SD02' FIELD INIT : UPD, DEL, INQ,
     C*==============================================================*
07===C           R1C20     BEGSR
|    C*
|    C           KEYSJ     CHAINSJ0                 N40
|    C           *IN40     IFEQ '0'
|    C                     MOVELSJ01      DSJ01
|    C                     MOVELSJ02      DSJ02
|    C                     MOVELSJ03      DSJ03
|    C                     MOVELSJ04      DSJ04
|    C                     MOVELSJ05      DSJ05
|    C                     Z-ADDSJ06      DSJ06
|    C                     END
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
08===C           R1E00     BEGSR
| 01-C           #FLD      IFEQ 'DSJ03'
|   C                     CALL 'PYI501'
|   C           DSJ03     PARM DSJ03     I501I1  3
|   C                     PARM           @RTNC   2
|   C           DSJ03     CHAINJT0                  42
|   C   42                MOVE *BLANK    DSJ03N
| 01-C  N42                MOVELJT02      DSJ03N
|    C                     END
08===C                     ENDSR
     C*==============================================================*
     C*          R2000 .... 'SD02' SCREEN MAIN ROUTINE
     C*==============================================================*
09===C           R2000     BEGSR
|    C*
|    C                     SETON                     32
|    C                     WRITEDSBTTM
|    C                     WRITEDSPD1
|    C                     EXFMTDSPD2
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E2000
| 01-C                     END
|    C*
| 02-C           *IN12     IFEQ '1'                        *PREVIOUS
|   C                     MOVEL'SD01'    SDID
|   C                     GOTO E2000
| 02-C                     END
|    C*
| 03-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 2                          *UPD
|   C                     EXSR R2B00                      *SC02 CHK
| 03-C                     END
|    C*
| 04-C           *IN05     IFEQ '1'                        *CHECK ONLY
|   C                     GOTO E2000
| 04-C                     END
|    C*
| 05-C           *IN99     IFEQ '0'                        *CHK OK
|   C                     EXSR R2D00                      *FILE UPD
|   C                     MOVE 'SD01'    SDID
| 05-C                     END
|    C*
09===C           E2000     ENDSR
     C*==============================================================*
     C*          R2B00 ....'SD02' CHECK
     C*==============================================================*
10===C           R2B00     BEGSR
10===C           E2B00     ENDSR
     C*==============================================================*
     C*          R2D00 ....FILE PROCESS
     C*==============================================================*
11===C           R2D00     BEGSR
|    C*
|    C           DOPT      CASEQ1         R2D10
|    C           DOPT      CASEQ2         R2D20
|    C           DOPT      CASEQ4         R2D30
|    C                     END
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          R2D10 ....FILE PROCESS : ADD
     C*==============================================================*
12===C           R2D10     BEGSR
|    C*
|    C                     EXSR R2D11
|    C                     WRITESJ0
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          R2D20 ....FILE PROCESS : UPD
     C*==============================================================*
11===C           R2D20     BEGSR
|    C*
|    C           KEYSJ     CHAINSJ0                  40
|    C           *IN40     IFEQ '0'
|    C                     EXSR R2D11
|    C                     UPDATSJ0
|    C                     END
|    C*
14===C                     ENDSR
     C*==============================================================*
     C*          R2D11 ....MOVE DATA
     C*==============================================================*
     C           R2D11     BEGSR
     C                     MOVELDSJ01     SJ01
     C                     MOVELDSJ02     SJ02
     C                     MOVELDSJ03     SJ03
     C                     MOVELDSJ04     SJ04
     C                     MOVELDSJ05     SJ05
     C                     Z-ADDDSJ06     SJ06
     C                     ENDSR
     C*==============================================================*
     C*          R2D30 ....FILE PROCESS
     C*==============================================================*
15===C           R2D30     BEGSR
|    C*
|    C           KEYSJ     CHAINSJ0                  40
|    C  N40                DELETSJ0
|    C*
15===C                     ENDSR
     C*==============================================================*
