     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA101                                     *
     H*    PROGRAM NAME :人事基本資料建立                          *
     H*    AUTHOR       : A1226 PETER                                *
     H*    CREATE DATE  : 85/12/30                                   *
     H*    UPDATE DATE  : 91/06/14 A1336 KLAUS                       *
     H*    SYSTEM       :人事薪資系統                              *
     H*
     H* 修改記錄
     H*---------------------------------------------------------------
     H* SEQ     DATE      BY      DESC
     H*---------------------------------------------------------------
     H* 0001 2005/04/29 GARY LEE  取消月薪不可領全勤獎金之限制
     H****************************************************************
     FPYEMPF  UF  E           K        DISK                      A
     F*PYEMLF06IF  E           K        DISK
     F*           EM0                               KRENAMEEM2
     FPYNOPF  UF  E           K        DISK                      A
     FPYLTPF  UF  E           K        DISK                      A
     FPYLUPF  UF  E           K        DISK                      A
     F*PYDSPF  UF  E           K        DISK                      A
     FPYCAPF  UF  E           K        DISK                      A
     FPYTAPF  IF  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYJTPF  IF  E           K        DISK
     F*PYCCPF  IF  E           K        DISK
     F*PYPSPF  IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FPYE4PF  IF  E           K        DISK
     FPT#YPF  IF  E           K        DISK
     F*PYT1PF  IF  E           K        DISK
     FPYA101D CF  E                    WORKSTN      KINFDS DSPFDS
     F*                                       RRN   KSFILE SFLSR
     E*---------------------------------------------------------------*
     E                    @A01        5  1               作業權利
     E                    WFUN    5   5  6
     E*---------------------------------------------------------------*
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I                                    B 378 3790#DRRN
     I*TRAN DATE
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I            DS
     I                                        1   7 EM04
     I                                        1   1 EM041
     I                                        2   2 EM042
     I                                        3   3 EM043
     I                                        4   7 EM044
     I            DS
     I                                        1   7 DEM04
     I                                        1   1 DEM041
     I                                        2   2 DEM042
     I                                        3   3 DEM043
     I                                        4   7 DEM044
     I            DS
     I                                        1   7 KEM04
     I                                        1   1 KEM041
     I                                        2   2 KEM042
     I                                        3   3 KEM043
     I                                        4   7 KEM044
     I*           DS
     I*                                       1   5 DDS04
     I*                                       1   1 DDS041
     I*                                       2   4 DDS042
     I*                                       5   5 DDS043
     I*           DS
     I*                                       1   5 DS04
     I*                                       1   1 DS041
     I*                                       2   4 DS042
     I*                                       5   5 DS043
     I*           DS
     I*                                       1   5 KCC01
     I*                                       1   1 KCC011
     I*                                       2   4 KCC012
     I*                                       5   5 KCC013
     I            DS
     I                                        1   3 K#Y03
     I                                        1   10K#Y031
     I                                        3   30K#Y032
     I*          IDS
     I*                                       1   70DEM20
     I*                                       1   30DEM20Y
     I*                                       4   50DEM20M
     I*          IDS
     I*                                       1   70DEM113
     I*                                       1   30EM113Y
     I*                                       4   50EM113M
     I*                                       6   70EM113D
     I           IDS
     I                                        1   80NO03
     I                                        1   8 KNO03
     I            DS
     I                                        1  10 DEM31
     I                                        2   2 WEM31
     I            DS
     I                                        1   8 EM105
     I                                        1   1 KEM105
     I           UDS
     I                                      101 110 $USER
     I                                      203 2080DDATE
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      203 2080A8YMD
     I                                      201 2040YEAR
     I*
     I            DS
     I                                        1   6 EM0216
     I                                        1   10EM021
     I                                        2   20EM022
     I                                        3   30EM023
     I                                        4   40EM024
     I                                        5   50EM025
     I                                        6   6 EM026
     I*個人專長
     I            DS
     I                                        1  22 DEM87
     I                                        1   3 DEM87A
     I                                        4   6 DEM87B
     I                                        7   9 DEM87C
     I                                       10  12 DEM87D
     I                                       13  15 DEM87E
     I            DS
     I                                        1  22 DEM89
     I                                        1   3 DEM89A
     I                                        4   6 DEM89B
     I                                        7   9 DEM89C
     I                                       10  12 DEM89D
     I                                       13  15 DEM89E
     I            DS
     I                                        1  22 DEM91
     I                                        1   3 DEM91A
     I                                        4   6 DEM91B
     I                                        7   9 DEM91C
     I                                       10  12 DEM91D
     I                                       13  15 DEM91E
     I            DS
     I                                        1  22 EM87
     I                                        1   3 EM87A
     I                                        4   6 EM87B
     I                                        7   9 EM87C
     I                                       10  12 EM87D
     I                                       13  15 EM87E
     I            DS
     I                                        1  22 EM89
     I                                        1   3 EM89A
     I                                        4   6 EM89B
     I                                        7   9 EM89C
     I                                       10  12 EM89D
     I                                       13  15 EM89E
     I            DS
     I                                        1  22 EM91
     I                                        1   3 EM91A
     I                                        4   6 EM91B
     I                                        7   9 EM91C
     I                                       10  12 EM91D
     I                                       13  15 EM91E
     I*語文能力
     I            DS
     I                                        1  22 DEM88
     I                                        1   3 DEM88A
     I                                        4   6 DEM88B
     I                                        7   9 DEM88C
     I                                       10  12 DEM88D
     I                                       13  15 DEM88E
     I            DS
     I                                        1  22 DEM90
     I                                        1   3 DEM90A
     I                                        4   6 DEM90B
     I                                        7   9 DEM90C
     I                                       10  12 DEM90D
     I                                       13  15 DEM90E
     I            DS
     I                                        1  22 DEM92
     I                                        1   3 DEM92A
     I                                        4   6 DEM92B
     I                                        7   9 DEM92C
     I                                       10  12 DEM92D
     I                                       13  15 DEM92E
     I            DS
     I                                        1  22 EM88
     I                                        1   3 EM88A
     I                                        4   6 EM88B
     I                                        7   9 EM88C
     I                                       10  12 EM88D
     I                                       13  15 EM88E
     I            DS
     I                                        1  22 EM90
     I                                        1   3 EM90A
     I                                        4   6 EM90B
     I                                        7   9 EM90C
     I                                       10  12 EM90D
     I                                       13  15 EM90E
     I            DS
     I                                        1  22 EM92
     I                                        1   3 EM92A
     I                                        4   6 EM92B
     I                                        7   9 EM92C
     I                                       10  12 EM92D
     I                                       13  15 EM92E
     I            DS
     I                                        1   80WEM33
     I                                        1   8 WEM33B
     I*英文名前二碼
     I            DS
     I                                        1  62 DEM031
     I                                        1   2 EM031E
     I                                        1  50 EM031A
     I                                       51  62 EM031B
     I/COPY QDDSSRC,PYEMDS01
     I/COPY QDDSSRC,PYPMDS01
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01           TRAN DATE
     C*          *LIKE     DEFN RRN       @DRCD            DSP REC NUM
     C*          *LIKE     DEFN RRN       @PRCD            PAGE REC
     C*          *LIKE     DEFN RRN       @LRRN            LAST REC NUM
     C*          *LIKE     DEFN RRN       @LPAGE           LAST PAGE
     C*          *LIKE     DEFN RRN       @PRRN            PROMPT USE
     C*          *LIKE     DEFN CM004O    DFMT
     C*          *LIKE     DEFN CM005O    DTYPE
     C           *LIKE     DEFN EM13      WEM13
     C           *LIKE     DEFN EM20      WEM20
     C*          *LIKE     DEFN EM33      WEM33
     C*          *LIKE     DEFN EM113     WEM113
     C           *LIKE     DEFN EM62      WEM62
     C           *LIKE     DEFN EM67      WEM67
     C           *LIKE     DEFN EM72      WEM72
     C           *LIKE     DEFN EM63      WEM63
     C           *LIKE     DEFN EM68      WEM68
     C           *LIKE     DEFN EM73      WEM73
     C           *LIKE     DEFN EM77      WEM77
     C           *LIKE     DEFN EM81      WEM81
     C           *LIKE     DEFN EM85      WEM85
     C           *LIKE     DEFN EM78      WEM78
     C           *LIKE     DEFN EM82      WEM82
     C           *LIKE     DEFN EM86      WEM86
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYEM     KLIST                           *PYEMPF
     C                     KFLD           DEM01
     C                     KFLD           DEM02
     C*          KEYEM2    KLIST                           *PYEMPF
     C*                    KFLD           DEM31
     C*                    KFLD           DEM01
     C           KEYDP     KLIST                           *PYDPPF
     C                     KFLD           KEM041
     C                     KFLD           KEM042
     C                     KFLD           KEM043
     C                     KFLD           KEM044
     C*          KEYCC     KLIST                           *PYDPPF
     C*                    KFLD           KCC011
     C*                    KFLD           KCC012
     C*                    KFLD           KCC013
     C           KEYPM     KLIST
     C                     KFLD           PM01
     C                     KFLD           DEM01
     C*          KEYPS     KLIST                           *PYPSPF
     C*                    KFLD           DEM06
     C*                    KFLD           DEM07
     C           KEYNO     KLIST                           *PYT4PF
     C                     KFLD           DEM01            公司編號
     C                     KFLD           NO02             編號年度
     C           KEYLT     KLIST                           *PYT4PF
     C                     KFLD           DEM01
     C                     KFLD           DEM02
     C                     KFLD           YEAR
     C           KEY#Y     KLIST                           *PT#YPF
     C                     KFLD           W#Y01  10
     C                     KFLD           W#Y02  10
     C*          KEYT1     KLIST                           *MAIN FILE
     C*                    KFLD           DM081
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
    C           SCID      CASEQ'SC02'    R2000
    C           SCID      CASEQ'SC03'    R3000
    C*          SCID      CASEQ'SC04'    R4000
    C           SCID      CASEQ'SC05'    R5000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     IN   PTDA01
|    C*RENT AUTHORITY CHECK
|    C                     MOVELDDATE     P#103
|    C                     CALL 'L@CHK'
|    C                     PARM           P#103   6
|    C                     PARM '01'      P#106   2
|    C                     PARM '  '      P#104   6
|    C                     PARM '2'       PFUN    1
|    C*--------------------------------------------------------------
|    C                     MOVE 'SC01'    SCID    4
|    C* FUN AUT
|    C                     MOVE $ADD      @A01,1
|    C                     MOVE $UPD      @A01,2
|    C                     MOVE $DLT      @A01,4
|    C                     MOVE $INQ      @A01,5
|    C*
|    C* SC01 FIELD INITIALIZE *--------------------------------------*
|    C                     MOVEL*BLANKS   DEM01
|    C                     MOVEL*BLANKS   DEM02
|    C*                    MOVEL*BLANKS   DEM31            .身份證號
|    C*                    MOVEL*BLANKS   DEM311           .檢查碼
|    C                     Z-ADD1         DOPT
|    C                     MOVEL*ZERO     EM131
|    C*------------------------------------------------------------****
|    C*公司別
|    C                     MOVEL$COR      DEM01
| 01-C           $RMK03    IFNE 'Y'
|   C                     SETOF                     32
| 01*C                     ELSE
|   C                     SETON                     32
| 01-C                     END
|    C*
|    C*TA09=勞保費率, TA10=員工負擔比率
|    C           '0'       CHAINTA0                  40
|    C  N40      TA09      MULT TA10      WTEMP   84
|    C   40                Z-ADD0         WTEMP   84
|    C*
|    C           '0'       CHAINE40                  40
| 02-C           *IN40     IFEQ '1'
|   C                     Z-ADD0         E401
|   C                     Z-ADD0         E402
|   C                     Z-ADD0         E405
| 02-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN18     IFEQ '1'                        *BROWSE
|   C                     EXSR R1A00
|   C                     GOTO E1000
| 02-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 03-C           *IN99     IFEQ '0'
|   C                     EXSR R1C00
|   C                     MOVEL'SC02'    SCID             *SCR2
| 03-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1A00 ....全頁查詢 (PF18 : CALL SUB-PROGRAM)
     C*==============================================================*
03===C           R1A00     BEGSR
|    C*
|    C* AUT CHECK
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM 'PYI101'  S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     99
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C   99                GOTO E1A00
|    C*
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* CALL SUB-PROGRAM
|    C                     CALL 'PYI101'
|    C           DEM01     PARM DEM01     I101I1  2
|    C           DEM02     PARM DEM02     I101I2  8
|    C                     PARM           @RTNC   2
|    C* RETURN CODE CHECK
| 02-C           @RTNC     IFEQ '03'                       *PF3
|   C                     SETON                     03
| 02-C                     END
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
03===C           E1A00     ENDSR
     C*==============================================================*
     C*          R1B00 ....SCREEN CHECK
     C*==============================================================*
04===C           R1B00     BEGSR
|    C*
|    C* CHK FUN AUT
| 01-C           @A01,DOPT IFNE 'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 01-C                     END
|    C   99                GOTO E1B00
|    C*---------------------------------------------------------------
|    C*公司別
| 02-C           DEM01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*                    CALL 'PYSCM0'
|    C*                    PARM DEM01     CM001I  2         公司代號
|    C*                    PARM           CM002O 22         公司名稱
|    C*                    PARM           CM003O 32         代碼說明
|    C*                    PARM           CM004O  1         日期格式
|    C*                    PARM           CM005O  1         日期曆別
|    C*                    PARM           CM098O 50         備用欄
|    C*                    PARM           CM099O  1         存在否？
|    C*                    MOVE CM004O    DFMT
|    C*                    MOVE CM005O    DTYPE
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 03-C*          CM099O    IFEQ 'N'
|   C*                    SETON                     6099
|   C*                    MOVEL'US#0099' ERRID
|   C*                    MOVEL'S#MF'    ERRF
| 03-C*                    END
|    C*  99                GOTO E1B00
|    C*
| 04-C*          CM099O    IFEQ *BLANK
|   C*                    SETON                     6099
|   C*                    MOVEL'UPT2010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
| 04-C*                    END
|    C*  99                GOTO E1B00
|    C*
|    C*                    MOVELCM002O    CM02
|    C*
|    C                     MOVEL'01'      PM01
|    C           KEYPM     CHAINPM0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     MOVEL'UMI0440' ERRID
|   C                     MOVEL'CEMF'    ERRF
|   C                     SETON                     6099
| 05-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*員工編號
|    C*911031    DOPT      IFNE 1
| 06-C           DEM02     IFEQ *BLANK
|   C*          DEM31     ANDEQ*BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     616263
|   C                     SETON                     99
| 06-C                     END
|    C   99                GOTO E1B00
|    C*
| 07-C           DEM02     IFNE *BLANK
|   C           KEYEM     CHAINEM0                  40    *NF
| 08-C           DOPT      IFEQ 1                          *ADD
| 09-C           *IN40     IFEQ '0'
|   C                     MOVEL'UPT2020' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606199
|   C                     SETON                     6263
| 09*C*                    ELSE
|   C*                    MOVEL*BLANK    DEM31
|   C*                    MOVEL*BLANK    DEM311
| 09-C                     END
| 08-C                     END
|   C   99                GOTO E1B00
|   C*
| 10-C           DOPT      IFNE 1                          *UPD,DEL,INQ
| 11-C           *IN40     ANDEQ'1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606199
|   C                     SETON                     6263
| 11*C*                    ELSE
|   C*                    MOVELEM31      DEM31     P
|   C*                    MOVELEM311     DEM311    P
| 11-C*                    END
| 10-C                     END
|   C   99                GOTO E1B00
|   C*
| 07-C                     END
|    C*
|    C*
| 12-C*          DEM02     IFEQ *BLANK
|   C*          DEM31     ANDNE*BLANK
|   C*          KEYEM2    CHAINEM2                  40    *NF
| 13-C*          DOPT      IFEQ 1                          *ADD
| 14-C*          *IN40     IFEQ '0'
|   C*                    MOVEL'UPT2020' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     606162
|   C*                    SETON                     6399
| 14*C*                    ELSE
|   C*                    MOVEL*BLANK    DEM02
|   C*                    MOVELDEM31     EM31
|   C*                    MOVELDEM311    EM311
| 14-C*                    END
| 13-C*                    END
|   C*  99                GOTO E1B00
|   C*
| 15-C*          DOPT      IFNE 1                          *UPD,DEL,INQ
| 16-C*          *IN40     IFEQ '1'
|   C*                    MOVEL'UPT2010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     606199
|   C*                    SETON                     6263
| 16*C*                    ELSE
|   C*                    MOVELEM02      DEM02     P
| 16-C*                    END
|   C*  99                GOTO E1B00
|   C*
| 15-C*                    END
| 12-C*                    END
|    C*---------------------------------------------------------------
| 17-C           DOPT      IFNE 1
|   C*部門別
|   C                     CALL 'PYSCM1'
|   C                     PARM EM01      CM101I  2         公司代號
|   C                     PARM EM04      CM102I  7         部門代號
|   C                     PARM           CM103O 14         部門名稱
|   C                     PARM           CM199O  1         存在否？
|   C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 18-C           CM199O    IFEQ 'N'
|   C                     SETON                     6199
|   C                     MOVEL'US#0098' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 18-C                     END
|   C   99                GOTO E1B00
|   C*
| 19-C           CM199O    IFEQ *BLANK
|   C                     SETON                     606199
|   C                     MOVEL'US#1111' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 19-C                     END
|   C   99                GOTO E1B00
| 17-C                     END
|    C*---------------------------------------------------------------
|    C*離職人員只可查詢*
| 20-C           DOPT      IFNE 5
|   C           EM11      ANDEQ'Y'
|   C                     MOVEL'UPT0090' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606199
| 20-C                     END
|    C   99                GOTO E1B00
|    C*
04===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....MOVE  SCREEN TO SCID
     C*==============================================================*
05===C           R1C00     BEGSR
|    C*
|    C                     MOVE WFUN,DOPT DFUN
|    C                     SETOF                     31    *IN CONTROL
|    C*                    EXSR R1CC0                      *INIT SFL
|    C* ADD
| 01-C           DOPT      IFEQ 1
|    C                     SETON                     3133
|   C                     EXSR R1CA0                      *HEADING
|   C*                    EXSR R1CE0                      *READ DETAIL
|   C*                    EXSR R1CD0                      *INIT DETAIL
| 01-C                     END
|    C* UPD
| 02-C           DOPT      IFEQ 2
|    C*                    SETON                     31
|TESTC                     SETON                     3133
|   C                     EXSR R1CB0                      *HEADING
|   C*                    EXSR R1CE0                      *READ DETAIL
|   C*                    EXSR R1CD0                      *INIT DETAIL
| 02-C                     END
|    C* DEL & INQ
| 03-C           DOPT      IFEQ 4
|   C           DOPT      OREQ 5
|   C                     EXSR R1CB0                      *HEADING
|   C*                    EXSR R1CE0                      *READ DETAIL
|   C                     SETOF                     33
|   C                     SETON                     53    *SFLEND
| 03-C                     END
|    C*SFLDSP
| 04-C*          @LRRN     IFGT 0
|   C*                    Z-ADD1         DRRN
|   C*                    SETON                     50    *SFLDSP
| 04*C*                    ELSE
|   C*                    SETON                     99    *NO DTA
|   C*                    MOVEL'UPT2050' ERRID
|   C*                    MOVEL'PTMF'    ERRF
| 04-C*                    END
|    C*
|    C* RELEASE FILE (ADD & INQUIRY)++++++++++++++++++++++++++++++++++*
| 05-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 5                          *INQ
|   C           *LOVAL    SETLLEM0                        *HEAD FILE
| 05-C                     END
|    C*
|    C*          *LOVAL    SETLLDS0                        *DETIAL FILE
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R1CA0 ....CLEAR SCREEN VARIABLES
     C*==============================================================*
06===C           R1CA0     BEGSR
|    C*
|    C                     MOVE *BLANK    DEM03
|    C                     MOVE *BLANK    DEM031
|    C                     MOVE *BLANK    DEM04
|    C                     MOVE *BLANK    DDP02
|    C                     MOVE *BLANK    DEM05            職稱編號
|    C                     MOVE *BLANK    DEM051           副職稱編號一
|    C                     MOVE *BLANK    DEM134           副職稱編號二
|    C                     MOVE *BLANK    DJT02            職稱說明
|    C                     MOVE *BLANK    DJT021           副職稱說明一
|    C                     MOVE *BLANK    DJT022           副職稱說明二
|    C                     MOVE *BLANK    DEM06
|    C                     Z-ADD0         DEM07
|    C**                   MOVE '1'       DEM08
|    C*                    MOVE '2'       DEM09
|    C*                    MOVE '1'       DEM10
|    C                     MOVE *BLANK    DEM11
|    C*                    MOVEL'N'       DEM12
|    C*KLAUS
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '1'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           DEM13     PARM           P3111O  80
|    C*
|    C                     Z-ADD0         DEM17
|    C                     Z-ADD0         DEM18
|    C                     Z-ADD0         DEM19
|    C*                    Z-ADD0         DEM20
|    C                     Z-ADD0         DEM21
|    C                     Z-ADD0         DEM22
|    C*                    MOVE 'Y'       DEM24
|    C*                    MOVE 'Y'       DEM25
|    C*                    MOVE 'N'       DCA03
|    C*                    MOVE *BLANK    DCA04
|    C                     Z-ADD0         DEM26
|    C*                    Z-ADD0         DEM27
|    C                     MOVE *BLANK    DEM30
|    C*                    MOVE *BLANK    DEM31
|    C*                    MOVE *BLANK    DEM311
|    C                     MOVE 'M'       DEM32
|    C                     MOVE 'L'       DEM321
|    C                     Z-ADD0         DEM33
|    C                     MOVE 'S'       DEM34
|    C                     Z-ADD0         DEM35
|    C**********           MOVE '2'       DEM36
|    C                     MOVE *BLANK    DEM37
|    C                     MOVE *BLANK    DEM38
|    C                     MOVE *BLANK    DM381            通訊地址之區碼
|    C                     MOVE *BLANK    DEM39
|    C                     MOVE *BLANK    DM391            戶籍地址之區碼
|    C                     MOVE *BLANK    DEM40
|    C                     MOVE *BLANK    DEM401
|    C                     MOVE *BLANK    DEM41
|    C                     MOVE *BLANK    DEM42
|    C**                   MOVE *BLANK    DEM43
|    C**                   MOVE *BLANK    DEM431
|    C**                   MOVE *BLANK    DEM44
|    C                     MOVE *BLANK    DEM45
|    C                     MOVE *BLANK    DEM451
|    C                     MOVE *BLANK    DEM452
|    C**                   MOVE *BLANK    DEM46
|    C**                   MOVE *BLANK    DEM461
|    C**                   MOVE *BLANK    DEM47
|    C                     MOVE *BLANK    DEM60            學校名稱
|    C                     MOVE *BLANK    DEM61
|    C                     Z-ADD0         DEM62
|    C                     Z-ADD0         DEM63
|    C                     MOVE *BLANK    DEM64
|    C                     MOVE *BLANK    DEM65            學校名稱
|    C                     MOVE *BLANK    DEM66
|    C                     Z-ADD0         DEM67
|    C                     Z-ADD0         DEM68
|    C                     MOVE *BLANK    DEM69
|    C                     MOVE *BLANK    DEM70            學校名稱
|    C                     MOVE *BLANK    DEM71
|    C                     Z-ADD0         DEM72
|    C                     Z-ADD0         DEM73
|    C                     MOVE *BLANK    DEM74
|    C                     MOVE *BLANK    DEM75
|    C                     MOVE *BLANK    DEM76
|    C                     Z-ADD0         DEM77
|    C                     Z-ADD0         DEM78
|    C                     MOVE *BLANK    DEM79
|    C                     MOVE *BLANK    DEM80
|    C                     Z-ADD0         DEM81
|    C                     Z-ADD0         DEM82
|    C                     MOVE *BLANK    DEM83
|    C                     MOVE *BLANK    DEM84
|    C                     Z-ADD0         DEM85
|    C                     Z-ADD0         DEM86
|    C                     MOVE *BLANK    DEM87            個人專長
|    C                     MOVE *BLANK    DEM89
|    C                     MOVE *BLANK    DEM91
|    C                     MOVE *BLANK    DEM88            語文能力
|    C                     MOVE *BLANK    DEM90
|    C                     MOVE *BLANK    DEM92
|    C                     MOVEL*BLANK    DEM93
|    C                     MOVEL*BLANKS   EM93N
|    C                     Z-ADD0         DEM951
|    C                     Z-ADD0         DEM952
|    C                     Z-ADD0         DEM953
|    C*
|    C                     MOVEL'1'       DEM100           薪　制
|    C                     MOVEL'1'       DEM101
|    C                     Z-ADD0         DEM102
|    C*                    MOVEL'Y'       DEM103
|    C*                    MOVEL'Y'       DEM104           班表
|    C*                    MOVEL*BLANK    DM081            固定班表
|    C*                    MOVEL'A'       DEM133
|    C**                   MOVEL'N'       EM105A           退休金提撥
|    C*                    MOVEL'Y'       DEM106
|    C**                   MOVEL'N'       DEM107
|    C**                   Z-ADD*ZERO     DEM108
|    C*                    MOVEL'1'       DEM109
|    C                     MOVEL'1'       DEM110
|    C*                    MOVEL*BLANKS   DEM111
|    C*                    MOVEL*BLANKS   EM111N
|    C**                   MOVEL'1'       DEM112
|    C*                    Z-ADD*ZERO     DEM113
|    C                     MOVEL*BLANKS   DEM114
|    C                     Z-ADD*ZERO     DEM115
|    C                     Z-ADD*ZERO     DEM116
|    C                     Z-ADD*ZERO     DEM117
|    C                     MOVEL*BLANKS   DEM118
|    C                     MOVEL*BLANKS   DEM119
|    C                     MOVEL*BLANKS   DEM120
|    C*
|    C**                   Z-ADD0         DEM121
|    C**                   Z-ADD0         DEM122
|    C**                   Z-ADD0         DEM123
|    C**                   Z-ADD0         DEM124
|    C*                    Z-ADD0         DEM125
|    C*                    Z-ADD0         DEM126
|    C* 890225 A1274 *YM
|    C**                   Z-ADD0         DEM127           最近申報年月
|    C**                   MOVEL*BLANK    DEM128           會計科目一
|    C**                   MOVEL*BLANK    DEM129           會計科目二
|    C* 890807 A1274 *YH
|    C*                    MOVEL*BLANK    DEM130           工作地點
|    C*                    MOVEL*BLANK    D130N            地點說明
|    C*                    Z-ADD*ZERO     DM150            契約期滿日
|    C*                    MOVEL'A'       DM135            報稅地點
|    C                     MOVEL*BLANK    DM136            E-MAIL
|    C*-EASON              Z-ADD0         EM150
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R1CB0 ....MOVE DATA TO SCREEN
     C*==============================================================*
07===C           R1CB0     BEGSR
|    C*
|    C                     MOVELEM03      DEM03
|    C                     MOVELEM031     DEM031
|    C                     MOVELEM04      DEM04
|    C                     MOVELDEM04     KEM04
|    C                     MOVELEM05      DEM05
|    C                     MOVELEM051     DEM051
|    C                     MOVELEM134     DEM134
|    C                     MOVELEM06      DEM06
|    C                     Z-ADDEM07      DEM07
|    C**                   MOVELEM08      DEM08
|    C*                    MOVELEM09      DEM09
|    C*                    MOVELEM10      DEM10
|    C****91/12/05 PP
| 01-C           EM11      IFEQ '*'
|   C                     MOVEL'*'       XX11    1
|   C                     SETON                     35
| 01-C                     END
|    C****91/12/05 PP
|    C                     MOVELEM11      DEM11
|    C*                    MOVELEM12      DEM12
|    C*
|    C                     CALL 'P31'
|    C                     PARM EM13      P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '1'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           DEM13     PARM           P3111O  80
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM EM17      P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM DFMT      P3104I  1
|    C*                    PARM DTYPE     P3105I  1
|    C*                    PARM           P3111O  80
|    C                     Z-ADDEM17      DEM17            留職停薪日
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM EM18      P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM DFMT      P3104I  1
|    C*                    PARM DTYPE     P3105I  1
|    C*                    PARM           P3111O  80
|    C                     Z-ADDEM18      DEM18            復職日期
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM EM19      P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM DFMT      P3104I  1
|    C*                    PARM DTYPE     P3105I  1
|    C*                    PARM           P3111O  80
|    C                     Z-ADDEM19      DEM19            離職日期
|    C*
|    C                     CALL 'P31'
|    C                     PARM EM20      P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM DFMT      P3104I  1
|    C                     PARM DTYPE     P3105I  1
|    C                     PARM           P3111O  80
|    C*                    Z-ADDP3111O    DEM20            試用期滿日
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM EM21      P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM DFMT      P3104I  1
|    C*                    PARM DTYPE     P3105I  1
|    C*                    PARM           P3111O  80
|    C                     Z-ADDEM21      DEM21            最近調陞日
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM EM22      P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM DFMT      P3104I  1
|    C*                    PARM DTYPE     P3105I  1
|    C*                    PARM           P3111O  80
|    C                     Z-ADDEM22      DEM22            最近調薪日
|    C*
|    C*                    MOVE EM24      DEM24
|    C*                    MOVELEM25      DEM25
|    C                     Z-ADDEM26      DEM26
|    C*                    Z-ADDEM27      DEM27
|    C                     MOVELEM30      DEM30
|    C                     MOVELEM31      DEM31
|    C                     MOVELEM311     DEM311
|    C                     MOVELEM32      DEM32
|    C                     MOVELEM321     DEM321
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM EM33      P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM DFMT      P3104I  1
|    C*                    PARM DTYPE     P3105I  1
|    C*                    PARM           P3111O  80
|    C                     Z-ADDEM33      DEM33            出生日期
|    C*
|    C                     MOVELEM34      DEM34
|    C                     Z-ADDEM35      DEM35
|    C**********           MOVELEM36      DEM36
|    C                     MOVELEM37      DEM37
|    C                     MOVELEM38      DEM38
|    C                     MOVELEM381     DM381
|    C                     MOVELEM39      DEM39
|    C                     MOVELEM391     DM391
|    C                     MOVELEM40      DEM40
|    C                     MOVELEM401     DEM401
|    C                     MOVELEM41      DEM41
|    C                     MOVELEM42      DEM42
|    C**                   MOVELEM43      DEM43
|    C**                   MOVELEM431     DEM431
|    C**                   MOVELEM44      DEM44
|    C                     MOVELEM45      DEM45
|    C                     MOVELEM451     DEM451
|    C                     MOVELEM452     DEM452
|    C**                   MOVELEM46      DEM46
|    C**                   MOVELEM461     DEM461
|    C**                   MOVELEM47      DEM47
|    C*
|    C                     MOVELEM60      DEM60            學校名稱
|    C*
|    C*                    CALL 'P39'
|    C*                    PARM EM62      P3901I  60
|    C*                    PARM '2'       P3902I  1
|    C*                    PARM '1'       P3903I  1
|    C*                    PARM DFMT      P3904I  1
|    C*                    PARM DTYPE     P3905I  1
|    C*                    PARM           P3911O  60
|    C                     Z-ADDEM62      DEM62            入校年月－１
|    C*
|    C*                    CALL 'P39'
|    C*                    PARM EM63      P3901I  60
|    C*                    PARM '2'       P3902I  1
|    C*                    PARM '1'       P3903I  1
|    C*                    PARM DFMT      P3904I  1
|    C*                    PARM DTYPE     P3905I  1
|    C*                    PARM           P3911O  60
|    C                     Z-ADDEM63      DEM63            離校年月－１
|    C*
|    C                     MOVELEM61      DEM61
|    C                     MOVELEM64      DEM64
|    C*
|    C                     MOVELEM65      DEM65            學校名稱
|    C*
|    C*                    CALL 'P39'
|    C*                    PARM EM67      P3901I  60
|    C*                    PARM '2'       P3902I  1
|    C*                    PARM '1'       P3903I  1
|    C*                    PARM DFMT      P3904I  1
|    C*                    PARM DTYPE     P3905I  1
|    C*                    PARM           P3911O  60
|    C                     Z-ADDEM67      DEM67            入校年月－２
|    C*
|    C*                    CALL 'P39'
|    C*                    PARM EM68      P3901I  60
|    C*                    PARM '2'       P3902I  1
|    C*                    PARM '1'       P3903I  1
|    C*                    PARM DFMT      P3904I  1
|    C*                    PARM DTYPE     P3905I  1
|    C*                    PARM           P3911O  60
|    C                     Z-ADDEM68      DEM68            離校年月－２
|    C*
|    C                     MOVELEM66      DEM66
|    C                     MOVELEM69      DEM69
|    C*
|    C                     MOVELEM70      DEM70            學校名稱
|    C*
|    C*                    CALL 'P39'
|    C*                    PARM EM72      P3901I  60
|    C*                    PARM '2'       P3902I  1
|    C*                    PARM '1'       P3903I  1
|    C*                    PARM DFMT      P3904I  1
|    C*                    PARM DTYPE     P3905I  1
|    C*                    PARM           P3911O  60
|    C                     Z-ADDEM72      DEM72            入校年月－３
|    C*
|    C*                    CALL 'P39'
|    C*                    PARM EM73      P3901I  60
|    C*                    PARM '2'       P3902I  1
|    C*                    PARM '1'       P3903I  1
|    C*                    PARM DFMT      P3904I  1
|    C*                    PARM DTYPE     P3905I  1
|    C*                    PARM           P3911O  60
|    C                     Z-ADDEM73      DEM73            離校年月－３
|    C*
|    C*                    CALL 'P39'
|    C*                    PARM EM77      P3901I  60
|    C*                    PARM '2'       P3902I  1
|    C*                    PARM '1'       P3903I  1
|    C*                    PARM DFMT      P3904I  1
|    C*                    PARM DTYPE     P3905I  1
|    C*                    PARM           P3911O  60
|    C                     Z-ADDEM77      DEM77            任職年月－１
|    C*
|    C*                    CALL 'P39'
|    C*                    PARM EM78      P3901I  60
|    C*                    PARM '2'       P3902I  1
|    C*                    PARM '1'       P3903I  1
|    C*                    PARM DFMT      P3904I  1
|    C*                    PARM DTYPE     P3905I  1
|    C*                    PARM           P3911O  60
|    C                     Z-ADDEM78      DEM78            離職年月－１
|    C*
|    C*                    CALL 'P39'
|    C*                    PARM EM81      P3901I  60
|    C*                    PARM '2'       P3902I  1
|    C*                    PARM '1'       P3903I  1
|    C*                    PARM DFMT      P3904I  1
|    C*                    PARM DTYPE     P3905I  1
|    C*                    PARM           P3911O  60
|    C                     Z-ADDEM81      DEM81            任職年月－２
|    C*
|    C*                    CALL 'P39'
|    C*                    PARM EM82      P3901I  60
|    C*                    PARM '2'       P3902I  1
|    C*                    PARM '1'       P3903I  1
|    C*                    PARM DFMT      P3904I  1
|    C*                    PARM DTYPE     P3905I  1
|    C*                    PARM           P3911O  60
|    C                     Z-ADDEM82      DEM82            離職年月－２
|    C*
|    C*                    CALL 'P39'
|    C*                    PARM EM85      P3901I  60
|    C*                    PARM '2'       P3902I  1
|    C*                    PARM '1'       P3903I  1
|    C*                    PARM DFMT      P3904I  1
|    C*                    PARM DTYPE     P3905I  1
|    C*                    PARM           P3911O  60
|    C                     Z-ADDEM85      DEM85            任職年月－３
|    C*
|    C*                    CALL 'P39'
|    C*                    PARM EM86      P3901I  60
|    C*                    PARM '2'       P3902I  1
|    C*                    PARM '1'       P3903I  1
|    C*                    PARM DFMT      P3904I  1
|    C*                    PARM DTYPE     P3905I  1
|    C*                    PARM           P3911O  60
|    C                     Z-ADDEM86      DEM86            離職年月－３
|    C*
|    C                     MOVELEM71      DEM71
|    C                     MOVELEM74      DEM74
|    C                     MOVELEM75      DEM75
|    C                     MOVELEM76      DEM76
|    C                     MOVELEM79      DEM79
|    C                     MOVELEM80      DEM80
|    C                     MOVELEM83      DEM83
|    C                     MOVELEM84      DEM84
|    C                     MOVELEM87      DEM87
|    C                     MOVELEM88      DEM88
|    C                     MOVELEM89      DEM89
|    C                     MOVELEM90      DEM90
|    C                     MOVELEM91      DEM91
|    C                     MOVELEM92      DEM92
|    C                     MOVELEM93      DEM93
|    C                     MOVEL*BLANK    W#Y01
|    C                     MOVEL*BLANK    W#Y02
| 02-C           DEM93     IFNE *BLANK
|   C                     MOVEL'EM93'    W#Y01
|   C                     MOVELDEM93     W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
|   C  N40                MOVEL#Y03      EM93N
| 02-C                     END
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM EM951     P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM DFMT      P3104I  1
|    C*                    PARM DTYPE     P3105I  1
|    C*                    PARM           P3111O  80
|    C                     Z-ADDEM951     DEM951           長病假日期
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM EM952     P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM DFMT      P3104I  1
|    C*                    PARM DTYPE     P3105I  1
|    C*                    PARM           P3111O  80
|    C                     Z-ADDEM952     DEM952           長病假復職日
|    C*
|    C                     Z-ADDEM953     DEM953
|    C                     MOVELEM100     DEM100           薪　制
|    C                     MOVELEM101     DEM101
|    C                     Z-ADDEM102     DEM102
|    C*                    MOVELEM103     DEM103
|    C*                    MOVELEM104     DEM104           班表
|    C*                    MOVELEM081     DM081            固定班表
|    C*                    MOVELEM133     DEM133
|    C**                   MOVELKEM105    EM105A
|    C*                    MOVELEM106     DEM106
|    C**                   MOVELEM107     DEM107
|    C**                   Z-ADDEM108     DEM108
|    C*                    MOVELEM109     DEM109
|    C                     MOVELEM110     DEM110
|    C*                    MOVELEM111     DEM111
|    C                     MOVEL*BLANK    W#Y01
|    C                     MOVEL*BLANK    W#Y02
| 03-C*          DEM111    IFNE *BLANK
|   C*                    MOVEL'EM111'   W#Y01
|   C*                    MOVELDEM111    W#Y02
|   C*          KEY#Y     CHAIN#Y0                  40
| 04-C*          *IN40     IFEQ '0'
|   C*                    CALL 'P65'
|   C*                    PARM #Y03      P6501I 80
|   C*                    PARM 10        P6502I  30
|   C*          EM111N    PARM           P6511O 80
|   C*                    PARM           P6512O 80
| 04-C*                    END
| 03-C*                    END
|    C*
|    C**                   MOVELEM112     DEM112
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM EM113     P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM DFMT      P3104I  1
|    C*                    PARM DTYPE     P3105I  1
|    C*                    PARM           P3111O  80
|    C*                    Z-ADDP3111O    DEM113           特休基準日
|    C*
|    C                     MOVELEM114     DEM114
|    C                     Z-ADDEM115     DEM115
|    C                     Z-ADDEM116     DEM116
|    C                     Z-ADDEM117     DEM117
|    C                     MOVELEM118     DEM118
|    C                     MOVELEM119     DEM119
|    C                     MOVELEM120     DEM120
|    C*部門名稱
|    C                     MOVELDEM04     KEM04
|    C           KEYDP     CHAINDP0                  40
| 05-C           *IN40     IFEQ '0'
|   C                     MOVELDP02      DDP02
| 05*C                     ELSE
|   C                     MOVEL*BLANK    DDP02
| 05-C                     END
|    C*
|    C*工作地點說明
|    C                     MOVELDEM13     KEM04
|    C*          KEYDP     CHAINDP0                  41
|    C*  41                MOVEL*BLANK    D130N
|    C* N41                MOVELDP02      D130N
|    C*
|    C*職稱名稱
| 06-C           DEM05     IFNE *BLANK
|   C           DEM05     CHAINJT0                  42
|   C   42                MOVE *BLANK    DJT02
|   C  N42                MOVELJT02      DJT02
| 06-C                     END
|    C*
|    C*副職稱名稱一
| 07-C           DEM051    IFNE *BLANK
|   C           DEM051    CHAINJT0                  43
|   C   43                MOVE *BLANK    DJT021
|   C  N43                MOVELJT02      DJT021
| 07-C                     END
|    C*
|    C*副職稱名稱二
| 08-C           DEM134    IFNE *BLANK
|   C           DEM134    CHAINJT0                  44
|   C   44                MOVE *BLANK    DJT022
|   C  N44                MOVELJT02      DJT022
| 08-C                     END
|    C*
|    C**                   Z-ADDEM121     DEM121
|    C**                   Z-ADDEM122     DEM122
|    C**                   Z-ADDEM123     DEM123
|    C**                   Z-ADDEM124     DEM124
|    C*                    Z-ADDEM125     DEM125
|    C*                    Z-ADDEM126     DEM126
|    C**                   Z-ADDEM127     DEM127           最近申報年月
|    C**                   MOVELEM128     DEM128           會計科目一
|    C**                   MOVELEM129     DEM129           會計科目二
|    C*                    MOVELEM130     DEM130           上班地點
|    C*-EASON
| 09-C*          EM150     IFNE 0
|   C*                    CALL 'P31'
|   C*                    PARM EM150     P3101I  80
|   C*                    PARM '2'       P3102I  1
|   C*                    PARM '1'       P3103I  1
|   C*                    PARM DFMT      P3104I  1
|   C*                    PARM DTYPE     P3105I  1
|   C*                    PARM           P3111O  80
|   C*                    Z-ADDP3111O    DM150            契約期滿日
| 09-C*                    END
|    C*-EASON
|    C*                    MOVELEM135     DM135            報稅地點
|    C                     MOVELEM136     DM136            E-MAIL
|    C*
     C*          KEYEM     CHAINCA0                  40
     C*          *IN40     IFEQ '0'
     C*
     C*          CA03      IFNE *BLANK
     C*                    MOVEL'Y'       DCA03
     C*                    MOVELCA03      DCA04
     C*                    ELSE
     C*                    MOVEL'N'       DCA03
     C*                    MOVEL*BLANK    DCA04
     C*                    END
     C*
     C*                    ELSE
     C*                    MOVEL'N'       DCA03
     C*                    MOVEL*BLANK    DCA04
     C*                    END
     C*
07===C                     ENDSR
     C*=============================================================*
     C*          R1CC0 ....SUBFILE INIT
     C*=============================================================*
08===C*          R1CC0     BEGSR
|    C* SFL SETTING ++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*                    Z-ADD6         @PRCD            *PGE RCD
|    C*                    Z-ADD19        @SFTOP  20       *SFL TOP LIN
|    C*                    Z-ADD21        @SFBOT  20       *SFL BOT LIN
|    C*                    Z-ADD1         @LNUM   20       *明細行數
|    C* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*                    Z-ADD0         DRRN
|    C*                    Z-ADD0         RRN
|    C*                    Z-ADD0         @LRRN            *LAST RRN
|    C*                    Z-ADD0         @DRCD            *DSP RCD
|    C*
|    C*                    SETOF                     51    *SFLDSPCTL
|    C*
|    C*                    SETON                     52    *SFLCLR
|    C*                    WRITESFLCR
|    C*                    SETOF                     52
|    C*
|    C*                    SETON                     51    *SFLDSPCTL
|    C*                    SETOF                     5053  *SFLDSP,END
|    C*
08===C*                    ENDSR
     C*==============================================================*
     C*          R1CD0 ....SFL DATA INIT
     C*==============================================================*
09===C*          R1CD0     BEGSR
|    C*
|    C*                    SETOF                     54    *54 FOR BLANK LOOP
|    C*                    Z-ADD@LRRN     RRN
|    C*
|    C*          @LRRN     DIV  @PRCD     @LPAGE
|    C*                    ADD  1         @LPAGE
|    C*          @LPAGE    MULT @PRCD     @DRCD
|    C*
|    C*                    EXSR R1CD1                      *INIT SFLDTA
| 01-C*          RRN       DOWLT@DRCD
|   C*                    ADD  1         RRN
|   C*                    WRITESFLSR
| 01-C*                    END
|    C*
|    C*                    Z-ADDRRN       @LRRN
|    C*                    Z-ADDRRN       DRRN
|    C*
09===C*                    ENDSR
     C*==============================================================*
     C*          R1CD1 ....SFL INIT DATA ADD
     C*==============================================================*
10===C*          R1CD1     BEGSR
|    C*
|    C*                    MOVEL*BLANKS   DDS041
|    C*                    MOVEL*BLANKS   DDS042
|    C*                    MOVEL*BLANKS   DDS043
|    C*                    MOVEL*BLANKS   DCC02
|    C*                    Z-ADD*ZERO     DDS05
|    C*
10===C*                    ENDSR
     C*==============================================================*
     C*          R1CE0 ....DETAIL DATA TO SFL
     C*==============================================================*
11===C*          R1CE0     BEGSR
|    C*
|    C*                    SETON                     54    *54
|    C*
|    C*          KEYEM     SETLLDS0
|    C*          KEYEM     READEDS0                      46
|    C*
| 01-C*          *IN46     DOWEQ'0'
|   C*                    EXSR R1CE1
|   C*                    ADD  1         RRN
|   C*                    WRITESFLSR
|   C*          KEYEM     READEDS0                      46
| 01-C*                    END
|    C*
|    C*                    Z-ADDRRN       @LRRN
|    C*
11===C*                    ENDSR
     C*==============================================================*
     C*          R1CE1 ....DETAIL DATA TO SFL
     C*==============================================================*
12===C*          R1CE1     BEGSR
|    C*
|    C*                    MOVELDS041     DDS041
|    C*                    MOVELDS042     DDS042
|    C*                    MOVELDS043     DDS043
|    C*
|    C*                    MOVELDDS04     KCC01
|    C*          KEYCC     CHAINCC0                  40
|    C*  40                MOVE *BLANKS   DCC02
|    C* N40                MOVELCC02      DCC02
|    C*                    Z-ADDDS05      DDS05
|    C*
12===C*                    ENDSR
     C*==============================================================*
     C*          R2000  ...'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
13===C           R2000     BEGSR
|    C*
|    C                     EXFMTDSPD2
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E2000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
| 03-C           DOPT      IFEQ 1
|   C           DOPT      OREQ 2
|   C                     EXSR R2E00
| 03-C                     END
|   C                     GOTO E2000
| 02-C                     END
|    C*
| 04-C           *IN12     IFEQ '1'
|   C                     MOVEL'SC01'    SCID
|   C                     GOTO E2000
| 04-C                     END
|    C*
| 05-C           DOPT      IFEQ 1
|   C           DOPT      OREQ 2
|   C                     EXSR R2B00                      *SCR CHK
| 05-C                     END
|    C*
| 06-C           *IN99     IFEQ '0'
|   C                     MOVEL'SC03'    SCID             *SCR2
| 06-C                     END
|    C*
13===C           E2000     ENDSR
     C*==============================================================*
     C*          R2B00 ....CHECK 'SC02' SCREEN
     C*==============================================================*
14===C           R2B00     BEGSR
|    C*離職碼91/12/05
| 01-C*          DEM11     IFNE XX11
|   C*          DEM11     ANDNE'Y'
|   C*          DEM11     ANDNE'X'
|   C*                    MOVEL'UPT6000' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6999
| 01-C*                    END
|    C*  99                GOTO E2B00
|    C*
|    C*員工姓名
| 02-C           DEM03     IFEQ *BLANK
|   C           EM031A    ANDEQ*BLANK
|   C                     MOVEL'UPT0130' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606699
| 02-C                     END
|    C   99                GOTO E2B00
|    C*出生日期
| 03-C           DEM33     IFEQ 0
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 03-C                     END
|    C   99                GOTO E2B00
|    C*
|    C                     CALL 'P30'
|    C                     PARM DEM33     P3001I  80
|    C                     PARM '1'       P3002I  1
|    C                     PARM '1'       P3003I  1
|    C                     PARM           P3011O  1
| 04-C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 04*C                     ELSE
|    C*
|   C                     CALL 'P31'
|   C                     PARM DEM33     P3101I  80
|   C                     PARM '1'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           WEM33     PARM           P3111O  80
| 04-C                     END
|    C   99                GOTO E2B00
|    C*
|    C*------------------------------------------------------------
|    C*身份證號
|    C*外國籍員工ＩＤ命名原則（出生日期＋英文名前二碼）
|    C*                    MOVEL*BLANK    EM31F  10
|    C*                    MOVELWEM33B    EM31F
|    C*                    MOVE EM031E    EM31F
|    C*
| 05-C           DEM321    IFEQ 'L'
| 05-C           DEM31     ANDEQ*BLANKS
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     619899
| 05-C                     END
|    C   99                GOTO E2B00
|    C*
| 05-C           DEM321    IFEQ 'F'
| 05-C           EM031B    ANDEQ*BLANKS
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6899
| 05-C                     END
|    C   99                GOTO E2B00
|    C*
| 06-C           DEM311    IFEQ *BLANKS
| 07-C           DEM321    IFNE 'F'
|   C                     CALL 'P02'
|   C                     PARM DEM31     P02I1  10
|   C                     PARM           P02O1   1
|   C                     PARM           P02O2   1
| 08-C           P02O1     IFEQ 'N'
|   C                     MOVEL'UPT0045' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 08-C                     END
| 07-C                     END
|   C*
| 06*C                     ELSE
| 09-C           DEM311    IFEQ '2'
|   C           DEM321    ANDNE'F'
|   C                     MOVEL'UMI0290' ERRID
|   C                     MOVEL'CEMF'    ERRF
|   C                     SETON                     6599
| 09-C                     END
| 06-C                     END
|    C   99                GOTO E2B00
|    C*
| 10-C*          DEM321    IFEQ 'L'
| 11-C*          DEM31     IFNE EM31F
| 11-C*          DEM311    ANDEQ*BLANKS
|   C*                    MOVEL'UPT0045' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6199
| 11-C*                    END
|   C*
| 12-C*          EM031B    IFEQ *BLANK
|   C*                    MOVEL'UPT0010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6899
| 12-C*                    END
| 10-C*                    END
|    C*  99                GOTO E2B00
|    C*------------------------------------------------------------
|    C*性別
| 13-C           DEM311    IFEQ *BLANKS
| 14-C           WEM31     IFEQ '1'
|   C                     MOVEL'M'       DEM32
|   C*********            MOVEL'2'       DEM36
| 14*C                     ELSE
|   C                     MOVEL'F'       DEM32
|   C*********            MOVEL'3'       DEM36
| 14-C                     END
| 13-C                     END
|    C*
|    C*外籍員工之戶籍地址可為空白
|    C*戶籍地址
| 15-C           DEM321    IFNE 'F'
| 16-C           DEM39     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 16-C                     END
|   C   99                GOTO E2B00
|   C*戶籍區碼
| 17-C*          DM391     IFEQ *BLANK
|   C*                    MOVEL'UPT0010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6499
| 17-C*                    END
|   C*  99                GOTO E2B00
|   C*通訊地址
| 18-C           DEM38     IFEQ *BLANK
|   C           DM381     ANDEQ*BLANK
|   C                     MOVELDEM39     DEM38
|   C                     MOVELDM391     DM381
| 18-C                     END
|   C*戶籍電話
| 19-C           DEM41     IFEQ *BLANK
|   C                     MOVELDEM40     DEM41
| 19-C                     END
|   C*戶籍地址郵遞區號
|   C*                    MOVEL*BLANK    W#Y01
|   C*                    MOVEL*BLANK    W#Y02
|   C*                    MOVEL'AREACODE'W#Y01
|   C*                    MOVELDM391     W#Y02
|   C*          KEY#Y     CHAINPT#YPF               40
| 20-C*          *IN40     IFEQ '1'
|   C*                    MOVEL'UPT2010' ERRID
|   8*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6499
| 20-C*                    END
|   C*  99                GOTO E2B00
|   C*通訊地址郵遞區號
|   C*                    MOVEL*BLANK    W#Y01
|   C*                    MOVEL*BLANK    W#Y02
|   C*                    MOVEL'AREACODE'W#Y01
|   C*                    MOVELDM381     W#Y02
|   C*          KEY#Y     CHAINPT#YPF               40
| 21-C*          *IN40     IFEQ '1'
|   C*                    MOVEL'UPT2010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6799
| 21-C*                    END
|   C*  99                GOTO E2B00
| 15-C                     END
|    C*
14===C           E2B00     ENDSR
     C*==============================================================*
     C*          R2E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
15===C           R2E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*--------------------------------------------------------------**
|    C*戶籍地址郵遞區號
| 01-C           #FLD      IFEQ 'DM391'
|   C                     CALL 'PTI121'
|   C                     PARM 'AREACODE'P120I1 10
|   C           DM391     PARM DM391     P120O1 10
| 01-C                     END
|    C*通訊地址郵遞區號
| 02-C           #FLD      IFEQ 'DM381'
|   C                     CALL 'PTI121'
|   C                     PARM 'AREACODE'P120I1 10
|   C           DM381     PARM DM381     P120O1 10
| 02-C                     END
|    C*
15===C           E2E00     ENDSR
     C*==============================================================*
     C*          R3000  ...'SC03' SCREEN MAIN ROUTINE
     C*==============================================================*
16===C           R3000     BEGSR
|    C*
|    C                     WRITEDSPC1
|    C                     EXFMTDSPD3
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E3000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
| 03-C           DOPT      IFEQ 1
|   C           DOPT      OREQ 2
|   C                     EXSR R3E00
| 03-C                     END
|   C                     GOTO E3000
| 02-C                     END
|    C*
| 04-C           *IN12     IFEQ '1'
|   C                     MOVEL'SC02'    SCID
|   C                     GOTO E3000
| 04-C                     END
|    C*
| 05-C           DOPT      IFEQ 1
|   C           DOPT      OREQ 2
|   C                     EXSR R3B00                      *SCR CHK
| 05-C                     END
|    C*
| 06-C           *IN99     IFEQ '0'
|   C                     MOVEL'SC05'    SCID             *SCR2
| 06-C                     END
|    C*
16===C           E3000     ENDSR
     C*==============================================================*
     C*          R3B00 ....CHECK 'SC03' SCREEN
     C*==============================================================*
17===C           R3B00     BEGSR
|    C*
|    C*部門編號
|    C                     MOVE *BLANK    DDP02
| 01-C           DEM04     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO E3B00
|    C*
|    C                     MOVELDEM04     KEM04
|    C           KEYDP     CHAINDP0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02*C                     ELSE
|   C                     MOVELDP02      DDP02
| 02-C                     END
|    C   99                GOTO E3B00
|    C*
| 03-C           DP04      IFEQ '2'
|   C                     MOVEL'UMI0370' ERRID
|   C                     MOVEL'CEMF'    ERRF
|   C                     SETON                     6099
| 03*C                     ELSE
|   C*                    MOVELDP02      D130N
| 03-C                     END
|    C   99                GOTO E3B00
|    C*
|    C*工作地點
|    C*                    MOVEL*BLANK    D130N
| 04-C*          DEM130    IFEQ *BLANK
|   C*                    MOVEL'UPT0010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     8199
| 04-C*                    END
|    C*  99                GOTO E3B00
|    C*工作地點
|   C*                    MOVEL*BLANK    W#Y01
|   C*                    MOVEL*BLANK    W#Y02
|   C*                    MOVEL'EM041   'W#Y01
|   C*                    MOVELDEM130    W#Y02
|   C*          KEY#Y     CHAINPT#YPF               40
| 20-C*          *IN40     IFEQ '1'
|   C*                    MOVEL'UPT2010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     8199
| 20-C*                    END
|   C*  99                GOTO E3B00
|   C*                    MOVEL#Y03      D130N
|    C*
|    C*
|    C*職稱編號
|    C                     MOVE *BLANK    DJT02
| 06-C*          DEM05     IFEQ *BLANK
|   C*                    MOVEL'UPT0010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6199
| 06*C*                    ELSE
|   C*          DEM05     CHAINJT0                  40
| 07-C*          *IN40     IFEQ '1'
|   C*                    MOVEL'UPT2010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6199
| 07*C*                    ELSE
|   C*                    MOVE JT02      DJT02
| 07-C*                    END
| 06-C*                    END
|    C*  99                GOTO E3B00
|    C*
|    C*副職稱編號一
|    C                     MOVE *BLANK    DJT021
|    C*          DEM051    IFEQ *BLANK
|    C*                    MOVEL'UPT0010' ERRID
|    C*                    MOVEL'PTMF'    ERRF
|    C*                    SETON                     7399
|    C*                    END
|    C*  99                GOTO E3B00
|    C*
| 08-C*          DEM051    IFNE *BLANK
|   C*          DEM051    CHAINJT0                  40
| 09-C*          *IN40     IFEQ '1'
|   C*                    MOVEL'UPT2010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     7399
| 09*C*                    ELSE
|   C*                    MOVE JT02      DJT021
| 09-C*                    END
| 08-C*                    END
|    C*  99                GOTO E3B00
|    C*-------------------------------------------
|    C*副職稱編號二
|    C                     MOVE *BLANK    DJT022
|    C*          DEM134    IFEQ *BLANK
|    C*                    MOVEL'UPT0010' ERRID
|    C*                    MOVEL'PTMF'    ERRF
|    C*                    SETON                     7499
|    C*                    END
|    C*  99                GOTO E3B00
|    C*
| 10-C           DEM134    IFNE *BLANK
|   C           DEM134    CHAINJT0                  40
| 11-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7499
| 11*C                     ELSE
|   C                     MOVE JT02      DJT022
| 11-C                     END
| 10-C                     END
|    C   99                GOTO E3B00
|    C*-------------------------------------------
|    C*職等編號
| 12-C*          DEM06     IFEQ *BLANK
|   C*                    MOVEL'UPT0010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6299
| 12-C*                    END
|    C*  99                GOTO E3B00
|    C*職級編號
|    C*          DEM07     IFEQ *ZERO
|    C*                    MOVEL'UPT0012' ERRID
|    C*                    MOVEL'PTMF'    ERRF
|    C*                    SETON                     7199
|    C*                    END
|    C*  99                GOTO E3B00
|    C*
|    C*          KEYPS     CHAINPS0                  40
| 13-C*          *IN40     IFEQ '1'
|   C*                    MOVEL'UPT2010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     627199
| 13-C*                    END
|    C*  99                GOTO E3B00
|    C*
|    C*到職日期
| 14-C           DEM13     IFEQ 0
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6999
| 14-C                     END
|    C   99                GOTO E3B00
|    C*
|    C                     CALL 'P30'
|    C                     PARM DEM13     P3001I  80
|    C                     PARM '1'       P3002I  1
|    C                     PARM '1'       P3003I  1
|    C                     PARM           P3011O  1
| 15-C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6999
| 15-C                     END
|    C   99                GOTO E3B00
|    C*
|    C                     CALL 'P31'
|    C                     PARM DEM13     P3101I  80
|    C                     PARM '1'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           WEM13     PARM           P3111O  80
|    C*試用日期
|    C*          DEM20     IFEQ *ZERO
|    C*                    Z-ADDDEM13     DEM20
|    C*                    ADD  3         DEM20M
|    C*          DEM20M    IFGT 12
|    C*                    SUB  12        DEM20M
|    C*                    ADD  1         DEM20Y
|    C*                    END
|    C*                    END
|    C*
|    C**         DEM20     IFEQ 0
|    C**                   MOVEL'UPT0012' ERRID
|    C**                   MOVEL'PTMF'    ERRF
|    C**                   SETON                     7099
|    C**                   END
|    C** 99                GOTO E3B00
|    C*
|    C**                   CALL 'P30'
|    C**                   PARM DEM20     P3001I  80
|    C**                   PARM '2'       P3002I  1
|    C**                   PARM '1'       P3003I  1
|    C**                   PARM           P3011O  1
|    C**         P3011O    IFEQ 'N'
|    C**                   MOVEL'UPT0040' ERRID
|    C**                   MOVEL'PTMF'    ERRF
|    C**                   SETON                     7099
|    C**                   END
|    C** 99                GOTO E3B00
|    C**
|    C**                   Z-ADDDEM20     WEM20
|    C*
|    C**         WEM20     IFLT WEM13
|    C**                   MOVEL'UMI0360' ERRID
|    C**                   MOVEL'CEMF'    ERRF
|    C**                   SETON                     7099
|    C**                   END
|    C** 99                GOTO E3B00
|    C*特休基準
|    C*
| 16-C*          DEM113    IFEQ *ZERO
|   C*                    Z-ADDDEM13     DEM113
| 16*C*                    ELSE
|   C*
|   C*                    CALL 'P30'
|   C*                    PARM DEM113    P3001I  80
|   C*                    PARM DFMT      P3002I  1
|   C*                    PARM DTYPE     P3003I  1
|   C*                    PARM           P3011O  1
| 17-C*          P3011O    IFEQ 'N'
|   C*                    MOVEL'UPT0040' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     7299
| 17-C*                    END
| 16-C*                    END
|    C*  99                GOTO E3B00
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM DEM113    P3101I  80
|    C*                    PARM DFMT      P3102I  1
|    C*                    PARM DTYPE     P3103I  1
|    C*                    PARM '2'       P3104I  1
|    C*                    PARM '1'       P3105I  1
|    C*                    PARM           P3111O  80
|    C*                    Z-ADDP3111O    WEM113           特休基準日
|    C*
|    C*契約期滿日
|    C*
| 18-C*          DEM321    IFEQ 'L'
| 19-C*          DM150     IFNE 0
|   C*                    MOVEL'UPT0011' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     8299
| 19-C*                    END
| 18*C*                    ELSE
| 20-C*          DM150     IFEQ 0
|   C*                    MOVEL'UPT0012' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     8299
| 20*C*                    ELSE
|   C*                    CALL 'P30'
|   C*                    PARM DM150     P3001I  80
|   C*                    PARM DFMT      P3002I  1
|   C*                    PARM DTYPE     P3003I  1
|   C*                    PARM           P3011O  1
| 21-C*          P3011O    IFEQ 'N'
|   C*                    MOVEL'UPT0040' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     8299
| 21-C*                    END
| 20-C*                    END
|   C*  99                GOTO E3B00
|   C*
|   C*                    CALL 'P31'
|   C*                    PARM DM150     P3101I  80
|   C*                    PARM DFMT      P3102I  1
|   C*                    PARM DTYPE     P3103I  1
|   C*                    PARM '2'       P3104I  1
|   C*                    PARM '1'       P3105I  1
|   C*                    PARM           P3111O  80
|   C*                    Z-ADDP3111O    WM150   80       契約期滿日
| 18-C*                    END
|    C*
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* CHECK DETAIL (SFLSR)
|    C                     Z-ADD*ZERO     CHKTOT  52
|    C*
|    C*                    SETON                     54
|    C*                    READCSFLSR                  5757
|    C*
| 22-C*          *IN57     DOWEQ'0'
|   C*          *IN99     ANDEQ'0'
|   C*                    EXSR R3B10
|   C*                    UPDATSFLSR
|   C*
| 23-C*          *IN99     IFEQ '1'
|   C*                    Z-ADDRRN       DRRN
| 23*C*                    ELSE
|   C*                    READCSFLSR                    57
| 23-C*                    END
|   C*
| 22-C*                    END
|    C*  99                GOTO E3B00
|    C*SHARON DEL***************************************************
| 24-C*          CHKTOT    IFEQ 0
|   C*          1         CHAINSFLSR                40
|   C*                    SETON                     54
|   C*                    MOVELDEM04     DDS04
|   C*                    MOVELDDP02     DCC02
|   C*                    Z-ADD100       DDS05
|   C*                    Z-ADD100       CHKTOT
|   C*                    UPDATSFLSR
| 24*C*                    ELSE
|    C*SHARON DEL END************************************************
|   C*
| 25-C           CHKTOT    IFNE 0
| 25-C           CHKTOT    ANDNE100
|   C                     MOVEL'UMI0280' ERRID
|   C                     MOVEL'CEMF'    ERRF
|   C                     SETON                     6499
| 25-C                     END
| 24-C*                    END
|    C   99                GOTO E3B00
|    C*
17===C           E3B00     ENDSR
     C*==============================================================*
     C*          R3B10 ....'SC03' CHECK - SFL DETAIL
     C*==============================================================*
18===C           R3B10     BEGSR
|    C*成本中心
|    C*                    MOVE *BLANK    DCC02
| 01-C*          RRN       IFEQ 1
|   C*          DDS04     ANDEQ*BLANK
|   C*                    MOVELDEM04     DDS04
| 01-C*                    END
|    C*
| 02-C*          DDS04     IFNE *BLANKS
|   C*                    MOVELDDS04     KCC01
    C*          KEYCC     CHAINCC0                  40
| 03-C*          *IN40     IFEQ '1'
|   C*                    MOVEL'UPT2010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6399
| 03-C*                    END
|   C*  99                GOTO E3B10
|   C*
|   C*                    MOVE CC02      DCC02
| 02-C*                    END
|    C*分攤比例
| 04-C*          RRN       IFEQ 1
|   C*          DDS05     ANDEQ0
|   C*                    Z-ADD100       DDS05
| 04-C*                    END
|    C*
|    C*                    ADD  DDS05     CHKTOT
|    C*
18===C           E3B10     ENDSR
     C*==============================================================*
     C*          R3E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
19===C           R3E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*--------------------------------------------------------------**
|    C*部門代號
| 01-C           #FLD      IFEQ 'DEM04'
|   C                     CALL 'PYI512'
|   C           DEM04     PARM DEM04     I512I1  7
|   C                     PARM           @RTNC   2
|   C                     MOVELDEM04     KEM04
|   C           KEYDP     CHAINDP0                  40
|   C   40                MOVEL*BLANK    DDP02
|   C  N40                MOVELDP02      DDP02
| 01-C                     END
|    C*--------------------------------------------------------------**
|    C*工作地點
| 01-C*          #FLD      IFEQ 'DEM130'
|   C*                    CALL 'PTI121'
|   C*                    PARM 'EM041   'P120I1 10
|   C*          DEM130    PARM DEM130    P120O1 10
|   C*                    MOVELDEM130    KEM04
|   C*          KEYDP     CHAINDP0                  40
|   C*  40                MOVEL*BLANK    D130N
|   C* N40                MOVELDP02      D130N
| 01-C*                    END
|    C*--------------------------------------------------------------**
|    C*職稱代號
| 03-C           #FLD      IFEQ 'DEM05'
|   C                     CALL 'PYI501'
|   C           DEM05     PARM DEM05     I501I1  3
|   C                     PARM           @RTNC   2
|   C           DEM05     CHAINJT0                  42
|   C   42                MOVE *BLANK    DJT02
|   C  N42                MOVELJT02      DJT02
| 03-C                     END
|    C*--------------------------------------------------------------**
|    C*副職稱代號一
| 04-C           #FLD      IFEQ 'DEM051'
|   C                     CALL 'PYI501'
|   C           DEM051    PARM DEM051    I501I1  3
|   C                     PARM           @RTNC   2
|   C           DEM051    CHAINJT0                  42
|   C   42                MOVE *BLANK    DJT021
|   C  N42                MOVELJT02      DJT021
| 04-C                     END
|    C*--------------------------------------------------------------**
|    C*副職稱代號二
| 05-C           #FLD      IFEQ 'DEM134'
|   C                     CALL 'PYI501'
|   C           DEM134    PARM DEM134    I501I1  3
|   C                     PARM           @RTNC   2
|   C           DEM134    CHAINJT0                  42
|   C   42                MOVE *BLANK    DJT022
|   C  N42                MOVELJT02      DJT022
| 05-C                     END
|    C*--------------------------------------------------------------**
|    C*職等職級
| 06-C           #FLD      IFEQ 'DEM06'
|   C           #FLD      OREQ 'DEM07'
|   C                     CALL 'PYI505'
|   C           DEM06     PARM DEM06     I505I1  2
|   C           DEM07     PARM DEM07     I505I2  30
|   C                     PARM           @RTNC   2
| 06-C                     END
|    C*-------------------------------------------------------------***
|    C* SFL DETAIL
| 07-C*          #LIN      IFLT @SFTOP
|   C*          #LIN      ORGT @SFBOT
|   C*                    GOTO E3E00
| 07-C*                    END
|    C* GET SFL REC
|    C*          #LIN      SUB  @SFTOP    @PRRN
|    C*          @PRRN     DIV  @LNUM     @PRRN
|    C*                    MVR            @LINE   20
|    C*
|    C*                    ADD  1         @LINE            .明細行
|    C*                    ADD  #DRRN     @PRRN            .PROMPT RRN
|    C*          @PRRN     CHAINSFLSR                40
|    C*  40                GOTO E3E00
|    C*
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* << SFLSR FIELD >>
| 08-C*          #FLD      IFEQ 'DDS04'
|   C*                    CALL 'PYI513'
|   C*          DDS04     PARM DDS04     I513I1  5
|   C*                    PARM           @RTNC   2
| 08-C*                    END
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* UPD SFL
|    C*                    SETON                     54
|    C*                    UPDATSFLSR
|    C*
19===C           E3E00     ENDSR
     C*==============================================================*
     C*          R4000  ...'SC04' SCREEN MAIN ROUTINE
     C*==============================================================*
20===C           R4000     BEGSR
|    C*
|    C*                    EXFMTDSPD4
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E4000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
| 03-C           DOPT      IFEQ 1
|   C           DOPT      OREQ 2
|   C                     EXSR R4E00
| 03-C                     END
|   C                     GOTO E4000
| 02-C                     END
|    C*
| 04-C           *IN12     IFEQ '1'
|   C                     MOVEL'SC03'    SCID
|   C                     GOTO E4000
| 04-C                     END
|    C*
| 05-C           DOPT      IFEQ 1
|   C           DOPT      OREQ 2
|   C                     EXSR R4B00                      *SCR CHK
| 05-C                     END
|    C*
| 06-C           *IN99     IFEQ '0'
|   C                     MOVEL'SC05'    SCID             *SCR2
| 06-C                     END
|    C*
20===C           E4000     ENDSR
     C*==============================================================*
     C*          R4B00 ....CHECK 'SC04' SCREEN
     C*==============================================================*
21===C           R4B00     BEGSR
|    C*
|    C*上下班不刷卡者，固定班表可為空白。
| 01-C*          DEM106    IFEQ 'Y'
|   C*班　　表
| 02-C*          DEM104    IFEQ 'N'
| 03-C*          DM081     IFEQ *BLANK
|   C*                    MOVEL'UPT0010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6499
| 03*C*                    ELSE
|   C*          KEYT1     CHAINT10                  40
| 04-C*          *IN40     IFEQ '1'
|   C*                    MOVEL'UPT2010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6499
| 04-C*                    END
|   C*  99                GOTO E4B00
| 03-C*                    END
| 02-C*                    END
|   C*911210              ELSE
|   C*911210    DEM104    IFEQ 'N'
|   C*911210    DM081     ANDNE*BLANK
|   C*911210              MOVEL'UPT0011' ERRID
|   C*911210              MOVEL'PTMF'    ERRF
|   C*911210              SETON                     6499
|   C*911210              END
|   C*  99                GOTO E4B00
| 01-C*                    END
|    C*
| 05-C*          DEM104    IFEQ 'Y'
|   C*          DM081     ANDNE*BLANK
|   C*                    MOVEL'UPT0011' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6499
| 05-C*                    END
|    C*  99                GOTO E4B00
|    C*
|    C*輪班班表   MODIFY BY EVA 880813
|    C*          DEM104    IFEQ 'N'
|    C*          DEM105    IFNE *BLANK
|    C*                    MOVEL'UPT0011' ERRID
|    C*                    MOVEL'PTMF'    ERRF
|    C*                    SETON                     6099
|    C*                    END
|    C*                    ELSE
|    C*          DEM105    IFEQ *BLANK
|    C*                    MOVEL'UPT0010' ERRID
|    C*                    MOVEL'PTMF'    ERRF
|    C*                    SETON                     6099
|    C*                    END
|    C*                    END
|    C*  99                GOTO E4B00
|    C*月休休假
|    C*          DEM107    IFEQ 'N'
|    C*          DEM108    IFNE *ZERO
|    C*                    MOVEL'UPT0011' ERRID
|    C*                    MOVEL'PTMF'    ERRF
|    C*                    SETON                     6199
|    C*                    END
|    C*                    ELSE
|    C*          DEM108    IFEQ *ZERO
|    C*                    MOVEL'UPT0010' ERRID
|    C*                    MOVEL'PTMF'    ERRF
|    C*                    SETON                     6199
|    C*                    END
|    C*                    END
|    C*  99                GOTO E4B00
|    C********************************************************* EVA
     C*全勤獎金
0001 C*          DEM100    IFEQ '1'
0001 C*          DEM100    OREQ '3'
0001 C           DEM100    IFEQ '3'
|    C*          DEM12     IFEQ '1'
|    C*          DEM12     IFEQ '1'
|    C**         DEM121    IFEQ *ZERO
|    C**         DEM122    OREQ *ZERO
|    C**         DEM123    OREQ *ZERO
|    C                     MOVEL'UPT1003' ERRID
|    C                     MOVEL'PTMF'    ERRF
|    C                     SETON                     6599
|    C                     END
     C*                    END
|    C   99                GOTO E4B00
     C*
     C*          DEM100    IFEQ '2'
|    C*          DEM12     IFEQ 'N'
|    C*          DEM12     IFEQ '1'
|    C*          DEM124    IFNE *ZERO
|    C*          DEM125    IFNE *ZERO
|    C*          DEM126    ORNE *ZERO
|    C*                    MOVEL'UPT1003' ERRID
|    C*                    MOVEL'PTMF'    ERRF
|    C*                    SETON                     6599
|    C*                    END
     C*                    END
|    C*  99                GOTO E4B00
|    C*                    ELSE
|    C*          DEM124    IFEQ *ZERO
|    C*          DEM125    IFNE *ZERO
|    C*          DEM126    ORNE *ZERO
|    C*                    MOVEL'UPT0010' ERRID
|    C*                    MOVEL'PTMF'    ERRF
|    C*                    SETON                     6499
|    C*                    END
     C*                    END
|    C*  99                GOTO E4B00
|    C*
|    C**         DEM121    IFNE *ZERO
|    C**         DEM122    ORNE *ZERO
|    C**         DEM123    ORNE *ZERO
|    C**                   MOVEL'UPT0011' ERRID
|    C**                   MOVEL'PTMF'    ERRF
|    C**                   SETON                     6399
|    C**                   END
|    C** 99                GOTO E4B00
|    C**                   END
|    C**                   END
|    C*所得扣繳
| 06-C           DEM101    IFNE '4'
| 07-C           DEM102    IFNE *ZERO
|   C                     MOVEL'UPT0011' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 07-C                     END
| 06*C                     ELSE
| 08-C           DEM102    IFEQ *ZERO
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 08-C                     END
| 06-C                     END
|    C   99                GOTO E4B00
|    C*
|    C*工作類別
| 09-C*          DEM111    IFEQ *BLANK
|   C*                    MOVEL'UPT0010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6399
| 09*C*                    ELSE
|   C*                    MOVEL*BLANK    W#Y01
|   C*                    MOVEL*BLANK    W#Y02
|   C*                    MOVEL'EM111'   W#Y01
|   C*                    MOVELDEM111    W#Y02
|   C*          KEY#Y     CHAINPT#YPF               40
| 10-C*          *IN40     IFEQ '1'
|   C*                    MOVEL'UPT2010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6399
| 10*C*                    ELSE
|   C*                    MOVEL#Y03      EM111N
| 10-C*                    END
| 09-C*                    END
|    C*  99                GOTO E4B00
|    C*
| 05-C*          DCA03     IFEQ 'Y'
| 05-C*          DCA04     ANDEQ*BLANKS
|   C*                    MOVEL'UPT0010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     7599
| 05-C*                    END
|    C*  99                GOTO E4B00
|    C*
| 05-C*          DCA03     IFEQ 'N'
| 05-C*          DCA04     ANDNE*BLANKS
|   C*                    MOVEL'CPF5223' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     7599
| 05-C*                    END
|    C*  99                GOTO E4B00
|    C*
     C*                    END
     C*                    END
21===C           E4B00     ENDSR
     C*==============================================================*
     C*          R4E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
22===C           R4E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*--------------------------------------------------------------**
|    C*工作類別
| 01-C*          #FLD      IFEQ 'DEM111'
|   C*                    CALL 'TRW001'
|   C*                    PARM 'EM111'   TR101I 10
|   C*          DEM111    PARM DEM111    TR102I 10
|   C*                    PARM           TR103I 32
|   C*                    PARM           TR104I  2
|   C*
|   C*                    MOVEL*BLANK    EM111N 10 P
| 02-C*          TR103I    IFNE *BLANK
|   C*                    CALL 'P65'
|   C*                    PARM TR103I    P6501I 80
|   C*                    PARM 10        P6502I  30
|   C*          EM111N    PARM           P6511O 80        工作說明
|   C*                    PARM           P6512O 80
| 02-C*                    END
| 01-C*                    END
|    C*--------------------------------------------------------------**
|    C*部門代號
| 03-C*          #FLD      IFEQ 'DM081'
|   C*                    CALL 'PYI506'
|   C*          DM081     PARM DM081     P001I1  2
|   C*                    PARM           @RTNC   2
| 03-C*                    END
|    C*--------------------------------------------------------------**
|    C*
22===C           E4E00     ENDSR
     C*==============================================================*
     C*          R5000  ...'SC05' SCREEN MAIN ROUTINE
     C*==============================================================*
23===C           R5000     BEGSR
|    C*
|    C                     EXFMTDSPD5
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E5000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
| 03-C           DOPT      IFEQ 1
|   C           DOPT      OREQ 2
|   C                     EXSR R5E00
| 03-C                     END
|   C                     GOTO E5000
| 02-C                     END
|    C*
| 04-C           *IN12     IFEQ '1'
|   C                     MOVEL'SC03'    SCID
|   C                     GOTO E5000
| 04-C                     END
|    C*
|    C                     EXSR R5B00                      *SCR CHK
|    C*
| 05-C           *IN99     IFEQ '0'
|   C                     EXSR R5D00                      *SCR CHK
|   C                     MOVEL'SC01'    SCID             *SCR2
| 05-C                     END
|    C*
|    C*退休金主檔維護作業
| 06-C*          DOPT      IFEQ 1
|   C*                    CALL 'PYH101'
| 06-C*                    END
23===C           E5000     ENDSR
     C*==============================================================*
     C*          R5B00 ....CHECK 'SC05' SCREEN
     C*==============================================================*
24===C           R5B00     BEGSR
|    C*
| 01-C*          DEM93     IFEQ *BLANK
|   C*                    MOVEL'UPT0010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6099
| 01*C*                    ELSE
|   C*                    MOVEL*BLANK    W#Y01
|   C*                    MOVEL*BLANK    W#Y02
|   C*                    MOVEL'EM93'    W#Y01
|   C*                    MOVELDEM93     W#Y02
|   C*          KEY#Y     CHAINPT#YPF               40
| 02-C*          *IN40     IFEQ '1'
|   C*                    MOVEL'UPT2010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6099
| 02*C*                    ELSE
|   C*                    MOVEL#Y03      EM93N
| 02-C*                    END
| 01-C*                    END
|    C*  99                GOTO E5B00
|    C*
|    C*學校名稱(1)
| 03-C           DEM60     IFEQ *BLANK
|   C                     MOVEL*BLANK    DEM61
|   C                     Z-ADD0         DEM62
|   C                     Z-ADD0         DEM63
|   C                     MOVEL*BLANK    DEM64
| 03-C                     END
|    C*
|    C*學校名稱(2)
| 04-C           DEM65     IFEQ *BLANK
|   C                     MOVEL*BLANK    DEM66
|   C                     Z-ADD0         DEM67
|   C                     Z-ADD0         DEM68
|   C                     MOVEL*BLANK    DEM69
| 04-C                     END
|    C*
|    C*學校名稱(3)
| 05-C           DEM70     IFEQ *BLANK
|   C                     MOVEL*BLANK    DEM71
|   C                     Z-ADD0         DEM72
|   C                     Z-ADD0         DEM73
|   C                     MOVEL*BLANK    DEM74
| 05-C                     END
|    C*
|    C*入校年月(1)
| 06-C           DEM62     IFNE 0
|   C                     CALL 'P38'
|   C                     PARM DEM62     P3801I  60
|   C                     PARM '1'       P3802I  1
|   C                     PARM '1'       P3803I  1
|   C           WEM62     PARM           P3801O  60
|   C                     PARM           P3811O  1
| 07-C           P3811O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 07-C                     END
|   C   99                GOTO E5B00
|   C*
|   C*                    CALL 'P39'
|   C*                    PARM DEM62     P3901I  60
|   C*                    PARM DFMT      P3902I  1
|   C*                    PARM DTYPE     P3903I  1
|   C*                    PARM '2'       P3904I  1
|   C*                    PARM '1'       P3905I  1
|   C*                    PARM           P3911O  60
|   C*                    Z-ADDP3911O    WEM62
| 06*C                     ELSE
|   C                     Z-ADD0         WEM62
| 06-C                     END
|    C*入校年月（２）
| 08-C           DEM67     IFNE 0
|   C                     CALL 'P38'
|   C                     PARM DEM67     P3801I  60
|   C                     PARM '1'       P3802I  1
|   C                     PARM '1'       P3803I  1
|   C           WEM67     PARM           P3801O  60
|   C                     PARM           P3811O  1
| 09-C           P3811O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 09-C                     END
|   C   99                GOTO E5B00
|   C*
|   C*                    CALL 'P39'
|   C*                    PARM DEM67     P3901I  60
|   C*                    PARM DFMT      P3902I  1
|   C*                    PARM DTYPE     P3903I  1
|   C*                    PARM '2'       P3904I  1
|   C*                    PARM '1'       P3905I  1
|   C*                    PARM           P3911O  60
|   C*                    Z-ADDP3911O    WEM67
| 08*C                     ELSE
|   C                     Z-ADD0         WEM67
| 08-C                     END
|    C*
|    C*入校年月（３）
| 10-C           DEM72     IFNE 0
|   C                     CALL 'P38'
|   C                     PARM DEM72     P3801I  60
|   C                     PARM '1'       P3802I  1
|   C                     PARM '1'       P3803I  1
|   C           WEM72     PARM           P3801O  60
|   C                     PARM           P3811O  1
| 11-C           P3811O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 11-C                     END
|   C   99                GOTO E5B00
|   C*
|   C*                    CALL 'P39'
|   C*                    PARM DEM72     P3901I  60
|   C*                    PARM DFMT      P3902I  1
|   C*                    PARM DTYPE     P3903I  1
|   C*                    PARM '2'       P3904I  1
|   C*                    PARM '1'       P3905I  1
|   C*                    PARM           P3911O  60
|   C*                    Z-ADDP3911O    WEM72
| 10*C                     ELSE
|   C                     Z-ADD0         WEM72
| 10-C                     END
|    C*離校年月（1 )
| 12-C           DEM63     IFNE 0
|   C                     CALL 'P38'
|   C                     PARM DEM63     P3801I  60
|   C                     PARM '1'       P3802I  1
|   C                     PARM '1'       P3803I  1
|   C           WEM63     PARM           P3801O  60
|   C                     PARM           P3811O  1
| 13-C           P3811O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 13-C                     END
|   C   99                GOTO E5B00
|   C*
|   C*                    CALL 'P39'
|   C*                    PARM DEM63     P3901I  60
|   C*                    PARM DFMT      P3902I  1
|   C*                    PARM DTYPE     P3903I  1
|   C*                    PARM '2'       P3904I  1
|   C*                    PARM '1'       P3905I  1
|   C*                    PARM           P3911O  60
|   C*                    Z-ADDP3911O    WEM63
| 12*C                     ELSE
|   C                     Z-ADD0         WEM63
| 12-C                     END
|    C*離校年月（2 )
| 14-C           DEM68     IFNE 0
|   C                     CALL 'P38'
|   C                     PARM DEM68     P3801I  60
|   C                     PARM '1'       P3802I  1
|   C                     PARM '1'       P3803I  1
|   C           WEM68     PARM           P3801O  60
|   C                     PARM           P3811O  1
| 15-C           P3811O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 15-C                     END
|   C   99                GOTO E5B00
|   C*
|   C*                    CALL 'P39'
|   C*                    PARM DEM68     P3901I  60
|   C*                    PARM DFMT      P3902I  1
|   C*                    PARM DTYPE     P3903I  1
|   C*                    PARM '2'       P3904I  1
|   C*                    PARM '1'       P3905I  1
|   C*                    PARM           P3911O  60
|   C*                    Z-ADDP3911O    WEM68
| 14*C                     ELSE
|   C                     Z-ADD0         WEM68
| 14-C                     END
|    C*離校年月（3 )
| 16-C           DEM73     IFNE 0
|   C                     CALL 'P38'
|   C                     PARM DEM73     P3801I  60
|   C                     PARM '1'       P3802I  1
|   C                     PARM '1'       P3803I  1
|   C           WEM73     PARM           P3801O  60
|   C                     PARM           P3811O  1
| 17-C           P3811O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 17-C                     END
|   C   99                GOTO E5B00
|   C*
|   C*                    CALL 'P39'
|   C*                    PARM DEM73     P3901I  60
|   C*                    PARM DFMT      P3902I  1
|   C*                    PARM DTYPE     P3903I  1
|   C*                    PARM '2'       P3904I  1
|   C*                    PARM '1'       P3905I  1
|   C*                    PARM           P3911O  60
|   C*                    Z-ADDP3911O    WEM73
| 16*C                     ELSE
|   C                     Z-ADD0         WEM73
| 16-C                     END
|    C*任職年月（1 )
| 18-C           DEM77     IFNE 0
|   C                     CALL 'P38'
|   C                     PARM DEM77     P3801I  60
|   C                     PARM '1'       P3802I  1
|   C                     PARM '1'       P3803I  1
|   C           WEM77     PARM           P3801O  60
|   C                     PARM           P3811O  1
| 19-C           P3811O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 19-C                     END
|   C   99                GOTO E5B00
|   C*
|   C*                    CALL 'P39'
|   C*                    PARM DEM77     P3901I  60
|   C*                    PARM DFMT      P3902I  1
|   C*                    PARM DTYPE     P3903I  1
|   C*                    PARM '2'       P3904I  1
|   C*                    PARM '1'       P3905I  1
|   C*                    PARM           P3911O  60
|   C*                    Z-ADDP3911O    WEM77
| 18*C                     ELSE
|   C                     Z-ADD0         WEM77
| 18-C                     END
|    C*任職年月（2 )
| 20-C           DEM81     IFNE 0
|   C                     CALL 'P38'
|   C                     PARM DEM81     P3801I  60
|   C                     PARM '1'       P3802I  1
|   C                     PARM '1'       P3803I  1
|   C           WEM81     PARM           P3801O  60
|   C                     PARM           P3811O  1
| 21-C           P3811O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 21-C                     END
|   C   99                GOTO E5B00
|   C*
|   C*                    CALL 'P39'
|   C*                    PARM DEM81     P3901I  60
|   C*                    PARM DFMT      P3902I  1
|   C*                    PARM DTYPE     P3903I  1
|   C*                    PARM '2'       P3904I  1
|   C*                    PARM '1'       P3905I  1
|   C*                    PARM           P3911O  60
|   C*                    Z-ADDP3911O    WEM81
| 20*C                     ELSE
|   C                     Z-ADD0         WEM81
| 20-C                     END
|    C*任職年月（3 )
| 22-C           DEM85     IFNE 0
|   C                     CALL 'P38'
|   C                     PARM DEM85     P3801I  60
|   C                     PARM '1'       P3802I  1
|   C                     PARM '1'       P3803I  1
|   C           WEM85     PARM           P3801O  60
|   C                     PARM           P3811O  1
| 23-C           P3811O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 23-C                     END
|   C   99                GOTO E5B00
|   C*
|   C*                    CALL 'P39'
|   C*                    PARM DEM85     P3901I  60
|   C*                    PARM DFMT      P3902I  1
|   C*                    PARM DTYPE     P3903I  1
|   C*                    PARM '2'       P3904I  1
|   C*                    PARM '1'       P3905I  1
|   C*                    PARM           P3911O  60
|   C*                    Z-ADDP3911O    WEM85
| 22*C                     ELSE
|   C                     Z-ADD0         WEM85
| 22-C                     END
|    C*離職年月（1 )
| 24-C           DEM78     IFNE 0
|   C                     CALL 'P38'
|   C                     PARM DEM78     P3801I  60
|   C                     PARM '1'       P3802I  1
|   C                     PARM '1'       P3803I  1
|   C           WEM78     PARM           P3801O  60
|   C                     PARM           P3811O  1
| 25-C           P3811O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 25-C                     END
|   C   99                GOTO E5B00
|   C*
|   C*                    CALL 'P39'
|   C*                    PARM DEM78     P3901I  60
|   C*                    PARM DFMT      P3902I  1
|   C*                    PARM DTYPE     P3903I  1
|   C*                    PARM '2'       P3904I  1
|   C*                    PARM '1'       P3905I  1
|   C*                    PARM           P3911O  60
|   C*                    Z-ADDP3911O    WEM78
| 24*C                     ELSE
|   C                     Z-ADD0         WEM78
| 24-C                     END
|    C*離職年月（2 )
| 26-C           DEM82     IFNE 0
|   C                     CALL 'P38'
|   C                     PARM DEM82     P3801I  60
|   C                     PARM '1'       P3802I  1
|   C                     PARM '1'       P3803I  1
|   C           WEM82     PARM           P3801O  60
|   C                     PARM           P3811O  1
| 27-C           P3811O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 27-C                     END
|   C   99                GOTO E5B00
|   C*
|   C*                    CALL 'P39'
|   C*                    PARM DEM82     P3901I  60
|   C*                    PARM DFMT      P3902I  1
|   C*                    PARM DTYPE     P3903I  1
|   C*                    PARM '2'       P3904I  1
|   C*                    PARM '1'       P3905I  1
|   C*                    PARM           P3911O  60
|   C*                    Z-ADDP3911O    WEM82
| 26*C                     ELSE
|   C                     Z-ADD0         WEM82
| 26-C                     END
|    C*離職年月（3 )
| 28-C           DEM86     IFNE 0
|   C                     CALL 'P38'
|   C                     PARM DEM86     P3801I  60
|   C                     PARM '1'       P3802I  1
|   C                     PARM '1'       P3803I  1
|   C           WEM86     PARM           P3801O  60
|   C                     PARM           P3811O  1
| 29-C           P3811O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6699
| 29-C                     END
|   C   99                GOTO E5B00
|   C*
|   C*                    CALL 'P39'
|   C*                    PARM DEM86     P3901I  60
|   C*                    PARM DFMT      P3902I  1
|   C*                    PARM DTYPE     P3903I  1
|   C*                    PARM '2'       P3904I  1
|   C*                    PARM '1'       P3905I  1
|   C*                    PARM           P3911O  60
|   C*                    Z-ADDP3911O    WEM86
| 28*C                     ELSE
|   C                     Z-ADD0         WEM86
| 28-C                     END
|    C*
|    C*個人專長                                      EVA
| 30-C           DEM87A    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM87'    W#Y01
|   C                     MOVELDEM87A    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 31-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6799
| 31-C                     END
| 30-C                     END
|    C   99                GOTO E5B00
|    C*
| 32-C           DEM87B    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM87'    W#Y01
|   C                     MOVELDEM87B    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 33-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6799
| 33-C                     END
| 32-C                     END
|    C   99                GOTO E5B00
|    C*
| 34-C           DEM87C    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM87'    W#Y01
|   C                     MOVELDEM87C    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 35-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6799
| 35-C                     END
| 34-C                     END
|    C   99                GOTO E5B00
|    C*
| 36-C           DEM87D    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM87'    W#Y01
|   C                     MOVELDEM87D    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 37-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6799
| 37-C                     END
| 36-C                     END
|    C   99                GOTO E5B00
|    C*
| 38-C           DEM87E    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM87'    W#Y01
|   C                     MOVELDEM87E    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 39-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6799
| 39-C                     END
| 38-C                     END
|    C   99                GOTO E5B00
|    C*
| 40-C           DEM89A    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM87'    W#Y01
|   C                     MOVELDEM89A    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 41-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6899
| 41-C                     END
| 40-C                     END
|    C   99                GOTO E5B00
|    C*
| 42-C           DEM89B    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM87'    W#Y01
|   C                     MOVELDEM89B    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 43-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6899
| 43-C                     END
| 42-C                     END
|    C   99                GOTO E5B00
|    C*
| 44-C           DEM89C    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM87'    W#Y01
|   C                     MOVELDEM89C    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 45-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6899
| 45-C                     END
| 44-C                     END
|    C   99                GOTO E5B00
|    C*
| 46-C           DEM89D    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM87'    W#Y01
|   C                     MOVELDEM89D    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 47-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6899
| 47-C                     END
| 46-C                     END
|    C   99                GOTO E5B00
|    C*
| 48-C           DEM89E    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM87'    W#Y01
|   C                     MOVELDEM89E    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 49-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6899
| 49-C                     END
| 48-C                     END
|    C   99                GOTO E5B00
|    C*
| 50-C           DEM91A    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM87'    W#Y01
|   C                     MOVELDEM91A    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 51-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6999
| 51-C                     END
| 50-C                     END
|    C   99                GOTO E5B00
|    C*
| 52-C           DEM91B    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM87'    W#Y01
|   C                     MOVELDEM91B    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 53-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6999
| 53-C                     END
| 52-C                     END
|    C   99                GOTO E5B00
|    C*
| 54-C           DEM91C    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM87'    W#Y01
|   C                     MOVELDEM91C    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 55-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6999
| 55-C                     END
| 54-C                     END
|    C   99                GOTO E5B00
|    C*
| 56-C           DEM91D    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM87'    W#Y01
|   C                     MOVELDEM91D    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 57-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6999
| 57-C                     END
| 56-C                     END
|    C   99                GOTO E5B00
|    C*
| 58-C           DEM91E    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM87'    W#Y01
|   C                     MOVELDEM91E    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 59-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6999
| 59-C                     END
| 58-C                     END
|    C   99                GOTO E5B00
|    C*語文1
| 60-C           DEM88A    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM88'    W#Y01
|   C                     MOVELDEM88A    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 61-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7099
| 61-C                     END
| 60-C                     END
|    C   99                GOTO E5B00
|    C*
| 62-C           DEM88B    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM88'    W#Y01
|   C                     MOVELDEM88B    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 63-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7099
| 63-C                     END
| 62-C                     END
|    C   99                GOTO E5B00
|    C*
| 64-C           DEM88C    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM88'    W#Y01
|   C                     MOVELDEM88C    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 65-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7099
| 65-C                     END
| 64-C                     END
|    C   99                GOTO E5B00
|    C*
| 66-C           DEM88D    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM88'    W#Y01
|   C                     MOVELDEM88D    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 67-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7099
| 67-C                     END
| 66-C                     END
|    C   99                GOTO E5B00
|    C*
| 68-C           DEM88E    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM88'    W#Y01
|   C                     MOVELDEM88E    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 69-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7099
| 69-C                     END
| 68-C                     END
|    C   99                GOTO E5B00
|    C*
|    C*語文2
| 70-C           DEM90A    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM88'    W#Y01
|   C                     MOVELDEM90A    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 71-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7199
| 71-C                     END
| 70-C                     END
|    C   99                GOTO E5B00
|    C*
| 72-C           DEM90B    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM88'    W#Y01
|   C                     MOVELDEM90B    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 73-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7199
| 73-C                     END
| 72-C                     END
|    C   99                GOTO E5B00
|    C*
| 74-C           DEM90C    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM88'    W#Y01
|   C                     MOVELDEM90C    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 75-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7199
| 75-C                     END
| 74-C                     END
|    C   99                GOTO E5B00
|    C*
| 76-C           DEM90D    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM88'    W#Y01
|   C                     MOVELDEM90D    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 77-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7199
| 77-C                     END
| 76-C                     END
|    C   99                GOTO E5B00
|    C*
| 78-C           DEM90E    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM88'    W#Y01
|   C                     MOVELDEM90E    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 79-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7199
| 79-C                     END
| 78-C                     END
|    C   99                GOTO E5B00
|    C*
|    C*語文3
| 80-C           DEM92A    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM88'    W#Y01
|   C                     MOVELDEM92A    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 81-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7299
| 81-C                     END
| 80-C                     END
|    C   99                GOTO E5B00
|    C*
| 82-C           DEM92B    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM88'    W#Y01
|   C                     MOVELDEM92B    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 83-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7299
| 83-C                     END
| 82-C                     END
|    C   99                GOTO E5B00
|    C*
| 84-C           DEM92C    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM88'    W#Y01
|   C                     MOVELDEM92C    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 85-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7299
| 85-C                     END
| 84-C                     END
|    C   99                GOTO E5B00
|    C*
| 86-C           DEM92D    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM88'    W#Y01
|   C                     MOVELDEM92D    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 87-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7299
| 87-C                     END
| 86-C                     END
|    C   99                GOTO E5B00
|    C*
| 88-C           DEM92E    IFNE *BLANK
|   C                     MOVEL*BLANK    W#Y01
|   C                     MOVEL*BLANK    W#Y02
|   C                     MOVEL'EM88'    W#Y01
|   C                     MOVELDEM92E    W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 89-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7299
| 89-C                     END
| 88-C                     END
|    C   99                GOTO E5B00
|    C*
24===C           E5B00     ENDSR
     C*==============================================================*
     C*          R5D00 ....FILE PROCESS
     C*==============================================================*
25===C           R5D00     BEGSR
|    C*
| 01-C           DOPT      CASEQ1         R5D10
|   C           DOPT      CASEQ2         R5D20
|   C           DOPT      CASEQ4         R5D30
| 01-C                     END
|    C*
25===C                     ENDSR
     C*==============================================================*
     C*          R5D10 ....FILE PROCESS : ADD
     C*==============================================================*
26===C           R5D10     BEGSR
|    C*人事
|    C                     EXSR R5D11
|    C                     WRITEEM0
     C                     WRITECA0
|    C*休假
|    C                     EXSR R5D13
|    C                     WRITELT0
|    C*
|    C                     EXSR R5D14
|    C*成本分攤
|    C*                    Z-ADD*ZERO     DS03
|    C*                    READCSFLSR                    57
| 01-C*          *IN57     DOWEQ'0'
| 02-C*          DDS04     IFNE *BLANK
|   C*                    EXSR R5D15
|   C*                    WRITEDS0
| 02-C*                    END
|   C*                    READCSFLSR                    57
| 01-C*                    END
|    C*
26===C                     ENDSR
     C*==============================================================*
     C*          R5D11 ....SAVE DATA
     C*==============================================================*
27===C           R5D11     BEGSR
|    C*
| 01-C           DOPT      IFEQ 1
|   C           DEM02     ANDEQ*BLANK                     ADD BY JADI
|   C                     EXSR R5D12
| 01-C                     END
|    C*
|    C                     MOVELDEM01     EM01
|    C                     MOVELDEM02     EM02
|    C                     MOVELDEM03     EM03
|    C                     MOVELDEM031    EM031
|    C                     MOVELDEM04     EM04
|    C                     MOVELDEM05     EM05
|    C                     MOVELDEM051    EM051
|    C                     MOVELDEM134    EM134
|    C                     MOVELDEM06     EM06
|    C                     Z-ADDDEM07     EM07
|    C**                   MOVELDEM08     EM08
|    C*                    MOVELDEM09     EM09
|    C*                    MOVELDEM10     EM10
|    C                     MOVELDEM11     EM11
|    C*                    MOVELDEM12     EM12
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM WEM13     P3101I  80
|    C*                    PARM DFMT      P3102I  1
|    C*                    PARM DTYPE     P3103I  1
|    C*                    PARM '2'       P3104I  1
|    C*                    PARM '1'       P3105I  1
|    C*                    PARM           P3111O  80
|    C                     Z-ADDWEM13     EM13             到職日期
|    C*
|    C                     CALL 'P31'
|    C                     PARM WEM20     P3101I  80
|    C                     PARM DFMT      P3102I  1
|    C                     PARM DTYPE     P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C                     PARM           P3111O  80
|    C                     Z-ADDP3111O    EM20
|    C*
|    C                     CALL 'P37'
|    C                     PARM EM13      P3701I  80
|    C                     PARM '2'       P3702I  1
|    C                     PARM '1'       P3703I  1
|    C                     PARM 90        P3704I  40
|    C                     PARM           P3701O  80
|    C                     Z-ADDP3701O    EM20
|    C*
|    C*                    MOVE DEM24     EM24
|    C*                    MOVELDEM25     EM25
|    C                     Z-ADDDEM26     EM26
|    C*                    Z-ADDDEM27     EM27
|    C                     MOVELDEM30     EM30
|    C                     MOVELDEM31     EM31
|    C                     MOVELDEM311    EM311
|    C                     MOVELDEM32     EM32
|    C                     MOVELDEM321    EM321
|    C*
|    C                     Z-ADDWEM33     EM33             出生日期
|    C*
|    C                     MOVELDEM34     EM34
|    C                     Z-ADDDEM35     EM35
|    C************         MOVELDEM36     EM36
|    C                     MOVELDEM37     EM37
|    C                     MOVELDEM38     EM38
|    C                     MOVELDM381     EM381
|    C                     MOVELDEM39     EM39
|    C                     MOVELDM391     EM391
|    C                     MOVELDEM40     EM40
|    C                     MOVELDEM401    EM401
|    C                     MOVELDEM41     EM41
|    C                     MOVELDEM42     EM42
|    C**                   MOVELDEM43     EM43
|    C**                   MOVELDEM431    EM431
|    C**                   MOVELDEM44     EM44
|    C                     MOVELDEM45     EM45
|    C                     MOVELDEM451    EM451
|    C                     MOVELDEM452    EM452
|    C**                   MOVELDEM46     EM46
|    C**                   MOVELDEM461    EM461
|    C**                   MOVELDEM47     EM47
|    C                     MOVELDEM60     EM60
|    C                     MOVELDEM61     EM61
|    C                     Z-ADDWEM62     EM62
|    C                     Z-ADDWEM63     EM63
|    C                     MOVELDEM64     EM64
|    C                     MOVELDEM65     EM65
|    C                     MOVELDEM66     EM66
|    C                     Z-ADDWEM67     EM67
|    C                     Z-ADDWEM68     EM68
|    C                     MOVELDEM69     EM69
|    C                     MOVELDEM70     EM70
|    C                     MOVELDEM71     EM71
|    C                     Z-ADDWEM72     EM72
|    C                     Z-ADDWEM73     EM73
|    C                     MOVELDEM74     EM74
|    C                     MOVELDEM75     EM75
|    C                     MOVELDEM76     EM76
|    C                     Z-ADDWEM77     EM77
|    C                     Z-ADDWEM78     EM78
|    C                     MOVELDEM79     EM79
|    C                     MOVELDEM80     EM80
|    C                     Z-ADDWEM81     EM81
|    C                     Z-ADDWEM82     EM82
|    C                     MOVELDEM83     EM83
|    C                     MOVELDEM84     EM84
|    C                     Z-ADDWEM85     EM85
|    C                     Z-ADDWEM86     EM86
|    C                     MOVELDEM87     EM87
|    C                     MOVELDEM88     EM88
|    C                     MOVELDEM89     EM89
|    C                     MOVELDEM90     EM90
|    C                     MOVELDEM91     EM91
|    C                     MOVELDEM92     EM92
|    C                     MOVELDEM93     EM93
|    C*
|    C                     CALL 'P31'
|    C                     PARM DEM951    P3101I  80
|    C                     PARM '1'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           EM951     PARM           P3111O  80
|    C*
|    C                     CALL 'P31'
|    C                     PARM DEM952    P3101I  80
|    C                     PARM '1'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           EM952     PARM           P3111O  80
|    C*
|    C                     Z-ADDDEM953    EM953
|    C                     MOVELDEM100    EM100            薪　制
|    C                     MOVELDEM101    EM101
|    C                     Z-ADDDEM102    EM102
|    C*                    MOVELDEM103    EM103
|    C*                    MOVELDEM104    EM104            班表
|    C*                    MOVELDM081     EM081            固定班表
|    C*                    MOVELDEM133    EM133
|    C**                   MOVELEM105A    EM105     P
|    C*                    MOVELDEM106    EM106
|    C**                   MOVELDEM107    EM107
|    C**                   Z-ADDDEM108    EM108
|    C*                    MOVELDEM109    EM109
|    C                     MOVELDEM110    EM110
|    C*                    MOVELDEM111    EM111
|    C**                   MOVELDEM112    EM112
|    C*                    Z-ADDWEM113    EM113            特休基準日
|    C                     MOVELDEM114    EM114
|    C                     Z-ADDDEM115    EM115
|    C                     Z-ADDDEM116    EM116
|    C                     Z-ADDDEM117    EM117
|    C                     MOVELDEM118    EM118
|    C                     MOVELDEM119    EM119
|    C                     MOVELDEM120    EM120
|    C*
|    C**                   Z-ADD*ZERO     KEM127  60
|    C**                   MOVE DEM127    KEM127
|    C**                   CALL 'P39'
|    C**                   PARM KEM127    P3901I  60
|    C**                   PARM '2'       P3902I  1
|    C**                   PARM '1'       P3903I  1
|    C**                   PARM '2'       P3904I  1
|    C**                   PARM '1'       P3905I  1
|    C**                   PARM           P3911O  60
|    C**                   Z-ADDP3911O    EM127            最近申報年月
|    C*
|    C**                   MOVELDEM128    EM128
|    C**                   MOVELDEM129    EM129
|    C*
| 02-C           DOPT      IFEQ 1
|   C                     MOVEL*BLANK    EM11
|   C                     Z-ADD0         EM14
|   C                     Z-ADD0         EM15
|   C                     Z-ADD0         EM16
|   C                     Z-ADD0         EM19
|   C                     Z-ADD0         EM23
|   C                     Z-ADD0         EM261
|   C                     Z-ADD0         EM28
|   C                     Z-ADD0         EM291
|   C                     Z-ADD0         EM292
|   C                     Z-ADD0         EM293
|   C                     Z-ADD0         EM294
|   C                     Z-ADD0         EM296
|   C                     Z-ADD0         EM297
|   C                     Z-ADD0         EM298
|   C                     Z-ADD0         EM299
|   C                     MOVE *BLANKS   EM94
| 02-C                     END
|    C*誠品
|    C**                   Z-ADDDEM121    EM121
|    C**                   Z-ADDDEM122    EM122
|    C**                   Z-ADDDEM123    EM123
|    C*                    Z-ADDDEM124    EM124
|    C*                    Z-ADDDEM125    EM125
|    C*                    Z-ADDDEM126    EM126
|    C*功學社
|    C*                    MOVELDEM130    EM130            工作地點
|    C*
|    C                     Z-ADD$A8YMD    EM97
|    C                     TIME           EM98
|    C                     MOVEL$USER     EM99
|    C*
|    C                     MOVELEM02      WEM02
|    C*-EASON              Z-ADDWM150     EM150            契約期滿日
|    C*
|    C*                    MOVELDM135     EM135            報稅地點
|    C                     MOVELDM136     EM136            E-MAIL
|    C*
27===C                     ENDSR
     C*==============================================================*
     C*          R5D12 ....SAVE DATA
     C*==============================================================*
28===C           R5D12     BEGSR
|    C*員工編號自動採番
|    C                     MOVELDEM01     NO01
|    C                     Z-ADD*ZERO     NO02
|    C           KEYNO     CHAINNO0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     ADD  1         NO03
|   C                     Z-ADD$A8YMD    NO97
|   C                     TIME           NO98
|   C                     MOVEL$USER     NO99
|   C                     UPDATNO0
| 01*C                     ELSE
|   C                     Z-ADD1         NO03
|   C                     Z-ADD$A8YMD    NO97
|   C                     TIME           NO98
|   C                     MOVEL$USER     NO99
|   C                     WRITENO0
| 01-C                     END
|    C*
|    C                     MOVELNO03      DEM02
|    C*
28===C                     ENDSR
     C*==============================================================*
     C*          R5D13 ....SAVE DATA
     C*==============================================================*
29===C           R5D13     BEGSR
|    C*
|    C                     MOVELDEM01     LT01
|    C                     MOVELDEM02     LT02
|    C                     Z-ADDYEAR      LT03
|    C                     Z-ADD*ZERO     LT10
|    C                     Z-ADD*ZERO     LT11
|    C                     Z-ADD*ZERO     LT12
|    C                     Z-ADD*ZERO     LT13
|    C                     Z-ADD*ZERO     LT14
|    C                     Z-ADD*ZERO     LT15
|    C                     Z-ADD*ZERO     LT16
|    C                     Z-ADD*ZERO     LT20
|    C                     Z-ADD*ZERO     LT21
|    C                     Z-ADD*ZERO     LT22
|    C                     Z-ADD*ZERO     LT23
|    C                     Z-ADD*ZERO     LT24
|    C                     Z-ADD*ZERO     LT25
|    C                     Z-ADD*ZERO     LT26
|    C*
|    C                     Z-ADD$A8YMD    LT97
|    C                     TIME           LT98
|    C                     MOVEL$USER     LT99
|    C*
29===C                     ENDSR
     C*==============================================================*
     C*          R5D14 ....SAVE DATA
     C*==============================================================*
30===C           R5D14     BEGSR
|    C*
|    C                     MOVELDEM01     LU01
|    C                     MOVELDEM02     LU02
|    C                     Z-ADDYEAR      LU03
|    C                     Z-ADD*ZERO     LU05
|    C                     Z-ADD*ZERO     LU06
|    C*
|    C                     Z-ADD$A8YMD    LU97
|    C                     TIME           LU98
|    C                     MOVEL$USER     LU99
|    C*
| 01-C                     DO   12        LU04
|   C                     WRITELU0
| 01-C                     END
|    C*
30===C                     ENDSR
     C*==============================================================*
     C*          R5D15 ... PYDSPF
     C*==============================================================*
31===C*          R5D15     BEGSR
|    C*
|    C*                    MOVELDEM01     DS01
|    C*                    MOVELDEM02     DS02
|    C*                    ADD  1         DS03
|    C*                    MOVELDDS041    DS041
|    C*                    MOVELDDS042    DS042
|    C*                    MOVELDDS043    DS043
|    C*                    Z-ADDDDS05     DS05
|    C*
|    C*                    Z-ADD$A8YMD    DS97
|    C*                    TIME           DS98
|    C*                    MOVEL$USER     DS99
|    C*
31===C*                    ENDSR
     C*==============================================================*
     C*          R5D20 ....FILE PROCESS : UPDATE
     C*==============================================================*
32===C           R5D20     BEGSR
|    C*人事
|    C                     EXSR R5D11
|    C                     UPDATEM0
     C*配車
     C*          KEYEM     CHAINCA0                  40
     C*          *IN40     IFEQ '0'
     C*          DCA03     IFEQ 'Y'
     C*                    MOVELDCA04     CA03
     C*                    UPDATCA0
     C*                    ELSE
     C*                    DELETCA0
     C*                    END
     C*                    ELSE
     C*          DCA03     IFEQ 'Y'
     C*                    MOVELDEM01     CA01
     C*                    MOVELDEM02     CA02
     C*                    MOVELDCA04     CA03
     C*                    WRITECA0
     C*                    END
     C*                    END
     C*
|    C*成本分攤
|    C*                    EXSR R5D31
|    C*
|    C*                    Z-ADD*ZERO     DS03
|    C*                    READCSFLSR                    57
| 01-C*          *IN57     DOWEQ'0'
| 02-C*          DDS04     IFNE *BLANK
|   C*                    EXSR R5D15
|   C*                    WRITEDS0
| 02-C*                    END
|   C*                    READCSFLSR                    57
| 01-C*                    END
|    C*
32===C                     ENDSR
     C*==============================================================*
     C*          R5D30 ....FILE PROCESS : DELETE
     C*==============================================================*
33===C           R5D30     BEGSR
|    C*人事
|    C                     DELETEM0
|    C*休假
|    C           KEYLT     CHAINLT0                  40
|    C  N40                DELETLT0
|    C*配車
|    C           KEYEM     CHAINCA0                  40
|    C  N40                DELETCA0
|    C*
|    C           KEYLT     SETLLLU0
|    C           KEYLT     READELU0                      41
| 01-C           *IN41     DOWEQ'0'
|   C                     DELETLU0
|   C           KEYLT     READELU0                      41
| 01-C                     END
|    C*成本分攤
|    C*                    EXSR R5D31
|    C*
33===C                     ENDSR
     C*==============================================================*
     C*          R5D31 ....FILE PROCESS : DELETE
     C*==============================================================*
34===C*          R5D31     BEGSR
|    C*成本分攤
|    C*          KEYEM     SETLLDS0
|    C*          KEYEM     READEDS0                      41
| 01-C*          *IN41     DOWEQ'0'
|   C*                    DELETDS0
|   C*          KEYEM     READEDS0                      41
| 01-C*                    END
|    C*
34===C*                    ENDSR
     C*==============================================================*
     C*          R5E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
35===C           R5E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*--------------------------------------------------------------**
|    C*學歷代碼
|    C                     MOVEL*BLANK    TR103I
| 01-C           #FLD      IFEQ 'DEM93'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM93'    TR101I 10
|   C           DEM93     PARM DEM93     TR102I 10
|   C           EM93N     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 01-C                     END
|    C*--------------------------------------------------------------**
|    C*個人專長
| 02-C           #FLD      IFEQ 'DEM87A'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM87'    TR101I 10
|   C           DEM87A    PARM DEM87A    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 02-C                     END
|    C*
| 03-C           #FLD      IFEQ 'DEM87B'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM87'    TR101I 10
|   C           DEM87B    PARM DEM87B    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 03-C                     END
|    C*
| 04-C           #FLD      IFEQ 'DEM87C'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM87'    TR101I 10
|   C           DEM87C    PARM DEM87C    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 04-C                     END
|    C*
| 05-C           #FLD      IFEQ 'DEM87D'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM87'    TR101I 10
|   C           DEM87D    PARM DEM87D    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 05-C                     END
|    C*
| 06-C           #FLD      IFEQ 'DEM87E'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM87'    TR101I 10
|   C           DEM87E    PARM DEM87E    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 06-C                     END
|    C*
| 07-C           #FLD      IFEQ 'DEM89A'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM87'    TR101I 10
|   C           DEM89A    PARM DEM89A    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 07-C                     END
|    C*
| 08-C           #FLD      IFEQ 'DEM89B'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM87'    TR101I 10
|   C           DEM89B    PARM DEM89B    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 08-C                     END
|    C*
| 09-C           #FLD      IFEQ 'DEM89C'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM87'    TR101I 10
|   C           DEM89C    PARM DEM89C    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 09-C                     END
|    C*
|    C                     MOVEL*BLANK    TR103I
| 10-C           #FLD      IFEQ 'DEM89D'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM87'    TR101I 10
|   C           DEM89D    PARM DEM89D    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 10-C                     END
|    C*
| 11-C           #FLD      IFEQ 'DEM89E'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM87'    TR101I 10
|   C           DEM89E    PARM DEM89E    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 11-C                     END
|    C*
| 12-C           #FLD      IFEQ 'DEM91A'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM87'    TR101I 10
|   C           DEM91A    PARM DEM91A    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 12-C                     END
|    C*
| 13-C           #FLD      IFEQ 'DEM91B'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM87'    TR101I 10
|   C           DEM91B    PARM DEM91B    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 13-C                     END
|    C*
| 14-C           #FLD      IFEQ 'DEM91C'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM87'    TR101I 10
|   C           DEM91C    PARM DEM91C    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 14-C                     END
|    C*
| 15-C           #FLD      IFEQ 'DEM91D'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM87'    TR101I 10
|   C           DEM91D    PARM DEM91D    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 15-C                     END
|    C*
| 16-C           #FLD      IFEQ 'DEM91E'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM87'    TR101I 10
|   C           DEM91E    PARM DEM91E    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 16-C                     END
|    C*--------------------------------------------------------------**
|    C*語文能力
| 17-C           #FLD      IFEQ 'DEM88A'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM88'    TR101I 10
|   C           DEM88A    PARM DEM88A    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 17-C                     END
|    C*
| 18-C           #FLD      IFEQ 'DEM88B'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM88'    TR101I 10
|   C           DEM88B    PARM DEM88B    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 18-C                     END
|    C*
| 19-C           #FLD      IFEQ 'DEM88C'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM88'    TR101I 10
|   C           DEM88C    PARM DEM88C    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 19-C                     END
|    C*
| 20-C           #FLD      IFEQ 'DEM88D'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM88'    TR101I 10
|   C           DEM88D    PARM DEM88D    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 20-C                     END
|    C*
| 21-C           #FLD      IFEQ 'DEM88E'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM88'    TR101I 10
|   C           DEM88E    PARM DEM88E    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 21-C                     END
|    C*
| 22-C           #FLD      IFEQ 'DEM90A'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM88'    TR101I 10
|   C           DEM90A    PARM DEM90A    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 22-C                     END
|    C*
| 23-C           #FLD      IFEQ 'DEM90B'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM88'    TR101I 10
|   C           DEM90B    PARM DEM90B    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 23-C                     END
|    C*
| 24-C           #FLD      IFEQ 'DEM90C'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM88'    TR101I 10
|   C           DEM90C    PARM DEM90C    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 24-C                     END
|    C*
| 25-C           #FLD      IFEQ 'DEM90D'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM88'    TR101I 10
|   C           DEM90D    PARM DEM90D    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 25-C                     END
|    C*
| 26-C           #FLD      IFEQ 'DEM90E'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM88'    TR101I 10
|   C           DEM90E    PARM DEM90E    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 26-C                     END
|    C*
| 27-C           #FLD      IFEQ 'DEM92A'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM88'    TR101I 10
|   C           DEM92A    PARM DEM92A    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 27-C                     END
|    C*
| 28-C           #FLD      IFEQ 'DEM92B'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM88'    TR101I 10
|   C           DEM92B    PARM DEM92B    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 28-C                     END
|    C*
| 29-C           #FLD      IFEQ 'DEM92C'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM88'    TR101I 10
|   C           DEM92C    PARM DEM92C    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 29-C                     END
|    C*
| 30-C           #FLD      IFEQ 'DEM92D'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM88'    TR101I 10
|   C           DEM92D    PARM DEM92D    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 30-C                     END
|    C*
| 31-C           #FLD      IFEQ 'DEM92E'
|   C                     CALL 'TRW001'
|   C                     PARM 'EM88'    TR101I 10
|   C           DEM92E    PARM DEM92E    TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
| 31-C                     END
|    C*--------------------------------------------------------------**
|    C*
35===C           E5E00     ENDSR
     C*==============================================================*
**
新增修改      刪除查詢
