     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYR131                                     *
     H*    PROGRAM NAME :勞／健保調整試算作業                      *
     H*    AUTHOR       : A1274 EVA                                  *
     H*    CREATE DATE  : 90/03/26                                   *
     H*    UPDATE DATE  : 92/12/30 ALLEN                             *
     H*    SYSTEM       :員工保險維護子系統                        *
     H****************************************************************
     F*YA131WFO   E           K        DISK                           UC
     FPYA131WFUF  E           K        DISK                      A
     FPYTXLF04IF  E           K        DISK
     FPYE1PF  IF  E           K        DISK
     FPYEMPF  IF  E           K        DISK
     FPYL1PF  IF  E           K        DISK
     FPYE3PF  IF  E           K        DISK
     FPYPHPF  IF  E           K        DISK
     FPYHDPF  IF  E           K        DISK
     FPYA135D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     E                    @A01        5  1               作業權利
     E*---------------------------------------------------------------*
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I                                    B 378 3790#DRRN
     ILDA        UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I                                      210 2160DATE
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      201 2040YEAR
     I            DS
     I                                        1   2 TX03
     I                                        1   1 TX031
     I                                        2   2 TX032
     I            DS
     I                                        1   80KYMD
     I                                        1   60KYM
     I            DS
     I                                        1   80EM13
     I                                        1   60EM13YM
     I            DS
     I                                        1   60YMS
     I                                        1   40YY
     I                                        5   60MM
     I            DS
     I                                        1   80DS13
     I                                        1   60DS13YM
     I/COPY QDDSSRC,PYEMDS01
     C*==============================================================*
     I*             'CLRPFM PYA131WF    ' C         CMD
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *LIKE     DEFN CM004O    DFMT
     C           *LIKE     DEFN CM005O    DTYPE
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYEM     KLIST                           *PYEMPF
     C                     KFLD           DEM01            *公司
     C*
     C           KEYTXS    KLIST
     C                     KFLD           DEM01            *公司編號
     C                     KFLD           EM02             *員工編號
     C                     KFLD           WYMD    80       *生效日期
     C           KEYTX     KLIST
     C                     KFLD           DEM01            *公司編號
     C                     KFLD           EM02             *員工編號
     C           KEYE1S    KLIST
     C                     KFLD           DEM01            *公司編號
     C                     KFLD           EM02             *員工編號
     C                     KFLD           WYMD    80       *生效日期
     C           KEYE1     KLIST
     C                     KFLD           DEM01            *公司編號
     C                     KFLD           EM02             *員工編號
     C*PYWDPF
     C                     MOVEL'1'       DPH04   1
     C           KEYPH     KLIST
     C                     KFLD           DEM01            *公司
     C                     KFLD           EM02             *員工編號
     C                     KFLD           DPH03            *年月
     C                     KFLD           DPH04            *期別
     C           KEYHD     KLIST
     C                     KFLD           HD01
     C                     KFLD           HD02
     C                     KFLD           HD03
     C                     KFLD           HD04
     C                     KFLD           HD05
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     IN   LDA
|    C*RENT AUTHORITY CHECK
|    C                     MOVELDDATE     P#103
|    C                     CALL 'L@CHK'
|    C                     PARM           P#103   6
|    C                     PARM '01'      P#106   2
|    C                     PARM '  '      P#104   6
|    C                     PARM '2'       PFUN    1
|    C*
|    C                     MOVE 'SC01'    SCID    4
|    C* FUN AUT
|    C                     MOVE $ADD      @A01,1
|    C                     MOVE $UPD      @A01,2
|    C                     MOVE $DLT      @A01,4
|    C                     MOVE $INQ      @A01,5
|    C*
|    C* SC01 FIELD INITIALIZE *--------------------------------------*
|    C                     Z-ADD0         DYM1
|    C                     Z-ADD0         DYM2
|    C                     Z-ADD2         @01     20
|    C*------------------------------------------------------------****
|    C*公司別
|    C                     MOVEL$COR      DEM01
| 01-C           $RMK03    IFNE 'Y'
|   C                     SETOF                     32
| 01*C                     ELSE
|   C                     SETON                     32
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     SETON                     97
|    C                     EXFMTDSPC1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 02-C           *IN99     IFEQ '0'
|   C           *IN13     ANDEQ'1'
|   C                     EXSR R1C00                      *PROCESS
| 02-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1B00 ....SCREEN CHECK
     C*==============================================================*
03===C           R1B00     BEGSR
|    C*
|    C* CHK FUN AUT
|    C*          @A01,DOPT IFNE 'Y'
|    C*                    MOVEL'UPT2150' ERRID
|    C*                    MOVEL'PTMF'    ERRF
|    C*                    SETON                     99
|    C*                    END
|    C*  99                GOTO E1B00
|    C*---------------------------------------------------------------
|    C*公司別
| 01-C           DEM01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DEM01     CM001I  2         公司代號
|    C                     PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C                     PARM           CM004O  1         日期格式
|    C                     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C                     MOVE CM004O    DFMT
|    C                     MOVE CM005O    DTYPE
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 02-C           CM099O    IFEQ 'N'
|   C                     SETON                     6099
|   C                     MOVEL'US#0099' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
| 03-C           CM099O    IFEQ *BLANK
|   C                     SETON                     6099
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C   99                GOTO E1B00
|    C*調整年月（自）
|    C                     Z-ADDDYM1      FDATE1  60
|    C                     CALL 'P38'
|    C                     PARM FDATE1    P3801I  60
|    C                     PARM CM004O    P3802I  1        .YYYYMM
|    C                     PARM CM005O    P3803I  1
|    C                     PARM           P3801O  60
|    C                     PARM           P3811O  1        .'Y':OK
|    C*                                                    .'N':ERROR
| 04-C           P3811O    IFNE 'Y'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 04-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'P39'
|    C                     PARM FDATE1    P3901I  60
|    C                     PARM CM004O    P3902I  1
|    C                     PARM CM005O    P3903I  1
|    C                     PARM '2'       P3904I  1
|    C                     PARM '1'       P3905I  1
|    C                     PARM           P3911O  60
|    C                     Z-ADDP3911O    YYMME1  60       *
|    C*
|    C*調整年月（至）
|    C                     Z-ADDDYM2      FDATE2  60
|    C                     CALL 'P38'
|    C                     PARM FDATE2    P3801I  60
|    C                     PARM CM004O    P3802I  1        .YYYYMM
|    C                     PARM CM005O    P3803I  1
|    C                     PARM           P3801O  60
|    C                     PARM           P3811O  1        .'Y':OK
|    C*                                                    .'N':ERROR
| 05-C           P3811O    IFNE 'Y'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 05-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'P39'
|    C                     PARM FDATE2    P3901I  60
|    C                     PARM CM004O    P3902I  1
|    C                     PARM CM005O    P3903I  1
|    C                     PARM '2'       P3904I  1
|    C                     PARM '1'       P3905I  1
|    C                     PARM           P3911O  60
|    C                     Z-ADDP3911O    YYMME2  60       *
|    C*
|    C*日期區間檢核DYM1 ~ DYM2
| 06-C           YYMME1    IFGT YYMME2
|   C                     MOVEL'UPT1011' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     619963
| 06-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*生效日期
| 07-C           DYMD      IFEQ 0
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 07-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'P30'
|    C                     PARM DYMD      P3001I  80
|    C                     PARM DFMT      P3002I  1
|    C                     PARM DTYPE     P3003I  1
|    C                     PARM           P3011O  1
| 08-C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 08-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'P31'
|    C                     PARM DYMD      P3101I  80
|    C                     PARM DFMT      P3102I  1
|    C                     PARM DTYPE     P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C                     PARM           P3111O  80
|    C                     Z-ADDP3111O    KYMD    80
|    C*
|    C*------------------------------------------------------------****
|    C           191100    ADD  DYM1      BYM     60
|    C           191100    ADD  DYM2      EYM     60
|    C*------------------------------------------------------------****
03===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....PROCESS
     C*==============================================================*
04===C           R1C00     BEGSR
|    C*
|    C                     SETON                     96
|    C                     WRITEDSPC1
|    C*CLRPGM PYA131WF
|    C*                    CALL 'QCMDEXC'
|    C*                    PARM CMD       P0001 256
|    C*                    PARM 20        P0002  155
|    C*DELETE WK
|    C*                    OPEN PYA131WF
     C           DEM01     SETLLW13R
     C           DEM01     READEW13R                     47
     C           *IN47     DOWEQ'0'
     C                     DELETW13R
     C           DEM01     READEW13R                     47
     C                     ENDDO
|    C*
|    C*由員工主檔代出相關資料
|    C           KEYEM     SETLLEM0
|    C           KEYEM     READEEM0                      47
| 01-C           *IN47     DOWEQ'0'
|   C                     Z-ADDYYMME1    YMS
|   C                     Z-ADDYYMME2    YME     60
|   C                     Z-ADD*ZERO     WBASE   70       平均薪資
|   C                     Z-ADD*ZERO     TPAMT   70       平均加班
|   C                     Z-ADD*ZERO     CON     10
|   C*到職日
|   C                     Z-ADDEM13      DS13
|   C           DS13YM    IFGE EYM
|   C                     GOTO NEXT
|   C                     END
|   C*
| 02-C           EM19      IFEQ 0                          *離職日期
|   C*
| 03-C           YMS       DOUGTYME
|   C*
|    C           DS13YM    IFGE YMS
|   C                     GOTO NEXY
|    C                     END
|   C*
|   C                     Z-ADDYMS       DPH03   60
|   C*----------------------------------------------------------------
|   C*薪資計算基準：
|   C*應稅加項+免稅加項(含免稅加班費+伙食費)-應稅減項
|   C*
|   C                     Z-ADD*ZERO     BASE    70       當月薪資
|   C*
|   C           KEYPH     CHAINPH0                  47
| 04-C           *IN47     IFEQ '0'
|   C           PH17      ADD  PH16      BASE
|   C*                    SUB  PH28      BASE
|   C*讀取加班資料
|   C                     MOVE DEM01     HD01
|   C                     MOVE EM02      HD02
|   C                     Z-ADDDPH03     HD03
|   C                     MOVE DPH04     HD04
|   C                     MOVE '25'      HD05
|   C           KEYHD     CHAINPYHDPF               40
|   C  N40                ADD  HD06      TPAMT
|   C                     MOVE DEM01     HD01
|   C                     MOVE EM02      HD02
|   C                     Z-ADDDPH03     HD03
|   C                     MOVE DPH04     HD04
|   C                     MOVE '26'      HD05
|   C           KEYHD     CHAINPYHDPF               40
|   C  N40                ADD  HD06      TPAMT
|   C*
| 04-C                     END
|   C*
|   C                     ADD  1         CON
|   C*
|   C                     ADD  BASE      WBASE
|   C*
|   C           NEXY      TAG
|   C                     ADD  1         YMS
| 05-C           MM        IFGT 12
|   C                     ADD  1         YY
|   C                     SUB  12        MM
| 05-C                     END
|   C*
| 03-C                     ENDDO
|   C           CON       IFNE 0
|   C                     DIV  CON       WBASE            平均薪資
|   C                     DIV  CON       TPAMT            平均加班
|   C                     ELSE
|   C                     Z-ADD0         WBASE            平均薪資
|   C                     Z-ADD0         TPAMT            平均加班
|   C                     END
|   C*
|   C           WBASE     SUB  TPAMT     TXAMT   70
|   C           WBASE     IFGE 43900                      SUNG 42-> 439
|   C                     Z-ADD43900     WBASE            SUNG 42->439
|   C                     END
|   C           TXAMT     IFGE 43900                      SUNG 42->439
|   C                     Z-ADDTXAMT     WBASE
|   C                     END
|   C*----------------------------------------------------------------
|   C*一個員工一筆資料
|   C                     EXSR R1C10                      *調整前
|   C                     EXSR R1C20                      *MOVE DATA
|   C*
|   C                     WRITEW13R
|   C*
| 02-C                     ENDIF
| 0  C           NEXT      TAG
|   C           KEYEM     READEEM0                      47
| 01-C                     END
|    C*----------------------------------------------------------------
|    C*                    CLOSEPYA131WF
|    C*
|    C*UPT2142--->作業完成
|    C                     MOVEL'UPT2142' ERRID
|    C                     MOVEL'PTMF'    ERRF
|    C                     SETOF                     96
|    C                     SETON                       99
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R1C10 ....調整前資料
     C*==============================================================*
05===C           R1C10     BEGSR
|    C*
|    C                     MOVEL*BLANK    @NEW    1
|    C*
|    C*----------------------------------------------------------------
|    C*讀取最近勞保資料PYTXPF
|    C*異動類別:(A1.勞保投保  A2.勞保調整  A3.勞保退保)
|    C                     Z-ADD*HIVAL    WYMD
|    C                     Z-ADD0         W1306B           *勞保投保金額B
|    C                     MOVEL*BLANK    W1311B           *勞保異動類別B'
|    C                     Z-ADD0         W1311C           *勞保生效日期B
|    C*
|    C           KEYTXS    SETLLTX0
|    C           KEYTX     REDPETX0                      46
| 01-C           *IN46     IFEQ '0'
| 02-C           TX03      IFEQ 'A1'
|   C           TX03      OREQ 'A2'
|   C                     Z-ADDTX05      W1306B           *勞保投保金額B
|   C                     Z-ADDTX04      W1311C           *生效日期B
|   C                     MOVELTX03      W1311B           *勞保異動類別B'
| 02-C                     END
| 01-C                     END
|    C*
|    C                     Z-ADDW1306B    WK00             *平均收入
|    C                     EXSR R1C1A                      *級數比對
|    C                     Z-ADDWK01      W1305B           *勞保級數
|    C*----------------------------------------------------------------
|    C*讀取最近健保資料PYE1PF
|    C*異動類別:(1.投保2.調整3.停保4.復保5.轉出9.退保
|    C                     Z-ADD*HIVAL    WYMD
|    C                     Z-ADD0         W1308B           *健保投保金額B
|    C                     MOVEL*BLANK    W1312B           *健保異動類別B'
|    C                     Z-ADD0         W1312C           *健保生效日期B
|    C*
|    C           KEYE1S    SETLLE10
|    C           KEYE1     REDPEE10                      46
| 03-C           *IN46     IFEQ '0'
| 04-C           E104      IFEQ '1'
|   C           E104      OREQ '2'
|   C           E104      OREQ '4'
|   C           E104      OREQ '5'
|   C                     Z-ADDE105      W1308B           *健保投保金額B
|   C                     Z-ADDE103      W1312C           *健保生效日期B
|   C                     MOVELE104      W1312B           *健保異動類別B'
| 04-C                     END
| 03-C                     END
|    C*
|    C                     Z-ADDW1308B    WK00             *平均收入
|    C                     EXSR R1C1B                      *級數比對
|    C                     Z-ADDWK03      W1307B           *健保級數
|    C*----------------------------------------------------------------
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R1C1A ....勞保級數比對
     C*==============================================================*
06===C           R1C1A     BEGSR
|    C*
|    C* PYL1PF(勞保投保級數參照檔)
|    C                     Z-ADD0         WK01    20       *勞保級數
|    C                     Z-ADD0         KL101   20       *勞保級數
|    C                     Z-ADD0         WK02    70       *勞保投保金額
|    C                     Z-ADD0         KEEP1   70       *勞保投保金額
|    C*
|    C*取得第二等級金額
| 01-C           @NEW      IFEQ 'Y'
|   C           @01       CHAINL10                  40
| 02-C           *IN40     IFEQ '0'
|   C                     Z-ADDL101      WK01             *勞保級數
|   C                     Z-ADDL102      WK02             *勞保投保金額
|   C                     Z-ADDL102      KEEP1            *勞保投保金額
| 02-C                     END
| 01-C                     END
|    C*
|    C*計算勞保級數&金額
|    C           @01       SETLLL10
|    C                     READ L10                      48
| 03-C           *IN48     DOWEQ'0'
|   C*
| 04-C           WK00      IFGT KEEP1
|   C           WK00      ANDLEL102
|   C                     Z-ADDL101      WK01             *勞保級數
|   C                     Z-ADDL102      WK02             *勞保投保金額
|   C                     GOTO TAG02
| 04-C                     END
|   C*
|   C                     Z-ADDL102      KEEP1            *勞保投保金額
|   C                     Z-ADDL101      KL101            *勞保級數
|   C*
|   C                     READ L10                      48
| 03-C                     END
|    C*
|    C*若為最大投保級數＆金額者
| 05-C           WK00      IFGT KEEP1
|   C           KL101     CHAINL10                  40
| 06-C           *IN40     IFEQ '0'
|   C                     Z-ADDL101      WK01             *勞保級數
|   C                     Z-ADDL102      WK02             *勞保投保金額
|   C                     GOTO TAG02
| 06-C                     END
| 05-C                     END
|    C*
|    C*----------------------------------------------------------------
|    C           TAG02     TAG
|    C*----------------------------------------------------------------
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R1C1B ....健保級數比對
     C*==============================================================*
07===C           R1C1B     BEGSR
|    C*
|    C*PYE3PF(全民健保級數檔)
|    C                     Z-ADD0         WK03    20       *健保級數
|    C                     Z-ADD0         KE301   20       *健保級數
|    C                     Z-ADD0         WK04    70       *健保投保金額
|    C                     Z-ADD0         KEEP2   70       *健保投保金額
|    C*
|    C*取得第二等級金額
| 01-C           @NEW      IFEQ 'Y'
|   C           @01       CHAINE30                  40
| 02-C           *IN40     IFEQ '0'
|   C                     Z-ADDE301      WK03             *健保級數
|   C                     Z-ADDE302      WK04             *健保投保金額
|   C                     Z-ADDE302      KEEP2            *健保投保金額
| 02-C                     END
| 01-C                     END
|    C*
|    C*計算健保級數&金額
|    C           @01       SETLLE30
|    C                     READ E30                      49
| 03-C           *IN49     DOWEQ'0'
|   C*
| 04-C           WK00      IFGT KEEP2                      *平均收入
|   C           WK00      ANDLEE302                       *平均收入
|   C                     Z-ADDE301      WK03             *健保級數
|   C                     Z-ADDE302      WK04             *健保投保金額
|   C                     GOTO TAG03
| 04-C                     END
|   C*
|   C                     Z-ADDE301      KE301            *健保級數
|   C                     Z-ADDE302      KEEP2            *健保投保金額
|   C*
|   C                     READ E30                      49
| 03-C                     END
|    C*
|    C*若為最大投保級數＆金額者
| 05-C           WK00      IFGT KEEP2
|   C           KE301     CHAINE30                  40
| 06-C           *IN40     IFEQ '0'
|   C                     Z-ADDE301      WK03             *健保級數
|   C                     Z-ADDE302      WK04             *健保投保金額
|   C                     GOTO TAG03
| 06-C                     END
| 05-C                     END
|    C*
|    C*----------------------------------------------------------------
|    C           TAG03     TAG
|    C*----------------------------------------------------------------
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          R1C20 ....調整後資料
     C*==============================================================*
08===C           R1C20     BEGSR
|    C*
|    C                     MOVEL'Y'       @NEW
|    C                     MOVELEM01      W1301            *公司
|    C                     MOVELEM02      W1302            *員工
|    C                     MOVELYYMME1    W1303S           *平均薪資年月起
|    C                     MOVELYYMME2    W1303E           *平均薪資年月迄
|    C*
|    C*平均薪資取薪資年月起迄固定項薪資資料
|    C                     Z-ADDWBASE     W1304            *當月收入
|    C                     Z-ADDW1304     WK00    70
|    C*勞保資料
|    C                     EXSR R1C1A                      *級數比對
|    C                     Z-ADDWK01      W1305            *勞保級數
|    C                     Z-ADDWK02      W1306            *勞保投保金額
|    C*健保資料
|    C                     EXSR R1C1B                      *級數比對
|    C                     Z-ADDWK03      W1307            *健保級數
|    C                     Z-ADDWK04      W1308            *健保投保金額
|    C                     Z-ADDEM13      W1309            *到職日期
|    C                     Z-ADDKYMD      W1310            *生效日期
|    C                     MOVEL*BLANK    W1320            *確認
|    C*
08===C                     ENDSR
     C*==============================================================*
