     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA133
     H*    PROGRAM NAME :勞／健保調整確認作業                      *
     H*    AUTHOR       : A1274 EVA                                  *
     H*    CREATE DATE  : 90/03/26                                   *
     H*    UPDATE DATE  : 92/12/30 ALLEN                             *
     H*    SYSTEM       :員工保險維護子系統                        *
     H****************************************************************
     FPYTXPF  UF  E           K        DISK                      A
     FPYEMPF  UF  E           K        DISK
     FPYE1PF  UF  E           K        DISK                      A
     FPYE2PF  UF  E           K        DISK                      A
     FPYE3LF01IF  E           K        DISK
     FPYE5PF  UF  E           K        DISK                      A
     FPYE5LF01IF  E           K        DISK
     F            E50                               KRENAMEE5L1
     FPYA131WFUF  E           K        DISK
     FPYA133D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     E                    @A01        5  1               作業權利
     E*                   WFUN    5   5  6
     E*---------------------------------------------------------------*
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I                                    B 378 3790#DRRN
     ILDA        UDS
     I                                      101 110 $USER
     I                                      187 1920DATE
     I                                      211 2160DDATE
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      201 2040YEAR
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *LIKE     DEFN CM004O    DFMT
     C           *LIKE     DEFN CM005O    DTYPE
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYW13    KLIST
     C                     KFLD           DEM01            *公司
     C*                    KFLD           YYMME            *年月
     C*                    KFLD           W1302
     C           KEYEM     KLIST
     C                     KFLD           W1301            *公司
     C                     KFLD           W1302            *員工編號
     C           KEYTX     KLIST
     C                     KFLD           W1301            *公司編號
     C                     KFLD           W1302            *員工編號
     C                     KFLD           DTX031           *異動大類
     C                     KFLD           W1310            *生效日期
     C                     KFLD           DTX032           *異動細目
     C*
     C                     MOVEL'A'       DTX031  1        *異動大類
     C                     MOVEL'2'       DTX032  1        *異動細目
     C*----------------------------------------------------------------
     C           KEYE1S    KLIST
     C                     KFLD           W1301            *公司編號
     C                     KFLD           W1302            *員工編號
     C                     KFLD           WYMD    80       *生效日期
     C           KEYE1     KLIST
     C                     KFLD           W1301            *公司編號
     C                     KFLD           W1302            *員工編號
     C           KEYE2     KLIST
     C                     KFLD           W1301            *公司編號
     C                     KFLD           W1302            *員工編號
     C                     KFLD           WYMD    80       *生效日期
     C           KEYE3     KLIST
     C                     KFLD           W1308            *健保級數
     C           KEYE5A    KLIST
     C                     KFLD           E501             *公司編號
     C                     KFLD           E502             *員工編號
     C                     KFLD           E515             *薪資年月
     C                     KFLD           E504             *序號
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     IN   LDA
|    C*RENT AUTHORITY CHECK
|    C                     MOVELDDATE     P#103
|    C                     CALL 'L@CHK'
|    C                     PARM           P#103   6
|    C                     PARM '01'      P#106   2
|    C                     PARM '  '      P#104   6
|    C                     PARM '2'       PFUN    1
|    C*
|    C                     MOVE 'SC01'    SCID    4
|    C* FUN AUT
|    C                     MOVE $ADD      @A01,1
|    C                     MOVE $UPD      @A01,2
|    C                     MOVE $DLT      @A01,4
|    C                     MOVE $INQ      @A01,5
|    C*
|    C* SC01 FIELD INITIALIZE *--------------------------------------*
|    C                     MOVEL*BLANKS   DYM
|    C*                    Z-ADD1         DOPT
|    C*------------------------------------------------------------****
|    C*公司別
|    C                     MOVEL$COR      DEM01
| 01-C           $RMK03    IFNE 'Y'
|   C                     SETOF                     32
| 01*C                     ELSE
|   C                     SETON                     32
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     SETON                     97
|    C                     EXFMTDSPC1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 02-C           *IN99     IFEQ '0'
|   C           *IN13     ANDEQ'1'
|   C                     EXSR R1C00                      *PROCESS
| 02-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1B00 ....SCREEN CHECK
     C*==============================================================*
03===C           R1B00     BEGSR
|    C*
|    C* CHK FUN AUT
|    C*          @A01,DOPT IFNE 'Y'
|    C*                    MOVEL'UPT2150' ERRID
|    C*                    MOVEL'PTMF'    ERRF
|    C*                    SETON                     99
|    C*                    END
|    C*  99                GOTO E1B00
|    C*---------------------------------------------------------------
|    C*公司別
| 01-C           DEM01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DEM01     CM001I  2         公司代號
|    C                     PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C                     PARM           CM004O  1         日期格式
|    C                     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C                     MOVE CM004O    DFMT
|    C                     MOVE CM005O    DTYPE
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 02-C           CM099O    IFEQ 'N'
|   C                     SETON                     6099
|   C                     MOVEL'US#0099' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
| 03-C           CM099O    IFEQ *BLANK
|   C                     SETON                     6099
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C   99                GOTO E1B00
|    C*調整年月DYM
|    C                     Z-ADDDYM       FDATE   80
|    C                     CALL 'P38'
|    C                     PARM FDATE     P3801I  60
|    C                     PARM CM004O    P3802I  1        .YYYYMM
|    C                     PARM CM005O    P3803I  1
|    C                     PARM           P3801O  60
|    C                     PARM           P3811O  1        .'Y':OK
|    C*                                                    .'N':ERROR
| 04-C           P3811O    IFNE 'Y'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 04-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'P39'
|    C                     PARM FDATE     P3901I  60
|    C                     PARM CM004O    P3902I  1
|    C                     PARM CM005O    P3903I  1
|    C                     PARM '2'       P3904I  1
|    C                     PARM '1'       P3905I  1
|    C                     PARM           P3911O  60
|    C                     Z-ADDP3911O    YYMME   60       *
|    C*確認日期W1310
|    C*          DYMD      IFEQ 0
|    C*                    MOVEL'UPT0010' ERRID
|    C*                    MOVEL'PTMF'    ERRF
|    C*                    SETON                     6299
|    C*                    END
|    C*  99                GOTO E1B00
|    C*
|    C*                    CALL 'P30'
|    C*                    PARM DYMD      P3001I  80
|    C*                    PARM DFMT      P3002I  1
|    C*                    PARM DTYPE     P3003I  1
|    C*                    PARM           P3011O  1
|    C*          P3011O    IFEQ 'N'
|    C*                    MOVEL'UPT0040' ERRID
|    C*                    MOVEL'PTMF'    ERRF
|    C*                    SETON                     6299
|    C*                    END
|    C*  99                GOTO E1B00
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM DYMD      P3101I  80
|    C*                    PARM DFMT      P3102I  1
|    C*                    PARM DTYPE     P3103I  1
|    C*                    PARM '2'       P3104I  1
|    C*                    PARM '1'       P3105I  1
|    C*                    PARM           P3111O  80
|    C*                    Z-ADDP3111O    KYMD    80
|    C*
03===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....MOVE  SCREEN TO SCID
     C*==============================================================*
04===C           R1C00     BEGSR
|    C*
|    C                     SETON                     98
|    C                     WRITEDSPC1
|    C           KEYW13    SETLLW13R
|    C           KEYW13    READEW13R                     46
| 01-C           *IN46     DOWEQ'0'
|   C*
| 02-C           W1320     IFEQ *BLANK                     *確認
|   C           KEYEM     CHAINEM0                  40
| 03-C           *IN40     IFEQ '0'
|   C           EM19      ANDEQ0                          *離職日期
|   C*
| 04-C           W1306     IFGT 0                          *勞保金額
|   C           W1306     ANDNEW1306B                     *勞保金額
|   C                     EXSR R1C10                      *勞保
| 04-C                     END
| 05-C           W1308     IFGT 0                          *健保金額
|   C           W1308     ANDNEW1308B                     *健保金額
|   C*
|   C           KEYE3     CHAINE30                  40
| 06-C           *IN40     IFEQ '1'
|   C                     Z-ADD0         E303             *健保保費
| 06-C                     END
|   C*
|   C                     EXSR R1C20                      *健保
| 05-C                     END
|   C*
| 03-C                     END
|   C*
|   C                     MOVEL'*'       W1320            *確認
|   C                     UPDATW13R
| 02-C                     END
|   C           KEYW13    READEW13R                     46
| 01-C                     END
|    C*UPT2142--->作業完成
|    C                     MOVEL'UPT2142' ERRID
|    C                     MOVEL'PTMF'    ERRF
|    C                     SETON                       99
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R1C10 ....勞保WRITE PYTXPF &UPDAT PYEMPF
     C*==============================================================*
05===C           R1C10     BEGSR
|    C*
|    C*異動類別:(A1.勞保投保  A2.勞保調整  A3.勞保退保)
|    C*
|    C           KEYTX     CHAINTX0                  40
|    C                     MOVELW1301     TX01             *公司編號
|    C                     MOVELW1302     TX02             *員工編號
|    C                     MOVEL'A'       TX031            *異動大類
|    C                     MOVEL'2'       TX032            *異動細目
|    C                     MOVELW1310     TX04             *生效日期
|    C                     MOVELW1306     TX05             *金額
|    C                     Z-ADD*ZERO     TX06             *異動前日期１
|    C                     Z-ADD*ZERO     TX07             *留職天數
|    C                     Z-ADDEM15      TX08             *異動前日期２
|    C                     MOVELEM11      TX09             *異動前離職碼
|    C                     Z-ADDEM23      TX10             *異動前金額
|    C                     Z-ADD*ZERO     TX11             *異動前天數
|    C                     MOVEL*BLANK    TX12             *離職原因
|    C                     MOVEL'U'       TX96             *主檔更新
|    C*
|    C                     Z-ADD$A8YMD    TX97             *記錄更新日期
|    C                     TIME           TX98             *
|    C                     MOVEL$USER     TX99             *
|    C*
| 01-C           *IN40     IFEQ '0'
|   C                     UPDATTX0
| 01*C                     ELSE
|   C                     WRITETX0
| 01-C                     END
|    C*----------------------------------------------------------------
|    C                     Z-ADDW1310     EM15             *勞保調整日期
|    C                     Z-ADDW1306     EM23             *勞保投保金額
|    C*
|    C                     Z-ADD$A8YMD    EM97
|    C                     TIME           EM98
|    C                     MOVEL$USER     EM99
|    C*
|    C                     UPDATEM0
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R1C20 ....健保WRITE PYE1PF PYE2PF
     C*==============================================================*
06===C           R1C20     BEGSR
|    C*異動類別:1.投保2.調整
|    C*取最近的投保日期
|    C                     Z-ADD*HIVAL    WYMD
|    C                     MOVEL*BLANK    WE108   1
|    C*
|    C           KEYE1S    SETLLE10
|    C           KEYE1     REDPEE10                      46
| 01-C           *IN46     IFEQ '0'
|   C                     Z-ADDE103      WYMD             *生效日期
|   C                     MOVELE108      WE108
| 01-C                     END
|    C*----------------------------------------------------------------
|    C* PYE2PF  全民健保投保資料檔-DETAIL
|    C                     Z-ADD1         DNUM    20       *投保人數
|    C           KEYE2     SETLLE20
|    C           KEYE2     READEE20                      46
| 02-C           *IN46     DOWEQ'0'
|   C* 補助碼
| 03-C           E211      IFEQ ' '
|   C                     Z-ADDE303      WE303
| 03-C                     END
| 03-C           E211      IFEQ '0'
|   C                     Z-ADD0         WE303   70
| 03-C                     END
|   C*
| 04-C           E211      IFEQ '1'
|   C           E303      SUB  604       WE303
| 04-C                     END
|   C*
| 05-C           E211      IFEQ '2'
|   C           E303      MULT 0.5       WE303
| 05-C                     END
|   C*
| 06-C           E211      IFEQ '4'
|   C           E303      MULT 0.75      WE303
| 06-C                     END
|   C*
| 07-C           E211      IFEQ '6'
|   C           E303      MULT 0.75      WE303
|   C                     SUB  604       WE303
| 07-C                     END
|   C*
| 08-C           WE303     IFLT 0
|   C                     Z-ADD0         WE303
| 08-C                     END
|   C*  停退轉出
| 09-C           E205      IFEQ '3'
|   C           E205      OREQ '5'
|   C           E205      OREQ '9'
|   C                     Z-ADD0         WE303
| 09-C                     END
|   C*
| 10-C           WYMD      IFNE W1310
|   C                     Z-ADDW1308     E213             *投保金額
|   C                     Z-ADDWE303     E214             *健保保費
|   C                     Z-ADDW1310     E203             *生效日期
|   C                     Z-ADD$A8YMD    E297             *
|   C                     TIME           E298             *
|   C                     MOVEL$USER     E299             *
|   C                     WRITEE20
|   C*
| 11-C           E205      IFEQ *BLANK                     *停保
|   C                     ADD  1         DNUM
| 11-C                     END
| 10-C                     END
|   C*
|   C           KEYE2     READEE20                      46
| 02-C                     END
|    C*----------------------------------------------------------------
|    C* PYE5PF  眷屬健保投保歷史檔-DETAIL
|    C                     Z-ADD1         DNUM    20       *投保人數
|    C           KEYE2     SETLLE50
|    C           KEYE2     READEE50                      46
| 12-C           *IN46     DOWEQ'0'
|   C*
|   C* 補助碼
| 13-C           E511      IFEQ '0'
|   C                     Z-ADD0         WE303
| 13-C                     END
|   C*
| 14-C           E511      IFEQ '1'
|   C           E303      SUB  604       WE303
| 14-C                     END
|   C*
| 15-C           E511      IFEQ '2'
|   C           E303      MULT 0.5       WE303
| 15-C                     END
|   C*
| 16-C           E511      IFEQ '4'
|   C           E303      MULT 0.75      WE303
| 16-C                     END
|   C*
| 17-C           E511      IFEQ '6'
|   C           E303      MULT 0.75      WE303
|   C                     SUB  604       WE303
| 17-C                     END
|   C*
| 18-C           WE303     IFLT 0
|   C                     Z-ADD0         WE303
| 18-C                     END
|   C*  停退轉出
| 19-C           E505      IFEQ '3'
|   C           E505      OREQ '5'
|   C           E505      OREQ '9'
|   C                     Z-ADD0         WE303
| 19-C                     END
|   C*
| 20-C           WYMD      IFNE W1310
|   C                     Z-ADDW1308     E513             *投保金額
|   C                     Z-ADDWE303     E514             *健保保費
|   C                     Z-ADDW1310     E503             *生效日期
|   C                     Z-ADD$A8YMD    E597             *
|   C                     TIME           E598             *
|   C                     MOVEL$USER     E599             *
|   C*  JOHN MODIFY BY PYE5LF01 KEY DUPLICATE -------------*
|   C                     Z-ADDP3801O    E515
|   C           KEYE5A    CHAINE5L1                 47
| 21-C           *IN47     IFEQ '1'
|   C                     WRITEE50
| 21-C                     END
|   C*  JOHN MODIFY BY PYE5LF01 KEY DUPLICATE -------------*
|   C*
| 22-C           E205      IFEQ *BLANK                     *停保
|   C                     ADD  1         DNUM
| 22-C                     END
| 20-C                     END
|   C*
|   C           KEYE2     READEE20                      46
| 12-C                     END
|    C*----------------------------------------------------------------
|    C* PYE1PF  全民健保投保資料檔-HEADING
|    C                     Z-ADDW1310     WYMD             *生效日期
|    C           KEYE1S    CHAINE10                  40
|    C                     MOVELW1301     E101             *公司編號
|    C                     MOVELW1302     E102             *員工編號
|    C                     Z-ADDW1310     E103             *生效日期
|    C                     MOVEL'2'       E104             *異動類別
|    C                     Z-ADDW1308     E105             *投保金額
|    C*                    Z-ADDDNUM      E106             *投保人數
|    C                     MOVEL*BLANK    E107             *停保　　
|    C                     MOVELWE108     E108             *補助碼
|    C*                    Z-ADDE303      E114             *健保保費
|    C* 補助碼
| 23-C           E108      IFEQ ' '
|   C                     Z-ADDE303      WE303
| 23-C                     END
| 23-C           E108      IFEQ '0'
|   C                     Z-ADD0         WE303
| 23-C                     END
|    C*
| 24-C           E108      IFEQ '1'
|   C           E303      SUB  604       WE303
| 24-C                     END
|    C*
| 25-C           E108      IFEQ '2'
|   C           E303      MULT 0.5       WE303
| 25-C                     END
|    C*
| 26-C           E108      IFEQ '4'
|   C           E303      MULT 0.75      WE303
| 26-C                     END
|    C*
| 27-C           E108      IFEQ '6'
|   C           E303      MULT 0.75      WE303
|   C                     SUB  604       WE303
| 27-C                     END
|    C*
| 28-C           WE303     IFLT 0
|   C                     Z-ADD0         WE303
| 28-C                     END
|    C*  停退轉出
| 29-C           E104      IFEQ '3'
|   C           E104      OREQ '5'
|   C           E104      OREQ '9'
|   C                     Z-ADD0         WE303
| 29-C                     END
|    C*
|    C                     Z-ADDWE303     E114             *健保保費
|    C                     Z-ADD$A8YMD    E197             *
|    C                     TIME           E198             *
|    C                     MOVEL$USER     E199             *
|    C*
| 30-C           *IN40     IFEQ '0'
|   C                     UPDATE10
| 30*C                     ELSE
|   C                     WRITEE10
| 30-C                     END
|    C*
06===C           E1C20     ENDSR
     C*==============================================================*
