     H****************************************************************
     H*   ªx¤Ó¸ê°T¬ì§Þ¶}µoªÑ¥÷¦³­­¤½¥q¡Ðª©Åv©Ò¦³    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA111                                     *
     H*    PROGRAM NAME :¥þ¥Á°·«O¸ê®Æ«Ø¥ß                          *
     H*    AUTHOR       : A1448 JENNIFER                             *
     H*    CREATE DATE  : 95/05/15                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :¤H¨ÆÁ~¸ê¨t²Î                              *
     H*--------------------------------------------------------------*
     H*00A»Ý¨D³æ¸¹: 1041046                                        *
     H*00A 2015/12/02 DEREK°·«O¸É§U                                *
     H****************************************************************
     FPYE5PF  UF  E           K        DISK                      A
     FPYE2LF07IF  E           K        DISK
     F            E20                               KRENAMEE27
     FPYE2LF04UF  E           K        DISK                      A
     FPYE5LF01IF  E           K        DISK
     F            E50                               KRENAMEE5X
     FPYEMPF  IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FPT#YPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYE1PF  IF  E           K        DISK
 00A+FPYE9PF  IF  E           K        DISK
     FPYA111D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     E                    @A01        5  1               §@·~Åv§Q
     E                    TFUN    5   5  6
     E*---------------------------------------------------------------*
     I*
     I/COPY QDDSSRC,PYPMDS01
     I*
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I                                    B 378 3790#DRRN
     I           UDS
     I                                      101 110 $USER
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      203 2080DDATE
     I                                      201 2080$A8YMD
     I*¥Í®Ä¤é´Á(¦è¤¸¦~)
     I            DS
     I                                        1   80TE512
     I                                        1   60DYM
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN CM004O    DFMT
     C           *LIKE     DEFN CM005O    DTYPE
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYEM     KLIST                           *PYEMPF
     C                     KFLD           DE501            ¤½¥q§O
     C                     KFLD           DE502            ­û¤u½s¸¹
     C           KEYE5     KLIST                           *PYE5PF
     C                     KFLD           DE507            ²²ÄÝÃÒ¸¹
     C                     KFLD           E512             ¥Í®Ä¤é´Á
     C           KEY#Y     KLIST                           *PYZYPF
     C                     KFLD           #Y01             ¥N½XÄæ¦ì
     C                     KFLD           #Y02             ¥N½X½s¸¹
     C           KEYPM     KLIST                           *PYPMPF
     C                     KFLD           PM01             Ãþ§O
     C                     KFLD           PM02             ¤½¥q½s¸¹
     C           KEYE1     KLIST                           *PYE1PF
     C                     KFLD           DE501            ¤½¥q§O
     C                     KFLD           DE502            ­û¤u½s¸¹
     C           KEYE2     KLIST                           *PYE2PF
     C                     KFLD           DE501            ¤½¥q§O
     C                     KFLD           DE502            ²²ÄÝÃÒ¸¹
     C                     KFLD           DE507            ¥Í®Ä¤é´Á
     C           KEYE21    KLIST                           *PYE2PF
     C                     KFLD           E201             ¤½¥q§O
     C                     KFLD           E202             ²²ÄÝÃÒ¸¹
     C                     KFLD           E207             ¥Í®Ä¤é´Á
     C           KEYE22    KLIST                           *PYE2PF
     C                     KFLD           DE501            ¤½¥q§O
     C                     KFLD           TMPFD4           ­û¤u½s¸¹
     C                     KFLD           DE507            ¥Í®Ä¤é´Á
     C           KEYE51    KLIST                           *PYEMPF
     C                     KFLD           DE501            ¤½¥q§O
     C                     KFLD           DE502            ­û¤u½s¸¹
     C                     KFLD           DE507            ²²ÄÝÃÒ¸¹
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
    C           SCID      CASEQ'SC02'    R2000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C                     MOVE 'SC01'    SCID    4
|    C* FUN AUT
|    C                     MOVE $ADD      @A01,1
|    C                     MOVE $UPD      @A01,2
|    C                     MOVE $DLT      @A01,4
|    C                     MOVE $INQ      @A01,5
|    C*
|    C* SC01 FIELD INITIALIZE *--------------------------------------*
|    C                     MOVEL*BLANK    DE507            ²²ÄÝÃÒ¸¹
|    C                     Z-ADD0         DE512            ¥Í®Ä¤é´Á
|    C                     Z-ADD1         DOPT
|    C*¤½¥q
|    C                     MOVEL$COR      DE501
| 01-C           $RMK03    IFNE 'Y'
|   C                     SETON                     32
| 01*C                     ELSE
|   C                     SETOF                     32
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN18     IFEQ '1'                        *BROWSE
|   C                     EXSR R1A00
|   C                     GOTO E1000
| 02-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 03-C           *IN99     IFEQ '0'
|   C                     EXSR R1C00
|   C                     MOVEL'SC02'    SCID             *SCR2
| 03-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1A00 ....¥þ­¶¬d¸ß (PF18 : CALL SUB-PROGRAM)
     C*==============================================================*
03===C           R1A00     BEGSR
|    C*
|    C* AUT CHECK
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM 'PYI111'  S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     99
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C   99                GOTO E1A00
|    C*
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* CALL SUB-PROGRAM
|    C                     CALL 'PYI111'
|    C           DE501     PARM DE501     I202I0  2         ¤½¥q½s¸¹
|    C           DE502     PARM DE502     I202I1  8         ­û¤u½s¸¹
|    C           DE507     PARM DE507     I202I2 10         ²²ÄÝÃÒ¸¹
|    C           DE512     PARM DE512     I202I3  60        ¥Í®Ä¤é´Á
|    C                     PARM           @RTNC   2
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* RETURN CODE CHECK
| 02-C           @RTNC     IFEQ '03'                       *PF3
|   C                     SETON                     03
| 02-C                     END
|    C*
03===C           E1A00     ENDSR
     C*==============================================================*
     C*          R1B00 ....SCREEN CHECK
     C*==============================================================*
04===C           R1B00     BEGSR
|    C* CHK FUN AUT
| 01-C           @A01,DOPT IFNE 'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 01-C                     END
|    C   99                GOTO E1B00
|    C*+<<DATA CHECK>>+++++++++++++++++++++++++++++++++++++++++++++++++
|    C*­û¤u½s¸¹
| 02-C           DE502     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 02-C                     ENDIF
|    C*²²ÄÝ¨­¥÷ÃÒ¦r¸¹
| 03-C           DE507     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 03*C                     ELSE
|   C*
|   C*CHECK ¿é¤Jªº²²ÄÝÃÒ¸¹¬O§_¬°¦³®Äªº¨­¥÷ÃÒID
|   C*
|   C                     CALL 'P02'
|   C                     PARM DE507     P03I1  10
|   C                     PARM           P03O1   1
|   C                     PARM           P03O2   1
| 04-C           P03O1     IFEQ 'N'
|   C                     MOVEL'UPT0045' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 04-C                     END
| 03-C                     ENDIF
|    C   99                GOTO E1B00
|    C*
|    C*---------------------------------------------------------------
|    C*¥Í®Ä¤é´Á-¤£¥iªÅ¥Õ, CHECK¤é´Á®æ¦¡¬O§_¥¿½T?
| 05-C           DE512     IFEQ 0
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 05-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'P30'
|    C                     PARM DE512     P3001I  80
|    C                     PARM '1'       P3002I  1
|    C                     PARM '1'       P3003I  1
|    C                     PARM           P3011O  1
|    C*
| 06-C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 06-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* CHECK ¸ê®Æ¦b·s¼W®É,¬O§_¦s¦b?
|    C                     CALL 'P31'
|    C                     PARM DE512     P3101I  80
|    C                     PARM '1'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           E512      PARM           P3111O  80
|    C                     Z-ADDP3111O    TE512
|    C           KEYE5     CHAINE50                  40
| 07-C           DOPT      IFEQ 1                          *ADD
|   C           *IN40     ANDEQ'0'
|   C                     MOVEL'UPT2020' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     626399
| 07-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* CHECK ¸ê®Æ¦b«D·s¼W®É,¬O§_¤£¦s¦b?
| 08-C           DOPT      IFNE 1                          *UPD,DEL,INQ
|   C           *IN40     ANDEQ'1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     626399
| 08-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* TMPFD1--¦s©ñ¤W¤@µ§¸ê®Æªº²§°ÊÃþ§O
|    C* TMPFD4--¦s©ñ¤W¤@µ§¸ê®Æªº­û¤u½s¸¹
|    C*
|    C                     Z-ADD0         COUNT   20
|    C                     MOVEL*BLANK    TMPFD1  1        ²§°ÊÃþ§O
|    C                     MOVEL*BLANK    TMPFD4  8        ­û¤u½s¸¹
|    C*
|    C*§ì¿é¤Jªº²²ÄÝÃÒ¸¹¦b°·«OÀÉ¤¤¦³´Xµ§°O¿ý
|    C*
|    C           KEYE51    SETLLE5X
|    C           KEYE51    READEE5X                      46
| 09-C           *IN46     DOWEQ'0'
|   C*
|   C* COUNT°O¿ý¦³´Xµ§²²ÄÝ
|   C*
|   C                     ADD  1         COUNT
|   C*
|   C           KEYE51    READEE5X                      46
| 09-C                     ENDDO
|    C*
|    C*­Y¸Ó¦W²²ÄÝ¦b°·«OÀÉ¤¤¦³1µ§¥H¤Wªº°O¿ý
|    C*
| 10-C           COUNT     IFGT 0
|   C                     CALL 'P31'
|   C                     PARM DE512     P3101I  80
|   C                     PARM '1'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C                     PARM           P3111O  80
|   C*
| 11-C                     SELEC
|   C*
|   C*­Y°·«O²²ÄÝÀÉ¦³¸Ó¦W²²ÄÝ¸ê®Æ,¥B§@·~¿ï¾Ü¬°1(·s¼W) ,
|   C*­n§PÂ_--¥Í®Ä¤é´Á¥²>³Ìªñ¤@µ§¤é´Á°O¿ý
|   C*
|   C           DOPT      WHEQ 1
| 12-C           P3111O    IFLE E512
|   C                     MOVEL'UPT0043' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 12-C                     ENDIF
|   C*
|   C*­Y°·«O²²ÄÝÀÉ¦³¸Ó¦W²²ÄÝ¸ê®Æ,¥B§@·~¿ï¾Ü¬°2 OR 4 (­×§ï§R°£)
|   C*­n§PÂ_--¥Í®Ä¤é´Á¥²=³Ìªñ¤@µ§¤é´Á°O¿ý
|   C*
|   C           DOPT      WHEQ 2
|   C           DOPT      OREQ 4
| 13-C           P3111O    IFNE E512
|   C                     MOVEL'UPT0043' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 13-C                     ENDIF
|   C*
| 11-C                     ENDSL
|   C*
|   C*§ì³Ì«á¤@µ§¸ê®Æªº­û¤u½s¸¹
|   C                     MOVELE502      TMPFD4           ­û¤u½s¸¹
|   C*
|   C*§ì³Ì«á¤@µ§¸ê®Æªº²§°ÊÃþ§O--·s¼W
| 14-C           DOPT      IFEQ 1
|   C                     MOVELE513      TMPFD1           ²§°ÊÃþ§O
| 14-C                     ENDIF
|   C*
|   C*§ì³Ì«á¤@µ§¸ê®Æªº²§°ÊÃþ§O--­×§ï
| 15-C           DOPT      IFEQ 2
|   C           KEYE5     SETLLE50
|   C           DE507     REDPEE50                      47
|   C  N47                MOVELE513      TMPFD1           ²§°ÊÃþ§O
| 15-C                     ENDIF
|   C*
| 10-C                     ENDIF
|    C*
04===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....MOVE  SCREEN TO SCID
     C*==============================================================*
05===C           R1C00     BEGSR
|    C*
|    C                     MOVE TFUN,DOPT DFUN
|    C*
| 01-C           DOPT      IFEQ 1
|   C                     EXSR R1CA0
| 01*C                     ELSE
|   C                     EXSR R1CB0
| 01-C                     END
|    C*
| 02-C           DOPT      IFNE 1
|   C           DOPT      ANDNE2
|   C                     SETON                     313334
| 02-C                     END
|    C*
| 03-C           DOPT      IFEQ 5
|   C           *LOVAL    SETLLE50
| 03-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R1CA0 ....²M°£µe­±ÅÜ¼Æ
     C*==============================================================*
06===C           R1CA0     BEGSR
|    C*
|    C*§PÂ_­Y¸Ó¦W²²ÄÝ­Y¨S¦³°O¿ý,«h¥i·s¼W¥þ³¡Äæ¦ì¸ê®Æ
|    C*  ­Y¸Ó¦W²²ÄÝ¦³¶W¹L¤@µ§¥H¤W°O¿ý,¥u¥i·s¼W³¡¥÷Äæ¦ì¸ê®Æ
|    C                     SETOF                     313334
|    C*
| 01-C                     SELEC
|   C*
|   C*µL¸Ó¦W²²ÄÝ¸ê®Æ
|   C           COUNT     WHEQ 0
|   C                     MOVEL*BLANKS   DE506            ²²ÄÝ©m¦W
|   C                     Z-ADD0         DE508            ¥X¥Í¤é´Á
|   C                     MOVEL*BLANKS   DE509            ²²ÄÝºÙ¿×
|   C                     MOVEL*BLANKS   DE509N           ºÙ¿×¦WºÙ
|   C                     MOVEL*BLANKS   DE513            ²§°ÊÃþ§O
|   C*                    MOVEL*BLANKS   DE501            ¤½¥q§O
|   C*                    MOVEL*BLANKS   DCM02            ¤½¥q¦WºÙ
|   C*                    MOVEL*BLANKS   DE502            ­û¤u½s¸¹
|   C*                    MOVEL*BLANKS   DEM03            ­û¤u©m¦W
|   C                     MOVEL*BLANKS   DE511            ¸É§U½X
|   C                     MOVEL*BLANKS   DE511N           ¸É§U¦WºÙ
|   C                     MOVEL'Y'       DFLG             ²Ä¤@µ§¸ê®Æ
|   C*
|   C*¤w¦³¸Ó²²ÄÝ¸ê®Æ
|   C           COUNT     WHGT 0
|   C*
|   C                     SETON                     3334
|   C           DE507     SETLLE50
|   C           DE507     READEE50                      46
|   C*
|   C                     MOVELE506      DE506            ²²ÄÝ©m¦W
|   C*
| 02-C           E508      IFNE 0
|   C                     Z-ADDE508      DE508            ¥X¥Í¤é´Á
|   C                     Z-ADDE508      WYMD             ¥X¥Í¤é´Á
| 02*C                     ELSE
|   C                     Z-ADD0         DE508            ¥X¥Í¤é´Á
| 02-C                     ENDIF
|   C*
| 03-C           TMPFD1    IFEQ '3'
|   C                     SETOF                     34
| 03-C                     ENDIF
|   C*
|   C                     MOVELE509      DE509            ºÙ¿×
|   C*
|   C*±a¥XºÙ¿×¤¤¤å
|   C                     MOVEL*BLANK    #Y01
|   C                     MOVEL*BLANK    #Y02
|   C                     MOVEL*BLANK    DE509N           ºÙ¿×¦WºÙ
|   C                     MOVEL'RELATION'#Y01
|   C                     MOVELE509      #Y02
|   C           KEY#Y     CHAIN#Y0                  40
|   C  N40                MOVEL#Y03      DE509N           ºÙ¿×¦WºÙ
|   C*
|   C*                    MOVEL*BLANKS   DE513            ²§°ÊÃþ§O
|   C*                    MOVEL*BLANK    DE501            ¤½¥q§O
|   C*                    MOVEL*BLANK    DCM02            ¤½¥q¦WºÙ
|   C*
|   C*                    MOVEL*BLANK    DE502            ­û¤u½s¸¹
|   C*                    MOVEL*BLANK    DEM03            ­û¤u©m¦W
|   C*
|   C*                    MOVEL*BLANK    DE511            ¸É§U
|   C*                    MOVEL*BLANK    DE511N           ¸É§U¦WºÙ
|   C*
| 01-C                     ENDSL
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R1CB0 ....·h­È¨ìµe­±
     C*==============================================================*
07===C           R1CB0     BEGSR
|    C*
|    C                     CALL 'P31'
|    C                     PARM DE512     P3101I  80
|    C                     PARM '1'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C                     PARM           P3111O  80
|    C*§PÂ_­Y¸Ó¦W²²ÄÝ­Y¨S¦³°O¿ý©Î¬O­×§ï²Ä¤@µ§°O¿ý,«h¥i­×§ï¥þ³¡Äæ¦ì
|    C*  ­Y¸Ó¦W²²ÄÝ¦³¶W¹L¤@µ§¥H¤W°O¿ý,¥u¥i­×§ï³¡¥÷Äæ¦ì
|    C                     SETOF                     313334
|    C*
| 01-C           COUNT     IFGT 1
|   C                     SETON                     3334
| 01-C                     ENDIF
|    C*
|    C*§ì¸Ó²²ÄÝ¬O§_­×§ï²Ä¤@µ§°O¿ý,­Y¬°²Ä¤@µ§«h¥i¥H­×§ï¥þ³¡Äæ¦ì
|    C                     MOVEL*BLANK    DFLG    1
|    C           DE507     SETLLE50
|    C           DE507     READEE50                      47
| 02-C  N47      P3111O    IFEQ E512
|   C                     SETOF                     33
|   C                     MOVEL'Y'       DFLG
| 02-C                     ENDIF
|    C*
|    C*µù:¦bR1B00®É¦³CHAIN PYE5PFÀÉ,¦ý«á¨Ó¤S¥h¤ñ¹ï¦P¤@¤H
|    C*   «e¤@µ§¸ê®Æªº¤é´Á,©Ò¥H¦bR1CB0±a¥X¸ê®Æ®É,ÁÙ­n
|    C*   ¦A­«·sCHAIN¸ê®Æ,¥H½T«O¤£·|±a¿ù¸ê®Æ¨Ó­×§ï,§R°£,
|    C*   ¬d¸ß
|    C*
|    C                     Z-ADDP3111O    E512
|    C           KEYE5     CHAINE50                  40
|    C*
|    C                     MOVELE506      DE506            ²²ÄÝ©m¦W
|    C*
| 03-C           E508      IFNE 0
|   C                     Z-ADDE508      DE508            ¥X¥Í¤é´Á
| 03*C                     ELSE
|   C                     Z-ADD0         DE508            ¥X¥Í¤é´Á
| 03-C                     ENDIF
|    C*
| 04-C           TMPFD1    IFEQ '3'
|   C                     SETOF                     34
| 04-C                     ENDIF
|    C*
|    C                     MOVELE509      DE509            ºÙ¿×
|    C*
|    C*±a¥XºÙ¿×¤¤¤å
|    C                     MOVEL*BLANK    #Y01
|    C                     MOVEL*BLANK    #Y02
|    C                     MOVEL*BLANK    DE509N           ºÙ¿×¦WºÙ
|    C                     MOVEL'RELATION'#Y01
|    C                     MOVELE509      #Y02
|    C           KEY#Y     CHAIN#Y0                  40
|    C  N40                MOVEL#Y03      DE509N           ºÙ¿×¦WºÙ
|    C*
|    C                     MOVELE513      DE513            ²§°Ê§O
|    C*
|    C                     MOVELE501      DE501            ¤½¥q§O
|    C                     MOVEL*BLANK    DCM02            ¤½¥q¦WºÙ
|    C           E501      CHAINCM0                  40
|    C  N40                MOVELCM02      DCM02            ¤½¥q¦WºÙ
|    C*
|    C                     MOVELE502      DE502            ­û¤u½s¸¹
|    C                     MOVEL*BLANK    DEM03            ­û¤u©m¦W
|    C           KEYEM     CHAINEM0                  40
|    C  N40                MOVELEM03      DEM03            ­û¤u©m¦W
|    C*
|    C                     MOVELE511      DE511            ¸É§U
|    C*±a¥X¸É§U¤¤¤å
|00A+C           DE511     CHAINE90                  40
|00A+C           *IN40     IFEQ '0'
|00A+C                     CALL 'P65'
|00A+C                     PARM E904      P6501I 80        ³Q¤À³Î¦r¦ê
|00A+C                     PARM 32        P6502I  30       ¤À³Îªø«×
|00A+C           DE511N    PARM           P6511O 80        ¤À³Î«á¦r¦ê1
|00A+C                     PARM           P6512O 80        ¤À³Î«á¦r¦ê2
|00A+C                     ELSE                                        2
|00A+C                     MOVEL*BLANK    DE511N            ¸É§U¦WºÙ
|00A+C                     END                                         2
|00A-C*                    MOVEL*BLANK    #Y01
|00A-C*                    MOVEL*BLANK    #Y02
|00A-C*                    MOVEL*BLANK    DE511N            ¸É§U¦WºÙ
|00A-C*                    MOVEL'INSR'    #Y01
|00A-C*                    MOVELE511      #Y02
|00A-C*          KEY#Y     CHAIN#Y0                  40
|00A-C* N40                MOVEL#Y03      DE511N            ¸É§U¦WºÙ
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          R2000  ...'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
08===C           R2000     BEGSR
|    C*
|    C                     EXFMTDSPD2
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E2000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'                        *Äæ¦ì¬d¸ß
| 03-C           DOPT      IFEQ 1
|   C           DOPT      OREQ 2
|   C                     EXSR R2E00
| 03-C                     END
|   C                     GOTO E2000
| 02-C                     END
|    C*
| 04-C           *IN12     IFEQ '1'
|   C                     MOVEL'SC01'    SCID
|   C                     GOTO E2000
| 04-C                     END
|    C*
|    C*­n§PÂ_¥Í®Ä¤é´Á¤£¯à<=Á~¸ê½T»{¦~¤ë(R2B00¦³¥[¤J³o¬qÀË®Ö)
|    C*
| 05-C           DOPT      IFEQ 1
|   C           DOPT      OREQ 2
|   C*
|   C*²Ä¤@¦¸°·«O°O¿ý
|   C*
| 06-C           DFLG      IFEQ 'Y'
|   C                     EXSR R2B00                      *SCR CHK
| 06-C                     ENDIF
|   C*
|   C*«D²Ä¤@¦¸°·«O°O¿ý©MÀË®Ö¥Í®Ä¤é´Á¬O§_¤p©óÁ~¸ê½T»{¤é´Á
|   C*
|   C                     EXSR R2B10                      *SCR CHK
|   C                     EXSR R2B20                      *SCR CHK
| 05-C                     END
|    C*
|    C*ÀË®Ö¥Í®Ä¤é´Á¬O§_¤p©óÁ~¸ê½T»{¤é´Á
|    C*
| 07-C           DOPT      IFEQ 4
|   C                     EXSR R2B20                      *SCR CHK
| 07-C                     END
|    C*
| 08-C           *IN99     IFEQ '0'
|   C                     EXSR R2D00                      *FILE UPD
|   C                     MOVEL'SC01'    SCID             *SCR2
| 08-C                     END
|    C*
08===C           E2000     ENDSR
     C*==============================================================*
     C*          R2B00 ....CHECK 'SC02' SCREEN--²²ÄÝ²Ä¤@¦¸°·«O°O¿ý
     C* µù:¥²»ÝÀË®Ö-- ²²ÄÝ©m¦W , ¥X¥Í¤é´Á , ºÙ¿×
     C*
     C*==============================================================*
09===C           R2B00     BEGSR
|    C*
|    C*²²ÄÝ©m¦W-¤£¥iªÅ¥Õ
| 01-C           DE506     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 01-C                     ENDIF
|    C   99                GOTO E2B00
|    C*
|    C*¥X¥Í¤é´Á-¤£¥i¬°0,¤é´Á­n§PÂ_¬°¤é´Á®æ¦¡
| 02-C           DE508     IFEQ 0
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 02*C                     ELSE
|   C*
|   C                     CALL 'P30'
|   C                     PARM DE508     P3001I  80
|   C                     PARM '1'       P3002I  1
|   C                     PARM '1'       P3003I  1
|   C                     PARM           P3011O  1
|   C*
| 03-C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 03-C                     END
| 02-C                     ENDIF
|    C   99                GOTO E2B00
|    C*
|    C                     CALL 'P31'
|    C                     PARM DE508     P3101I  80
|    C                     PARM '1'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C                     PARM           P3111O  80
|    C                     Z-ADDP3111O    WYMD    80
|    C*
|    C*ºÙ¿×--¤£¥iªÅ¥Õ,¤£¥i¤£¦s¦bÀÉ®×¤¤
| 04-C           DE509     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 04*C                     ELSE
|   C                     MOVEL*BLANK    #Y01
|   C                     MOVEL*BLANK    #Y02
|   C                     MOVEL*BLANK    DE509N            ºÙ¿×¦WºÙ
|   C                     MOVEL'RELATION'#Y01
|   C                     MOVELDE509     #Y02
|   C           KEY#Y     CHAIN#Y0                  40
|   C  N40                MOVEL#Y03      DE509N            ºÙ¿×¦WºÙ
|   C   40                MOVEL'UPT0043' ERRID
|   C   40                MOVEL'PTMF'    ERRF
|   C   40                SETON                     6299
| 04-C                     ENDIF
|    C   99                GOTO E2B00
|    C*
09===C           E2B00     ENDSR
     C*==============================================================*
     C*          R2B10 ....CHECK 'SC02' SCREEN--²²ÄÝ«D²Ä¤@¦¸°·«O°O¿ý
     C* µù:¥²»ÝÀË®Ö-- ¤½¥q§O,­û¤u½s¸¹,²§°Ê§O,¸É§U½X
     C*
     C*==============================================================*
10===C           R2B10     BEGSR
|    C*
|    C*ºÙ¿×--­Y¸Ó¦W²²ÄÝ«e¤@µ§°O¿ý¬°°h«O,¥Ø«e¸Óµ§¸ê®Æ´N¥i¿é¤JºÙ¿×
|    C*ºÙ¿×--¤£¥iªÅ¥Õ,¤£¥i¤£¦s¦bÀÉ®×¤¤
| 01-C           TMPFD1    IFEQ '3'
| 02-C           DE509     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 02*C                     ELSE
|   C                     MOVEL*BLANK    #Y01
|   C                     MOVEL*BLANK    #Y02
|   C                     MOVEL*BLANK    DE509N            ºÙ¿×¦WºÙ
|   C                     MOVEL'RELATION'#Y01
|   C                     MOVELDE509     #Y02
|   C           KEY#Y     CHAIN#Y0                  40
|   C  N40                MOVEL#Y03      DE509N            ºÙ¿×¦WºÙ
|   C   40                MOVEL'UPT0043' ERRID
|   C   40                MOVEL'PTMF'    ERRF
|   C   40                SETON                     6299
| 02-C                     ENDIF
| 01-C                     ENDIF
|    C   99                GOTO E2B10
|    C*
|    C*
|    C*²§°ÊÃþ§O-¤£¥iªÅ¥Õ,¤£¥i¬°1,2,3¥H¥~ªº­È
| 03-C           DE513     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 03*C                     ELSE
|   C*
| 04-C           DE513     IFNE '1'
|   C           DE513     ANDNE'2'
|   C           DE513     ANDNE'3'
|   C                     MOVEL'UPT0043' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 04-C                     ENDIF
| 03-C                     ENDIF
|    C   99                GOTO E2B10
|    C*
| 05-C                     SELEC
|   C*
|   C*¦¹²²ÄÝµL°·«O°O¿ý
|   C           COUNT     WHEQ 0
| 06-C           DOPT      IFEQ 1
|   C           DOPT      OREQ 2
|   C*
|   C*µL°·«O°O¿ý®É,²§°ÊÃþ§O¤£¬°2©Î3
| 07-C           DE513     IFNE '1'
|   C                     MOVEL'UPT0043' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 07-C                     ENDIF
|   C*
| 06-C                     ENDIF
|   C*
|   C*¦¹²²ÄÝ¦³°·«O°O¿ý
|   C           COUNT     WHGT 0
| 08-C           DOPT      IFEQ 1
|   C           DOPT      OREQ 2
|   C*
| 09-C                     SELEC
|   C*
|   C*¤W¤@µ§°O¿ýªº²§°ÊÃþ§O¬°1©Î2®É,¥Ø«e³oµ§°O¿ý²§°ÊÃþ§O¤£¬°1
|   C           TMPFD1    WHEQ '1'
|   C           TMPFD1    OREQ '2'
|   C*
| 10-C           DE513     IFEQ '1'
|   C                     MOVEL'UPT0043' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 10-C                     ENDIF
|   C*
|   C*¤W¤@µ§°O¿ýªº²§°ÊÃþ§O¬°1©Î2®É,¥Ø«e³oµ§°O¿ý­û¤u½s¸¹¤£¥i
|   C*ÅÜ§ó¸ê®Æ
| 11-C           DE502     IFNE TMPFD4
|   C                     MOVEL'UPT0043' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     646699
| 11-C                     ENDIF
|   C*
|   C*¤W¤@µ§°O¿ýªº²§°ÊÃþ§O¬°3®É,¥Ø«e³oµ§°O¿ý²§°ÊÃþ§O¤£¬°2©Î3
|   C           TMPFD1    WHEQ '3'
|   C*
| 12-C           DE513     IFNE '1'
|   C                     MOVEL'UPT0043' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 12-C                     ENDIF
|   C*
| 09-C                     ENDSL
|   C*
| 08-C                     ENDIF
|   C*
| 05-C                     ENDSL
|    C   99                GOTO E2B10
|    C*---------------------------------------------------------------
|    C*¤½¥q§O¤£¥iªÅ¥Õ--¥B­n¦s¦b
|    C                     MOVEL*BLANKS   DCM02
| 13-C           DE501     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6699
| 13-C                     END
|    C   99                GOTO E2B10
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DE501     CM001I  2         ¤½¥q¥N¸¹
|    C           DCM02     PARM           CM002O 22         ¤½¥q¦WºÙ
|    C                     PARM           CM003O 32         ¥N½X»¡©ú
|    C           DFMT      PARM           CM004O  1         ¤é´Á®æ¦¡
|    C           DTYPE     PARM           CM005O  1         ¤é´Á¾ä§O
|    C                     PARM           CM098O 50         ³Æ¥ÎÄæ
|    C                     PARM           CM099O  1         ¦s¦b§_¡H
|    C*¦s¦b§_¡H(Y-¦s¦b¦³Åv§QN-¦s¦bµLÅv§Q*BLANK-¤£¦s¦b)
| 14-C           CM099O    IFEQ 'N'
|   C                     SETON                     6699
|   C                     MOVEL'US#0099' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 14-C                     END
|    C   99                GOTO E2B10
|    C*
| 15-C           CM099O    IFEQ *BLANK
|   C                     SETON                     6699
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 15-C                     END
|    C   99                GOTO E2B10
|    C*
|    C*­û¤u½s¸¹¤£¥iªÅ¥Õ,­n¦s¦bÀÉ®×¤¤
| 16-C           DE502     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 16*C                     ELSE
|   C                     MOVEL*BLANK    DEM03            ­û¤u©m¦W
|   C           KEYEM     CHAINEM0                  40
|   C  N40                MOVELEM03      DEM03            ­û¤u©m¦W
|   C   40                MOVEL'UPT0043' ERRID
|   C   40                MOVEL'PTMF'    ERRF
|   C   40                SETON                     6499
| 16-C                     ENDIF
|    C   99                GOTO E2B10
|    C*
|    C*­û¤u³Ìªñ¤@µ§ªº°·«Oª¬ºA¤£¥i¬°°h«O
|    C*
|    C           KEYEM     SETGTE10
|    C           KEYEM     REDPEE10                      47
| 17-C           *IN47     IFEQ *OFF
|   C*
| 18-C           E104      IFEQ '3'
|   C*
|   C                     MOVEL'UPT0043' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
|   C*
| 18-C                     ENDIF
| 17-C                     ENDIF
|    C   99                GOTO E2B10
|    C*
|    C*¸É§U¤£¥i¬°ªÅ¥Õ,­n¦s¦bÀÉ®×¤¤
|    C*          DE511     IFEQ *BLANK
|    C*                    MOVEL'UPT0010' ERRID
|    C*                    MOVEL'PTMF'    ERRF
|    C*                    SETON                     6599
|    C*                    ELSE
|    C*
|    C*¸É§U­n¦s¦bÀÉ®×¤¤
| 19-C           DE511     IFNE *BLANK
|00A+C           DE511     CHAINE90                  40
|00A+C           *IN40     IFEQ '1'
|00A+C                     MOVEL'UPT0043' ERRID
|00A+C                     MOVEL'PTMF'    ERRF
|00A+C                     SETON                     6599
|00A+C                     MOVEL*BLANK    DE511N            ¸É§U¦WºÙ
|00A+C                     ELSE
|00A+C                     CALL 'P65'
|00A+C                     PARM E904      P6501I 80        ³Q¤À³Î¦r¦ê
|00A+C                     PARM 32        P6502I  30       ¤À³Îªø«×
|00A+C           DE511N    PARM           P6511O 80        ¤À³Î«á¦r¦ê1
|00A+C                     PARM           P6512O 80        ¤À³Î«á¦r¦ê2
|00A+C                     END
|00A-C*                    MOVEL*BLANK    #Y01
|00A-C*                    MOVEL*BLANK    #Y02
|00A-C*                    MOVEL*BLANK    DE511N            ¸É§U¦WºÙ
|00A-C*                    MOVEL'INSR'    #Y01
|00A-C*                    MOVELDE511     #Y02
|00A-C*          KEY#Y     CHAIN#Y0                  40
|00A-C* N40                MOVEL#Y03      DE511N            ¸É§U¦WºÙ
|00A-C*  40                MOVEL'UPT0043' ERRID
|00A-C*  40                MOVEL'PTMF'    ERRF
|00A-C*  40                SETON                     6599
| 19-C                     ENDIF
|    C   99                GOTO E2B10
|    C*
10===C           E2B10     ENDSR
     C*==============================================================*
     C*          R2B20 ....CHECK 'SC02' SCREEN--ÀË®Ö¯S®íÄæ¦ì
     C* µù:ÀË®ÖÄæ¦ì-- ¥Í®Ä¤é´Á
     C*
     C*==============================================================*
11===C           R2B20     BEGSR
|    C*
|    C* CHECK§@·~¿ï¾Ü¤£¬°5(¬d¸ß)®É,
|    C*¥Í®Ä¤é´Á¤£¯à¤p©óµ¥©ó¤U´ÁÁ~¸ê½T»{¦~¤ë
|    C*
|    C                     MOVEL'01'      PM01
|    C                     MOVELDE501     PM02
|    C           KEYPM     CHAINPM0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     Z-ADD*ZERO     PM201
|   C                     Z-ADD*ZERO     PM202
|   C                     Z-ADD*ZERO     PM205
|   C                     Z-ADD*ZERO     PM206
|   C*                    MOVEL*BLANK    PM207
| 01-C                     END
|    C*
|    C*SPECIAL AUTHORITY CAN UPDATE AFTERÁ~¸ê¸Õºâ
| 02-C           DOPT      IFNE 5
| 03-C           DYM       IFLE PM206
|   C                     MOVEL'UPT0039' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6799
| 03-C                     END
| 02-C                     END
|    C   99                GOTO E2B20
|    C*
|    C*
11===C           E2B20     ENDSR
     C*==============================================================*
     C*          R2D00 ....FILE PROCESS
     C*==============================================================*
12===C           R2D00     BEGSR
|    C*
| 01-C           DOPT      CASEQ1         R2D10
|   C           DOPT      CASEQ2         R2D20
|   C           DOPT      CASEQ4         R2D30
| 01-C                     END
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          R2D10 ....FILE PROCESS : ADD
     C*==============================================================*
13===C           R2D10     BEGSR
|    C* HEAD
|    C                     EXSR R2D11
|    C                     WRITEE50
|    C                     CLEARE50
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          R2D11 ....SCREEN FIELD TO FILE
     C*==============================================================*
14===C           R2D11     BEGSR
|    C*
|    C                     MOVELDE501     E501             ¤½¥q§O
|    C                     MOVELDE507     E507             ²²ÄÝÃÒ¸¹
|    C                     CALL 'P31'
|    C                     PARM DE512     P3101I  80
|    C                     PARM '1'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           E512      PARM           P3111O  80
|    C                     Z-ADDWYMD      E508             ¥X¥Í¤é´Á
|    C                     MOVELDE506     E506             ²²ÄÝ©m¦W
|    C                     MOVELDE509     E509             ºÙ¿×
|    C                     MOVELDE513     E513             ²§°Ê§O
| 01-C           E513      IFEQ '3'
|   C                     MOVEL'Y'       E505
| 01*C                     ELSE
|   C                     MOVEL*BLANK    E505
| 01-C                     ENDIF
|    C                     MOVELDE502     E502             ­û¤u½s¸¹
|    C                     MOVELDE511     E511             ¸É§U
|    C**
|    C                     Z-ADD$A8YMD    E597             §ó·s¤é´Á
|    C                     TIME           E598             §ó·s®É¶¡
|    C                     MOVEL$USER     E599             ¨Ï¥ÎªÌ¥N¸¹
|    C**
|    C*
|    C                     EXSR R2D12
|    C*
14===C                     ENDSR
     C*==============================================================*
     C*          R2D12 ....SCREEN FIELD TO FILE -- PYE2PF
     C*==============================================================*
15===C           R2D12     BEGSR
|    C**
|    C*¥ý±N¸Ó²²ÄÝ¦bPYE2PFµ¹¤©§R°£,¤§«á¦A·s¼W³Ì·sª¬ºA¼g¦^PYE2PF
|    C**
|    C           KEYE22    CHAINE20                  40
|    C*
|    C  N40                DELETE20
|    C**
|    C*®Ú¾Ú­û¤u©Ò«Ø¥ßªº²²ÄÝ¸ê®Æµ¹¤©§Ç¸¹
|    C**
|    C                     Z-ADD0         TMPFD3  30
|    C           KEYEM     SETGTE27                  47
|    C           KEYEM     REDPEE27                      46
|    C*
|    C  N46      E204      ADD  1         TMPFD3           §Ç¸¹
|    C   46                Z-ADD1         TMPFD3           §Ç¸¹
|    C*
|    C*±NPYE5PF³Ìªñªº²²ÄÝ¸ê®Æ¼g¤J¨ìPYE2PF
|    C*
|    C           KEYE2     CHAINE20                  40
|    C*
|    C                     MOVELE501      E201             ¤½¥q½s¸¹
|    C                     MOVELE502      E202             ­û¤u½s¸¹
|    C                     MOVELE507      E207             ²²ÄÝÃÒ¸¹
|    C                     Z-ADDE512      E203             ¥Í®Ä¤é´Á
|    C*
| 01-C           E513      IFEQ '3'
|   C                     MOVEL'Y'       E205             °±«O
| 01*C                     ELSE
|   C                     MOVEL*BLANK    E205             °±«O
| 01-C                     ENDIF
|    C*
|    C*          TMPFD4    IFNE DE507
|    C   40                Z-ADDTMPFD3    E204             §Ç¸¹
|    C*                    ENDIF
|    C*
|    C                     MOVELE506      E206             ²²ÄÝ©m¦W
|    C                     MOVELE508      E208             ¥X¥Í¤é´Á
|    C                     MOVELE509      E209             ²²ÄÝºÙ¿×
|    C                     MOVELE511      E211             ¸É§U½X
|    C**
|    C                     Z-ADD$A8YMD    E297             §ó·s¤é´Á
|    C                     TIME           E298             §ó·s®É¶¡
|    C                     MOVEL$USER     E299             ¨Ï¥ÎªÌ¥N¸¹
|    C**
|    C   40                WRITEE20
|    C  N40                UPDATE20
|    C                     CLEARE20
|    C*
15===C                     ENDSR
     C*==============================================================*
     C*          R2D20 ....FILE PROCESS : UPD
     C*==============================================================*
16===C           R2D20     BEGSR
|    C* DETAIL
|    C                     EXSR R2D11
|    C                     UPDATE50
|    C                     CLEARE50
|    C*
16===C                     ENDSR
     C*==============================================================*
     C*          R2D30 ....FILE PROCESS
     C*==============================================================*
17===C           R2D30     BEGSR
|    C*
|    C                     DELETE50
|    C                     EXSR R2D31
|    C*
17===C                     ENDSR
     C*==============================================================*
     C*          R2D31 ....SCREEN FIELD TO FILE -- PYE2PF
     C*==============================================================*
18===C           R2D31     BEGSR
|    C**
|    C*·íPYE5PF¦¨¥\±þ¤F¤@µ§¸ê®Æ,PYE2PF¤]­n±þ±¼¨ºµ§°O¿ý
|    C*µù:²²ÄÝµ§¼Æ¤]­n¦©±¼1,¦]¬°R1B00¦³­pºâ²²ÄÝµ§¼Æ
|    C**
|    C           KEYE2     CHAINE20                  40
|    C*
|    C  N40                DELETE20
|    C  N40                SUB  1         COUNT
|    C*
| 01-C           COUNT     IFGT 0
|   C**
|   C*®Ú¾Ú­û¤u©Ò«Ø¥ßªº²²ÄÝ¸ê®Æµ¹¤©§Ç¸¹
|   C**
|   C                     Z-ADD0         TMPFD3  30
|   C           KEYEM     SETGTE27                  47
|   C           KEYEM     REDPEE27                      46
|   C*
|   C  N46      E204      ADD  1         TMPFD3           §Ç¸¹
|   C   46                Z-ADD1         TMPFD3           §Ç¸¹
|   C*
|   C*±NPYE5PF³Ìªñªº²²ÄÝ¸ê®Æ¼g¤J¨ìPYE2PF
|   C*
|   C           DE507     SETGTE50
|   C           DE507     REDPEE50                      46
|   C*
| 02-C           *IN46     IFEQ *OFF
|   C                     MOVELE501      E201             ¤½¥q½s¸¹
|   C                     MOVELE502      E202             ­û¤u½s¸¹
|   C                     MOVELE507      E207             ²²ÄÝÃÒ¸¹
|   C*
|   C           KEYE21    CHAINE20                  40
|   C*
|   C                     Z-ADDE512      E203             ¥Í®Ä¤é´Á
|   C*
| 03-C           E513      IFEQ '3'
|   C                     MOVEL'Y'       E205             °±«O
| 03*C                     ELSE
|   C                     MOVEL*BLANK    E205             °±«O
| 03-C                     ENDIF
|   C*
|   C*          TMPFD4    IFNE DE507
|   C   40                Z-ADDTMPFD3    E204             §Ç¸¹
|   C*                    ENDIF
|   C*
|   C                     MOVELE506      E206             ²²ÄÝ©m¦W
|   C                     MOVELE508      E208             ¥X¥Í¤é´Á
|   C                     MOVELE509      E209             ²²ÄÝºÙ¿×
|   C                     MOVELE511      E211             ¸É§U½X
|   C**
|   C                     Z-ADD$A8YMD    E297             §ó·s¤é´Á
|   C                     TIME           E298             §ó·s®É¶¡
|   C                     MOVEL$USER     E299             ¨Ï¥ÎªÌ¥N¸¹
|   C**
|   C   40                WRITEE20
|   C  N40                UPDATE20
|   C                     CLEARE20
|   C*
| 02-C                     ENDIF
|   C*
| 01-C                     ENDIF
|    C**
18===C                     ENDSR
     C*==============================================================*
     C*          R2E00 ....Äæ¦ì¬d¸ß (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
19===C           R2E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*ºÙ¿×
| 01-C           #LIN      IFEQ 10
|   C           #COL      ANDEQ58
|   C                     CALL 'PTIZ21'
|   C                     PARM 'RELATION'P201I1 10        ¥N½XÄæ¦ì
|   C           DE509     PARM DE509     P201I2 10        ¥N½X½s¸¹
|   C                     MOVEL*BLANKS   #Y01
|   C                     MOVEL*BLANKS   #Y02
|   C                     MOVEL*BLANKS   DE509N           ºÙ¿×¤¤¤å
|   C                     MOVEL'RELATION'#Y01
|   C                     MOVELDE509     #Y02
|   C           KEY#Y     CHAIN#Y0                  40
|   C  N40                MOVEL#Y03      DE509N           ºÙ¿×¤¤¤å
|   C   40                MOVEL*BLANKS   DE509N           ºÙ¿×¤¤¤å
| 01-C                     ENDIF
|    C*
|    C*­û¤u½s¸¹DE502
|    C*          #LIN      IFEQ 13
|    C*          #COL      ANDGE47
|    C*          #COL      ANDLE56
|    C*                    CALL 'PYI101'
|    C*                    PARM DE501     P101I1  2         ¤½¥q§O
|    C*          DE502     PARM DE502     P101I2 10         ­û¤u¡@
|    C*                    PARM           P101I3 10         ­û¤u¡@
|    C*                    PARM           @RTNC   2          FUN KEY
|    C*                    END
|    C*
|    C           KEYEM     CHAINEM0                  40    *NF
|    C   40                MOVEL*BLANKS   DEM03
|    C  N40                MOVELEM03      DEM03
|    C*
|    C*¸É§U
| 02-C           #LIN      IFEQ 14
|   C           #COL      ANDEQ9
|00A+C                     CALL 'TRW006'
|00A+C           DE511     PARM DE511     P120O1  1
|00A+C           DE511     CHAINE90                  40
|00A+C           *IN40     IFEQ '0'
|00A+C                     CALL 'P65'
|00A+C                     PARM E904      P6501I 80        ³Q¤À³Î¦r¦ê
|00A+C                     PARM 32        P6502I  30       ¤À³Îªø«×
|00A+C           DE511N    PARM           P6511O 80        ¤À³Î«á¦r¦ê1
|00A+C                     PARM           P6512O 80        ¤À³Î«á¦r¦ê2
|00A+C                     ELSE                                        2
|00A+C                     MOVEL*BLANK    DE511N            ¸É§U¦WºÙ
|00A+C                     END                                         2
|   C*00A-                CALL 'PTIZ21'
|   C*00A-                PARM 'INSR'    P201I1           ¥N½XÄæ¦ì
|   C*00A-      DE511     PARM DE511     P201I2           ¥N½X½s¸¹
|   C*00A-                MOVEL*BLANKS   #Y01
|   C*00A-                MOVEL*BLANKS   #Y02
|   C*00A-                MOVEL*BLANKS   DE511N           ¸É§U¤¤¤å
|   C*00A-                MOVEL'INSR'    #Y01
|   C*00A-                MOVELDE511     #Y02
|   C*00A-      KEY#Y     CHAIN#Y0                  40
|   C*00A-N40                MOVEL#Y03      DE511N           ¸É§U¤¤¤å
|   C*00A- 40                MOVEL*BLANKS   DE511N           ¸É§U¤¤¤å
| 02-C                     ENDIF
|    C*
19===C                     ENDSR
     C*==============================================================*
**
·s¼W­×§ï      §R°£¬d¸ß
