     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : PYA104                                     *
     A*    PROGRAM NAME :教育訓練資料建立                          *
     A*    AUTHOR       : A1226 PETER                                *
     A*    CREATE DATE  : 85/08/27                                   *
     A*    UPDATE DATE  : 90/06/23 A1274 EVA                         *
     A*    SYSTEM       :人事薪資系統                              *
     A****************************************************************
     FPYEDPF  UF  E           K        DISK                      A
     FPYEMPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYECPF  IF  E           K        DISK
     FPYA104D CF  E                    WORKSTN      KINFDS DSPFDS
     E*----------------------------------------------------------------
     E                    @A01        5  1               作業權利
     E                    WFUN    5   5  6
     E*----------------------------------------------------------------
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I           UDS
     I                                      101 110 $USER
     I                                      203 2080DDATE
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I*
     I            DS
     I                                        1   7 DEM04
     I                                        1   7 EM04
     I                                        1   1 EM041
     I                                        2   2 EM042
     I                                        3   3 EM043
     I                                        4   7 EM044
     I*訓練類別
     I              '內訓'              C         CODE1
     I              '新人訓練'          C         CODE2
     I              '讀書會'            C         CODE3
     I              '研討會'            C         CODE4
     I              '外訓'              C         CODE5
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN CM004O    DFMT
     C           *LIKE     DEFN CM005O    DTYPE
     C           *LIKE     DEFN ED03      WED03
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYEM     KLIST                           *PYEMPF
     C                     KFLD           DED01
     C                     KFLD           DED02
     C           KEYED     KLIST                           *PYEDPF
     C                     KFLD           DED01
     C                     KFLD           DED02
     C                     KFLD           WED03
     C                     KFLD           DED11
     C           KEYDP     KLIST                           *PYEMPF
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
    C           SCID      CASEQ'SC02'    R2000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100  ...INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     MOVE 'SC01'    SCID    4
|    C* FUN AUT
|    C                     MOVE $ADD      @A01,1
|    C                     MOVE $UPD      @A01,2
|    C                     MOVE $DLT      @A01,4
|    C                     MOVE $INQ      @A01,5
|    C*
|    C                     MOVEL*BLANK    DED01
|    C                     MOVEL*BLANK    DED02
|    C                     Z-ADDDDATE     DED03
|    C                     MOVEL'1'       DED11
|    C                     Z-ADD1         DOPT
|    C*
|    C                     MOVEL$COR      DED01
| 01-C           $RMK03    IFNE 'Y'
|   C                     SETOF                     32
| 01*C                     ELSE
|   C                     SETON                     32
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|     *
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
|   C                     EXSR R1E00
|   C                     GOTO E1000
| 02-C                     END
|    C*
| 03-C           *IN18     IFEQ '1'                        *BROWSE
|   C                     EXSR R1A00
|   C                     GOTO E1000
| 03-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 04-C           *IN99     IFEQ '0'
|   C                     EXSR R1C00
|   C                     MOVEL'SC02'    SCID             *SCR2
| 04-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1A00 ....全頁查詢 (PF18 : CALL SUB-PROGRAM)
     C*==============================================================*
03===C           R1A00     BEGSR
|    C* AUT CHECK
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM 'PYI104'  S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     99
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C   99                GOTO E1A00
|    C*
|    C                     CALL 'PYI104'
|    C*----------------------------------------------------------------
|    C           DED01     PARM DED01     I104I1  2         公司編號
|    C           DED02     PARM DED02     I104I2  8         員工編號
|    C           DED03     PARM DED03     I104I3  60        受訓日期
|    C           DED11     PARM DED11     I104I4  1         受訓類別
|    C*----------------------------------------------------------------
|    C                     PARM           @RTNC   2          FUN KEY
|    C*
| 02-C           @RTNC     IFEQ '03'
|   C                     SETON                     03
| 02-C                     END
|    C*
03===C           E1A00     ENDSR
      *==============================================================*
      *          R1B00 ....SCREEN CHECK
      *==============================================================*
04===C           R1B00     BEGSR
|    C* CHK FUN AUT
|    C                     MOVE DOPT      WNUM    10
| 01-C           @A01,WNUM IFNE 'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 01-C                     END
|    C   99                GOTO E1B00
|    C*---------------------------------------------------------------
|    C* << CHACK 公司別NOT *BLANK >>
| 02-C           DED01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DED01     CM001I  2         公司代號
|    C                     PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C           DFMT      PARM           CM004O  1         日期格式
|    C           DTYPE     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 03-C*          CM099O    IFEQ 'N'
|   C*                    SETON                     6099
|   C*                    MOVEL'US#0099' ERRID
|   C*                    MOVEL'S#MF'    ERRF
| 03-C*                    END
|    C*  99                GOTO E1B00
|    C*
| 04-C*          CM099O    IFEQ *BLANK
|   C*                    SETON                     6099
|   C*                    MOVEL'UPT2010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
| 04-C*                    END
|    C*  99                GOTO E1B00
|    C*
|    C                     MOVELCM004O    DFMT
|    C                     MOVELCM005O    DTYPE
|    C*+<<DATA CHECK>>+++++++++++++++++++++++++++++++++++++++++++++++++
|     *: CHECK BLANK :
|    C           DED01     CHAINCM0                  40
|     *
| 05-C           DED02     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 05-C                     END
|    C   99                GOTO E1B00
|    C*
| 06-C           DED03     IFEQ 0
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 06*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM DED03     P3001I  80
|   C                     PARM '1'       P3002I  1
|   C                     PARM '1'       P3003I  1
|   C                     PARM           P3011O  1
| 07-C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 07-C                     END
| 06-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'P31'
|    C                     PARM DED03     P3101I  80
|    C                     PARM '1'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           WED03     PARM           P3111O  80
|    C*                    Z-ADDP3111O    WED03
|     *: CHECK KEY :
|    C*
|    C           KEYEM     CHAINEM0                  40    *NF
| 08-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606199
|   C                     SETON                     61
| 08-C                     END
|    C   99                GOTO E1B00
|    C*---------------------------------------------------------------
|    C*部門別
|    C                     CALL 'PYSCM1'
|    C                     PARM EM01      CM101I  2         公司代號
|    C                     PARM EM04      CM102I  7         部門代號
|    C                     PARM           CM103O 14         部門名稱
|    C                     PARM           CM199O  1         存在否？
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 09-C           CM199O    IFEQ 'N'
|   C                     SETON                     6199
|   C                     MOVEL'US#0098' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 09-C                     END
|    C   99                GOTO E1B00
|    C*
| 10-C           CM199O    IFEQ *BLANK
|   C                     SETON                     606199
|   C                     MOVEL'US#1111' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 10-C                     END
|    C   99                GOTO E1B00
|    C*---------------------------------------------------------------
|    C*
| 11-C           DOPT      IFEQ 1
|    *
| 12-C           EM11      IFEQ 'Y'
|   C           EM11      OREQ '*'
| 13-C           WED03     IFGE EM19
|   C                     MOVEL'UPT0090' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606162
|   C                     SETON                     99
| 13-C                     END
| 12-C                     END
|   C*
| 14-C           WED03     IFLT EM13
|   C                     MOVEL'UMI0360' ERRID
|   C                     MOVEL'CEMF'    ERRF
|   C                     SETON                     6299
| 14-C                     END
|   C*
| 11-C                     END
|    C   99                GOTO E1B00
|    C*
|    C           KEYED     CHAINED0                  40    *NF
| 15-C           DOPT      IFEQ 1                          *ADD
|   C           *IN40     ANDEQ'0'
|   C                     MOVEL'UPT2020' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606162
|   C                     SETON                     99
| 15-C                     END
|    C   99                GOTO E1B00
|     *
| 16-C           DOPT      IFNE 1                          *UPD,DEL,INQ
|   C           *IN40     ANDEQ'1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606162
|   C                     SETON                     99
| 16-C                     END
|    C*
04===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....'SC02' SCREEN INITIAL
     C*==============================================================*
05===C           R1C00     BEGSR
|    C*
|    C                     MOVE WFUN,DOPT DFUN
|    C*
| 01-C           DOPT      IFEQ 1
|   C                     EXSR R1CA0
| 01*C                     ELSE
|   C                     EXSR R1CB0
| 01-C                     END
|    C*
| 02-C           DOPT      IFEQ 1
|   C           DOPT      OREQ 2
|   C                     SETON                     31
| 02*C                     ELSE
|   C                     SETOF                     31
| 02-C                     END
|    C*
| 03-C           DOPT      IFEQ 5
|   C           *LOVAL    SETLLED0
| 03-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R1CA0 ....CLEAR FIELD WHEN ADD
     C*==============================================================*
06===C           R1CA0     BEGSR
|    C*
|    C           KEYDP     CHAINDP0                  40
|    C   40                MOVEL*BLANK    DP02
|    C                     Z-ADD*ZERO     DED04
|    C                     MOVEL*BLANK    DED05
|    C                     MOVEL*BLANK    ED05N
|    C                     Z-ADD*ZERO     DED07
|    C                     Z-ADD*ZERO     DED08
|    C                     Z-ADD*ZERO     DED09
|    C                     MOVEL*BLANK    DED10
|    C*
06===C           E1CA0     ENDSR
     C*==============================================================*
     C*          R1CB0 ....MOVE DATA TO 'SC02' SCREEN
     C*==============================================================*
07===C           R1CB0     BEGSR
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM ED04      P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM '1'       P3104I  1
|    C*                    PARM '1'       P3105I  1
|    C*          DED04     PARM           P3111O  80
|    C                     Z-ADDED04      DED04
|    C                     MOVELED05      DED05
|    C                     Z-ADDED07      DED07
|    C                     Z-ADDED08      DED08
|    C                     Z-ADDED09      DED09
|    C                     MOVELED10      DED10
|    C*
|    C*訓練類別
| 09-C           DED11     IFEQ '1'
|   C                     MOVELCODE1     ED11N            內訓
| 09-C                     END
|    C*
| 10-C           DED11     IFEQ '2'
|   C                     MOVELCODE2     ED11N            新人訓練
| 10-C                     END
|    C*
| 11-C           DED11     IFEQ '3'
|   C                     MOVELCODE3     ED11N            領績效獎金＋按工時
| 11-C                     END
|    C*
| 12-C           DED11     IFEQ '4'
|   C                     MOVELCODE4     ED11N            研討會
| 12-C                     END
|    C*
| 12-C           DED11     IFEQ '5'
|   C                     MOVELCODE5     ED11N            外訓
| 12-C                     END
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          R1E00 ....'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
08===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*員工編號DPY02
| 01-C           #LIN      IFEQ 5
|   C           #COL      ANDGE13
|   C           #COL      ANDLE17
|   C                     CALL 'PYI101'
|   C                     PARM DED01     P101I1  2         公司別
|   C           DED02     PARM DED02     P101I2  8         員工　
|   C                     PARM           @RTNC   2          FUN KEY
| 01-C                     END
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          R2000  ...'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
09===C           R2000     BEGSR
|    C*
|    C*訓練類別
| 09-C           DED11     IFEQ '1'
|   C                     MOVELCODE1     ED11N            內訓
| 09-C                     END
|    C*
| 10-C           DED11     IFEQ '2'
|   C                     MOVELCODE2     ED11N            新人訓練
| 10-C                     END
|    C*
| 11-C           DED11     IFEQ '3'
|   C                     MOVELCODE3     ED11N            領績效獎金＋按工時
| 11-C                     END
|    C*
| 12-C           DED11     IFEQ '4'
|   C                     MOVELCODE4     ED11N            研討會
| 12-C                     END
|    C*
| 12-C           DED11     IFEQ '5'
|   C                     MOVELCODE5     ED11N            外訓
| 12-C                     END
|    C*
|    C                     EXFMTDSPD2
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E2000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
|   C                     EXSR R2E00                      .PROMPT
|   C                     GOTO E2000
| 02-C                     END
|    C*
| 03-C           *IN12     IFEQ '1'
|   C                     MOVEL'SC01'    SCID
|   C                     GOTO E2000
| 03-C                     END
|    C*
| 04-C           DOPT      IFEQ 1
|   C           DOPT      OREQ 2
|   C                     EXSR R2B00                      *SCR CHK
| 04-C                     END
|    C*
| 05-C           *IN99     IFEQ '0'
|   C                     EXSR R2D00
|   C                     MOVEL'SC01'    SCID             *SCR2
| 05-C                     END
|    C*
09===C           E2000     ENDSR
     C*==============================================================*
     C*          R2E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
10===C           R2E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*------------------------------------------------------------***
|    C*訓練課程DED05
|    C                     MOVEL*BLANKS   ED05N
| 01-C           #FLD      IFEQ 'DED05'
|   C                     CALL 'PYI520'
|   C           DED05     PARM DED05     I520I1  5         課程代碼
|   C                     PARM           @RTNC   2          FUN KEY
|   C*
|   C           DED05     CHAINEC0                  40
|   C  N40                MOVELEC02      ED05N
| 01-C                     END
|    C*------------------------------------------------------------***
10===C                     ENDSR
     C*==============================================================*
     C*          R2B00 ....CHECK 'SC02' SCREEN
     C*==============================================================*
11===C           R2B00     BEGSR
|    C*
| 01-C           DED05     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 01-C                     END
|    C   99                GOTO E2B00
|    C*
|    C                     MOVEL*BLANKS   ED05N
|    C           DED05     CHAINEC0                  40
|    C  N40                MOVELEC02      ED05N
|    C*
| 02-C           DED04     IFEQ 0
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 02*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM DED04     P3001I  80
|   C                     PARM '1'       P3002I  1
|   C                     PARM '1'       P3003I  1
|   C                     PARM           P3011O  1
| 03-C           P3011O    IFEQ 'N'
|   C                     SETON                     6499
| 03-C                     END
| 02-C                     END
|    C   99                GOTO E2B00
|    C*
|    C                     CALL 'P31'
|    C                     PARM DED04     P3101I  80
|    C                     PARM '1'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C                     PARM           P3111O  80
|    C                     Z-ADDP3111O    WED04   80
|    C*
| 04-C           WED04     IFLT WED03
|   C                     MOVEL'UPT0041' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 04-C                     END
|    C   99                GOTO E2B00
|    C*
| 05-C           DED09     IFEQ *ZERO
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6899
| 05-C                     END
|    C   99                GOTO E2B00
|    C*
11===C           E2B00     ENDSR
     C*==============================================================*
     C*          R2D00 ....FILE PROCESS
     C*==============================================================*
12===C           R2D00     BEGSR
|    C*
| 01-C           DOPT      CASEQ1         R2D10
|   C           DOPT      CASEQ2         R2D20
|   C           DOPT      CASEQ4         R2D30
| 01-C                     END
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          R2D10 ....FILE PROCESS : ADD
     C*==============================================================*
13===C           R2D10     BEGSR
|    C*
|    C                     EXSR R2D11
|    C                     WRITEED0
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          R2D11 ....SCREEN FIELD TO FILE
     C*==============================================================*
14===C           R2D11     BEGSR
|    C*
|    C                     MOVELDED01     ED01
|    C                     MOVELDED02     ED02
|    C                     Z-ADDWED03     ED03
|    C                     Z-ADDWED04     ED04
|    C                     MOVELDED05     ED05
|    C                     Z-ADDDED07     ED07
|    C                     Z-ADDDED08     ED08
|    C                     Z-ADDDED09     ED09
|    C                     MOVELDED10     ED10
|    C                     MOVELDED11     ED11
|    C           ED07      ADD  ED08      ED06
|    C*
|    C                     Z-ADD$A8YMD    ED97
|    C                     TIME           ED98
|    C                     MOVEL$USER     ED99
|    C*
14===C                     ENDSR
     C*==============================================================*
     C*          R2D20 ....FILE PROCESS : UPD
     C*==============================================================*
15===C           R2D20     BEGSR
|    C*
|    C                     EXSR R2D11
|    C                     UPDATED0
|    C*
15===C                     ENDSR
     C*==============================================================*
     C*          R2D30 ....FILE PROCESS
     C*==============================================================*
16===C           R2D30     BEGSR
|    C*
|    C                     DELETED0
|    C*
16===C                     ENDSR
     C*==============================================================*
**
新增修改      刪除查詢
