     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA207                                     *
     H*    PROGRAM NAME :刷卡轉檔作業                              *
     H*    AUTHOR       : A1184                                      *
     H*    CREATE DATE  : 85/02/15                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       : KH                                         *
     H*    SUBSYSTEM    :                                            *
     H*    PURPOSE      :刷卡轉檔作業                              *
     H****************************************************************
     FPYA207D CF  E                    WORKSTN
     I*------------------------------------------------------------***
     ILDA        UDS
     I                                      101 110 $USER
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      187 1920DDATE
     I                                      201 2080$A8YMD
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INI. RTN.
     C*
  01-C           *IN03     DOWEQ'0'
    C                     EXSR RTN100                     *MAIN
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL ROUTINE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   *NAMVAR
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100.... MAIN ROUTINE
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     SETON                     97
|    C                     EXFMTDSPC1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO END100
| 01-C                     END
|    C*
| 02-C           *IN13     IFEQ '1'
|   C                     EXSR RTN120                     *PROCESS
| 02-C                     END
|    C*
02===C           END100    ENDSR
     C*==============================================================*
     C*          RTN120.... PROCESS
     C*==============================================================*
03===C           RTN120    BEGSR
|    C*
|    C                     SETON                     28
|    C                     WRITEDSPC1
|    C*
|    C                     OUT  *NAMVAR
|    C                     CALL 'PYA2071'
|    C*
|    C                     SETON                     93
|    C                     SETOF                     28
|    C*
03===C                     ENDSR
