     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA2071 (FOR YKK)                          *
     H*    PROGRAM NAME :刷卡轉檔作業                              *
     H*    AUTHOR       : A1226 PETER                                *
     H*    CREATE DATE  : 2004/03/16                                 *
     H*    UPDATE DATE  : 2004/03/16 A1386 SHARON                    *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FPYT5PFX IP  E           K        DISK
     FPYEMLF02IF  E           K        DISK
     FPYA207WFUF  E           K        DISK                      A
     I*---------------------------------------------------------------
     I           UDS
     I                                      101 110 $USER
     I                                      187 1920DDATE
     I                                      201 2080$A8YMD
     I            DS
     I                                        1  60 W501X
     I                                        1   80T5DS1
     I                                       10  110T5DS2
     I                                       12  130T5DS3
     I                                       24  31 T5DS4
     I                                       33  35 T5DS5
     I            DS
     I                                        1   7 EM04
     I                                        1   1 EM041
     I                                        2   2 EM042
     I                                        3   3 EM043
     I                                        4   7 EM044
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYT5     KLIST
     C                     KFLD           T501             員工編號
     C                     KFLD           T502             刷卡日期
     C*                    KFLD           T507             上／下班
     C                     KFLD           T503             刷卡時
     C                     KFLD           T504             刷卡分
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      INIT
     C                     EXSR R2000                      WRITE DATA
     C*==============================================================
     C*          R0100     DATA INIT
     C*==============================================================
     C           R0100     BEGSR
     C*
     C                     MOVELT501X     W501X
     C*
     C                     MOVEL*BLANK    T501
     C                     Z-ADD*ZERO     T502
     C                     Z-ADD*ZERO     T503
     C                     Z-ADD*ZERO     T504
     C                     MOVEL*BLANK    T505
     C                     MOVEL*BLANK    T506
     C                     MOVEL*BLANK    T507
     C                     MOVEL*BLANK    T508
     C                     Z-ADD*ZERO     T597
     C                     Z-ADD*ZERO     T598
     C                     MOVEL*BLANK    T599
     C*
     C                     ENDSR
     C*==============================================================
     C*         R2000      WRITE DATA
     C*==============================================================
     C           R2000     BEGSR
     C*
     C                     MOVELT5DS4     T501
     C                     Z-ADDT5DS1     T502
     C                     Z-ADDT5DS2     T503
     C                     Z-ADDT5DS3     T504
     C*
     C           T5DS4     CHAINEM0                  88
     C           *IN88     IFEQ '0'
     C                     MOVELEM01      T505
     C                     MOVELEM04      T506
     C                     END
     C*
     C                     MOVELT5DS5     T508
     C                     Z-ADD$A8YMD    T597
     C                     TIME           T598
     C                     MOVEL$USER     T599
     C           KEYT5     CHAINT50                  86
     C           *IN86     IFEQ '1'
     C                     WRITET50
     C                     END
     C*
     C                     ENDSR
