     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : PYA204                                     *
     H*    PROGRAM NAME :考勤資料建立                              *
     H*    AUTHOR       : A1226 PETER                                *
     H*    CREATE DATE  : 86/01/20                                   *
     H*    UPDATE DATE  : 91/11/04 A1355 ERIC                        *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FPYLAPF  UF  E           K        DISK                      A
     FPYEMPF  IF  E           K        DISK
     FPYHDPF  IF  E           K        DISK
     FPYA204D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     E                    @A01        5  1               作業權利
     E                    WFUN    5   5  6
     E*---------------------------------------------------------------*
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I            DS
     I                                        1   7 EM04
     I                                        1   1 EM041
     I                                        2   2 EM042
     I                                        3   3 EM043
     I                                        4   7 EM044
     I           UDS
     I                                      101 110 $USER
     I                                      203 2080DDATE
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I            DS
     I                                        1   60DLA03
     I                                        1   40DLA3YM
     I                                        1   20DLA3Y
     I                                        3   40DLA3M
     I                                        5   60DLA3D
     I            DS
     I                                        1   40DLA96
     I                                        1   20DLA96Y
     I                                        3   40DLA96M
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN CM004O    DFMT
     C           *LIKE     DEFN CM005O    DTYPE
     C           *LIKE     DEFN LA03      WLA03
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYLA     KLIST                           *PYEMPF
     C                     KFLD           DLA01
     C                     KFLD           DLA02
     C                     KFLD           WLA03
     C           KEYEM     KLIST
     C                     KFLD           DLA01
     C                     KFLD           DLA02
     C           KEYHD     KLIST
     C                     KFLD           DLA01
     C                     KFLD           DLA02
     C                     KFLD           KLA96   60       *YYYYMM
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
    C           SCID      CASEQ'SC02'    R2000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     MOVE 'SC01'    SCID    4
|    C* FUN AUT
|    C                     MOVE $ADD      @A01,1
|    C                     MOVE $UPD      @A01,2
|    C                     MOVE $DLT      @A01,4
|    C                     MOVE $INQ      @A01,5
|    C*
|    C* SC01 FIELD INITIALIZE *--------------------------------------*
|    C*
|    C                     MOVE *BLANK    DLA01
|    C                     MOVE *BLANK    DLA02
|    C                     Z-ADDDDATE     DLA03
|    C*                    MOVEL'1'       DLA04
|    C                     Z-ADD1         DOPT
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*公司別
|    C                     MOVEL$COR      DLA01
| 01-C           $RMK03    IFNE 'Y'
|   C                     SETOF                     32
| 01*C                     ELSE
|   C                     SETON                     32
| 01-C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          R1000 ....'SC01' SCREEN MAIN ROUTINE
      *==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN18     IFEQ '1'                        *BROWSE
|   C                     EXSR R1A00
|   C                     GOTO E1000
| 02-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
|   C                     EXSR R1E00                      .PROMPT
|   C                     GOTO E1000
| 02-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 03-C           *IN99     IFEQ '0'
|   C                     EXSR R1C00
|   C                     MOVE 'SC02'    SCID
| 03-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1A00 ....全頁查詢 (PF18 : CALL SUB-PROGRAM)
     C*==============================================================*
03===C           R1A00     BEGSR
|    C*
|    C* AUT CHECK
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM 'PYI204'  S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     99
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C   99                GOTO E1A00
|    C*
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* CALL SUB-PROGRAM
|    C                     CALL 'PYI204'
|    C           DLA01     PARM DLA01     I204I1  2
|    C           DLA02     PARM DLA02     I204I2  8
     C           DLA07     PARM DLA07     I204I3  7
     C           DLA03     PARM DLA03     I204I4  70        遲到日期
|    C                     PARM           @RTNC   2
|    C* RETURN CODE CHECK
| 02-C           @RTNC     IFEQ '03'                       *PF3
|   C                     SETON                     03
| 02-C                     END
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
03===C           E1A00     ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
03===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*
|    C*員工編號DOV02
| 01-C           #LIN      IFEQ 5
|   C           #COL      ANDGE13
|   C           #COL      ANDLE17
|   C                     CALL 'PYI101'
|   C                     PARM DLA01     P101I1  2         公司別
|   C           DLA02     PARM DLA02     P101I2  8         員工　
|   C                     PARM           @RTNC   2          FUN KEY
| 01-C                     END
|    C*
|    C*部門編號DLA07
| 01-C           #LIN      IFEQ 6
|   C           #COL      ANDGE13
|   C           #COL      ANDLE19
|   C                     CALL 'PYI512'
|   C           DLA07     PARM DLA07     I512I1  7         部門代碼
|   C                     PARM           @RTNC   2          FUN KEY
| 01-C                     END
|    C*
03===C           E1E00     ENDSR
     C*==============================================================*
     C*          R1B00 ....SCREEN CHECK
     C*==============================================================*
04===C           R1B00     BEGSR
|    C* CHK FUN AUT
| 01-C           @A01,DOPT IFNE 'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 01-C                     END
|    C   99                GOTO E1B00
|    C*---------------------------------------------------------------
|    C*公司別
|    C                     MOVEL*BLANK    DLA01N
| 02-C           DLA01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DLA01     CM001I  2         公司代號
|    C           DLA01N    PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C           DFMT      PARM           CM004O  1         日期格式
|    C           DTYPE     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
|    C*
| 03-C           CM099O    IFEQ 'N'
|   C                     SETON                     6099
|   C                     MOVEL'US#0099' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 03-C                     END
|    C   99                GOTO E1B00
|    C*
| 04-C           CM099O    IFEQ *BLANK
|   C                     SETON                     6099
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 04-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*員工編號
| 05-C           DLA02     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 05-C                     END
|    C   99                GOTO E1B00
|    C*
|    C           KEYEM     CHAINEM0                  40
| 06-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606199
| 06-C                     END
|    C   99                GOTO E1B00
|    C*---------------------------------------------------------------
|    C*部門別
|   C                     MOVELEM04      DLA07
|    C                     CALL 'PYSCM1'
|    C                     PARM EM01      CM101I  2         公司代號
|    C                     PARM EM04      CM102I  7         部門代號
|    C                     PARM           CM103O 14         部門名稱
|    C                     PARM           CM199O  1         存在否？
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 07-C           CM199O    IFEQ 'N'
|   C                     SETON                     6199
|   C                     MOVEL'US#0098' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 07-C                     END
|    C   99                GOTO E1B00
|    C*
| 08-C           CM199O    IFEQ *BLANK
|   C                     SETON                     606199
|   C                     MOVEL'US#1111' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 08-C                     END
|    C   99                GOTO E1B00
|    C*---------------------------------------------------------------
|    C*
| 09-C           DOPT      IFEQ 1
|   C           EM11      ANDEQ'Y'
|   C                     MOVEL'UMI0400' ERRID
|   C                     MOVEL'CEMF'    ERRF
|   C                     SETON                     606199
| 09-C                     END
|    C   99                GOTO E1B00
|    C*考勤日期
| 10-C           DLA03     IFEQ 0
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 10-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'P30'
|    C                     PARM DLA03     P3001I  80
|    C                     PARM '1'       P3002I  1
|    C                     PARM '1'       P3003I  1
|    C                     PARM           P3011O  1
| 11-C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 11-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*
|    C                     CALL 'P31'
|    C                     PARM DLA03     P3101I  80
|    C                     PARM '1'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           WLA03     PARM           P3101O  80
|    C*
|    C           KEYLA     CHAINLA0                  40    *NF
|    C*
| 12-C           *IN40     IFEQ '0'                        *ADD
|   C           DOPT      ANDEQ1
|   C                     MOVEL'UPT2020' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606162
|   C                     SETON                     99
| 12-C                     END
|    C   99                GOTO E1B00
|    C*
| 13-C           DOPT      IFNE 1                          *UPD,DEL,INQ
|   C           *IN40     ANDEQ'1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606162
|   C                     SETON                     99
| 13-C                     END
|    C*
04===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....'SC02' SCREEN INITIAL
     C*==============================================================*
05===C           R1C00     BEGSR
|    C*
|    C                     MOVE WFUN,DOPT DFUN
|    C*
| 01-C           DOPT      IFEQ 1
|   C                     EXSR R1CA0
| 01*C                     ELSE
|   C                     EXSR R1CB0
| 01-C                     END
|    C*
| 02-C           DOPT      IFEQ 1
|   C           DOPT      OREQ 2
|   C                     SETON                     31
| 02*C                     ELSE
|   C                     SETOF                     31
| 02-C                     END
|    C*
| 03-C           DOPT      IFEQ 5
|   C           *LOVAL    SETLLLA0
|   C           *LOVAL    SETLLEM0
| 03-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R1CA0 ....CLEAR FIELD WHEN ADD
     C*==============================================================*
06===C           R1CA0     BEGSR
|    C*
|    C*                    Z-ADD*ZERO     DLA04
|    C*                    Z-ADD*ZERO     DLA05
|    C*                    Z-ADD*ZERO     DLA06
|    C*
|    C*
     C                     Z-ADDDLA3Y     DLA96Y
|    C           DLA3M     ADD  1         DLA96M
|    C           DLA96M    IFEQ 13
|    C                     Z-ADD1         DLA96M
|   C                     ADD  1         DLA96Y
| 02-C                     END
|    C*
06===C           E1CA0     ENDSR
     C*==============================================================*
     C*          R1CB0 ....MOVE DATA TO 'SC02' SCREEN
     C*==============================================================*
07===C           R1CB0     BEGSR
|    C*
|    C*                    Z-ADDLA04      DLA04
|    C*                    Z-ADDLA05      DLA05
|    C*                    Z-ADDLA06      DLA06
|    C                     MOVELLA07      DLA07
|    C*
|    C*                    CALL 'P39'
|    C*                    PARM LA96      P3901I  60
|    C*                    PARM '2'       P3902I  1
|    C*                    PARM '1'       P3903I  1
|    C*                    PARM DFMT      P3904I  1
|    C*                    PARM DTYPE     P3905I  1
|    C*          DLA96     PARM           P3911O  60
     C                     Z-ADDLA96      DLA96
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          R2000 ....'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
08===C           R2000     BEGSR
|    C*
|    C                     EXFMTDSPD2
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E2000
| 01-C                     END
|    C*
| 02-C           *IN12     IFEQ '1'
|   C                     MOVE 'SC01'    SCID
|   C                     GOTO E2000
| 02-C                     END
|    C*
| 03-C           DOPT      IFEQ 1
|   C           DOPT      OREQ 2
|   C                     EXSR R2B00                      *CHK SCR
| 03-C                     END
|    C*
| 04-C           *IN99     IFEQ '0'
|   C                     EXSR R2D00                      *OV
|   C                     MOVE 'SC01'    SCID
| 04-C                     END
|    C*
08===C           E2000     ENDSR
      *==============================================================*
      *          R2B00 ....CHECK 'SC02' SCREEN
      *==============================================================*
09===C           R2B00     BEGSR
|    C*
|    C*                    Z-ADDDLA04     WTOTR   71
|    C*                    ADD  DLA05     WTOTR
|    C*                    ADD  DLA06     WTOTR
|    C*
| 01-C*          WTOTR     IFEQ *ZERO
|   C*                    MOVEL'UPT0130' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     606162
|   C*                    SETON                     99
| 01-C*                    END
|    C*  99                GOTO E2B00
|    C*計薪年月
| 02-C*911211    DLA96     IFEQ 0
|   C*911211              MOVEL'UPT0010' ERRID
|   C*911211              MOVEL'PTMF'    ERRF
|   C*911211              SETON                     6699
| 02-C*911211              END
|    C*  99                GOTO E2B00
|    C*
|    C*911211              CALL 'P38'
|    C*911211              PARM DLA96     P3801I  60
|    C*911211              PARM DFMT      P3802I  1
|    C*911211              PARM DTYPE     P3803I  1
|    C*911211              PARM           P3801O  60
|    C*911211              PARM           P3811O  1
| 03-C*911211    P3811O    IFEQ 'N'
|   C*911211              MOVEL'UPT0040' ERRID
|   C*911211              MOVEL'PTMF'    ERRF
|   C*911211              SETON                     6699
| 03-C*911211              END
|    C*  99                GOTO E2B00
|    C*
|    C                     CALL 'P39'
|    C                     PARM DLA96     P3901I  60
|    C                     PARM '1'       P3902I  1
|    C                     PARM '1'       P3903I  1
|    C                     PARM '2'       P3904I  1
|    C                     PARM '1'       P3905I  1
|    C           KLA96     PARM           P3911O  60
|    C*
|    C           KEYHD     CHAINHD0                  40
| 04-C           *IN40     IFEQ '0'
|   C                     MOVEL'UMI0410' ERRID
|   C                     MOVEL'CEMF'    ERRF
|   C                     SETON                     66
|   C                     SETON                     99
| 04-C                     END
|    C   99                GOTO E2B00
|    C*
|    C*
09===C           E2B00     ENDSR
     C*==============================================================*
     C*          R2D00 ....FILE PROCESS
     C*==============================================================*
10===C           R2D00     BEGSR
|    C*
| 01-C           DOPT      CASEQ1         R2D10
|   C           DOPT      CASEQ2         R2D20
|   C           DOPT      CASEQ4         R2D30
| 01-C                     END
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          R2D10 ....FILE PROCESS : ADD
     C*=============================================================*
11===C           R2D10     BEGSR
|    C*
|    C                     EXSR R2D11
|    C                     WRITELA0
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          R2D11 ....SCREEN FIELD TO FILE
     C*==============================================================*
12===C           R2D11     BEGSR
|    C*
|    C                     CALL 'P31'
|    C                     PARM DLA03     P3101I  80
|    C                     PARM '1'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           WLA03     PARM           P3101O  80
|    C*
|    C*
|    C                     MOVELDLA01     LA01
|    C                     MOVELDLA02     LA02
|    C                     Z-ADDWLA03     LA03
|    C*                    Z-ADDDLA04     LA04
|    C*                    Z-ADDDLA05     LA05
|    C*                    Z-ADDDLA06     LA06
|    C                     MOVELDLA07     LA07
|    C*911211              Z-ADDKLA96     LA96
|    C                     Z-ADD$A8YMD    LA97
|    C                     TIME           LA98
|    C                     MOVEL$USER     LA99
12===C                     ENDSR
     C*==============================================================*
     C*          R2D20 ....FILE PROCESS : UPD
     C*==============================================================*
13===C           R2D20     BEGSR
|    C*
|    C                     EXSR R2D11
|    C                     UPDATLA0
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          R2D30 ....FILE PROCESS
     C*==============================================================*
14===C           R2D30     BEGSR
|    C*
|    C                     DELETLA0
|    C*
14===C                     ENDSR
     C*==============================================================*
**
新增修改      刪除查詢
