      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      *    PROGRAM ID   : PYA217                                     *
      *    WRITTEN BY   : A1278 ROBERT                               *
      *    DATE WRITTEN : 88/08/02                                   *
      *    UPDATE DATE  :                                            *
      *    SYSTEM       : MIRS                                       *
      *    SUBSYSTEM    : PY                                         *
      *    PROCEDURE    :                                            *
      *    PURPOSE      :遲到次數設定　                            *
      *    INDICATOR    :                                            *
      ****************************************************************
     FPYODPF  UF  E           K        DISK                      A
     FPYA217D CF  E                    WORKSTN
     I           UDS
     I                                      101 110 USER
     I                                      211 2160DDATE
     I                                      201 2080$A8YMD
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C                     EXSR RTN010
     C*
  01-C           *IN03     DOWEQ'0'
    C                     EXSR RTN100
  01-C                     END
     C*
     C                     SETON                     LR
     C*
     C*==============================================================*
     C*          RTN010....INTRIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVEL'0'       DOD01
|    C           DOD01     CHAINOD0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     Z-ADDOD02      DOD02
|   C                     Z-ADDOD03      DOD03
|   C                     Z-ADDOD04      DOD04
| 01*C                     ELSE
|   C                     Z-ADD*ZERO     DOD02
|   C                     Z-ADD*ZERO     DOD03
|   C                     Z-ADD*ZERO     DOD04
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100.... SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           RTN100    BEGSR
|    C                     EXFMTDSPC1
|    C*: CLEAR ALL ERROR USED INDICATOR :
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
|    C                     EXSR RTN110                     *SCN CHK
|    C*
| 01-C           *IN99     IFEQ '0'
|   C           DOD01     CHAINOD0                  40
|   C                     EXSR RTN200
|   C   40                WRITEOD0
|   C  N40                UPDATOD0
|   C                     SETON                     03
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN110....SCREEN CHECK
      *==============================================================*
03===C           RTN110    BEGSR
|     *
| 01-C           DOD02     IFEQ 0
|   C                     SETON                     609899
| 01-C                     END
|    C   99                GOTO END110
|     *
| 02-C           DOD03     IFEQ 0
|   C                     SETON                     619899
| 02-C                     END
|    C   99                GOTO END110
|     *
| 03-C           DOD04     IFEQ 0
|   C                     SETON                     629899
| 03-C                     END
|    C   99                GOTO END110
|     *
03===C           END110    ENDSR
      *==============================================================*
      *          RTN200....UPDATE FILE
      *==============================================================*
04===C           RTN200    BEGSR
|    C*
|    C                     MOVELDOD01     OD01
|    C                     Z-ADDDOD02     OD02
|    C                     Z-ADDDOD03     OD03
|    C                     Z-ADDDOD04     OD04
|    C                     Z-ADD$A8YMD    OD97
|    C                     TIME           OD98
|    C                     MOVELUSER      OD99
|    C*
04===C                     ENDSR
