     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM NAME : PYA315                                     *
     H****************************************************************
     FPYPHLF01IF  E           K        DISK
     FPYPMPF  UF  E           K        DISK
     FPYBTLF02IF  E           K        DISK
     FPYA315D CF  E                    WORKSTN
     I*
     ILDA        UDS
     I                                      101 110 $USER
     I                                      187 1920DDATE
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      140 140 $RMK02
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I*
     I                                      501 502 DPW01
     I                                      507 507 DPW04
     I                                      511 5160WPW03
     I                                      603 6070DPW03
     I                                      603 6050DPW03Y
     I                                      606 6070DPW03M
     I            DS
     I                                        1   50DPM206
     I                                        1   30PM206Y
     I                                        4   50PM206M
     I            DS
     I                                        1   50DPM202
     I                                        1   30PM202Y
     I                                        4   50PM202M
     I/COPY PYDDSSRC,PYPMDS01
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN CM004O    DFMT
     C           *LIKE     DEFN CM005O    DTYPE
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYPH     KLIST
     C                     KFLD           DPW01
     C                     KFLD           WPW03
     C                     KFLD           DPW04
     C*
     C                     MOVEL'01'      DPM01   2
     C           KEYPM     KLIST
     C                     KFLD           DPM01
     C                     KFLD           DPW01
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INI. RTN.
     C*
  01-C           *IN03     DOWEQ'0'
    C                     EXSR RTN100                     *MAIN
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL ROUTINE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     IN   *NAMVAR
|    C*
|    C                     Z-ADD0         DPW03
|    C                     MOVEL*BLANK    DPW04
|    C*
|    C                     MOVEL$COR      DPW01
| 01-C           $RMK03    IFNE 'Y'
|   C                     SETOF                     32
| 01*C                     ELSE
|   C                     SETON                     32
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100.... MAIN ROUTINE
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     SETON                     97
|    C                     EXFMTDSPC1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO END100
| 01-C                     END
|    C*
|    C                     EXSR RTN110                     *CHK SCREEN1
|    C*
| 02-C           *IN99     IFEQ '0'
|   C           *IN13     ANDEQ'1'
|   C                     EXSR RTN120                     *PROCESS
| 02-C                     END
|    C*
02===C           END100    ENDSR
     C*==============================================================*
     C*          RTN110....CHECK SCREEN1
     C*==============================================================*
03===C           RTN110    BEGSR
|    C* << CHACK 公司別NOT *BLANK >>
| 01-C           DPW01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO END110
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DPW01     CM001I  2         公司代號
|    C                     PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C           DFMT      PARM           CM004O  1         日期格式
|    C           DTYPE     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 02-C           CM099O    IFEQ 'N'
|   C                     SETON                     6099
|   C                     MOVEL'US#0099' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 02-C                     END
|    C   99                GOTO END110
|    C*
| 03-C           CM099O    IFEQ *BLANK
|   C                     SETON                     6099
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C   99                GOTO END110
|    C*
|    C*+<<DATA CHECK>>+++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
| 04-C           DPW03     IFEQ *ZERO
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 04*C                     ELSE
| 05-C           DPW03M    IFLT 1
|   C           DPW03M    ORGT 12
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 05-C                     END
| 04-C                     END
|    C   99                GOTO END110
|    C*
|    C                     CALL 'P39'
|    C                     PARM DPW03     P3901I  60
|    C                     PARM DFMT      P3902I  1
|    C                     PARM DTYPE     P3903I  1
|    C                     PARM '2'       P3904I  1
|    C                     PARM '1'       P3905I  1
|    C           WPW03     PARM           P3911O  60
|    C*
| 06-C           DPW04     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 06-C                     END
|    C   99                GOTO END110
|    C*
|    C           KEYPH     SETLLPH0
|    C           KEYPH     READEPH0                      40
| 07-C           *IN40     IFEQ '1'
|   C                     MOVEL'UMI0560' ERRID
|   C                     MOVEL'CEMF'    ERRF
|   C                     SETON                     606162
|   C                     SETON                     99
| 07-C                     END
|    C   99                GOTO END110
|    C*
|    C           KEYPH     SETLLBT0
|    C           KEYPH     READEBT0                      40
| 08-C           *IN40     IFEQ '0'
|   C                     MOVEL'UMI0410' ERRID
|   C                     MOVEL'CEMF'    ERRF
|   C                     SETON                     606162
|   C                     SETON                     99
| 08-C                     END
|    C   99                GOTO END110
|    C*
|    C                     Z-ADD*ZERO     DPM03   50       薪資確認月
|    C*
|    C           KEYPM     CHAINPM0                  40
| 09-C           *IN40     IFEQ '0'
|   C*
|   C                     Z-ADDPM202     DPM202
|   C                     Z-ADDPM206     DPM206
|   C*
| 10-C           DPW04     IFEQ '1'                        *下期薪
|   C                     SUB  1         PM206M
| 11-C           PM206M    IFEQ 0
|   C                     SUB  1         PM206Y
|   C                     Z-ADD12        PM206M
| 11-C                     END
| 10*C                     ELSE                            *上期薪
|   C                     SUB  1         PM202M
| 12-C           PM202M    IFEQ 0
|   C                     SUB  1         PM202Y
|   C                     Z-ADD12        PM202M
| 12-C                     END
| 10-C                     END
|   C*
|   C                     Z-ADDDPM202    PM202
|   C                     Z-ADDDPM206    PM206
|   C                     UPDATPM0
|   C*
| 09-C                     END
|    C*
03===C           END110    ENDSR
     C*==============================================================*
     C*          RTN120.... PROCESS
     C*==============================================================*
04===C           RTN120    BEGSR
|    C*
|    C                     SETON                     96
|    C                     WRITEDSPC1
|    C*
|    C                     OUT  *NAMVAR
|    C*
|    C                     CALL 'PYA3151C'
|    C*
|    C                     SETON                     93
|    C                     SETOF                     96
|    C                     Z-ADD*ZERO     DPW03
|    C                     MOVEL*BLANK    DPW04
|    C*
04===C                     ENDSR
