     H****************************************************************
     H*   ªx¤Ó¸ê°T¬ì§Þ¶}µoªÑ¥÷¦³­­¤½¥q¡Ðª©Åv©Ò¦³    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA3151                                    *
     H*    PROGRAM NAME :Á~¸ê¨ú®ø½T»{§@·~                         *
     H*    AUTHOR       :                                            *
     H*    CREATE DATE  : 93/07/14  A1386 SHARON                     *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :¤H¨ÆÁ~¸ê¨t²Î                              *
     H****************************************************************
     FPYPHLF01UP  E           K        DISK
     FPYE6LF03UF  E           K        DISK
     FPYHDLF02UF  E           K        DISK
     FPYCHLF01UF  E           K        DISK
     FPYCDLF03UF  E           K        DISK
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      140 140 $RMK02
     I                                      187 1920DDATE
     I                                      201 2080$A8YMD
     I*
     I                                      501 502 DPW01
     I                                      511 5160WPW03
     I                                      511 5140WPW03Y
     I                                      515 5160WPW03M
     I                                      507 507 DPW04
     I                                      603 6070DPW03
     I                                      603 6050DPW03Y
     I                                      606 6070DPW03M
     I*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYE6     KLIST
     C                     KFLD           DPW01
     C                     KFLD           WPW03
     C                     KFLD           WPW03
     C           KEYPH     KLIST
     C                     KFLD           DPW01
     C                     KFLD           WPW03
     C                     KFLD           DPW04
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C                     DELETPH0
     C*
     CLR                   EXSR RTN100
     C*==============================================================*
     C*                 DELETE PYSICAL FILE
     C*==============================================================*
01===C           RTN100    BEGSR
|    C*
| 01-C           DPW04     IFEQ '1'                        *¤U´ÁÁ~
|   C           KEYE6     SETLLE60
|   C           KEYE6     READEE60                      40
| 02-C           *IN40     DOWEQ'0'
|   C                     DELETE60
|   C           KEYE6     READEE60                      40
| 02-C                     END
| 01-C                     END
|    C*
|    C           KEYPH     SETLLHD0
|    C           KEYPH     READEHD0                      40
| 03-C           *IN40     DOWEQ'0'
|   C                     DELETHD0
|   C           KEYPH     READEHD0                      40
| 03-C                     END
|    C*
|    C           KEYPH     SETLLCH0
|    C           KEYPH     READECH0                      40
| 04-C           *IN40     DOWEQ'0'
|   C                     DELETCH0
|   C           KEYPH     READECH0                      40
| 04-C                     END
|    C*
|    C           KEYPH     SETLLCD0
|    C           KEYPH     READECD0                      40
| 05-C           *IN40     DOWEQ'0'
|   C                     DELETCD0
|   C           KEYPH     READECD0                      40
| 05-C                     END
|    C*
01===C                     ENDSR
