     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*                                                              *
     A*    PROGRAM ID   : PYA312                                     *
     A*    PROGRAM NAME : 薪資月份彙總作業　　　　　　             *
     A*    AUTHOR       : A1260 VAN                                  *
     A*    CREATE DATE  : 88/02/01                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A****************************************************************
     FPYCDPF  IP  E           K        DISK
     FPYSMPF  UF  E           K        DISK                      A
     E*---------------------------------------------------------------
     ICD0
     I                                              CD05  L1
     I                                              CD073 L2
     I                                              CD072 L3
     I                                              CD071 L4
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I           UDS
     I                                      101 110 $USER
     I                                      111 118 $CHYMD
     I                                      119 124 $ADMDY
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DCD01
     I                                      503 5080DCD03
     I                                      509 509 DOPT
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C           *LIKE     DEFN $A8YMD    FDATE            .TRANS DATE USE
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYSM     KLIST
     C                     KFLD           DCD01            .公司編號
     C                     KFLD           DCD03            .年月
     C           KEYSM1    KLIST
     C                     KFLD           SM01             .公司編號
     C                     KFLD           SM03             .年月
     C                     KFLD           SM021            .成本中心1
     C                     KFLD           SM022            .成本中心2
     C                     KFLD           SM023            .成本中心3
     C                     KFLD           SM04             .薪資項目
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*
     C   L1                EXSR R7100
     C   L2                EXSR R7200
     C   L3                EXSR R7300
     C   L4                EXSR R7400
     C*
     C                     EXSR R2000                      .DETAIL
     C*
     CL1 10                EXSR R8100                      .L1
     CL1 10                EXSR R8200                      .L2
     CL1 10                EXSR R8300                      .L3
     CL1 10                EXSR R8400                      .L4
     C*==============================================================*
     C*          R1000 ... INITIAL PROCESS
     C*==============================================================*
01===C           R1000     BEGSR
|    C*
|    C                     IN   PTDA01
|    C*
|    C                     SETON                     10
|    C                     MOVEL'Y'       $DATA
|    C*
|    C*重新處理... YES
| 01-C           DOPT      IFEQ 'Y'
|   C*清除舊資料
|   C           KEYSM     SETLLSM0
|   C           KEYSM     READESM0                      42
| 02-C           *IN42     DOWEQ'0'
|   C*
|   C                     DELETSM0
|   C*
|   C           KEYSM     READESM0                      42
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADD*ZERO     SCD06   90
|    C*
01===C           E1000     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
02===C           R2000     BEGSR
|    C*
|    C*寫入薪資月份彙總資料檔中 PYSMPF
|    C                     MOVELCD01      SM01             .公司編號
|    C                     Z-ADDCD03      SM03             .年月　　
|    C*
|    C                     Z-ADD$A8YMD    SM97             .更新日期
|    C                     TIME           SM98             .更新時間
|    C                     MOVEL$USER     SM99             .使用者ID
|    C*薪資累加
|    C                     ADD  CD06      SCD06
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          R7100 ... LEVEL BREAK L1             .薪資項目
     C*==============================================================*
03===C           R7100     BEGSR
|    C*
|    C***                  SETON                     31
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          R7200 ... LEVEL BREAK L2             .成本中心3
     C*==============================================================*
04===C           R7200     BEGSR
|    C*
|    C****                 SETON                     32
|    C                     MOVELCD073     SM023
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R7300 ... LEVEL BREAK L3             .成本中心2
     C*==============================================================*
05===C           R7300     BEGSR
|    C*
|    C****                 SETON                     33
|    C                     MOVELCD072     SM022
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R7400 ... LEVEL BREAK L4             .成本中心1
     C*==============================================================*
06===C           R7400     BEGSR
|    C*
|    C****                 SETON                     34
|    C                     MOVELCD071     SM021
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R8100 ... LEVEL BREAK L1             .薪資項目
     C*==============================================================*
07===C           R8100     BEGSR
|    C*
|    C                     MOVELCD05      SM04
|    C*
|    C                     Z-ADDSCD06     SM05
|    C*
|    C*-------------------------------------------------------------*
|    C           KEYSM1    CHAINSM0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     UPDATSM0
| 01*C                     ELSE
|   C                     WRITESM0
| 01-C                     END
|    C*
|    C                     Z-ADD*ZERO     SCD06
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          R8200 ... LEVEL BREAK L2             .成本中心3
     C*==============================================================*
08===C           R8200     BEGSR
|    C*
|    C***                  MOVELCD073     SM023
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          R8300 ... LEVEL BREAK L3             .成本中心2
     C*==============================================================*
09===C           R8300     BEGSR
|    C*
|    C***                  MOVELCD072     SM022
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          R8400 ... LEVEL BREAK L4             .成本中心1
     C*==============================================================*
10===C           R8400     BEGSR
|    C*
|    C***                  MOVELCD071     SM021
|    C*
10===C                     ENDSR
