     H****************************************************************
     H*   ªx¤Ó¸ê°T¬ì§Þ¶}µoªÑ¥÷¦³­­¤½¥q¡Ðª©Åv©Ò¦³    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA30611                                   *
     H*    PROGRAM NAME :Á~¸ê¸Õºâ§@·~¡Ð­û¤u                        *
     H*    AUTHOR       :                                            *
     H*    CREATE DATE  : 78/09/06                                   *
     H*    UPDATE DATE  : 90/03/21 A1274 EVA                         *
     H*    SYSTEM       :¤H¨ÆÁ~¸ê¨t²Î                              *
     H*
     H* ­×§ï°O¿ý
     H*---------------------------------------------------------------
     H* SEQ     DATE      BY      DESC
     H*---------------------------------------------------------------
     H* 0002 2005/12/06 GARY LEE  ½ü¯Z¬z¶K:¿ð¨ì½Ð°²·í¤é¬z¶K¬°0
     H* 0001 2005/04/29 GARY LEE  ¨ú®ø¤ëÁ~¤£¥i»â¥þ¶Ô¼úª÷¤§­­¨î
     H****************************************************************
     H            Y
     F*¤H¨Æ¥DÀÉ
     FPYEMPF  IP  E           K        DISK
     F*Á~¸ê¤u§@ÀÉ
     FPYPWPF  UF  E           K        DISK                      A
     F*Á~¸ê¤u§@ÀÉDETAIL
     FPYWDPF  UF  E           K        DISK                      A
     F*²²ÄÝ°·«O§ë«O¾ú¥vÀÉ
     FPYE5LF01UF  E           K        DISK                      A
     F*Á~¸ê¾ú¥vÀÉHEADING
     FPYPHPF  IF  E           K        DISK
     F*Á~¸ê¥DÀÉ¡ÐHEADING
     FPYPYPF  IF  E           K        DISK
     F*Á~¸ê¥DÀÉDETAIL
     FPYPDPF  IF  E           K        DISK
     F*¿ð¨ì¦¸¼Æ³]©wÀÉ
     FPYODPF  IF  E           K        DISK
     F*½ÕÁ~¥DÀÉHEADING
     FPYSHPF  IF  E           K        DISK
     F*½ÕÁ~¥DÀÉDETAIL
     FPYSDPF  IF  E           K        DISK
     F*Á~¸ê²§°ÊÀÉ
     FPYOSPF  IF  E           K        DISK
     F*®ÖÁ~¼Ð·Ç¡]Â¾µ¥Â¾¯Å¡^¸ê®ÆÀÉ
     FPYPSPF  IF  E           K        DISK
     F*Á~¸êµ²ºc°Ñ¼ÆÀÉ
     FPYSSPF  IF  E           K        DISK
     F*¤H¨ÆÁ~¸ê°Ñ¼ÆÀÉ
     FPYPMPF  IF  E           K        DISK
     F*¦Ò¶Ô¥DÀÉ
     FPYLAPF  IF  E           K        DISK
     F*°t¨®°ò¥»¸ê®ÆºûÅ@ÀÉ
     FPYCAPF  IF  E           K        DISK
     F*¥[¯Z¥DÀÉ
     FPYOVPF  UF  E           K        DISK
     F*¥[¯Z¥DÀÉ
     FPYOVLF01IF  E           K        DISK
     F            OV0                               KRENAMEOVL1
     F*½Ð°²¥DÀÉ
     FPYLVPF  UF  E           K        DISK
     F*½Ð°²¥DÀÉ
     FPYLVLF02IF  E           K        DISK
     F            LV0                               KRENAMELVL2
     F*©Ò±oµ|²v°Ñ¼ÆÀÉ
     FPYTAPF  IF  E           K        DISK
     F*­û¤u¶U´Ú¸ê®ÆÀÉ
     FPYLNPF  IF  E           K        DISK
     F*Â¾ºÙ°ò¥»¸ê®ÆÀÉ
     FPYJTPF  IF  E           K        DISK
     F*°²§O°ò¥»¸ê®ÆÀÉ
     FPYLCPF  IF  E           K        DISK
     F*³¡ªù°ò¥»¸ê®ÆÀÉ
     FPYDPPF  IF  E           K        DISK
     F*¤H¨Æ½Õ°Ê¸ê®ÆÀÉ
     FPYTRPF  IF  E           K        DISK
     F*¥þ¥Á°·«O¸ê®ÆÀÉ-HEADING
     FPYE1PF  IF  E           K        DISK
     F*¥þ¥Á°·«O¸ê®ÆÀÉ-DETAIL
     FPYE2PF  IF  E           K        DISK
     F*¥þ¥Á°·«O°Ñ¼ÆÀÉ
     FPYE4PF  IF  E           K        DISK
     F*³Ò«O¶O²v°Ñ¼ÆÀÉ
     FPYL2PF  IF  E           K        DISK
     F*­û¤u±Æ¯Z¸ê®ÆÀÉ
     FPYT2PF  IF  E           K        DISK
     F*¤½¥q¥DÀÉ
     FSYCMPF  IF  E           K        DISK
     F*¨ê¥d®É¶¡¸ê®ÆÀÉ
     FPYT1PF  IF  E           K        DISK
     F*¹ÎÅé«OÀI§ë«O¸ê®ÆÀÉ¡ÐHEADING
     FPYX1PF  IF  E           K        DISK
     F*¹Î«O¶O²v³]©wÀÉ
     FPYX9PF  IF  E           K        DISK
     F*PYPD1PF IF  E           K        DISK
     F*¥[¯Z°òÂ¦Á~¸ê¶µ¥ØÀÉ
     FPYPD1LF2IF  E           K        DISK
     F*¥Í²£¼úª÷¸ê®Æ©ú²ÓÀÉ
     FPYPQLF02IF  E           K        DISK
     F*PYTXPF  IF  E           K        DISK
     F*¦~°²§å¦¸³B²zÀÉ
     FPY2HPF  IF  E           K        DISK
     F*­û¤u¦í±J¥DÀÉ
     FPYLIPF  IF  E           K        DISK
     F*Á~¸ê¶µ¥ØÂkÄÝÀÉ
     FPYS1PF  IF  E           K        DISK
     F*¥N½X°ò¥»¸ê®ÆÀÉ
     FPT#YPF  IF  E           K        DISK
     E*---------------------------------------------------------------
     E                    A1         50  2               .Á~¸ê¶µ¥Ø
     E                    A2         50  7 0             .¶µ¥Øª÷ÃB
     E*
     E                    B1         50  2               .©T©w¶µ¥Ø
     E                    B2         50  7 0             .½ÕÁ~«e
     E                    B3         50  7 0             .½ÕÁ~«á
     E                    B4         50  7 0             .¶µ¥Øª÷ÃB
     E*
     E                    C1         50  1               .½Ð°²¶µ¥Ø
     E                    C2         50  7 2             .½ÕÁ~«e®É¼Æ
     E                    C3         50  7 2             .½ÕÁ~«á®É¼Æ
     E                    C4         50  7 0             .¶µ¥Øª÷ÃB
     E*
     E                    D1         31  2               .±Æ¯Zªí
     E*---------------------------------------------------------------
     I*
     IOV0
     I              OV45                            OV45A
     I              OV46                            OV46A
     I              OV47                            OV47A
     I              OV48                            OV48A
     I*
     ILV0
     I              LV15                            LV15A
     I*
     I/COPY PYDDSSRC,PYPMDS01
     I*/COPY PYRPGSRC,PYC02I
     I*/COPY PYRPGSRC,PYC03I
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I                                      201 2080$A8YMD
     I*
     I                                      501 502 DPW01
     I                                      507 507 DPW04
     I                                      511 5160WPW03
     I                                      511 5140WPW03Y
     I                                      601 601 DOPT
     I                                      515 5160WPW03M
     I                                      603 6070DPW03
     I                                      603 6050DPW03Y
     I                                      606 6070DPW03M
     I*
     IPYDA01      DS                            256
     I                                       50  50 PYD01B
     I                                       52  52 PYD01C
     I*
     I            DS
     I                                        1   80WFYMD
     I                                        1   60WFYM
     I                                        1   40WFY
     I                                        5   60WFM
     I                                        7   80WFD
     I*
     I            DS
     I                                        1   80WTYMD
     I                                        1   60WTYM
     I                                        1   40WTY
     I                                        5   60WTM
     I                                        7   80WTD
     I*
     I            DS
     I                                        1   80WNYMD
     I                                        1   60WNYM
     I                                        1   40WNY
     I                                        5   60WNM
     I                                        7   80WND
     I*
     I*           DS
     I*                                       1   80WNYMDT
     I*                                       1   60WNYMT
     I*                                       1   40WNYT
     I*                                       5   60WNMT
     I*                                       7   80WNDT
     I*
     I            DS
     I                                        1   80EM13
     I                                        1   60EM13YM
     I                                        7   80EM13D
     I*
     I            DS
     I                                        1   80EM19
     I                                        1   60EM19YM
     I                                        7   80EM19D
     I*
     I            DS
     I                                        1   80EM17
     I                                        1   60EM17YM
     I                                        7   80EM17D
     I*
     I            DS
     I                                        1   80EM18
     I                                        1   60EM18YM
     I                                        7   80EM18D
     I*
     I            DS
     I                                        1   80TX04
     I                                        1   60TX04M
     I*
     I            DS
     I                                        1   80EM14
     I                                        1   60EM14YM
     I                                        7   80EM14D
     I*
     I            DS
     I                                        1   80EM16
     I                                        1   60EM16YM
     I                                        7   80EM16D
     I*
     I            DS
     I                                        1   80EM951
     I                                        1   60EM951M
     I                                        7   80EM951D
     I*
     I            DS
     I                                        1   80EM952
     I                                        1   60EM952M
     I                                        7   80EM952D
     I            DS
     I                                        1   2 EM06
     I                                        1   20EM061
     I*
     I            DS
     I                                        1   80SH03
     I                                        7   80SH03D
     I*
     I            DS
     I                                        1   80WLV03
     I                                        1   40WLV03Y
     I                                        5   60WLV03M
     I                                        7   80WLV03D
     I*
     I            DS
     I                                        1   80WYMD
     I                                        1   60WYM
     I                                        5   60WMM
     I                                        7   80WDD
     I            DS
     I                                        1   80WCURT
     I                                        1   60W3YM
     I                                        7   80CNT
     I            DS
     I                                        1   80LA03
     I                                        1   60LA3YM
     I            DS
     I                                        1   80JOBDT
     I                                        1   60JOBYM
     I                                        1   40JOBYR
     I                                        5   60JOBMT
     I            DS
     I                                        1   80EXDT
     I                                        1   40EXYR
     I                                        5   60EXMT
     I                                        7   80EXDA
     I            DS
     I                                        1   60LVYM
     I                                        1   40LVYR
     I                                        5   60LVMT
     I*           DS
     I*                                       1  62 EM39
     I*                                       1   5 EM391
     I*¦í±J¶O
     I            DS
     I                                        1   80KYMD
     I                                        1   60KYM
     I                                        7   80KDD
     I            DS
     I                                        1   80OV03
     I                                        1   60OVYM
     I                                        7   80OVD
     I            DS
     I                                        1   80LI04
     I                                        1   40LI04Y
     I                                        1   60LI04YM
     I                                        5   60LI04M
     I                                        7   80LI04D
     I*³Ì«á¤@µ§¦í±J¤é´Á
     I            DS
     I                                        1   80LI1
     I                                        1   40LI1Y
     I                                        1   60LI1YM
     I                                        5   60LI1M
     I                                        7   80LI1D
     I*³Ì«á²Ä¤Gµ§¦í±J¤é´Á
     I            DS
     I                                        1   80LI12
     I                                        1   40LI12Y
     I                                        1   60LI12YM
     I                                        5   60LI12M
     I                                        7   80LI12D
     I*³Ì«á¤@µ§°h±J¤é´Á
     I            DS
     I                                        1   80LI2
     I                                        1   40LI2Y
     I                                        1   60LI2YM
     I                                        5   60LI2M
     I                                        7   80LI2D
     I*³Ì«á²Ä¤Gµ§°h±J¤é´Á
     I            DS
     I                                        1   80LI22
     I                                        1   40LI22Y
     I                                        1   60LI22YM
     I                                        5   60LI22M
     I                                        7   80LI22D
     I*
     I            DS
     I                                        1   3 K#Y03
     I                                        1   10K#Y031
     I                                        3   30K#Y032
     IPYLVT     E DSPYLVLF02
     I                                       11  160LV3YM
     IPYLVTD      DS                          1  65
     I/COPY PYDDSSRC,PYEMDS01
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN SH03      KSH03
     C           *LIKE     DEFN SH03      SH03M
     C           *LIKE     DEFN SH03      WSH03
     C*          *LIKE     DEFN LV03      KLV03
     C           *LIKE     DEFN LV04      KLV04
     C           *LIKE     DEFN LV96      KLV96
     C           *LIKE     DEFN LV04      OLV04
     C           *LIKE     DEFN OV96      KOV96
     C           *LIKE     DEFN OV07      SOV07
     C           *LIKE     DEFN OV08      SOV08
     C           *LIKE     DEFN OV09      SOV09
     C           *LIKE     DEFN OV10      SOV10
     C           *LIKE     DEFN OV11      SOV11
     C           *LIKE     DEFN OV21      SOV21
     C           *LIKE     DEFN OV22      SOV22
     C           *LIKE     DEFN OV23      SOV23
     C           *LIKE     DEFN OV24      SOV24
     C           *LIKE     DEFN OV25      SOV25
     C           *LIKE     DEFN OV27      SOV27
     C           *LIKE     DEFN OV28      SOV28
     C           *LIKE     DEFN OV29      SOV29
     C           *LIKE     DEFN OV30      SOV30
     C           *LIKE     DEFN PW05      PW05M
     C           *LIKE     DEFN WD05      #WD05
     C           *LIKE     DEFN WD06      #WD06
     C           *LIKE     DEFN TR04      KTR04
     C           *LIKE     DEFN TR03      KTR03
     C           *LIKE     DEFN EM10      #EM10
     C           *LIKE     DEFN EM05      #EM05
     C           *LIKE     DEFN EM041     #EM041
     C           *LIKE     DEFN EM042     #EM042
     C           *LIKE     DEFN EM043     #EM043
     C           *LIKE     DEFN EM044     #EM044
     C           *LIKE     DEFN LC05      WLC05
     C           *LIKE     DEFN LC05      WLC051
     C           *LIKE     DEFN PW07      PW07M
     C*          *LIKE     DEFN PW18      #PW18
     C           *LIKE     DEFN OS05      KOS05
     C*
     C           *LIKE     DEFN CM14      DFMT
     C           *LIKE     DEFN CM15      DTYPE
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYPM     KLIST
     C                     KFLD           PM01
     C                     KFLD           DPW01
     C*PYCAPF
     C           KEYCA     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C           KEYPY     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C           KEY#Y     KLIST                           *DETIL FILE
     C                     KFLD           W#Y01  10
     C                     KFLD           W#Y02  10
     C*PYPWPF
     C           KEYPW     KLIST
     C                     KFLD           EM01             ¤½¥q
     C                     KFLD           WFYM             ¦~¤ë
     C                     KFLD           DPW04            ´Á§O
     C                     KFLD           EM02             ¤u¸¹
     C*
     C           KEYPW1    KLIST
     C                     KFLD           EM01             ¤½¥q
     C                     KFLD           WPW03            ¦~¤ë
     C                     KFLD           DPW04            ´Á§O
     C                     KFLD           EM02             ¤u¸¹
     C*
     C           KEYPH     KLIST
     C                     KFLD           EM01             ¤½¥q½s¸¹
     C                     KFLD           EM02             ­û¤u½s¸¹
     C                     KFLD           WPW03            Á~¸ê¦~¤ë
     C                     KFLD           WPW04            ´Á§O
     C*PYPDPF
     C           KEYPD     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C           KEYPD1    KLIST
     C                     KFLD           EM01             ¤½¥q
     C                     KFLD           EM02             ¤u¸¹
     C                     KFLD           PD03P   2        Á~¶µ
     C           KEYPD2    KLIST
     C                     KFLD           EM01             ¤½¥q
     C                     KFLD           EM135            ²Õ§O
     C*
     C           KEYPDA    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           PD102
     C           KEYSH     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           KSH03
     C           KEYSD     KLIST
     C                     KFLD           SH01             ¤½¥q½s¸¹
     C                     KFLD           SH02             ­û¤u½s¸¹
     C                     KFLD           SH03             ¥Í®Ä¤é´Á
     C*PYLVPF
     C           KEYLVA    KLIST
     C                     KFLD           LV01             ¤½¥q
     C                     KFLD           LV02             ­û¤u
     C                     KFLD           LV03             ½Ð°²¤é´Á
     C                     KFLD           LV04             °²§O
     C           KEYPS     KLIST
     C                     KFLD           EM06             Â¾µ¥½s¸¹
     C                     KFLD           EM07             Â¾¯Å½s¸¹
     C*PYLVLF02
     C           KEYLV1    KLIST
     C                     KFLD           EM01             ¤½¥q
     C                     KFLD           EM02             ­û¤u
     C                     KFLD           WPW03            ­pÁ~¦~¤ë
     C           KEYLV2    KLIST
     C                     KFLD           EM01             ¤½¥q
     C                     KFLD           EM02             ­û¤u
     C                     KFLD           WPW03            ­pÁ~¦~¤ë
     C                     KFLD           KLV04            °²§O
     C           KEYLV3    KLIST
     C                     KFLD           EM01             ¤½¥q
     C                     KFLD           EM02             ­û¤u
     C                     KFLD           WPW03            ­pÁ~¦~¤ë
     C           KEYLV4    KLIST
     C                     KFLD           EM01             ¤½¥q
     C                     KFLD           EM02             ­û¤u
     C                     KFLD           WCURT            ½Ð°²¤é´Á
     C*PYLAPF
     C           KEYLA     KLIST
     C                     KFLD           EM01             ¤½¥q
     C                     KFLD           EM02             ­û¤u
     C           KEYLA1    KLIST
     C                     KFLD           EM01             ¤½¥q
     C                     KFLD           EM02             ­û¤u
     C                     KFLD           WCURT            ²§±`¤é´Á
     C*PYOVLF01
     C           KEYOV     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           WPW03            ­pÁ~¦~¤ë
     C*PYOVPF
     C           KEYOV1    KLIST
     C                     KFLD           OV01
     C                     KFLD           OV02
     C                     KFLD           OV03
     C*PYWDPF
     C           KEYWD     KLIST
     C                     KFLD           KWD01
     C                     KFLD           KWD03
     C                     KFLD           KWD04
     C                     KFLD           KWD02
     C                     KFLD           KWD05
     C*
     C           KEYOS     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           WPW03
     C                     KFLD           DPW04
     C           KEYOS1    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           WPW03
     C                     KFLD           DPW04
     C                     KFLD           KOS05
     C           KEYTR     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           KTR04            ¥Í®Ä¤é´Á
     C                     KFLD           KTR03            Ãþ§O
     C           KEYTR1    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           WFYMD            ¥Í®Ä¤é´Á
     C           KEYE1     KLIST
     C                     KFLD           EM01             ¤½¥q
     C                     KFLD           EM02             ­û½s
     C                     KFLD           WTYMD
     C           KEYDP     KLIST
     C                     KFLD           #EM041
     C                     KFLD           #EM042
     C                     KFLD           #EM043
     C                     KFLD           #EM044
     C           KEYE2     KLIST
     C                     KFLD           E101
     C                     KFLD           E102
     C                     KFLD           E103
     C*PYSSPF
     C           KEYSS     KLIST
     C                     KFLD           CM13
     C                     KFLD           #WD05
     C           KEYSS1    KLIST
     C                     KFLD           CM13
     C                     KFLD           PD102
     C           KEYWSS    KLIST
     C                     KFLD           CM13
     C                     KFLD           KWD05
     C           KEYPSS    KLIST
     C                     KFLD           CM13
     C                     KFLD           PWD05   2
     C*
     C           KEYWH     KLIST
     C                     KFLD           EM01             *¤½¥q½s¸¹
     C                     KFLD           EM02             *­û¤u½s¸¹
     C                     KFLD           WPW03            *Á~¸ê¦~¤ë
     C*PYX1PF
     C           KEYX1A    KLIST
     C                     KFLD           EM01             ¤½¥q
     C                     KFLD           EM02             ­û¤u
     C                     KFLD           WTYMD            ¥Í®Ä¤é´Á
     C           KEYX1B    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C*PYE5PF
     C*          KEYE5     KLIST
     C*                    KFLD           E101             ¤½¥q½s¸¹
     C*                    KFLD           E102             ­û¤u½s¸¹
     C*                    KFLD           WPW03            Á~¸ê¦~¤ë
     C*          KEYE5A    KLIST
     C*                    KFLD           E201             ¤½¥q½s¸¹
     C*                    KFLD           E202             ­û¤u½s¸¹
     C*                    KFLD           WPW03            Á~¸ê¦~¤ë
     C*                    KFLD           E204             §Ç¸¹
     C           KEYE5     KLIST
     C                     KFLD           EM01             ¤½¥q½s¸¹
     C                     KFLD           EM02             ­û¤u½s¸¹
     C                     KFLD           WPW03            Á~¸ê¦~¤ë
     C           KEYE5A    KLIST
     C                     KFLD           EM01             ¤½¥q½s¸¹
     C                     KFLD           EM02             ­û¤u½s¸¹
     C                     KFLD           WPW03            Á~¸ê¦~¤ë
     C                     KFLD           E204             §Ç¸¹
     C*
     C*          KEYTX     KLIST
     C*                    KFLD           EM01             ¤½¥q
     C*                    KFLD           EM02             ­û¤u
     C*                    KFLD           TX031            ²§°Ê¤jÃþ
     C           KEY2H     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02             ­û¤u½s¸¹
     C                     KFLD           WFY
     C           KEYLV     KLIST                           *PYLVPF
     C                     KFLD           EM01             ¤½¥q½s¸¹
     C                     KFLD           EM02             ­û¤u½s¸¹
     C           KEYT5     KLIST                           *PYT5PF
     C                     KFLD           EM02             ­û¤u½s¸¹
     C*RTN138¦í±J¶O--------------------------------------------------
     C           KEYLI     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02             ­û¤u½s¸¹
     C*                    KFLD           WFYMD
     C*Á~¸ê¶µ¥ØÂkÄÝÀÉ
     C           KEYS1     KLIST
     C                     KFLD           CM13             Á~¸ê²Õ§O
     C                     KFLD           PD03             ­ìÁ~¸ê¶µ¥Ø
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*±o¨ìÁ~¸ê°Ñ¼Æ¡B³Ò«O¡B°·«O¡B©Ò±oµ|¡B¿ð¨ì°Ñ¼Æ
     C  N10                EXSR RTN010                     .INIT
     C*­pºâ¨C¤ëµLÁ~°²¦X­p¤Ñ¼Æ
     C                     EXSR RNOMD
     C*¬O§_¬°Â÷Â¾¡B¯dÂ¾°±Á~¡Bªø¯f¡B¨ìÂ¾
     C                     EXSR RTN020                     .DATA SEL.
     C*
     C                     Z-ADD0         I1      20       .INDEX-PAY
     C                     MOVEL*BLANK    A1
     C                     MOVEL*ZERO     A2
     C*«DÂ÷Â¾¡B¯dÂ¾¡Bªø¯f¡B¨ìÂ¾
  01-C           SWEM      IFEQ 'Y'
     C*¥ý²MªÅÁ~¸ê¤u§@ÀÉ
    C                     EXSR RTN025                     .CLEAR PW
     C* GET EMPLOYEE DATA
    C                     EXSR RTN030                     .EM DATA
    C*Á~¸ê¥DÀÉ¡ÐHEADING
    C           KEYPY     CHAINPY0                  40
  02-C           *IN40     IFEQ '0'
    C*Á~¸ê¤u§@ÀÉHEADING
    C           KEYPW1    CHAINPW0                  48
     C*¥D¥Ø¿ý¡A­pºâ©Ò¦³Á~¸ê
    C                     EXSR RTN040                     .MAIN
  02-C                     END
  01-C                     END
     C*
     C*==============================================================*
     C*          RTN010... INITIAL PROCESS
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     SETON                     10
|    C                     Z-ADD0         WLV03
|    C*¥ý¨úªºÁ~¸ê°ò¥»°Ñ¼ÆÀÉ
|    C*GET PAYROLL PARAMETER
|    C                     MOVEL'01'      PM01
|    C           KEYPM     CHAINPM0                  40
|    C*
|    C*ADD BY JADI LEE
|    C   40                MOVE *ZERO     PM03
|    C*¨ú±o¤é´Á®æ¦¡¤Î¾ä§O
|    C*GET PAYROLL PARAMETER
|    C           DPW01     CHAINCM0                  40
|    C                     MOVE CM14      DFMT
|    C                     MOVE CM15      DTYPE
|    C*
|    C*GET THIS YEAR AND YEAR FROM-TO DATE (#C03O1, #C03O2, #C03O3)
|    C                     MOVELWPW03     #C03I1  60
|    C*                    EXSR #C0300
|    C*
|    C*GET THIS MONTH FIRST DATE (WFYMD)  YYYYMM01
|    C                     Z-ADD01        WFYMD
|    C                     Z-ADDWPW03     WFYM
|    C*          WFM       IFEQ 01
|    C*          WFY       SUB  1         WFY
|    C*                    Z-ADD12        WFM
|    C*                    ELSE
|    C*                    SUB  1         WFM
|    C*                    END
|    C*
|    C*GET THIS MONTH LAST DATE (WTYMD)
|    C                     Z-ADD0         WTYMD   80
|    C                     Z-ADDWFYM      WTYM
|    C                     CALL 'P34'
|    C                     PARM WFYM      P3401I  60
|    C                     PARM '2'       P3403I  1
|    C                     PARM '1'       P3404I  1
|    C                     PARM           P3411O  1
|    C                     PARM           P3412O  20
|    C                     MOVE P3412O    WTYMD
|    C*
|    C*¨C¤ë¤u§@¤Ñ¼Æ¤@«ß¥H¢²¢¯¤Ñ­pºâ                      *YH USE ONLY
|    C**911215             MOVE 30        WTYMD
|    C*
|    C*¤G¤ë¥÷¥¼º¡30¤Ñ¤é¼Æ­pºâ
|    C                     MOVE WTYMD     WM2A    20
| 01-C           WM2A      IFLT 30
|   C           30        SUB  WM2A      WM2A
| 01*C                     ELSE
|   C                     Z-ADD*ZERO     WM2A
| 01-C                     END
|    C*
|    C*----------------------------------------------------------------
|    C*GET NEXT MONTH FIRST DATE(WNYMD)
|    C                     Z-ADD0         WNYMD   80
|    C                     Z-ADDWFYM      WNYM
|    C                     ADD  1         WNM
| 02-C           WNM       IFGT 12
|   C                     ADD  1         WNY
|   C                     SUB  12        WNM
| 02-C                     END
|    C                     Z-ADD01        WND
|    C*GET NEXS MONTH LAST DATE (WNYMDT)
|    C                     Z-ADD0         WNYMDT  80
|    C                     MOVELWNYM      WNYMDT  80
|    C                     CALL 'P34'
|    C                     PARM WNYM      P3401I  60
|    C                     PARM '2'       P3403I  1
|    C                     PARM '1'       P3404I  1
|    C                     PARM           P3411O  1
|    C                     PARM           P3412O  20
|    C                     MOVE P3412O    WNYMDT
|    C*----------------------------------------------------------------
|    C*
|    C*TAX ©Ò±oµ|°Ñ¼ÆÀÉ
|    C           '0'       CHAINTA0                  40
|    C*°·«O°Ñ¼Æ
|    C                     READ E40                      40
|    C*³Ò«O°Ñ¼Æ
|    C                     READ L20                      40
|    C*¿ð¨ì¦¸¼Æ³]©w
|    C           '0'       CHAINOD0                  40
|    C*
|    C                     Z-ADD0         #C02F   50
|    C                     Z-ADD0         #C02T   50
|    C                     Z-ADD0         #EM13   50
|    C                     Z-ADD0         LV96
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN020... DATA SELECT (SWEM)
     C*==============================================================*
02===C           RTN020    BEGSR
|    C*
|    C                     Z-ADD0         I1
|    C*
|    C                     MOVEL'Y'       SWEM    1 P
|    C*Â÷Â¾
| 01-C           EM19      IFNE *ZERO
|   C           EM19      ANDLTWFYMD
|   C                     MOVEL'N'       SWEM
| 01-C                     END
|    C*¯dÂ¾
| 02-C           EM11      IFEQ 'R'
|   C           EM17      ANDLTWFYMD
|   C                     MOVEL'N'       SWEM
| 02-C                     END
|    C*ªø¯f
| 03-C           EM11      IFEQ 'S'
|   C           EM951     ANDLTWFYMD
|   C                     MOVEL'N'       SWEM
| 03-C                     END
|    C*¨ìÂ¾
| 04-C           EM13YM    IFGT WNYM
|   C                     MOVEL'N'       SWEM
| 04-C                     END
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN025... CLEAR PW FIELD
     C*==============================================================*
03===C           RTN025    BEGSR
|    C*
|    C                     MOVELEM01      PW01
|    C                     MOVELEM02      PW02
|    C                     Z-ADDWPW03     PW03
|    C                     MOVELDPW04     PW04
|    C                     Z-ADD*ZERO     PW05
|    C                     Z-ADD*ZERO     PW07
|    C                     Z-ADD*ZERO     PW14
|    C                     Z-ADD*ZERO     PW15
|    C                     Z-ADD*ZERO     PW16
|    C                     Z-ADD*ZERO     PW17
|    C                     Z-ADD*ZERO     PW18
|    C                     Z-ADD*ZERO     PW19
|    C                     MOVELEM11      PW20
|    C                     Z-ADD*ZERO     PW22
|    C                     Z-ADD*ZERO     PW24
|    C                     Z-ADD*ZERO     PW26
|    C                     Z-ADD*ZERO     PW27
|    C                     Z-ADD*ZERO     PW28
|    C                     Z-ADD*ZERO     PW29
|    C                     Z-ADD*ZERO     PW30
|    C                     Z-ADD*ZERO     PW30
|    C                     Z-ADD*ZERO     PW31
|    C                     Z-ADD*ZERO     PW32
|    C                     Z-ADD*ZERO     PW33
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN030... GET EMPLOYEE DATA
     C*==============================================================*
04===C           RTN030    BEGSR
|    C*
|    C*GETÁ~¸ê¥DÀÉ
|    C           KEYPY     CHAINPY0                  40
|    C   40                Z-ADD*ZERO     PY03
|    C*
|    C*GET¤ë©³Á~¨î¡AÂ¾ºÙ¡A¥þ¶Ô¼úª÷¦³µL(#EM10,#EM05,JT07)
|    C*GET¤ë©³³¡ªù¡A¾n¥~¬z¶K¡A©Ð«Î¬z¶K¡A¥[¯Z­pºâ(#EM041,2,3,4,DP03,5,7)
|    C*½ü¯Z¬z¶K
| 01-C           EM104     IFEQ 'Y'
     C*±Æ¯Z¬z¶K¡A¤@©w­n¦³±Æ¯Z¤~¦³
|   C                     EXSR RTN139
| 01-C                     END
|    C*¨ú±o¬Y¤@®É¶¡ÂIÁ~¨î¡BÂ¾°È
|    C                     EXSR RTN201
|    C*---------------------------------------------------------------
|    C*¤W´Á­É¤äPM312,PW30
|    C*
|    C                     MOVEL'2'       WPW04   1
| 02-C           EM10      IFEQ '2'
|   C           KEYPH     CHAINPH0                  41
| 03-C           *IN41     IFEQ '0'
|   C                     Z-ADDPH30      #WD06
|   C                     MOVELPM312     #WD05
| 03-C                     END
| 02-C                     END
     C*­pºâ¤W´Á­É¤äªºª÷ÃB
|    C                     EXSR RTN250
|    C*---------------------------------------------------------------
|    C*­pºâ¤w¨ìÂ¾¤ë¤é¼Æ
|    C                     Z-ADD0         WJOBM   70
|    C                     Z-ADD0         WJOBD   20
|    C                     CALL 'P33'
|    C                     PARM EM13      P3301I  80
|    C                     PARM WFYMD     P3302I  80
|    C                     PARM '2'       P3303I  1
|    C                     PARM '1'       P3304I  1
|    C           WJOBM     PARM           P3311O  70
|    C           WJOBD     PARM           P3312O  20
|    C*
04===C           END030    ENDSR
     C*==============================================================*
     C*          RTN040... MAIN PROCESS
     C*==============================================================*
05===C           RTN040    BEGSR
|    C*
|    C                     SETON                     99
|    C                     MOVEL'N'       WSTOP   1        .¥þ¶Ô¼úª÷
|    C*
|    C*GET¥»Á~»P½ÕÁ~«eÁ~¸ê(PW05,PW05M,SH03M)
|    C                     EXSR RTN105
|    C*
|    C*GET¤u§@¤é¼Æ¡®­pºâ¹ê»â¥»Á~--PW07&PM301
|    C                     EXSR RTN115
|    C*
|    C*GET¦©Á~½Ð°²®É¼Æ---PW14,½Ð°²¦©´Ú
|    C   99                EXSR RTN110
|    C*
|    C*¥[¯Z¶O¡A¹q³ø¡A§Ñ¥´¥d¡A¿ð¨ì¡A¦­°h--PM303-PM305,7,8,9
|    C                     EXSR RTN130
|    C*
|    C*¥þ¶Ô¼úª÷PM309 ---·í¤ë¥÷¥þ¶Ô¼úª÷
| 01-C           WSTOP     IFEQ 'N'
|   C                     EXSR RTN135
| 01-C                     END
|    C*
|    C*ºÖ§Qª÷:PM334 (¦³¥[¤JºÖ©e·|ªÌ¤~¦©)
| 02-C           EM24      IFEQ 'Y'
|   C                     EXSR RTN150
| 02-C                     END
|    C*
|    C*¹Î«O¶OÃº´Úª÷ÃB
|    C                     EXSR RTN120
|    C*
|    C*½Ð°²¦©´Úª÷ÃB
|    C                     EXSR RTN112
|    C*
|    C*¾n¥~¡A©Ð«Î¬z¶K
|    C*                    EXSR RTN137
|    C*
|    C*¦í±J¶O
|    C                     EXSR RTN138
|    C*
|    C*°·«O¶O-PM319, PW24, PW25
|    C*¥ý­pºâ°·«O¶O¡G¦]»ÝGET°·«O¥»¤H¸É§U½X
|    C                     EXSR RTN147
|    C*
|    C*³Ò«O¶O-PM310, PW19, PW22
|    C                     EXSR RTN145
|    C*---------------------------------------
|    C*¥Í²£¼úª÷-PM326
|    C                     EXSR RTN148
|    C*---------------------------------------
|    C*ÁZ®Ä¼úª÷-PM308
|    C                     EXSR RTN149
|    C*---------------------------------------
|    C*°h¥ðª÷-PM352
|    C                     EXSR RTN146
|    C*
|    C*---------------------------------------
|    C*
|    C*¨ä¥¦¦©´Ú--2.¶U´Ú:PM313
|    C                     EXSR RTN160
|    C*
|    C*¨ä¥¦¦©´Ú--3.¤u·|¶O:PM332 (¦³¥[¤J¤u·|ªÌ¤~¦©¡^
| 03-C           EM25      IFEQ 'Y'
|   C                     EXSR RTN180
| 03-C                     END
|    C*---------------------------------------------------------------
|    C*
|    C*Á~©w¶µ¥Ø---> PYWDPF, PW16-PW18
|    C                     EXSR RTN165
|    C*
|    C*---------------------------------------
|    C*¥æ³q¬z¶K-PM314
|    C*
|    C           KEYCA     CHAINCA0                  46
| 04-C           *IN46     IFEQ '1'
|   C                     EXSR RTN182
| 04-C                     END
|    C*---------------------------------------
|    C*¥ë­¹¬z¶K-PM323
|    C*
|    C                     EXSR RTN183
|    C*---------------------------------------
|    C*©T©wÁ~¸ê©Ò±oµ|(PW15, PM318)
|    C                     EXSR RTN170
|    C*¼úª÷©Ò±oµ|(PM311)
|    C                     EXSR RTN175
|    C*---------------------------------------
|    C*
|    C                     Z-ADD$A8YMD    PW97
|    C                     TIME           WTIME  120
|    C                     MOVELWTIME     PW98
|    C                     MOVEL$USER     PW99
|    C*
|    C                     Z-ADDWPW03     PW03
|    C*                    ADD  #PW18     PW18
|    C*
|    C           KEYPW1    CHAINPW0                  48
| 05-C           *IN48     IFEQ '1'
|   C                     WRITEPW0
| 05*C                     ELSE
|   C                     UPDATPW0
| 05-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*   RTN105... GET ¥»¤ë¥»Á~- PW05
     C*             GET ¥»½ÕÁ~«eÁ~¸ê -PW05M,¤é´Á=SH03M
     C*==============================================================*
06===C           RTN105    BEGSR
|    C*
|    C*¥»¤ë©³Á~¸ê
|    C                     MOVEL'N'       SWSH    1        .¥¼½ÕÁ~
     C*­pºâ©³Á~(°Ï¤À¤ëÁ~¸ò¤éÁ~)
|    C                     EXSR R0101
|    C                     Z-ADDDPY#3     PW05             .©³Á~
|    C*
|    C*¥H°ò·ÇÀÉ¤§¶µ¥Øª÷ÃB­pºâ
|    C                     Z-ADDDPY#3     WBASE1  70       ¥»­Ä
|    C*
|    C*­pºâ®ÉÁ~¡G«ö³W©w¤u§@¤Ñ¼Æ¤Î®É¼Æ´«ºâ¥X
|    C           WBASE1    DIV  PM101     WBASE1    H
|    C                     DIV  PM102     WBASE1    H
|    C*
|    C                     Z-ADDWTYMD     KSH03
|    C*
     C*½ÕÁ~¥DÀÉHEADING PYSHPF
|    C           KEYSH     SETGTSH0
|    C           KEYPY     READESH0                      40
|    C*
| 01-C           *IN40     IFEQ '0'
|   C           SH06      ANDNE*ZERO
|   C*                    Z-ADDSH07      PW05
|   C                     Z-ADDSH08      PW05
|   C                     MOVEL'Y'       SWSH
| 01-C                     END
|    C*
|    C                     EXSR RTN260                     .©T©w¶µ¥Ø
|    C*----
|    C*¥»¤ë½ÕÁ~¡]¤@­Ó¤ë³Ì¦h½ÕÁ~¤@¦¸¡^
|    C                     MOVEL'N'       SWSH             .¥¼½ÕÁ~
|    C                     Z-ADDWFYMD     KSH03
|    C           KEYSH     SETGTSH0
|    C           KEYPY     READESH0                      40
|    C*
| 02-C           *IN40     IFEQ '0'
|   C           SH03      ANDLEWTYMD
|   C           SH06      ANDNE*ZERO
|   C                     MOVEL'Y'       SWSH
| 02-C                     END
|    C*½ÕÁ~«e
| 03-C           SWSH      IFEQ 'N'
|   C                     Z-ADDPW05      PW05M
|   C                     Z-ADD*ZERO     SH03M
|   C                     Z-ADDWNYMD     WSH03
| 03*C                     ELSE
|   C*                    Z-ADDSH07      PW05M
|   C                     Z-ADDSH08      PW05M
|   C                     Z-ADDSH03      SH03M            .½ÕÁ~¤é´Á
|   C                     Z-ADDSH03      WSH03            .½ÕÁ~¤é´Á
|   C                     EXSR RTN270                     .©T©w¶µ¥Ø
| 03-C                     END
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*   RTN110... GET ¦©Á~½Ð°²®É¼Æ--- PW14
     C*==============================================================*
07===C           RTN110    BEGSR
|    C*
|    C                     MOVE *BLANK    OLV04
|    C                     Z-ADD*ZERO     WPW14
|    C                     MOVEL*BLANKS   C1
|    C                     Z-ADD*ZERO     C2
|    C                     Z-ADD*ZERO     C3
|    C                     Z-ADD*ZERO     C4
|    C                     Z-ADD*ZERO     SPW14   83       .½Ð°²
|    C                     Z-ADD*ZERO     TPW14   83       .½Ð°²
|    C                     Z-ADD*ZERO     SLV11   30       .¥æ³q¬z¶K
|    C                     Z-ADD*ZERO     SLV12   30       .¤j©]¯Z¬z¶K
|    C                     Z-ADD*ZERO     W309    83       .¥þ¶Ô¼úª÷
|    C*
|    C                     Z-ADD*ZERO     LV03
|    C                     Z-ADD*ZERO     LV05
|    C                     Z-ADD1         J       30
|    C*
|    C           KEYLV1    SETLLLVL2
|    C           KEYLV1    READELVL2                     42
|    C*
|    C  N42                MOVELLV04      OLV04
|    C*
| 01-C           *IN42     DOWEQ'0'
| 02-C           LV05      IFLT WSH03                      ½ÕÁ~¤é
|   C*
| 03-C           LV04      IFNE OLV04
|   C*
|   C                     EXSR RTN220
|   C                     EXSR RTN230
|   C*
|   C                     MOVELOLV04     C1,J
|   C                     Z-ADDSPW14     C2,J
|   C                     ADD  SPW14     TPW14
|   C                     Z-ADD*ZERO     SPW14
|   C                     ADD  1         J
|   C                     MOVELLV04      OLV04
| 03-C                     END
|   C*
|   C                     EXSR RTN210
| 02-C                     END
|   C*
|   C           KEYLV1    READELVL2                     42
|   C*
|   C   42                EXSR RTN220
|   C   42                EXSR RTN230
|   C   42                MOVELOLV04     C1,J
|   C   42                Z-ADDSPW14     C2,J
|   C   42                ADD  SPW14     TPW14
|   C   42                Z-ADD*ZERO     SPW14
|   C   42                ADD  1         J
| 01-C                     END
|    C*¦³½ÕÁ~
| 04-C           SWSH      IFEQ 'Y'
|   C           KEYLV1    SETLLLVL2
|   C           KEYLV1    READELVL2                     42
|   C*
|   C                     MOVELLV04      OLV04
|   C                     Z-ADD*ZERO     WPW14   62
|   C*
| 05-C           *IN42     DOWEQ'0'
| 06-C           LV05      IFLT WNYMD
|   C*
| 07-C           LV04      IFNE OLV04
|   C*
|   C                     EXSR RTN220
|   C                     EXSR RTN230
|   C*
|   C                     Z-ADD1         WI      20
|   C           OLV04     LOKUPC1,WI                    40
| 08-C           *IN40     IFEQ '0'
|   C                     MOVELOLV04     C1,J
|   C                     Z-ADDSPW14     C3,J
|   C                     ADD  1         J
| 08*C                     ELSE
|   C                     Z-ADDSPW14     C3,WI
| 08-C                     END
|   C*
|   C                     ADD  SPW14     TPW14
|   C                     Z-ADD*ZERO     SPW14
|   C                     MOVELLV04      OLV04
| 07-C                     END
|   C*
| 09-C           LV03      IFGE WSH03
|   C                     EXSR RTN210
| 09-C                     END
|   C*
| 06-C                     END
|   C*
|   C           KEYLV1    READELVL2                     42
|   C   42                EXSR RTN220
|   C   42                EXSR RTN230
|   C   42                Z-ADD1         WI
|   C   42      OLV04     LOKUPC1,WI                    40
| 10-C   42      *IN40     IFEQ '0'
|   C                     MOVELOLV04     C1,J
|   C                     Z-ADDSPW14     C3,J
|   C                     ADD  1         J
| 10*C                     ELSE
|   C                     Z-ADDSPW14     C3,WI
| 10-C                     END
|   C*
|   C   42                ADD  SPW14     TPW14
|   C   42                Z-ADD*ZERO     SPW14
|   C   42                ADD  1         J
| 05-C                     END
| 04-C                     END
|    C*
|    C                     Z-ADDTPW14     PW14      H
|    C*
07===C           END110    ENDSR
     C*==============================================================*
     C*   RTN112... GET ¦©Á~½Ð°²®É¼Æ¡®ª÷ÃB
     C*==============================================================*
08===C           RTN112    BEGSR
|    C*----------------------------------------------------------------
|    C*
|    C                     MOVELLV01      S2I1    2        ¤½¥q½s¸¹
|    C                     MOVELLV02      S2I2    8        ­û¤u½s¸¹
|    C                     Z-ADDLV96      S2I3    60       ­pÁ~¦~¤ë
|    C                     Z-ADDLV03      S2I4    80       ½Ð°²¤é´Á
|    C                     CALL 'PYS3062'
|    C                     PARM           S2I1    2        ¤½¥q½s¸¹
|    C                     PARM           S2I2    8        ­û¤u½s¸¹
|    C                     PARM           S2I3    60       ­pÁ~¦~¤ë
|    C                     PARM           S2I4    80       ½Ð°²¤é´Á
|    C                     PARM           S2O1    70       Á~¸ê°ò·Ç
|    C*
|    C                     Z-ADD*ZERO     COST   103       ®ÉÁ~°ò·Ç
|    C*­pºâ®ÉÁ~¡G«ö³W©w¤u§@¤Ñ¼Æ¤Î®É¼Æ´«ºâ¥X
| 01-C           EM100     IFEQ '1'                         *¤ëÁ~
|   C           S2O1      DIV  PM101     COST      H
|   C                     DIV  PM102     COST      H
| 01-C                     END
|    C*
| 02-C           EM100     IFEQ '2'                         *¤éÁ~
|   C           S2O1      DIV  PM101     COST      H
| 02-C                     END
|    C*
| 03-C           EM100     IFEQ '3'                         *®ÉÁ~
|   C                     Z-ADDS2O1      COST
| 03-C                     END
|    C*
|    C*------------------------------------------------------------***
|    C                     Z-ADD*ZERO     KWD06  103
|    C                     Z-ADD*ZERO     #WD06
|    C*
|    C           KEYLV3    SETLLLVL2
|    C           KEYLV3    READELVL2                     42
| 04-C           *IN42     DOWEQ'0'
|   C*
|   C           LV04      CHAINLC0                  41
| 05-C           *IN41     IFEQ '0'
|   C           LC03      ANDEQ'2'                        .µLÁ~
|   C*
|   C                     Z-ADD0         HOURS   52
|   C                     Z-ADD0         HLC08   52
|   C*
|   C*          LV05      IFLE #YMDT
| 06-C           LV09      IFNE 0
|   C           LV08      ORNE 0
|   C           LV09      MULT PM101     HOURS     H
|   C                     ADD  LV08      HOURS
| 06-C                     END
|   C*
|   C                     Z-ADD0         KWD06  103
|   C                     Z-ADD0         LV15A
|   C*
|   C           LC08      MULT PM101     HLC08     H
|   C*
| 07-C           HOURS     IFNE 0
|   C           HOURS     ANDGEHLC08
|   C           HOURS     MULT COST      KWD06     H
|   C                     MULT LC09      KWD06     H
| 07-C                     END
|   C*
|   C*±N¨Cµ§½Ð°²¦©´Úª÷ÃB¼g¦^½Ð°²¥DÀÉ
|   C           KEYLVA    CHAINLV0                  42
| 08-C           *IN42     IFEQ '0'
|   C                     Z-ADDKWD06     LV15A
|   C                     UPDATLV0
| 08-C                     END
|   C*
|   C                     ADD  KWD06     #WD06
| 05-C                     END
|   C           KEYLV3    READELVL2                     42
| 04-C                     END
|    C*
| 09-C           #WD06     IFNE 0
|   C                     MOVELPM327     #WD05
|   C                     EXSR RTN250
| 09-C                     END
|    C*
08===C           END112    ENDSR
     C*==============================================================*
     C*   RTN115... ¤u§@¤é¼Æ¡A¹ê»â¥»Á~­pºâPW07,PM301
     C*==============================================================*
09===C           RTN115    BEGSR
|    C*
|    C                     Z-ADD0         TOT     70
|    C*
|    C*¤u§@¤Ñ¼Æ
|    C                     EXSR RTN240                     .¤u§@¤Ñ¼Æ
|    C*
| 01-C           PW07      IFLT *ZERO
|   C                     Z-ADD*ZERO     PW07
| 01-C                     END
|    C*
| 02-C           EM100     IFEQ '2'                        ¤éÁ~
|   C                     Z-ADDWDAY      PW07
| 02-C                     END
|    C*
|    C*¹ê»â¥»Á~
|    C                     ADD  1         I1
|    C                     MOVELPM301     A1,I1            .¶µ¥Ø
|    C                     Z-ADDPW05M     A2,I1
     C*¤ëÁ~¤H­û¯}¤ë­pºâ
     C           EM100     IFEQ '1'
     C           PW05M     DIV  PM102     BAMT   125H
     C           BAMT      MULT PW07      A2,I1     H
     C                     END
|    C*
|    C*                    Z-ADDPW05M     WAMT
|    C*
|    C*¥»¤ë½ÕÁ~ª÷ÃB°l¥[
| 03-C           SH03M     IFNE *ZERO
|   C           SH03M     ANDLE#YMDT                      .­pÁ~¤î¤é
|   C*
|   C                     CALL 'P32'
|   C                     PARM SH03M     P3201I  80
|   C                     PARM #YMDT     P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C*
|   C           PW05      SUB  PW05M     WAMT   218
|   C           WAMT      DIV  PM102     WAMT      H
|   C                     MULT P3211O    WAMT      H
|   C                     ADD  WAMT      A2,I1     H
| 03-C                     END
|    C*
|    C*À³¤u§@¤Ñ¼Æ#PM102,µoÁ~¤ñ¨Ò#SALR
| 04-C           #EM10     IFEQ '2'                        ¥bÁ~
|   C                     Z-ADD15        #PM102  20
|   C                     Z-ADD0.5       #SALR   21
| 04-C                     END
| 05-C           #EM10     IFEQ '1'                        ¥þÁ~
|   C                     Z-ADDPM102     #PM102
|   C                     Z-ADD1         #SALR
| 05-C                     END
| 06-C           #EM10     IFEQ '3'                        µLÁ~
|   C                     Z-ADDPM102     #PM102
|   C                     Z-ADD1         #SALR
| 06-C                     END
|    C*¹ê»â¥»Á~
|    C*          A2,I1     MULT #SALR     A2,I1     H
|    C*
|    C*¦©°£¿ð¨ìª÷ÃB
|    C                     EXSR RTN181
|    C                     SUB  TOTAL     A2,I1
|    C                     Z-ADDA2,I1     TOT
|    C*
|    C                     EXSR RTN280
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          RTN120... GET¹Î«O¶OÃº¥æª÷ÃB *YH USE ONLY
     C*==============================================================*
10===C           RTN120    BEGSR
|    C*
|    C*¤éÄy¥DºÞ¤£¦©¹Î«O¶O
| 01-C           EM321     IFEQ 'F'                        ¥~°êÄy
|   C                     GOTO END120
| 01-C                     END
|    C*
|    C*GET¨ì¥»¤ë©³¤§§ë«Oª¬ªp
|    C           KEYX1A    SETGTX10
|    C           KEYX1B    REDPEX10                      40
|    C   40                GOTO END120                     µL§ë«O
|    C*
|    C                     Z-ADDWFYMD     #YMDF
|    C*                    Z-ADDWNYMD     #YMDT   80       .­pºâ¤î¤é
|    C                     Z-ADDWTYMD     #YMDT   80       .­pºâ¤î¤é
|    C*Â÷Â¾¡A·í¤ë¤£­p
| 02-C           EM19      IFNE *ZERO
|   C           EM19      ANDLE#YMDT
|   C                     GOTO END120
| 02-C                     END
|    C*°±«O¡A·í¤ë¤£­p
| 03-C           X104      IFEQ '3'                        °h«O
|   C           X103      ANDLE#YMDT
|   C                     GOTO END120
| 03-C                     END
|    C*°h«O¡A·í¤ë¤£­p
| 04-C           X104      IFEQ '9'                        °h«O
|   C           X103      ANDLE#YMDT
|   C                     GOTO END120
| 04-C                     END
|    C*
|    C*À³Ãº«O¶OÁ`ÃB¡×¢¯¡A·í¤ë¤£­p
| 05-C           X105      IFEQ *ZERO                      µL«O¶O
|   C           X103      ANDLE#YMDT
|   C                     GOTO END120
| 05-C                     END
|    C*
|    C*¨ìÂ¾º¡¤@¦~­û¤u¹Î«O¶O¦³§é¦©¡GPYX9PF
|    C                     Z-ADD*ZERO     WX906   52
|    C           *LOVAL    SETLLX90
|    C                     READ X90                      41
| 06-C           *IN41     IFEQ '0'
|   C           X906      DIV  100       WX906     H
| 06*C                     ELSE
|   C                     Z-ADD0         WX906
| 06-C                     END
|    C*
|    C                     CALL 'P33'
|    C                     PARM EM13      P3301I  80
|    C                     PARM WFYMD     P3302I  80
|    C                     PARM '2'       P3303I  1
|    C                     PARM '1'       P3304I  1
|    C           WJOBM     PARM           P3311O  70
|    C           WJOBD     PARM           P3312O  20
|    C*
| 07-C           WJOBM     IFGE 12
|   C           X105      MULT WX906     WAMT      H
| 07*C                     ELSE
|   C                     Z-ADDX105      WAMT
| 07-C                     END
|    C*
|    C*¹Î«O¶O'78'
| 08-C           WAMT      IFNE *ZERO
|   C                     ADD  1         I1
|   C                     MOVEL'78'      A1,I1
|   C                     Z-ADDWAMT      A2,I1     H
| 08-C                     END
|    C*
10===C           END120    ENDSR
     C*==============================================================*
     C*   RTN130... GET ¥[¯Z¡]­È¯Z¡^¶O»P®É¼Æ-PW31-PW33, PM303-PM305
     C*==============================================================*
11===C           RTN130    BEGSR
|    C*
|    C                     Z-ADD*ZERO     WSUBT   73
|    C                     Z-ADD*ZERO     WTAXH   51       .À³µ|®É¼Æ
|    C                     Z-ADD*ZERO     WTAXH1  51       .§Kµ|®É¼Æ
|    C                     Z-ADD*ZERO     WTAX    70       .¥[¯ZÁ`ª÷
|    C                     Z-ADD*ZERO     WTAXHA  73
|    C                     Z-ADD*ZERO     WTAXHB  70       ¥­®É¥[¯Zª÷
|    C                     Z-ADD*ZERO     WTAXHC  70       °²¤é¥[¯Zª÷
|    C                     Z-ADD*ZERO     WTAXHD  73       °²¤é®É¼Æ  
|    C                     Z-ADD*ZERO     RTAX2   70                 
|    C                     Z-ADD*ZERO     GTAX2   70                 
|    C*§Kµ|
|    C                     Z-ADD*ZERO     UOV07   73       ¥­±`¥[¯Z®É¼Æ
|    C                     Z-ADD*ZERO     UOV08   73       ¶W®É¥[¯Z®É¼Æ
|    C                     Z-ADD*ZERO     UOV10   73       °²¤é¥[¯Z®É¼Æ
|    C                     Z-ADD*ZERO     UOV17   73       °²¤é¶W®É¥[¯Z®É¼Æ
|    C                     Z-ADD*ZERO     UOV45   70       ¥­±`¥[¯Zª÷ÃB
|    C                     Z-ADD*ZERO     UOV46   70       ¶W®É¥[¯Zª÷ÃB
|    C                     Z-ADD*ZERO     UOV47   70       °²¤é¥[¯Zª÷ÃB
|    C                     Z-ADD*ZERO     UOV48   70       °²¤é¶W®É¥[¯Zª÷ÃB
|    C*À³µ|
|    C                     Z-ADD*ZERO     VOV07   73       ¥­±`¥[¯Z®É¼Æ
|    C                     Z-ADD*ZERO     VOV08   73       ¶W®É¥[¯Z®É¼Æ
|    C                     Z-ADD*ZERO     VOV10   73       °²¤é¥[¯Z®É¼Æ
|    C                     Z-ADD*ZERO     VOV17   73       °²¤é¶W®É¥[¯Z®É¼Æ
|    C                     Z-ADD*ZERO     VOV45   70       ¥­±`¥[¯Zª÷ÃB
|    C                     Z-ADD*ZERO     VOV46   70       ¶W®É¥[¯Zª÷ÃB
|    C                     Z-ADD*ZERO     VOV47   70       °²¤é¥[¯Zª÷ÃB
|    C                     Z-ADD*ZERO     VOV48   70       °²¤é¶W®É¥[¯Zª÷ÃB
|    C*
|    C                     Z-ADD*ZERO     ROV07   73
|    C                     Z-ADD*ZERO     ROV08   73
|    C                     Z-ADD*ZERO     ROV10   73
|    C                     Z-ADD*ZERO     ROV17   73
|    C                     Z-ADD*ZERO     ROV45   70
|    C                     Z-ADD*ZERO     ROV46   70
|    C                     Z-ADD*ZERO     ROV47   70
|    C                     Z-ADD*ZERO     ROV48   70
|    C*
|    C                     Z-ADD*ZERO     COST             ¨C¤p®É¥[¯Z¶O
|    C*
|    C*ªk©w§Kµ|®É¼Æ(WTAXFH)
| 01-C           EM32      IFEQ 'M'                        .MALE
|   C                     Z-ADDPM113     WTAXFH  51
| 01*C                     ELSE                            .FEMALE
|   C                     Z-ADDPM114     WTAXFH  51
| 01-C                     END
|    C*
|    C*¥[¯Z¶O­pºâ¡GÀ³§Kµ|®É¼Æ
|    C                     EXSR RTN13A                     À³§Kµ|®É¼Æ
|    C*
11===C           END130    ENDSR
     C*==============================================================*
     C*          RTN131...¥[¯Z¶O­pºâ¡G³Ò°òªk
     C*==============================================================*
12===C           RTN131    BEGSR
|    C*
|    C*--------------------------------------------------------------**
|    C*»¡©ú¡G­û¤u¥[¯Z®É¼Æ­Y¶W¹Lªk©w§Kµ|¥[¯Z®É¼Æ
|    C*      «h¦h¥Xªº®É¼Æ¥HÀ³µ|¥[¯Z¶O¨Ó­pºâ
|    C*      ¥t¥~¡D®É¼Æªº±±¨î¶¶§Ç«h«ö¤é´Á¥ý«á¨Ó²Ö­p
|    C*        ­pºâªºÀu¥ý¶¶§Ç«h«ö¥­¤é¡D¶W®É¡D°²¤é¡D°²¤é¶W®É¶¶§Ç¨Ó²Ö­p
|    C*------------------------------------------------------------***
|    C                     Z-ADD*ZERO     AAA     73
|    C                     Z-ADD*ZERO     UOV07   73       ¥­±`¥[¯Z®É¼Æ
|    C                     Z-ADD*ZERO     UOV08   73       ¶W®É¥[¯Z®É¼Æ
|    C                     Z-ADD*ZERO     UOV10   73       °²¤é¥[¯Z®É¼Æ
|    C                     Z-ADD*ZERO     UOV17   73       °²¤é¶W®É¥[¯Z®É¼Æ
|    C                     Z-ADD*ZERO     VOV07   73       ¥­±`¥[¯Z®É¼Æ
|    C                     Z-ADD*ZERO     VOV08   73       ¶W®É¥[¯Z®É¼Æ
|    C                     Z-ADD*ZERO     VOV10   73       °²¤é¥[¯Z®É¼Æ
|    C                     Z-ADD*ZERO     VOV17   73       °²¤é¶W®É¥[¯Z®É¼Æ
|    C                     Z-ADD*ZERO     ROV07   73       ¥­±`¥[¯Z®É¼Æ
|    C                     Z-ADD*ZERO     ROV08   73       ¶W®É¥[¯Z®É¼Æ
|    C                     Z-ADD*ZERO     ROV10   73       °²¤é¥[¯Z®É¼Æ
|    C                     Z-ADD*ZERO     ROV17   73       °²¤é¶W®É¥[¯Z®É¼Æ
|    C*
|    C*ªk©w§Kµ|®É¼Æ(WTAXFH)
| 01-C           EM32      IFEQ 'M'                        .MALE
|   C                     Z-ADDPM113     WTAXFH  51
| 01*C                     ELSE                            .FEMALE
|   C                     Z-ADDPM114     WTAXFH  51
| 01-C                     END
|    C*
|    C*¥[¯Z¶O­pºâ¡GÀ³§Kµ|®É¼Æ
|    C                     EXSR RTN13A                     À³§Kµ|®É¼Æ
|    C*
12===C           END131    ENDSR
     C*==============================================================*
     C*          RTN13A...¥[¯Z¶O­pºâ¡GÀ³¡þ§Kµ|®É¼Æ
     C*==============================================================*
13===C           RTN13A    BEGSR
|    C*
|    C*²Ö­p¥[¯Z®É¼Æ¡G OV07.OV08.OV10.OV17
|    C           KEYOV     SETLLOVL1
|    C           KEYOV     READEOVL1                     42
| 01-C           *IN42     DOWEQ'0'
|   C*------------------------------------------------------------***
|   C*
|   C                     MOVELOV01      SI1     2        ¤½¥q½s¸¹
|   C                     MOVELOV02      SI2     8        ­û¤u½s¸¹
|   C                     Z-ADDOV96      SI3     60       ­pÁ~¦~¤ë
|   C                     Z-ADDOV03      SI4     80       ¥[¯Z¤é´Á
|   C                     CALL 'PYS3061'
|   C                     PARM           SI1     2        ¤½¥q½s¸¹
|   C                     PARM           SI2     8        ­û¤u½s¸¹
|   C                     PARM           SI3     60       ­pÁ~¦~¤ë
|   C                     PARM           SI4     80       ¥[¯Z¤é´Á
|   C                     PARM           SO1     70       Á~¸ê°ò·Ç
|   C*
|   C                     Z-ADD*ZERO     COST1   70
|   C*­pºâ¥[¯ZÁ~¸ê°òÂ¦
|   C*
|   C           KEYPD2    SETLLPD10
|   C           KEYPD2    READEPD10                     46
| 02-C           *IN46     DOWEQ'0'
|   C*
| 03-C           PD102     IFEQ PM323                      .¥æ³q¬z¶K
|   C           PD102     OREQ PM314                      .¥ë­¹¬z¶K
|   C*
|   C           KEYSS1    CHAINSS0                  45
| 04-C           *IN45     IFEQ '0'
| 05-C           SS07      IFNE *ZERO
|   C                     ADD  SS07      COST1            .BY¤é
| 05-C                     END
| 04-C                     END
|   C*
| 03-C                     END
|   C*
|   C           KEYPD2    READEPD10                     46
| 02-C                     END
|   C*
|   C                     Z-ADD*ZERO     SO2     70
|   C*
|   C*­pºâ®ÉÁ~¡G«ö³W©w¤u§@¤Ñ¼Æ¤Î®É¼Æ´«ºâ¥X
|   C                     Z-ADD*ZERO     COST   103       ®ÉÁ~°ò·Ç
| 06-C           EM100     IFEQ '1'                         *¤ëÁ~
|   C           COST1     MULT PM102     SO2       H
|   C                     ADD  SO2       SO1
|   C           SO1       DIV  PM101     COST      H
|   C                     DIV  PM102     COST      H
| 06-C                     END
|   C*
| 07-C           EM100     IFEQ '2'                         *¤éÁ~
|   C                     ADD  COST1     SO1
|   C           SO1       DIV  PM101     COST      H
| 07-C                     END
|   C*
| 08-C           EM100     IFEQ '3'                         *®ÉÁ~
|   C           COST1     DIV  PM101     SO2       H
|   C                     ADD  SO2       SO1
|   C                     Z-ADDSO1       COST
| 08-C                     END
|   C*
|   C*¥[¯Z¶O¡×°ò¼Æ¡¯¥[¯ZÁ~¸ê¤ñ
|   C*¡@¡@¡@¥­¤é¥[¯Z¶O¡×°ò¼Æ¡¯PM115 (¥­¤é¥[¯ZÁ~¸ê¤ñ¡^
|   C*¡@¡@¡@¶W®É¥[¯Z¶O¡×°ò¼Æ¡¯PM116 (¶W®É¥[¯ZÁ~¸ê¤ñ¡^
|   C*¡@¡@¡@°²¤é¥[¯Z¶O¡×°ò¼Æ¡¯PM117 (°²¤é¥[¯ZÁ~¸ê¤ñ¡^
|   C*¡@¡@¡@°²¤é¶W®É¶O¡×°ò¼Æ¡¯PM118 (°²¤é¶W®É¥[¯ZÁ~¸ê¤ñ¡^
|   C*------------------------------------------------------------***
| 09-C           OV07      IFNE *ZERO                      ¥­¤é¥[¯Z®É¼Æ
|   C           OV07      MULT COST      DOV45   83H
|   C           DOV45     MULT PM115     OV45      H
|   C*          DOV45     MULT PM115     AMT     83H
|   C*
|   C*          WTAXHA    IFGE WTAXFH
|   C*                    ADD  OV07      VOV07            À³µ|®É¼Æ
|   C*                    ADD  OV45      VOV45            À³µ|ª÷ÃB
|   C*
|   C*                    ELSE
|   C*                    ADD  OV07      WTAXHA           ¥¼µ|®É¼Æ
|   C*                    ADD  OV45      UOV45            ¥¼µ|ª÷ÃB
|   C*          WTAXHA    IFGE WTAXFH
|   C*          WTAXHA    SUB  WTAXFH    WSUBT
|   C*                    Z-ADDWSUBT     VOV07            À³µ|®É¼Æ
|   C*          WSUBT     MULT COST      ROV45     H
|   C*          ROV45     MULT PM115     VOV45     H      À³µ|ª÷ÃB
|   C*                    Z-ADDWTAXFH    UOV07            ¥¼µ|®É¼Æ
|   C*                    SUB  VOV45     UOV45            ¥¼µ|ª÷ÃB
|   C*                    END
|   C*
|   C*                    END
|   C*
| 09-C                     END
|   C*
|   C*------------------------------------------------------------***
| 10-C           OV08      IFNE *ZERO                      ¶W®É¥[¯Z
|   C           OV08      MULT COST      DOV46   83H
|   C           DOV46     MULT PM116     OV46      H      ¨C¤p®Éª÷ÃB
|   C*          DOV46     MULT PM116     AMT     83H
|   C*
|   C*          WTAXHA    IFGE WTAXFH
|   C*                    ADD  OV08      VOV08            À³µ|®É¼Æ
|   C*                    ADD  OV46      VOV46            À³µ|ª÷ÃB
|   C*                    ELSE
|   C*                    ADD  OV08      WTAXHA           ¥¼µ|®É¼Æ
|   C*                    ADD  OV46      UOV46            ¥¼µ|ª÷ÃB
|   C*          WTAXHA    IFGE WTAXFH
|   C*          WTAXHA    SUB  WTAXFH    WSUBT
|   C*                    Z-ADDWSUBT     VOV08            À³µ|®É¼Æ
|   C*          WSUBT     MULT COST      ROV46     H
|   C*          ROV46     MULT PM116     VOV46     H      À³µ|ª÷ÃB
|   C*                    Z-ADDWTAXFH    UOV08            ¥¼µ|®É¼Æ
|   C*                    SUB  VOV46     UOV46            ¥¼µ|ª÷ÃB
|   C*                    END
|   C*
|   C*                    END
|   C*
| 10-C                     END
|   C*
|   C* -----------------------------------------------------------***
| 11-C           OV10      IFNE *ZERO                      °²¤é¥[¯Z
|   C           OV10      MULT COST      DOV47   83H
|   C           DOV47     MULT PM117     OV47      H      ¨C¤p®Éª÷ÃB
|   C*          DOV47     MULT PM117     AMT     83H
|   C*
|   C*          WTAXHA    IFGE WTAXFH
|   C*                    ADD  OV10      VOV10            À³µ|®É¼Æ
|   C*                    ADD  OV47      VOV47            À³µ|ª÷ÃB
|   C*
|   C*                    ELSE
|   C*                    ADD  OV10      WTAXHA           ¥¼µ|®É¼Æ
|   C*                    ADD  OV47      UOV47            ¥¼µ|ª÷ÃB
|   C*          WTAXHA    IFGE WTAXFH
|   C*          WTAXHA    SUB  WTAXFH    WSUBT
|   C*                    Z-ADDWSUBT     VOV10            À³µ|®É¼Æ
|   C*          WSUBT     MULT COST      ROV47     H
|   C*          ROV47     MULT PM117     VOV47     H      À³µ|ª÷ÃB
|   C*                    Z-ADDWTAXFH    UOV10            ¥¼µ|®É¼Æ
|   C*                    SUB  VOV47     UOV47            ¥¼µ|ª÷ÃB
|   C*                    END
|   C*
|   C*                    END
|   C*
| 11-C                     END
|   C*
|   C*------------------------------------------------------------***
| 12-C           OV17      IFNE *ZERO                      °²¤é¶W®É¥[¯Z
|   C           OV17      MULT COST      DOV48   83H
|   C           DOV48     MULT PM118     OV48      H      ¨C¤p®Éª÷ÃB
|   C*
|   C*          WTAXHA    IFGE WTAXFH
|   C*                    ADD  OV17      VOV17            À³µ|
|   C*                    ADD  OV48      VOV48            À³µ|ª÷ÃB
|   C*
|   C*                    ELSE
|   C*                    ADD  OV17      WTAXHA           ¥¼µ|®É¼Æ
|   C*                    ADD  OV48      UOV48            ¥¼µ|ª÷ÃB
|   C*          WTAXHA    IFGE WTAXFH
|   C*          WTAXHA    SUB  WTAXFH    WSUBT
|   C*                    Z-ADDWSUBT     VOV17            À³µ|®É¼Æ
|   C*          WSUBT     MULT COST      ROV48     H
|   C*          ROV48     MULT PM118     VOV48     H      À³µ|ª÷ÃB
|   C*                    Z-ADDWTAXFH    UOV17            ¥¼µ|®É¼Æ
|   C*                    SUB  VOV48     UOV48            ¥¼µ|ª÷ÃB
|   C*                    END
|   C*
|   C*                    END
| 12-C                     END
|   C*
|   C* -----------------------------------------------------------***
|   C           KEYOV1    CHAINOV0                  40
| 13-C           *IN40     IFEQ '0'
|   C                     Z-ADDOV45      OV45A
|   C                     Z-ADDOV46      OV46A
|   C                     Z-ADDOV47      OV47A
|   C                     Z-ADDOV48      OV48A
|   C                     UPDATOV0
| 13-C                     END
|   C* -----------------------------------------------------------***
|   C*°²¤é¤£­pºâÀ³µ|¥[¯Z¶O,¥þ³¡ºâ§@§Kµ|¥[¯Z¶O
|   C                     ADD  OV07      WTAXHA
|   C                     ADD  OV08      WTAXHA
|   C*
|   C                     ADD  OV10      WTAXHD
|   C                     ADD  OV17      WTAXHD
|   C*
|   C                     ADD  OV45      WTAXHB
|   C                     ADD  OV46      WTAXHB
|   C*
|   C                     ADD  OV47      WTAXHC
|   C                     ADD  OV48      WTAXHC
|   C*
|   C                     ADD  OV45      WTAX
|   C                     ADD  OV46      WTAX
|   C                     ADD  OV47      WTAX
|   C                     ADD  OV48      WTAX
|   C* -----------------------------------------------------------***
|   C           KEYOV     READEOVL1                     42
| 01-C                     END
|    C* -----------------------------------------------------------***
|    C*§Kµ|®É¼Æ
|    C*          UOV07     ADD  UOV08     WTAXH1           .§Kµ|®É¼Æ
|    C*                    ADD  UOV10     WTAXH1
|    C*                    ADD  UOV17     WTAXH1
|    C*À³µ|®É¼Æ
|    C*          VOV07     ADD  VOV08     WTAXH            .À³µ|®É¼Æ
|    C*                    ADD  VOV10     WTAXH
|    C*                    ADD  VOV17     WTAXH
|    C*------------------------------------------------------------***
|    C*§Kµ|¥[¯Z¶O
|    C*                    Z-ADD*ZERO     WTAX2   70H
|    C*          UOV45     ADD  UOV46     WTAX2
|    C*                    ADD  UOV47     WTAX2
|    C*                    ADD  UOV48     WTAX2
|    C*
|    C*À³µ|¥[¯Z¶O
|    C*                    Z-ADD*ZERO     WTAX1   70H
|    C*          VOV45     ADD  VOV46     WTAX1
|    C*                    ADD  VOV47     WTAX1
|    C*                    ADD  VOV48     WTAX1
|    C*
|    C*------------------------------------------------------------***
|    C                     Z-ADD*ZERO     WTAX1   70       À³µ|¥[¯Z  
|    C                     Z-ADD*ZERO     WTAX2   70       §Kµ|¥[¯Z  
|    C*
| 14-C           WTAXHA    IFGT WTAXFH
|   C*¥[¯Z®É¼Æ
|   C           WTAXHA    SUB  WTAXFH    WSUBT
|   C                     Z-ADDWSUBT     WTAXH            À³µ|®É¼Æ
|   C                     Z-ADDWTAXFH    WTAXH1           §Kµ|®É¼Æ
|   C                     ADD  WTAXHD    WTAXH1
|   C*¥[¯Z¶O
|   C           COST      MULT PM115     GTAX2     H
|   C           GTAX2     MULT WTAXFH    RTAX2     H
|   C           WTAXHB    SUB  RTAX2     WTAX1            À³µ|¥[¯Z¶O
|   C           WTAX      SUB  WTAX1     WTAX2            §Kµ|¥[¯Z¶O
| 14*C                     ELSE
|   C                     Z-ADDWTAX      WTAX2            §Kµ|¥[¯Z¶O
|   C           WTAXHA    ADD  WTAXHD    WTAXH1           §Kµ|®É¼Æ
| 14-C                     END
|    C*------------------------------------------------------------***
|    C*À³µ|¥[¯Z®É¼Æ¡Aª÷ÃBPW31,WTAX1
|    C                     Z-ADDWTAXH     PW31
| 15-C           WTAX1     IFNE *ZERO
|   C                     MOVELPM303     #WD05            À³µ|¥[¯Z¶O
|   C                     MOVEL'1'       #TAXYN  1
|   C                     Z-ADDWTAX1     #WD06
|   C                     EXSR RTN250
| 15-C                     END
|    C*
|    C*§Kµ|¥[¯Z®É¼Æ¡Aª÷ÃBPW32,WTAX2
|    C                     Z-ADDWTAXH1    PW32
| 16-C           WTAX2     IFNE *ZERO
|   C                     MOVELPM304     #WD05            §Kµ|¥[¯Z¶O
|   C                     MOVEL'2'       #TAXYN  1
|   C                     Z-ADDWTAX2     #WD06
|   C                     EXSR RTN250
| 16-C                     END
|    C*
13===C           END13A    ENDSR
     C*==============================================================*
     C*   RTN135... GET ¥þ¶Ô¼úª÷-PM321
     C*==============================================================*
14===C           RTN135    BEGSR
|    C*
|    C*¬O§_¦³¥þ¶Ô¼úª÷&¤ëÁ~ªÌµL¥þ¶Ô¼úª÷
0001-C*          EM100     IFEQ '1'
0001-C*          EM12      OREQ 'N'
0001 C           EM12      IFEQ 'N'
|   C                     GOTO END135
| 01-C                     END
|    C*
|    C*¥»¤ë·s¶i­û¤uµL¥þ¶Ô
| 02-C           EM13YM    IFEQ WPW03
|   C           EM13D     ANDNE1
|   C                     GOTO END135
| 02-C                     END
|    C*
|    C*¥»¤ëÂ÷Â¾­û¤uµL¥þ¶Ô
| 03-C           EM19YM    IFEQ WPW03
|   C                     GOTO END135
| 03-C                     END
|    C*¥»¤ë½Ð«D¥þ¶Ô°²ªÌ,µL¥þ¶Ô¼úª÷
|    C           KEYLV1    SETLLLVL2
|    C           KEYLV1    READELVL2                     40
|    C           *IN40     DOWEQ'0'
|    C           LV04      CHAINLC0                  40
|    C           LC07      IFEQ 'N'
|    C                     GOTO END135
|    C                     END
|    C           KEYLV1    READELVL2                     40
|    C                     ENDDO
|    C*
|    C*¥»¤ë¿ð¨ì­û¤uµL¥þ¶Ô
|    C                     Z-ADDWPW03     W3YM
|    C                     Z-ADD31        CNT
|    C           KEYLA1    SETGTLA0
|    C                     READPLA0                      46
| 06-C           *IN46     IFEQ '0'
|   C           LA01      ANDEQEM01
|   C           LA02      ANDEQEM02
|   C           LA3YM     ANDEQWPW03
|   C                     GOTO END135
| 06-C                     END
|    C*¥þ¶Ô¼úª÷¡GPM321
|    C*
|    C                     MOVELPM321     #WD05
|    C           KEYSS     CHAINSS0                  47
| 07-C           *IN47     IFEQ '0'
| 08-C           SS07      IFNE *ZERO
|   C                     Z-ADDSS07      #WD06
|   C                     EXSR RTN250
| 08-C                     END
| 07-C                     END
|    C*
14===C           END135    ENDSR
     C*==============================================================*
     C*   RTN137... GET ¾n¥~¬z¶K-PM302,©Ð«Î¬z¶KPM306
     C*==============================================================*
15===C           RTN137    BEGSR
|    C*
| 01-C           WJOBM     IFLT 3                          ¥¼º¡3­Ó¤ë
|   C                     GOTO END137
| 01-C                     END
|    C*
| 02-C           EM19      IFNE *ZERO                      ¥»¤ë¤wÂ÷Â¾
|   C           EM19      ANDLEWFYMD
|   C                     GOTO END137
| 02-C                     END
|    C*¾n¥~¬z¶K
|    C*          DP03      IFNE 0
|    C*                    ADD  1         I1
|    C*                    MOVELPM302     A1,I1
|    C*                    Z-ADDDP03      A2,I1     H
|    C*                    END
|    C*©Ð«Î¬z¶K
|    C*          DP05      IFNE 0
|    C*          EM32      ANDEQ'M'                        ¨k¥Í
|    C*          EM34      ANDEQ'M'                        ¤w±B
|    C*                    ADD  1         I1
|    C*                    MOVELPM306     A1,I1
|    C*                    Z-ADDDP05      A2,I1     H
|    C*                    END
|    C*
15===C           END137    ENDSR
     C*==============================================================*
     C*   RTN138... GET ¦í±J¶O
     C*==============================================================*
16===C           RTN138    BEGSR
|    C*
|    C*­û¤u¨S¦³¦í±J°h±J¸ê®Æ
|    C           KEYLI     CHAINLI0                  41
| 01-C           *IN41     IFEQ '1'
|   C                     GOTO END138
| 01-C                     END
|    C*
|    C*GET EMPLOYEE DATA
|    C           *LOVAL    SETLLLI0
|    C                     Z-ADD*ZERO     YY1     20       *¸ê®Æ¦¸¼Æ
|    C                     Z-ADD*ZERO     SDD     20       *¬Û®t¤é¼Æ
|    C                     Z-ADD*ZERO     X       21       *¦í±J¶O²v
|    C                     Z-ADD*ZERO     LI1              *1¦í±J¤é´Á
|    C                     Z-ADD*ZERO     LI2              *1°h±J¤é´Á
|    C                     Z-ADD*ZERO     LI12             *2¦í±J¤é´Á
|    C                     Z-ADD*ZERO     LI22             *2°h±J¤é´Á
|    C*­pºâ¦í±J¤é¼Æ
|    C*LI03=¥Ó½ÐÃþ§O LI04=¥Í®Ä¤é´Á
|    C*
|    C           KEYLI     SETGTLI0
|    C                     READPLI0                      46
| 02-C           *IN46     DOWEQ'0'
|   C*
|   C                     ADD  1         YY1              *¸ê®Æ¦¸¼Æ
|   C*³Ì«á¤@µ§¸ê®Æ
| 03-C           YY1       IFEQ 1
| 04-C           LI03      IFEQ '1'
|   C                     Z-ADDLI04      LI1              *1¦í±J¤é´Á
| 04-C                     END
| 05-C           LI03      IFEQ '2'
|   C                     Z-ADDLI04      LI2              *1°h±J¤é´Á
| 05-C                     END
| 03-C                     END
|   C*³Ì«á²Ä¤Gµ§¸ê®Æ
|   C*
| 06-C           YY1       IFEQ 2
| 07-C           LI03      IFEQ '1'
|   C                     Z-ADDLI04      LI12             *2¦í±J¤é´Á
| 07-C                     END
| 08-C           LI03      IFEQ '2'
|   C                     Z-ADDLI04      LI22             *2°h±J¤é´Á
| 08-C                     END
| 06-C                     END
|   C*
| 09-C           YY1       IFGT 2
|   C                     LEAVE
| 09-C                     END
|   C*
|   C                     READPLI0                      46
| 02-C                     END
|    C*³Ì«á¤@µ§¸ê®Æ¬O°h±J---------------
|    C*³B²z¦~¤ë«e°h±J
| 10-C           WFYM      IFGT LI2YM                      *1°h±J¦~¤ë
|   C                     GOTO END138
| 10-C                     END
|    C*³B²z¦~¤ë«á°h±J
| 11-C           WFYM      IFLT LI2YM                      *1°h±J¦~¤ë
|   C                     Z-ADD1         X
| 11-C                     END
|    C**³B²z¦~¤ë¡×°h±J¦~¤ë
| 12-C           WFYM      IFEQ LI2YM                      *1°h±J¦~¤ë
|   C*
| 13-C           WFYM      IFNE LI12YM                     *2¦í±J¦~¤ë
| 14-C           LI2D      IFGT 15
|   C                     Z-ADD1         X
| 14*C                     ELSE
|   C                     Z-ADD0.5       X
| 14-C                     END
| 13-C                     END
|   C*
| 15-C           WFYM      IFEQ LI12YM                     *2¦í±J¦~¤ë
|   C           LI2D      SUB  LI12D     SDD              *¬Û®t¤Ñ¼Æ
| 16-C           SDD       IFGT 15
|   C                     Z-ADD1         X
| 16*C                     ELSE
|   C                     Z-ADD0.5       X
| 16-C                     END
| 15-C                     END
|   C*
| 12-C                     END
|    C*³Ì«á¤@µ§¸ê®Æ¬O¦í±J---------------
|    C*³B²z¦~¤ë«á¦í±J
| 17-C           WFYM      IFLT LI1YM                      *1¦í±J¦~¤ë
|   C                     GOTO END138
| 17-C                     END
|    C*³B²z¦~¤ë«e¦í±J
| 18-C           WFYM      IFGT LI1YM                      *1¦í±J¦~¤ë
|   C                     Z-ADD1         X
| 18-C                     END
|    C**³B²z¦~¤ë¡×¦í±J¦~¤ë
| 19-C           WFYM      IFEQ LI1YM                      *1¦í±J¦~¤ë
|   C*
| 20-C           WFYM      IFNE LI22YM                     *2°h±J¦~¤ë
| 21-C           LI2D      IFGT 15
|   C                     Z-ADD1         X
| 21*C                     ELSE
|   C                     Z-ADD0.5       X
| 21-C                     END
| 20-C                     END
|   C*
| 22-C           WFYM      IFEQ LI22YM                     *2°h±J¦~¤ë
|   C           LI1D      SUB  LI22D     SDD
| 23-C           SDD       IFGT 15
|   C                     Z-ADD1         X
| 23*C                     ELSE
|   C                     Z-ADD0.5       X
| 23-C                     END
| 22-C                     END
|   C*
| 19-C                     END
|    C*------------------------------------------------------------
|    C*
|    C           LI09      MULT X         WAMT      H      *ª÷ÃB
|    C*¦í±J¶O'69'
| 24-C           WAMT      IFNE *ZERO
|   C                     ADD  1         I1
|   C                     MOVELPM325     A1,I1
|   C                     Z-ADDWAMT      A2,I1     H
| 24-C                     END
|    C*
16===C           END138    ENDSR
     C*==============================================================*
     C*   RTN139... GET ½ü¯Z¬z¶K
     C*==============================================================*
17===C           RTN139    BEGSR
|    C*
|    C                     Z-ADD0         WTVAL   80
|    C                     Z-ADD1         CNT     20
|    C                     Z-ADD0         WDAY    20
|    C                     Z-ADD0         DDAY    20
|    C                     Z-ADDWPW03     W3YM    60
|    C*
|    C           KEYWH     CHAINT20                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEAT205      D1               ±Æ¯Z°}¦C
|   C*
| 02-C           CNT       DOWLE31
|   C*­pºâ±Æ¯Z¤u§@¤Ñ¼Æ
| 03-C           D1,CNT    IFNE *BLANK
|   C                     ADD  1         WDAY
|   C*¥­±`½ü¯Z
|   C                     MOVE D1,CNT    CLAS    2
|   C           CLAS      CHAINT10                  40
| 04-C           *IN40     IFEQ '0'
|   C                     Z-ADDT116      WT116   40       .¥X¶Ô¬z¶K
|   C                     Z-ADD*ZERO     NT116   40       .¿ð¨ì¦©´Ú
|   C*¿ð¨ì¦©´Ú
|   C           KEYLA1    CHAINLA0                  47
| 05-C           *IN47     IFEQ '0'
| 06-C           LA04      IFNE *ZERO
| 06-C           LA06      ORNE *ZERO
|   C*          T116      DIV  8         NT116     H
|   C                     Z-ADDT116      NT116     H
| 06-C                     END
| 07-C           LA05      IFNE *ZERO
|   C                     Z-ADDT116      NT116
| 07-C                     END
|   C                     SUB  NT116     WT116
| 05-C                     END
|   C*
|   C*½Ð°²¦©´Ú
|   C           KEYLV4    SETGTLV0
|   C                     READPLV0                      47
| 08-C           *IN47     IFEQ '0'
     C           EM01      IFEQ LV01
     C           EM02      ANDEQLV02
| 09-C           WCURT     ANDGELV03                       °_©l¤é
|   C           WCURT     ANDLELV05                       ²×¤î¤é
     C*
     C                     GOTO XXNEXT
|   C*½Ð°²¥¼º¡¤@¤Ñ
| 10-C           LV09      IFEQ 0
| 11-C           LV08      IFNE 0
|   C*          T116      DIV  2         WT116
|   C                     Z-ADD*ZERO     WT116
| 11-C                     END
| 10*C                     ELSE
| 12-C           LV08      IFEQ 0
|   C                     Z-ADD*ZERO     WT116
| 12*C                     ELSE
| 13-C           WCURT     IFEQ LV05
|   C*          T116      DIV  2         WT116
|   C                     Z-ADD*ZERO     WT116
| 13*C                     ELSE
|   C                     Z-ADD*ZERO     WT116
| 13-C                     END
| 12-C                     END
| 10-C                     END
|   C*
| 09-C                     END
| 08-C                     END
     C           TAG2      TAG
|   C                     ADD  WT116     WTVAL
| 04-C                     END
|   C*°²¤é¥[¯Z
| 03*C                     ELSE
|   C           KEYOV     SETLLOVL1
|   C           KEYOV     READEOVL1                     46
| 14-C           *IN46     DOWEQ'0'
| 15-C           OVD       IFEQ CNT
|   C           WT116     DIV  8         WT116     H
|   C           WT116     MULT OV07      ST      40H
|   C**94/07/01½ü¯Z¬z¶K¤@©w­n¦³±Æ¯Z¤~¦³
|   C**                   ADD  ST        WTVAL
| 15-C                     END
|   C           KEYOV     READEOVL1                     46
| 14-C                     END
|   C*
| 03-C                     END
| 03-C           XXNEXT    TAG
|   C                     ADD  1         CNT
| 02-C                     END
| 01-C                     END
|    C*
|    C                     MOVEL'21'      #WD05
|    C           KEYSS     CHAINSS0                  40
| 16-C           *IN40     IFEQ '0'
|   C           SS18      ANDEQCM13
|   C           WTVAL     ANDNE*ZERO
|   C                     Z-ADDWTVAL     #WD06
|   C                     EXSR RTN250
| 16-C                     END
|    C*
17===C           END139    ENDSR
     C*==============================================================*
     C*   RTN145... GET ³Ò«O¶O-PM310
     C*==============================================================*
18===C           RTN145    BEGSR
|    C*¥¼§ë«O
| 01-C           EM14      IFEQ *ZERO
|   C           EM14      ORGT WTYMD
|   C                     GOTO END145
| 01-C                     END
|    C*
|    C                     Z-ADDWFYMD     #YMDF   80       .­pºâ°_¤é
|    C*¥»¤ë·s¶i¤H­û
| 02-C           EM13YM    IFEQ WTYM
|   C           EM13D     ANDNE1
|   C                     Z-ADDEM13      #YMDF
| 02-C                     END
|    C*
| 03-C           EM14      IFGT #YMDF
|   C                     Z-ADDEM14      #YMDF
| 03-C                     END
|    C*
|    C*                    Z-ADDWNYMD     #YMDT   80       .­pºâ¤î¤é
|    C                     Z-ADDWTYMD     #YMDT   80       .­pºâ¤î¤é
|    C*Â÷Â¾
| 04-C           EM19      IFNE *ZERO
|   C           EM19      ANDLE#YMDT
|   C                     Z-ADDEM19      #YMDT
| 04-C                     END
|    C*
| 05-C           EM16      IFNE *ZERO
|   C           EM16      ANDLE#YMDT
|   C                     Z-ADDEM16      #YMDT
| 05-C                     END
|    C*
| 06-C           #YMDT     IFLE #YMDF
|   C                     GOTO END145
| 06-C                     END
|    C*
|    C*³Ò«O¶O
|    C*L201 =³Ò«O¶O²v¢Ï(0.065) ==>¥»°ê­û¤u
|    C*L2012=³Ò«O¶O²v¢Ð(0.055) ==>1.¥~³Ò
|    C*                            2.¦~ÄÖ¤j©ó60·³,
|    C*                            3.¦~ÄÖ¤p©ó15·³.
|    C                     CALL 'P33'
|    C                     PARM EM33      P3301I  80
|    C                     PARM WFYMD     P3302I  80
|    C                     PARM '2'       P3303I  1
|    C                     PARM '1'       P3304I  1
|    C                     PARM           P3311O  70
|    C                     PARM           P3312O  20
|    C           P3311O    DIV  12        MMM     20
|    C*
|    C*³Ò«O¶O
|    C*                    MOVEL'A'       TX031
|    C*          KEYTX     SETGTTX0
|    C*                    READPTX0                      46
| 07-C*          *IN46     IFEQ '0'
| 08-C*          TX04M     IFEQ WTYM
| 09-C*          TX032     IFEQ '3'                        .³Ò«O°h«O
|   C*                    Z-ADD0         TX05
| 09-C*                    END
| 10-C*          TX032     IFEQ '2'                        .³Ò«O½Õ¾ã
|   C*                    Z-ADDTX05      TX05
| 10-C*                    END
| 08-C*                    END
|   C*
| 11-C           EM321     IFEQ 'F'
|   C           EM23      MULT L2012     WAMT      H
| 11*C                     ELSE
| 12-C           MMM       IFGE 60
|   C           MMM       ORLE 15
|   C           EM23      MULT L2012     WAMT      H
| 12*C                     ELSE
|   C           EM23      MULT L201      WAMT      H
| 12-C                     END
| 11-C                     END
| 07-C*                    END
|    C                     Z-ADDPM102     PW22
|    C*
|    C*
| 13-C           #YMDF     IFNE WFYMD
|   C           #YMDT     ORNE WTYMD
|   C*
|   C                     CALL 'P32'
|   C                     PARM #YMDF     P3201I  80
|   C                     PARM #YMDT     P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C                     ADD  1         P3211O
|   C*
|   C*Â÷Â¾¤Ñ¼Æ¤£§t·í¤Ñ¤é´ÁEX: 1/15Â÷Â¾«h­pÁ~¤Ñ¼Æ¦@¦³14¤Ñ
|   C*
|   C                     Z-ADDP3211O    PW22
|   C                     MULT P3211O    WAMT      H
|   C                     DIV  PM102     WAMT      H
| 13-C                     END
|    C*
|    C                     Z-ADDWAMT      PW19      H
|    C*
|    C           EM02      IFEQ '26978   '
|    C                     Z-ADDWAMT      TPAMT   40
|    C                     Z-ADDWE108     XX108   40
|    C                     END
|    C*
| 14-C           PW19      IFGT *ZERO
|   C                     ADD  1         I1
|   C                     MOVELPM310     A1,I1
|   C*
|   C*¦©¸É§U
| 15-C           WE108     IFNE 0
|   C           1         SUB  WE108     WAMT
| 15*C                     ELSE
|   C                     Z-ADD1         WAMT
| 15-C                     END
|   C           WAMT      MULT L202      WAMT      H
|   C           PW19      MULT WAMT      A2,I1     H
| 14-C                     END
|    C*
18===C           END145    ENDSR
     C*==============================================================*
     C*   RTN146... GET °h¥ðª÷-PM352 (­û¤u¦Û´£°h¥ðª÷)
     C*==============================================================*
22===C           RTN146    BEGSR
|    C*
|    C                     Z-ADD*ZERO     DH605   60
|    C                     Z-ADD*ZERO     DH606   60
|    C                     Z-ADD*ZERO     P1014I
|    C                     Z-ADD*ZERO     P1015I
|    C                     CALL 'PYH120'
|    C                     PARM EM01      P1011I  2         ¤½¥q½s¸¹
|    C                     PARM EM02      P1012I  8         ­û¤u½s¸¹
|    C                     PARM WPW03     P1013I  60        Á~¸ê¤ë¥÷
|    C           DH605     PARM           P1014I  60        ¦Û´£ª÷ÃB
|    C           DH606     PARM           P1015I  60        ¥ø´£ª÷ÃB
|    C                     PARM           @RTNC   2
|    C*³Ò°h¶}©l«á¸Ñ¶}
| 01-C           DH605     IFNE *ZERO
|   C                     MOVELPM352     #WD05
|   C                     Z-ADDDH605     #WD06
|   C                     EXSR RTN250
| 01-C                     ELSE
|   C                     MOVE *BLANKS   #WD05
|   C                     Z-ADD0         #WD06
| 01-C                     END
|    C*
22===C           END146    ENDSR
     C*==============================================================*
     C*   RTN147... GET °·«O¶O-PM319
     C*==============================================================*
19===C           RTN147    BEGSR
|    C*
|    C                     Z-ADD*ZERO     WE108   54       ¥»¤H¡Ð¸É§U
|    C*GET¨ì¥»¤ë©³¤§§ë«Oª¬ªp
|    C           KEYE1     SETGTE10
|    C           KEYPY     REDPEE10                      40
|    C   40                GOTO END147                     µL§ë«O
|    C*
| 01-C           E106      IFEQ 0                          ¥þ³¡°±«O
|   C                     GOTO END147
| 01-C                     END
|    C*
|    C                     Z-ADDWNYMD     #YMDF             ­pºâ¤î¤é
|    C*Â÷Â¾¡A·í¤ë¤£­p
|    C*·í¤ë·s¨ìÂ¾¤SÂ÷Â¾»Ý­p°·«O¶O
|    C*
| 02-C           EM19      IFNE *ZERO
| 03-C           EM19      IFLT #YMDF
|   C           EM13YM    ANDNEWPW03
|   C                     GOTO END147
| 03-C                     END
| 02-C                     END
|    C*
|    C*°±«O¡A·í¤ë¤£­p
| 04-C           E104      IFEQ '3'                        °±«O
|   C           E103      ANDLT#YMDF
|   C                     GOTO END147
| 04-C                     END
|    C*°h«O¡A·í¤ë¤£­p
| 05-C           E104      IFEQ '9'                        °h«O
|   C           E103      ANDLT#YMDF
|   C                     GOTO END147
| 05-C                     END
|    C*----------------------------------------------------------------
|    C                     SETOF                     4241
|    C*°·«O¶O¡×§ë«OÃB¢æ¶O²v
|    C                     Z-ADDE114      PW24    70
|    C                     Z-ADD1         PW26    10
|    C                     Z-ADD0         E204
|    C           KEYE5A    CHAINE50                  42
|    C                     EXSR RTN14A
|    C   42                WRITEE50
|    C  N42                UPDATE50
|    C*­pºâ°·«O¸É§U´Ú¡Ð¥»¤H
|    C                     Z-ADD*ZERO     WE108   54       ¥»¤H¡Ð¸É§U
| 06-C           E108      IFNE *BLANK                     ¦³¸É§U
|   C                     MOVEL'INSR'    W#Y01     P
|   C                     MOVELE108      W#Y02     P
|   C           KEY#Y     CHAIN#Y0                  40
| 07-C           *IN40     IFEQ '0'
|   C                     MOVEL#Y03      K#Y03
|   C*
| 08-C           K#Y03     IFNE 'ALL'                      ÅU¥D
|   C*
| 09-C           K#Y03     IFNE '0/0'
|   C           K#Y03     ANDNE'3/4'
|   C           K#Y032    ANDNE0
|   C           K#Y031    DIV  K#Y032    WE108   54H
| 09-C                     END
|   C*
| 10-C           K#Y03     IFEQ '0/0'                      ­û¤u¥þÃB­t¾á
|   C                     Z-ADD*ZERO     WE108   54H
| 10-C                     END
|   C*
| 11-C           K#Y03     IFEQ '3/4'                      ¸É§U¢°¡þ¢³¾á
|   C           1         DIV  K#Y032    WE108   54H
| 11-C                     END
|   C*
| 12-C           E108      IFEQ '1'                        ¥_¥«¥þ¸É¤W­­$604
|   C           K#Y03     ANDEQ'1/1'
|   C                     Z-ADD1         WE108
| 12-C                     END
|   C*
| 13-C           E108      IFEQ '0'                        ¬F©²¥þ¸É
|   C           K#Y03     ANDEQ'1/1'
|   C                     Z-ADD1         WE108
| 13-C                     END
|   C*
| 08-C                     END
|   C*
| 07-C                     END
|   C*
| 06-C                     END
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*­pºâ°·«O¸É§U´Ú¡Ð²²ÄÝ
|    C           KEYE2     SETLLE20
|    C           KEYE2     READEE20                      46
| 14-C           *IN46     DOWEQ'0'
|   C*
|   C*---------------------------------------------------------------
|   C                     EXSR RTN14B
|   C           PW26      IFLT 4
|    C           E205      IFNE '3'
|    C           E205      ANDNE'5'
|    C           E205      ANDNE'9'
|   C                     ADD  E214      PW24             Á`À³Ãº«O¶O
|   C                     ADD  1         PW26
|   C                     END
|   C           KEYE5A    CHAINE50                  41
|   C   41                WRITEE50
|   C  N41                UPDATE50
|   C                     END
|   C           KEYE2     READEE20                      46
| 14-C                     END
|    C*---------------------------------------------------------------
| 16-C           PW24      IFGT *ZERO
|   C                     ADD  1         I1
|   C                     MOVELPM319     A1,I1
|   C*
|   C                     ADD  PW24      A2,I1     H
| 16-C                     END
|    C*----------------------------------------------------------------
19===C           END147    ENDSR
     C*==============================================================*
     C*          RTN14A....PYE1PF FIELD TO PYE5PF                    *
     C*==============================================================*
20===C           RTN14A    BEGSR
|    C*
|    C                     MOVELE101      E501             ¤½¥q½s¸¹
|    C                     MOVELE102      E502             ­û¤u½s¸¹
|    C                     Z-ADDE103      E503             ¥Í®Ä¤é´Á
|    C                     Z-ADD0         E504             §Ç¸¹
|    C                     MOVELE104      E505             ²§°ÊÃþ§O
|    C                     MOVELEM03      E506             ²²ÄÝ©m¦W
|    C                     MOVELEM31      E507             ¨­¥÷ÃÒ¸¹
|    C                     Z-ADDEM33      E508             ¥X¥Í¤é´Á
|    C                     MOVEL'0'       E509             ²²ÄÝºÙ¿×
|    C                     MOVEL'N'       E510             ¥Á°ê«e¥X¥Í
|    C                     MOVELE108      E511             ¸É§U½X
|    C                     MOVEL*BLANK    E512             »¡©úµù¸Ñ
|    C                     Z-ADDE105      E513             §ë«Oª÷ÃB
|    C                     Z-ADDE114      E514             À³Ãº«O¶O
|    C                     Z-ADDWPW03     E515             Á~¸ê¦~¤ë
|    C                     MOVELE109      E516             °·«O¦a°Ï
|    C                     Z-ADD$A8YMD    E597
|    C                     TIME           E598
|    C                     MOVEL$USER     E599
|    C*
20===C                     ENDSR
     C*==============================================================*
     C*          RTN14B ...PYE2PF FIELD TO PYE5PF                    *
     C*==============================================================*
21===C           RTN14B    BEGSR
|    C*
|    C                     MOVELE201      E501             ¤½¥q½s¸¹
|    C                     MOVELE202      E502             ­û¤u½s¸¹
|    C                     Z-ADDE203      E503             ¥Í®Ä¤é´Á
|    C                     MOVELE204      E504             §Ç¸¹
|    C                     MOVELE205      E505             ²§°Ê§O
|    C                     MOVELE206      E506             ²²ÄÝ©m¦W
|    C                     MOVELE207      E507             ¨­¥÷ÃÒ¸¹
|    C                     Z-ADDE208      E508             ¥X¥Í¤é´Á
|    C                     MOVELE209      E509             ²²ÄÝºÙ¿×
|    C                     MOVELE210      E510             ¥Á°ê«e¥X¥Í
|    C                     MOVELE211      E511             ¸É§U½X
|    C                     MOVELE212      E512             »¡©úµù¸Ñ
|    C                     Z-ADDE213      E513             §ë«Oª÷ÃB
|    C                     Z-ADDE214      E514             À³Ãº«O¶O
|    C                     Z-ADDWPW03     E515             Á~¸ê¦~¤ë
|    C                     MOVELE215      E516             °·«O¦a°Ï
|    C                     Z-ADD$A8YMD    E597
|    C                     TIME           E598
|    C                     MOVEL$USER     E599
|    C*
21===C                     ENDSR
     C*==============================================================*
     C*          RTN148...¥Í²£¼úª÷PM326 *EL USE ONLY
     C*==============================================================*
22===C           RTN148    BEGSR
|    C*
| 01-C           EM133     IFNE ' '
|   C*
|   C                     Z-ADD*ZERO     WAMT
|   C*
|   C           KEYLV1    CHAINPQ0                  46
|   C  N46                Z-ADDPQ10      WAMT
|   C   46                Z-ADD0         WAMT
|   C*
|   C*¥Í²£¼úª÷¡GPM326
| 02-C           WAMT      IFNE *ZERO
|   C                     ADD  1         I1
|   C                     MOVELPM326     A1,I1
|   C                     Z-ADDWAMT      A2,I1     H
| 02-C                     END
| 01-C                     END
|    C*
22===C           END148    ENDSR
     C*==============================================================*
     C*          RTN149...ÁZ®Ä¼úª÷PM308 *EL USE ONLY
     C*==============================================================*
23===C           RTN149    BEGSR
|    C*
|    C                     Z-ADD*ZERO     WAMT
|    C*
| 01-C           EM133     IFEQ 'C'
|   C           EM133     OREQ ' '
|   C           KEYPS     CHAINPS0                  40
|   C  N40                ADD  PS10      WAMT
|   C*
|   C*¦P¤ë¤¤¥Í²£µù°OÅÜ°ÊªÌ¡]¨Ò¥Ñ¢Ï©Î¢Ð¡Ð¡ÖªÅ¥Õ¡^
|   C*
|   C           KEYTR1    SETGTTR0
|   C           KEYPY     READETR0                      40
|   C*
| 02-C           *IN40     IFEQ '0'
| 03-C           TR231     IFEQ 'A'
|   C           TR231     OREQ 'B'
| 04-C           TR232     IFEQ ' '
|   C           TR04      SUB  WTYMD     DAYS    20
|   C           WAMT      DIV  30        WAMT      H
|   C                     MULT DAYS      WAMT      H
| 04-C                     END
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C*ÁZ®Ä¼úª÷¡GPM308
| 05-C           WAMT      IFNE *ZERO
|   C                     ADD  1         I1
|   C                     MOVELPM308     A1,I1
|   C                     Z-ADDWAMT      A2,I1     H
| 05-C                     END
|    C*
23===C           END149    ENDSR
     C*==============================================================*
     C*          RTN150...ºÖ§Qª÷PM334   *YH USE ONLY
     C*==============================================================*
24===C           RTN150    BEGSR
|    C*
|    C*¥[¤JºÖ©e·|ªÌ¤~»ÝÃº¥æºÖ§Qª÷
|    C*ºÖ§Qª÷ª÷ÃB¡×PY03¥»­Ä¡¯0.005
|    C                     Z-ADD*ZERO     WAMT
|    C*
|    C*                    EXSR R0101
|    C           KEYPY     CHAINPY0                  42
| 01-C           *IN42     IFEQ '0'
| 02-C           EM100     IFEQ '1'
|   C                     Z-ADDPY03      DPY#3   70
| 02-C                     END
| 03-C           EM100     IFEQ '2'
|   C           PY03      MULT PM102     DPY#3   70
| 03-C                     END
| 01-C                     END
|    C           DPY#3     MULT 0.005     WAMT      H
|    C*
|    C*ºÖ§Qª÷¡GPM334
| 04-C           WAMT      IFNE *ZERO
|   C                     ADD  1         I1
|   C                     MOVELPM334     A1,I1
|   C                     Z-ADDWAMT      A2,I1     H
| 04-C                     END
|    C*
24===C           END150    ENDSR
     C*==============================================================*
     C*   RTN160... GET ¦©¶µ    -PM131:¶U´Ú
     C*==============================================================*
25===C           RTN160    BEGSR
|    C*
|    C*¶U´Ú
|    C           KEYPY     SETLLLN0
|    C           KEYPY     READELN0                      42
|    C*
|    C                     Z-ADD*ZERO     WPM313
|    C*
| 01-C           *IN42     DOWEQ'0'
|   C*
|   C                     Z-ADD*ZERO     WAMT
| 02-C           WFYM      IFEQ LN09                       .³Ì«á¤@´Á
|   C                     Z-ADDLN10      WAMT
| 02*C                     ELSE
| 03-C           WFYM      IFEQ LN06                       .²Ä¤@´Á
|   C                     Z-ADDLN07      WAMT
| 03*C                     ELSE
| 04-C           WFYM      IFGT LN06                       .¨C¤@´Á
|   C           WFYM      ANDLTLN09
|   C                     Z-ADDLN08      WAMT
| 04-C                     END
| 03-C                     END
| 02-C                     END
|   C*
| 05-C           WAMT      IFNE *ZERO
|   C                     ADD  WAMT      WPM313  70H
| 05-C                     END
|   C*
|   C           KEYPY     READELN0                      42
| 01-C                     END
|    C*
| 06-C           WPM313    IFNE *ZERO
|   C                     ADD  1         I1
|   C                     MOVELPM313     A1,I1
|   C                     Z-ADDWPM313    A2,I1
| 06-C                     END
|    C*
25===C                     ENDSR
     C*==============================================================*
     C*   RTN165... GET Á~¸ê©T©w¶µ¥Ø
     C*==============================================================*
26===C           RTN165    BEGSR
|    C*
|    C*©T©w¶µ¥Ø
|    C                     Z-ADD1         K1      20
| 01-C           K1        DOWLEIB
|   C*
| 02-C           B1,K1     IFNE *BLANK
|   C           B4,K1     ANDNE*ZERO
|   C                     MOVELB1,K1     #WD05
|   C                     Z-ADDB4,K1     #WD06
|   C                     EXSR RTN250
| 02-C                     END
|   C*
|   C                     ADD  1         K1
| 01-C                     END
|    C*
|    C*ÅÜ°Ê¶µ¥Ø
|    C           KEYOS     SETLLOS0
|    C           KEYOS     READEOS0                      42
|    C*
| 03-C           *IN42     DOWEQ'0'
|   C*
|   C                     MOVELOS05      #WD05
| 04-C           OS06      IFNE *ZERO
|   C                     Z-ADDOS06      #WD06
| 04*C                     ELSE
|   C           OS07      MULT OS08      #WD06     H
| 04-C                     END
|   C                     EXSR RTN250
|   C*
|   C           KEYOS     READEOS0                      42
| 03-C                     END
|    C*
|    C*¨t²Î³]©w
|    C                     Z-ADD1         K1      20
| 05-C           K1        DOWLEI1
|   C*
| 06-C           A1,K1     IFNE *BLANK
|   C           A2,K1     ANDNE*ZERO
|   C                     MOVELA1,K1     #WD05
|   C                     Z-ADDA2,K1     #WD06
|   C                     EXSR RTN250
| 06-C                     END
|   C*
|   C                     ADD  1         K1
| 05-C                     END
|    C*
26===C                     ENDSR
     C*==============================================================*
     C*   RTN170... GET ©T©wÁ~¸ê©Ò±oµ| & PYPWPF
     C*==============================================================*
27===C           RTN170    BEGSR
|    C*
|    C           KEYPW1    CHAINPW0                  46
| 01-C           *IN46     IFEQ '1'
|   C           PW17      SUB  PW28      WAMT
| 01-C                     END
|    C*
| 02-C           WAMT      IFLE *ZERO
|   C                     GOTO END170
| 02-C                     END
|    C*
| 03-C           EM101     IFEQ '1'
|   C                     Z-ADDWAMT      PI1     80
|   C                     MOVELEM34      PI2     1
|   C                     Z-ADDEM35      PI3     20
|   C                     CALL 'PYS306'                   .TAX
|   C                     PARM           PI1
|   C                     PARM           PI2
|   C                     PARM           PI3
|   C                     PARM           PO1     70
|   C                     PARM           PO2     53
| 03-C                     END
|    C*
|    C                     Z-ADDPO2       TAXR    53
|    C*
| 04-C           EM101     IFEQ '2'
|   C                     Z-ADD0.1       PO2
|   C           WAMT      MULT PO2       PO1       H
| 04-C                     END
|    C*
| 05-C           EM101     IFEQ '3'
|   C                     Z-ADD0.2       PO2
|   C           WAMT      MULT PO2       PO1       H
| 05-C                     END
|    C*
| 06-C           EM101     IFEQ '4'
|   C                     Z-ADD*ZERO     PO2
|   C                     Z-ADDEM102     PO1       H
| 06-C                     END
|    C*
| 07-C           PO1       IFNE *ZERO
|   C                     MOVELPM318     #WD05
|   C                     Z-ADDPO1       #WD06
|   C                     EXSR RTN250
| 07-C                     END
|    C*--------
|    C                     Z-ADDPO2       PW15
|    C*
27===C           END170    ENDSR
     C*==============================================================*
     C*   RTN175... ­pºâ¼úª÷©Ò±oµ| & PYPWPF
     C*==============================================================*
28===C           RTN175    BEGSR
|    C*
|    C           PW27      SUB  PW29      WAMT
| 01-C           WAMT      IFLE *ZERO
|   C                     GOTO END175
| 01-C                     END
|    C*
|    C*¼úª÷µ|=«D©T©wÁ~¸ê©Ò±oX¼úª÷µ|²v
|    C*¤£¨¬³Ì§Cµ|ÃB¤£¦©
|    C           WAMT      MULT TA07      #WD06     H
|    C*          #WD06     IFLT TA08
|    C*                    Z-ADD*ZERO     #WD06
|    C*                    END
|    C*
| 02-C           #WD06     IFNE *ZERO
|   C                     MOVELPM311     #WD05
|   C                     EXSR RTN250
| 02-C                     END
|    C*
28===C           END175    ENDSR
     C*==============================================================*
     C*   RTN176... ¯S¥ð¥Nª÷µ²ºâ & PY2HPF
     C*==============================================================*
29===C           RTN176    BEGSR
|    C*
|    C           KEY2H     CHAINH20                  43
| 01-C           *IN43     IFEQ '0'
|   C*
|   C*§éµoª÷ÃB¤£¥i¤p©ó¹s
| 02-C           H206      IFLE *ZERO
|   C                     Z-ADD*ZERO     H206
| 02-C                     END
|   C*
|   C*¦~°²µ¹¥I¡GPM324
| 03-C           H206      IFNE *ZERO
|   C                     ADD  1         I1
|   C                     MOVELPM324     A1,I1
|   C                     Z-ADDH206      A2,I1     H
| 03-C                     END
|   C*
| 01-C                     END
|    C*
29===C           END176    ENDSR
     C*==============================================================*
     C*   RTN180... GET ¦©¶µ    -PM332:¤u·|¶O
     C*==============================================================*
30===C           RTN180    BEGSR
|    C*
|    C                     MOVELPM332     PWD05
|    C           KEYPSS    CHAINSS0                  40
|    C*
| 01-C           *IN40     IFEQ '1'
|   C                     GOTO END180
| 01*C                     ELSE
|   C                     Z-ADDSS07      #WD06
| 01-C                     END
|    C*
| 02-C           #WD06     IFNE 0
|   C                     MOVELPM332     #WD05
|   C                     EXSR RTN250
| 02-C                     END
|    C*
30===C           END180    ENDSR
     C*==============================================================*
     C*   RTN181... ¿ð¨ì´î¶µÁ~¸ê²Ö­p
     C*==============================================================*
31===C           RTN181    BEGSR
|    C*
|    C                     CALL 'P39'
|    C                     PARM DPW03     P3901I  60
|    C                     PARM DFMT      P3902I  1
|    C                     PARM DTYPE     P3903I  1
|    C                     PARM '2'       P3904I  1
|    C                     PARM '1'       P3905I  1
|    C                     PARM           P3911O  60
|    C                     Z-ADDP3911O    CPW03   60       ­pÁ~¦~¤ë
|    C*
|    C                     Z-ADD*ZERO     DLA04   20
|    C                     Z-ADD*ZERO     DLA05   20
|    C                     Z-ADD*ZERO     DLA06   20
|    C*¿ð¨ì¦¸¼Æ²Ö¿n
|    C           KEYLA     SETLLLA0
|    C           KEYLA     READELA0                      44*NF/EOF
|    C*
| 01-C           *IN44     DOWEQ'0'
|   C                     Z-ADDLA03      KYMD
|   C*
| 02-C           KYM       IFEQ CPW03
|   C                     ADD  LA04      DLA04   20
|   C                     ADD  LA05      DLA05   20
|   C                     ADD  LA06      DLA06   20
| 02-C                     ENDIF
|   C           KEYLA     READELA0                      44*NF/EOF
| 01-C                     END
|    C*
|    C                     Z-ADD0         SALA    80       ¤éÁ~
|    C                     Z-ADD0         SALCAL  80       ¤p­p
|    C                     Z-ADD0         TOTAL   80       ¦X­p
|    C           KEYPY     CHAINPY0                  40
| 03-C           *IN40     IFEQ '0'
| 04-C           EM100     IFEQ '1'
|   C           PY03      DIV  PM102     SALA      H
| 04-C                     END
| 05-C           EM100     IFEQ '2'
|   C                     Z-ADDPY03      SALA
| 05-C                     END
| 06-C           EM100     IFEQ '3'
|   C           PY03      MULT PM101     SALA
| 06-C                     END
| 03-C                     END
|    C*
|    C*¤@¯ë¿ð¨ìOR¦­±ß¯Z¿ð¨ì1HR¡A´î1/8¤éÁ~
| 07-C           DLA04     IFNE 0
|   C           SALA      DIV  8         SALCAL    H
|   C                     ADD  SALCAL    TOTAL
| 07-C                     END
|    C*¤¤±ß¯Z¿ð¨ì2HR¥H¤W¡A´î2/8<Iz
| 08-C           DLA05     IFNE 0
|   C           SALA      DIV  8         SALCAL    H
|   C                     MULT 2         SALCAL    H
|   C                     ADD  SALCAL    TOTAL
| 08-C                     END
|    C*¤é¯Z¿ð¨ì¡A´î1/8¤éÁ~
| 09-C           DLA06     IFNE 0
|   C           SALA      DIV  8         SALCAL    H
|   C                     ADD  SALCAL    TOTAL
| 09-C                     END
|    C*¶}©l­pºâ
|    C*                    Z-ADD0         SALA    80       ¤éÁ~
|    C*                    Z-ADD0         SALB    80       ½ü¯Z
|    C*                    Z-ADD0         SALCAL  80       ¦X­p
|    C*          KEYPY     CHAINPY0                  40    *NF
|    C*
|    C*                    EXSR R0101
|    C*                    Z-ADDDPY#3     HEHE    80
|    C*
|    C*          *IN40     IFEQ '0'
|    C*                    MOVEL'21'      #WD05
|    C*          KEYSS     CHAINSS0                  40    *NF
|    C*
|    C*          *IN40     IFEQ '0'
|    C*´î1/8¤éÁ~&´î1/8½ü¯Z¬z¶K
|    C*          DLA04     IFNE 0
|    C*          DPY#3     DIV  8         SALA      H
|    C*          SALA      MULT DLA04     SALA      H
|    C*          WTVAL     DIV  8         SALB      H
|    C*          SALB      MULT DLA04     SALB      H
|    C*          SALA      ADD  SALB      SALCAL
|    C*                    ADD  SALCAL    TOTAL
|    C*                    Z-ADD0         SALA
|    C*                    END
|    C*´î2/8¤éÁ~&´î½ü¯Z¬z¶K
|    C*          DLA05     IFNE 0
|    C*          DPY#3     DIV  8         SALA      H
|    C*          SALA      MULT 2         SALA      H
|    C*          SALA      MULT DLA05     SALA      H
|    C*          SALA      ADD  WTVAL     SALCAL
|    C*                    ADD  SALCAL    TOTAL
|    C*                    Z-ADD0         SALA
|    C*                    Z-ADD0         SALB
|    C*                    END
|    C*´î1/8¤éÁ~
|    C*          DLA06     IFNE 0
|    C*          DPY#3     DIV  8         SALA      H
|    C*          SALA      MULT DLA06     SALA      H
|    C*                    ADD  SALA      TOTAL
|    C*                    Z-ADD0         SALA
|    C*                    END
|    C*
|    C*                    ADD  TOTAL     #PW18
|    C*                    END
|    C*                    END
|    C*
31===C                     ENDSR
     C*==============================================================*
     C*¥æ³q¬z¶K­pºâ
     C*==============================================================*
32===C           RTN182    BEGSR
|    C*
|    C                     EXSR RNOMD
|    C*
|    C                     MOVELPM323     PWD05
|    C                     Z-ADD0         #WD06
|    C                     Z-ADD0         DAYCAL  51
|    C*
|    C           KEYPSS    CHAINSS0                  40
|    C*
| 01-C           *IN40     IFEQ '1'
|   C                     GOTO END182
| 01-C                     END
|    C*
|    C           WDAY      SUB  CNTD      DAYCAL           .¦©µLÁ~°²
|    C                     ADD  DDAY      DAYCAL           .°²¤é¥[¯Z
|    C           DAYCAL    MULT SS07      #WD06     H
|    C*
| 02-C           #WD06     IFNE 0
|   C                     MOVELPM323     #WD05
|   C                     EXSR RTN250
| 02-C                     END
|    C*
32===C           END182    ENDSR
     C*==============================================================*
     C*¥ë­¹¬z¶K­pºâ
     C*==============================================================*
33===C           RTN183    BEGSR
|    C*
|    C                     EXSR RNOMD
|    C*
|    C                     MOVELPM314     PWD05
|    C                     Z-ADD0         #WD06
|    C                     Z-ADD0         DAYCAL
|    C*
|    C           KEYPSS    CHAINSS0                  40
|    C*
| 01-C           *IN40     IFEQ '1'
|   C                     GOTO END183
| 01-C                     END
|    C*
|    C           WDAY      SUB  CNTD      DAYCAL           .¦©µLÁ~°²
|    C           DAYCAL    MULT SS07      #WD06     H
|    C*
| 02-C           #WD06     IFNE 0
|   C                     MOVELPM314     #WD05
|   C                     EXSR RTN250
| 02-C                     END
|    C*
33===C           END183    ENDSR
     C*==============================================================*
     C*­pºâ¨C¤ëµLÁ~°²¦X­p¤Ñ¼Æ
     C*==============================================================*
34===C           RNOMD     BEGSR
|    C*
|    C                     Z-ADD*ZERO     CNTD    51
|    C                     Z-ADD*ZERO     WDAY
|    C                     Z-ADDWPW03     JOBYM
|    C                     Z-ADD1         CNT
|    C*
|    C           KEYWH     CHAINT20                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEAT205      D1               ±Æ¯Z°}¦C
|   C*
| 02-C           CNT       DOWLE31
|   C*­pºâ±Æ¯Z¤u§@¤Ñ¼Æ
| 03-C           D1,CNT    IFNE *BLANK
| 04-C           EM13YM    IFNE WPW03                      «D·s¶i­û¤u
|   C                     ADD  1         WDAY
| 04*C                     ELSE
| 05-C           CNT       IFGE EM13D
|   C                     ADD  1         WDAY
| 05-C                     END
| 04-C                     END
|   C*
| 03-C                     END
|   C                     ADD  1         CNT
| 02-C                     END
|   C*
|   C           KEYLV1    SETLLLVL2
|   C           KEYLV1    READELVL2                     44*NF/EOF
|   C*
| 06-C           *IN44     DOWEQ'0'
|   C                     Z-ADDLV96      LVYM
|   C                     Z-ADD0         WLV09   51
|   C                     Z-ADD0         THURS   51
|   C*
|   C           LV04      CHAINLC0                  40
| 08-C           *IN40     IFEQ '0'
|   C           LV09      MULT PM101     THURS     H
|   C                     ADD  LV08      THURS
|   C*
| 09-C           LC03      IFEQ '2'
| 10-C           LC09      IFNE *ZERO
|   C           THURS     MULT LC09      WLV09     H
|   C                     ADD  WLV09     CNTD
| 10-C                     END
| 09-C                     END
|   C*
| 08-C                     END
|   C*
|   C           KEYLV1    READELVL2                     44*NF/EOF
| 06-C                     ENDDO
|   C*
| 01-C                     END
|    C*
|    C                     DIV  PM101     CNTD      H
|    C*
34===C                     ENDSR
     C*==============================================================*
     C*   RTN201... GET ¬Y¤@®É¶¡ÂIÁ~¨î¡AÂ¾°È-#EM10, #EM05
     C*==============================================================*
35===C           RTN201    BEGSR
|    C*
|    C                     MOVELEM041     #EM041
|    C                     MOVELEM042     #EM042
|    C                     MOVELEM043     #EM043
|    C                     MOVELEM044     #EM044
|    C                     MOVELEM05      #EM05
|    C                     MOVELEM10      #EM10
|    C                     MOVELWTYMD     KTR04
|    C                     MOVEL*HIVAL    KTR03
     C*
     C*¤H¨Æ½Õ°Ê¸ê®ÆÀÉPYTRPF
|    C           KEYTR     SETGTTR0
|    C           KEYPY     READETR0                      40
|    C*
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELTR051     #EM041
|   C                     MOVELTR052     #EM042
|   C                     MOVELTR053     #EM043
|   C                     MOVELTR054     #EM044
|   C                     MOVELTR07      #EM05
|   C                     MOVELTR11      #EM10
| 01-C                     END
|    C*¥þ¶Ô¼úª÷¦³µL
| 02-C           EM100     IFNE '1'
|   C*
|   C           #EM05     CHAINJT0                  40
|   C   40                MOVEL'Y'       JT07
| 02-C                     END
|    C*¾n¥~¬z¶K¡A©Ð«Î¬z¶K¡A¥[¯Z­pºâ
|    C           KEYDP     CHAINDP0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     Z-ADD0         DP03
|   C                     Z-ADD0         DP05
|   C                     MOVEL'1'       DP07
| 03-C                     END
|    C*
35===C                     ENDSR
     C*==============================================================*
     C*   RTN210... °²§O¦©Á~½Ð°²®É¼Æ²Ö­p--- WPW14
     C*==============================================================*
36===C           RTN210    BEGSR
|    C*
|    C*¥u³B²z¥»¤ë¸ê®Æ
|    C*                    MOVELLV03      LV03YM  60
|    C*          LV03YM    IFNE WPW03
|    C*                    GOTO END210
|    C*                    END
|    C*
|    C                     ADD  LV08      WPW14
|    C           LV09      MULT PM101     WHOUR  149H
|    C                     ADD  WHOUR     WPW14     H
|    C*
|    C                     ADD  LV11      SLV11
|    C                     ADD  LV12      SLV12
|    C*
| 01-C           LV04      IFEQ PM104
|   C           LV04      OREQ PM110
|   C           LV04      OREQ PM127
|   C                     ADD  WPW14     W309
| 01-C                     END
|    C*
36===C           END210    ENDSR
     C*==============================================================*
     C*   RTN220... °²§O¦©Á~½Ð°²®É¼Æ§P§O--- WPW14
     C*             °²§O¥»¦~«×¤w¥ð®É¼Æ²Ö­p-- WPW14A
     C*==============================================================*
37===C           RTN220    BEGSR
|    C*
|    C           OLV04     CHAINLC0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL'1'       LC03
|   C                     Z-ADD999       LC04
|   C                     Z-ADD0         LC08
|   C                     Z-ADD0         LC09
|   C                     MOVEL'1'       LC10
|   C                     Z-ADD999       LC11
|   C                     GOTO END220
| 01-C                     END
|    C*
|    C*¦³Á~¥B¤£­­¤Ñ¼ÆªÌ¤£­pºâ
| 02-C           LC03      IFEQ '1'
|   C           LC04      ANDEQ999
|   C                     GOTO END220
| 02-C                     END
|    C*
|    C*µLÁ~
| 03-C           LC03      IFEQ '2'
|   C           LC09      ANDEQ0                          µL¶W¦©
|   C                     GOTO END220
| 03-C                     END
|    C*
|    C*¦³³¡¥÷­pÁ~¡Ð­pºâ¥»¦~«×¤w½Ð®É¼Æ(WPW14A)
|    C                     MOVELPYLVT     PYLVTD
|    C*
|    C                     Z-ADDLV03      WLV03
| 04-C           WLV03M    IFGT PM103
|   C           WLV03Y    ADD  1         #C02I1  40
| 04*C                     ELSE
|   C                     Z-ADDWLV03Y    #C02I1
| 04-C                     END
|    C*
|    C*                    EXSR #C0200                     ¦bÂ¾¤ë¼Æ
|    C                     MOVEL#C02T     WC02TD  80
|    C                     MOVE '31'      WC02TD
|    C*
|    C                     MOVELOLV04     KLV04
|    C                     Z-ADD*ZERO     WPW14A  62
|    C           KEYLV2    SETLLLVL2
|    C           KEYLV2    READELVL2                     40
| 05-C           *IN40     DOWEQ'0'
|   C*
| 06-C           LV96      IFNE *ZERO
|   C                     ADD  LV08      WPW14A
|   C           LV09      MULT PM101     WHOUR     H
|   C                     ADD  WHOUR     WPW14A    H
| 06-C                     END
|   C*
|   C           KEYLV2    READELVL2                     40
| 05-C                     END
|    C*
| 07-C           SWSH      IFEQ 'Y'
|   C                     ADD  C2,J      WPW14A                      0
| 07-C                     END
|    C*
|    C                     MOVELPYLVTD    PYLVT
|    C*
37===C           END220    ENDSR
     C*==============================================================*
     C*   RTN230... ¦©Á~½Ð°²®É¼Æ²Ö­p--- SPW14
     C*==============================================================*
38===C           RTN230    BEGSR
|    C*
| 01-C           LV04      IFEQ PM127
|   C                     MOVEL'Y'       WSTOP
| 01-C                     END
|    C*
|    C*·í¤ë¦³½ÐµL¥þ¶Ô°²ªÌ'Y'-> WSTOPµL¥þ¶Ô¼úª÷
| 02-C           LC07      IFEQ 'N'                        .µL¥þ¶Ô
|   C*          WPW14     ANDNE*ZERO
|   C                     MOVEL'Y'       WSTOP
| 02-C                     END
|    C*
|    C*µLÁ~
| 03-C           LC03      IFEQ '2'
| 04-C           LC09      IFEQ 0                          .µL¶W¦©
|   C                     ADD  WPW14     SPW14
|   C*
| 04*C                     ELSE                            .¦³¶W¦©
|   C*¤£»Ý¶W¦©ªº¤Ñ¼Æ­pºâ
|   C           LC08      MULT PM101     WHOUR     H      .­pÁ~®É¼Æ
|   C*                    MULT #C02M1    WHOUR     H      .·s¶i¤ñ²v
|   C                     DIV  12        WHOUR     H
|   C*
| 05-C           WHOUR     IFGT WPW14A
|   C                     SUB  WPW14A    WHOUR            .³Ñ¤U¤£¦©
| 05*C                     ELSE
|   C                     Z-ADD*ZERO     WHOUR
| 05-C                     END
|   C*
| 06-C           WPW14     IFLE WHOUR
|   C                     ADD  WPW14     SPW14
| 06*C                     ELSE
|   C                     ADD  WHOUR     SPW14
|   C           WPW14     SUB  WHOUR     WHOUR            .¶W¦©®É¼Æ
|   C           WHOUR     MULT LC09      WHOUR     H      .X¶W¤ñ
|   C                     ADD  WHOUR     SPW14
| 06-C                     END
|   C*
| 04-C                     END
| 03-C                     END
|    C*
|    C*¦³³¡¥÷­pÁ~
| 07-C           LC03      IFEQ '1'
|   C           LC04      ANDNE999
|   C*
|   C           LC04      MULT PM101     WHOUR     H      .­pÁ~®É¼Æ
|   C*                    MULT #C02M1    WHOUR     H      .·s¶i¤ñ²v
|   C                     DIV  12        WHOUR     H
|   C*
|   C           LC10      MULT PM101     WHOUR1    H      .­pÁ~®É¼Æ
|   C*                    MULT #C02M1    WHOUR1    H      .·s¶i¤ñ²v
|   C                     DIV  12        WHOUR1 149H
|   C*
|   C           1         SUB  LC05      WLC05            .¦©Á~¤ñ²v
|   C           1         SUB  LC11      WLC051           .¦©Á~¤ñ²v
|   C*
|   C           WPW14     ADD  WPW14A    WPW14B 149H
|   C*
| 08-C                     SELEC
|   C           WPW14A    WHLE WHOUR
| 09-C           WPW14B    IFLE WHOUR
|   C           WPW14     MULT WLC05     WAMT      H
|   C                     ADD  WAMT      SPW14            .¦©³¡¥÷Á~
| 09*C                     ELSE
| 10-C           WPW14B    IFLE WHOUR1
|   C           WHOUR     SUB  WPW14A    WAMT
|   C           WAMT      MULT WLC05     WAMT      H
|   C                     ADD  WAMT      SPW14            .¦©³¡¥÷Á~
|   C           WPW14B    SUB  WHOUR     WHOUR
|   C           WHOUR     MULT WLC051    WAMT      H
|   C                     ADD  WAMT      SPW14            .¦©¥þÁ~
| 10*C                     ELSE
|   C           WHOUR     SUB  WPW14A    WAMT
|   C           WAMT      MULT WLC05     WAMT      H
|   C                     ADD  WAMT      SPW14            .¦©³¡¥÷Á~
|   C           WHOUR1    SUB  WHOUR     WAMT
|   C           WAMT      MULT WLC051    WAMT      H
|   C                     ADD  WAMT      SPW14            .¦©³¡¥÷Á~
|   C           WPW14B    SUB  WHOUR1    WHOUR1
|   C                     ADD  WHOUR1    SPW14            .¦©¥þÁ~
| 10-C                     END
| 09-C                     END
|   C*
|   C           WPW14A    WHGT WHOUR
|   C           WPW14A    ANDLEWHOUR1
| 11-C           WPW14B    IFLE WHOUR1
|   C           WPW14     MULT WLC051    WAMT      H
|   C                     ADD  WAMT      SPW14            .¦©³¡¥÷Á~
| 11*C                     ELSE
|   C           WHOUR1    SUB  WPW14A    WAMT
|   C           WAMT      MULT WLC051    WAMT      H
|   C                     ADD  WAMT      SPW14            .¦©³¡¥÷Á~
|   C           WPW14B    SUB  WHOUR1    WHOUR1
|   C                     ADD  WHOUR1    SPW14            .¦©¥þÁ~
| 11-C                     END
|   C*
|   C                     OTHER
|   C                     ADD  WPW14     SPW14
| 08-C                     END
| 07-C                     END
|    C* TEMP FIELD CLEAR
|    C                     Z-ADD*ZERO     WPW14
|    C*
38===C           END230    ENDSR
     C*==============================================================*
     C*   RTN240... ¤u§@¤é¼Æ­pºâPW07
     C*==============================================================*
39===C           RTN240    BEGSR
|    C*
|    C                     Z-ADDWFYMD     #YMDF            .­pÁ~°_¤é
|    C                     Z-ADDWTYMD     #YMDT            .­pÁ~¤î¤é
|    C*
|    C*¥»¤ë¤u§@¤é¼Æ(30 DAYS)
|    C                     Z-ADDPM102     PW07
|    C*
|    C*¥»¤ë·s¶i¤H­ûÆæ¤u§@¤Ñ¼Æ¡Ð¨ìÂ¾¤é¦Ü¤ë©³¤éÆæ
|    C                     CALL 'P34'
|    C                     PARM WPW03     P3401I  60
|    C                     PARM '2'       P3403I  1
|    C                     PARM '1'       P3404I  1
|    C                     PARM           P3411O  1
|    C                     PARM           P3412O  20
|    C                     Z-ADDP3412O    WTD
|    C*
| 01-C           EM13      IFGE #YMDF
|   C           EM13      ANDLE#YMDT
|   C*
|   C                     CALL 'P32'
|   C                     PARM EM13      P3201I  80
|   C                     PARM WTYMD     P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C           P3211O    ADD  1         PW07
|   C                     Z-ADDEM13      #YMDF
| 01-C                     END
|    C*
|    C*Â÷Â¾¤H­ûÆæ¤u§@¤é¼Æ­pºâ¡Ð­pÁ~°_¤é¦ÜÂ÷Â¾¤é¶¡¤Ñ¼ÆÆæ
| 02-C           EM19      IFNE *ZERO
|   C           EM19YM    ANDLEWFYM
|   C*                    MOVEL'Y'       WSTOP            .µL¥þ¶Ô
|   C*Â÷Â¾¤é¡Õ­pÁ~°_¤é¡A¤u§@¤é¼Æ¡×¢¯
| 03-C           EM19      IFLT #YMDF
|   C                     Z-ADD*ZERO     PW07
|   C                     Z-ADDEM19      #YMDT
|   C                     GOTO END240
| 03*C                     ELSE
|   C                     CALL 'P32'
|   C                     PARM #YMDF     P3201I  80
|   C                     PARM EM19      P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C                     ADD  1         P3211O
|   C                     Z-ADDP3211O    PW07
|   C                     Z-ADDEM19      #YMDT
| 03-C                     END
| 02-C                     END
|    C*
|    C*¥»´Á¶¡¯dÂ¾¤H­ûÆæ¤u§@¤é¼Æ­pºâ¡Ð­pÁ~°_¤é¦Ü¯dÂ¾¤é¶¡¤Ñ¼ÆÆæ
| 04-C           EM11      IFEQ 'R'
|   C           EM17YM    ANDLEWFYM
|   C*                    MOVEL'Y'       WSTOP            .µL¥þ¶Ô
|   C*¯dÂ¾¤é¡Õ­pÁ~°_¤é¡A¤u§@¤é¼Æ¡×¢¯
| 05-C           EM17      IFLT #YMDF
|   C                     Z-ADD*ZERO     PW07
|   C                     Z-ADDEM17      #YMDT
|   C                     GOTO END240
| 05*C                     ELSE
|   C                     CALL 'P32'
|   C                     PARM #YMDF     P3201I  80
|   C                     PARM EM17      P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C                     ADD  1         P3211O
|   C                     Z-ADDP3211O    PW07
|   C                     Z-ADDEM17      #YMDT
| 05-C                     END
| 04-C                     END
|    C*
|    C*¥»´Á¶¡ªø¯f¤H­ûÆæ¤u§@¤é¼Æ­pºâ¡Ð­pÁ~°_¤é¦Ü¯dÂ¾¤é¶¡¤Ñ¼ÆÆæ
| 06-C           EM11      IFEQ 'S'
|   C           EM951M    ANDLEWFYM
|   C*                    MOVEL'Y'       WSTOP            .µL¥þ¶Ô
|   C*¯dÂ¾¤é¡Õ­pÁ~°_¤é¡A¤u§@¤é¼Æ¡×¢¯
| 07-C           EM951     IFLT #YMDF
|   C                     Z-ADD*ZERO     PW07
|   C                     Z-ADDEM951     #YMDT
|   C                     GOTO END240
| 07*C                     ELSE
|   C                     CALL 'P32'
|   C                     PARM #YMDF     P3201I  80
|   C                     PARM EM951     P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C                     ADD  1         P3211O
|   C                     Z-ADDP3211O    PW07
|   C                     Z-ADDEM951     #YMDT
| 07-C                     END
| 06-C                     END
|    C*
|    C*¥»´Á¶¡¯dÂ¾°±Á~¤é¼Æ¦©°£
| 08-C           EM11      IFNE 'R'
|   C           EM18      ANDGE#YMDF
|   C           EM17      ANDLE#YMDT
|   C*
| 09-C           EM17      IFGE #YMDF
|   C                     Z-ADDEM17      P3201I
| 09*C                     ELSE
|   C                     Z-ADD#YMDF     P3201I
| 09-C                     END
| 10-C           EM18      IFLE #YMDT
|   C                     Z-ADDEM18      P3202I
| 10*C                     ELSE
|   C                     Z-ADD#YMDT     P3202I
| 10-C                     END
|   C*
|   C                     CALL 'P32'
|   C                     PARM           P3201I  80
|   C                     PARM           P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C*
|   C                     SUB  P3211O    PW07
| 08-C                     END
|    C*
|    C*¥»´Á¶¡ªø¯f°±Á~¤é¼Æ¦©°£
| 11-C           EM11      IFNE 'S'
|   C           EM952     ANDGE#YMDF
|   C           EM951     ANDLE#YMDT
|   C*                    MOVEL'Y'       WSTOP            .µL¥þ¶Ô
|   C*
| 12-C           EM951     IFGE #YMDF
|   C                     Z-ADDEM951     P3201I
| 12*C                     ELSE
|   C                     Z-ADD#YMDF     P3201I
| 12-C                     END
| 13-C           EM952     IFLE #YMDT
|   C                     Z-ADDEM952     P3202I
| 13*C                     ELSE
|   C                     Z-ADD#YMDT     P3202I
| 13-C                     END
|   C                     CALL 'P32'
|   C                     PARM           P3201I  80
|   C                     PARM           P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C*
|   C                     SUB  P3211O    PW07
| 11-C                     END
39===C           END240    ENDSR
     C*==============================================================*
     C*          RTN250... Á~¸ê¶µ¥Ø¡Ð¤@
     C*==============================================================*
40===C           RTN250    BEGSR
|    C*
| 01-C           #WD06     IFEQ *ZERO
|   C                     GOTO END250
| 01-C                     END
|    C*
|    C           TAG1      TAG
|    C*
|    C           KEYSS     CHAINSS0                  40
| 02-C           *IN40     IFEQ '0'
|   C*
| 03-C           SS17      IFEQ 'A'                        .¤W´Á­É¤ä
|   C                     ADD  #WD06     PW30             .¤W´Á­É¤ä
| 03-C                     END
|   C*
| 04-C           SS04      IFEQ 'B'                        .´î¶µ
|   C*
| 05-C           SS03      IFEQ 'N'                        .§Kµ|
|   C                     ADD  #WD06     PW18
| 05*C                     ELSE                            .À³µ|
| 06-C           SS11      IFEQ '1'                        .©T©w
|   C                     ADD  #WD06     PW28
| 06*C                     ELSE                            .«D©T©w
|   C                     ADD  #WD06     PW29
| 06-C                     END
| 05-C                     END
|   C*
| 04*C                     ELSE                            .¥[¶µ
|   C*
| 07-C           SS03      IFEQ 'N'                        .§Kµ|
|   C                     ADD  #WD06     PW16
| 07*C                     ELSE                            .À³µ|
| 08-C           SS11      IFEQ '1'                        .©T©w
|   C                     ADD  #WD06     PW17
| 08*C                     ELSE                            .«D©T©w
|   C                     ADD  #WD06     PW27
| 08-C                     END
| 07-C                     END
|   C*
| 04-C                     END
| 02-C                     END
|    C*
| 09-C           #WD05     IFEQ '57'
|   C                     GOTO END250
| 09-C                     END
|    C*
|    C                     MOVELPW01      KWD01   2
|    C                     MOVELPW02      KWD02   8
|    C                     Z-ADDWPW03     KWD03   60
|    C                     MOVELPW04      KWD04   1
|    C                     MOVEL#WD05     KWD05   2
|    C           KEYWD     CHAINWD0                  40
|    C*
| 10-C           *IN40     IFEQ '0'
|   C*                    ADD  #WD06     WD06
|   C                     Z-ADD#WD06     WD06
|   C                     UPDATWD0
| 10*C                     ELSE
|   C                     MOVELPW01      WD01
|   C                     MOVELPW02      WD02
|   C                     Z-ADDWPW03     WD03
|   C                     MOVELPW04      WD04
|   C                     MOVEL#WD05     WD05
|   C                     Z-ADD#WD06     WD06
|   C                     WRITEWD0
| 10-C                     END
|    C*
| 11-C           #WD05     IFEQ PM303
|   C           #TAXYN    ANDEQ'1'
|   C                     MOVEL'57'      KWD05   2
|   C                     MOVEL'57'      #WD05
|   C           KEYWD     CHAINWD0                  40
|   C*
|   C           #WD06     MULT 0.06      #WD06     H
| 12-C           *IN40     IFEQ '0'
|   C                     Z-ADD#WD06     WD06
|   C*                    ADD  #WD06     WD06
|   C                     UPDATWD0
| 12*C                     ELSE
|   C                     MOVELPW01      WD01
|   C                     MOVELPW02      WD02
|   C                     Z-ADDWPW03     WD03
|   C                     MOVELPW04      WD04
|   C                     MOVELKWD05     WD05
|   C                     Z-ADD#WD06     WD06
|   C                     WRITEWD0
| 12-C                     END
|   C*
|   C                     GOTO TAG1
|   C*
| 11-C                     END
|    C*
|    C                     Z-ADD*ZERO     #WD06
|    C*
40===C           END250    ENDSR
     C*==============================================================*
     C*          RTN251.. Á~¸ê¶µ¥Ø¡Ð¤G
     C*==============================================================*
41===C           RTN251    BEGSR
|    C*
| 01-C           WD06      IFEQ *ZERO
|   C                     GOTO END251
| 01-C                     END
|    C*
|    C           KEYWSS    CHAINSS0                  42
| 02-C           *IN42     IFEQ '0'
|   C*
| 03-C           SS04      IFEQ 'B'                        .´î¶µ
|   C*
| 04-C           SS03      IFEQ 'N'                        .§Kµ|
|   C                     ADD  WD06      PW18
| 04*C                     ELSE                            .À³µ|
| 05-C           SS11      IFEQ '1'                        .©T©w
|   C                     ADD  WD06      PW28
| 05*C                     ELSE                            .«D©T©w
|   C                     ADD  WD06      PW29
| 05-C                     END
| 04-C                     END
|   C*
| 03*C                     ELSE                            .¥[¶µ
|   C*
| 06-C           SS03      IFEQ 'N'                        .§Kµ|
|   C                     ADD  WD06      PW16
| 06*C                     ELSE                            .À³µ|
| 07-C           SS11      IFEQ '1'                        .©T©w
|   C                     ADD  WD06      PW17
| 07*C                     ELSE                            .«D©T©w
|   C                     ADD  WD06      PW27
| 07-C                     END
| 06-C                     END
|   C*
| 03-C                     END
| 02-C                     END
|    C*
41===C           END251    ENDSR
     C*==============================================================*
     C*          RTN260... Á~¸ê©T©w¶µ¥Ø¡Ð¥»¤ë©³Á~¸ê
     C*==============================================================*
42===C           RTN260    BEGSR
|    C*
|    C                     MOVEL*BLANK    B1
|    C                     MOVEL*ZERO     B2
|    C                     MOVEL*ZERO     B3
|    C                     MOVEL*ZERO     B4
|    C                     Z-ADD*ZERO     IB      20       .©T©w¼Æ
|    C                     Z-ADD*ZERO     K1      20
|    C                     Z-ADD*ZERO     K2      20
|    C*********20070309
| 01-C           SWSH      IFEQ 'N'                        .¥¼½ÕÁ~
|   C*Á~¸ê¥DÀÉ¡Ð¢Ò¢Ó¢â¢Ï¢×¢Ú PYPDPF
|   C           KEYPY     SETLLPD0
|   C           KEYPY     READEPD0                      42
| 02-C           *IN42     DOWEQ'0'
|   C*Á~¸ê¶µ¥ØÂkÄÝÀÉ
|   C           KEYS1     CHAINS10                  43
| 03-C           *IN43     IFEQ '0'
|   C                     Z-ADD1         K1      20
|   C           S103      LOKUPB1,K1                    44
| 04-C           *IN44     IFEQ '0'
|   C                     ADD  1         IB
|   C                     MOVELS103      B1,IB
|   C                     Z-ADDPD04      B3,IB
| 04*C                     ELSE
|   C                     ADD  PD04      B3,K1
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C*920311**********
|   C                     Z-ADD1         K2      20
|   C           PD03      LOKUPB1,K2                    44
| 05-C           *IN44     IFEQ '0'
|   C                     ADD  1         IB
|   C                     MOVELPD03      B1,IB
|   C                     Z-ADDPD04      B3,IB
| 05*C                     ELSE
|   C**********           MOVELB1,K2     B1,IB
|   C                     ADD  PD04      B3,K2
| 05-C                     END
|   C*920311**********
| 03-C                     END
|   C           KEYPY     READEPD0                      42
| 02-C                     END
|   C*
| 01*C                     ELSE                            .¦³½ÕÁ~
|   C           KEYSD     SETLLSD0
|   C           KEYSD     READESD0                      42
| 06-C           *IN42     DOWEQ'0'
|   C*
| 07-C           SD05      IFNE *ZERO
|   C                     ADD  1         IB
|   C                     MOVELSD04      B1,IB
|   C                     Z-ADDSD05      B3,IB
| 07-C                     END
|   C*
|   C           KEYSD     READESD0                      42
| 06-C                     END
|   C*
| 01-C                     END
|    C*
42===C                     ENDSR
     C*==============================================================*
     C*   RTN270... Á~¸ê©T©w¶µ¥Ø¡Ð½ÕÁ~«eÁ~¸ê
     C*==============================================================*
43===C           RTN270    BEGSR
|    C*
|    C           KEYSD     SETLLSD0
|    C           KEYSD     READESD0                      42
|    C*
| 01-C           *IN42     DOWEQ'0'
|   C*
| 02-C           SD05      IFNE *ZERO
|   C                     Z-ADD1         I2      20
|   C           SD04      LOKUPB1,I2                    40
|   C*
| 03-C           *IN40     IFEQ '0'
|   C                     ADD  1         IB
|   C                     MOVELSD04      B1,IB
|   C                     Z-ADDSD05      B2,IB
| 03*C                     ELSE
|   C                     Z-ADDSD05      B2,I2
| 03-C                     END
|   C*
| 02-C                     END
|   C           KEYSD     READESD0                      42
| 01-C                     END
|    C*
43===C                     ENDSR
     C*==============================================================*
     C*   RTN280... Á~¸ê©T©w¶µ¥Ø¡Ð¥»¤ëÀ³µ¹¥I
     C*==============================================================*
44===C           RTN280    BEGSR
|    C*
|    C                     Z-ADD1         I2
| 01-C           I2        DOWLEIB
|   C*
| 02-C           SH03M     IFEQ *ZERO                      .¥¼½ÕÁ~
|   C                     Z-ADDB3,I2     B2,I2
| 02-C                     END
|   C*
|   C                     Z-ADD*ZERO     NDAY    20       ¥¿±`¤u§@¤Ñ¼Æ
| 03-C           EM100     IFEQ '1'                        *¤ëÁ~
|   C                     Z-ADDPM102     NDAY
| 03*C                     ELSE
|   C                     Z-ADDWDAY      NDAY
| 03-C                     END
|   C*
| 04-C*          PW07      IFEQ NDAY
|   C*                    Z-ADDB2,I2     B4,I2
| 04*C*                    ELSE
     C*+EASON
     C           NDAY      IFNE 0
|   C           B2,I2     DIV  NDAY      WAMT      H
|   C           WAMT      MULT PW07      B4,I2     H
     C                     END
     C*+EASON
| 04-C*                    END
|   C*
|   C*¥»¤ë½ÕÁ~ª÷ÃB°l¥[
| 05-C           SH03M     IFNE *ZERO                      .¯}¤ë½ÕÁ~
|   C           SH03M     ANDLE#YMDT                      .­pÁ~¤î¤é
|   C           B3,I2     SUB  B2,I2     WAMT
|   C           WAMT      DIV  PM102     WAMT      H
|   C                     MULT P3211O    WAMT      H
|   C                     ADD  WAMT      B4,I2     H
| 05-C                     END
|   C*
|   C*À³¤u§@¤Ñ¼Æ#PM102,µoÁ~¤ñ¨Ò#SALR
|   C*          #EM10     IFEQ '1'                        ¥bÁ~
|   C*                    Z-ADD15        #PM102  20
|   C*                    Z-ADD0.5       #SALR   21
|   C*                    END
|   C*          #EM10     IFEQ '2'                        ¥þÁ~
|   C*                    Z-ADDPM102     #PM102
|   C*                    Z-ADD1         #SALR
|   C*                    END
|   C*          #EM10     IFEQ '3'                        µLÁ~
|   C*                    Z-ADDPM102     #PM102
|   C*                    Z-ADD*ZERO     #SALR
|   C*                    END
|   C*
|   C*¹ê»â©T©wÁ~¶µ
| 06-C           B1,I2     IFEQ '12'
|   C           B4,I2     MULT 0.5       B4,I2     H
| 06*C                     ELSE
|   C           B4,I2     MULT 1         B4,I2     H
| 06-C                     END
|   C*
|   C                     ADD  1         I2
| 01-C                     END
|    C*
44===C                     ENDSR
     C*==============================================================*
     C*          R0101 ....EM100 CHECK
     C*==============================================================*
45===C           R0101     BEGSR
|    C*­pºâ¨C¤ëµLÁ~°²¦X­p¤Ñ¼Æ
|    C                     EXSR RNOMD
|    C* PY03 = ©³Á~
|    C                     Z-ADDPY03      DPY#3   70       ¤ëÁ~
| 01-C           EM100     IFEQ '2'                        ¤éÁ~
|   C           PY03      MULT WDAY      DPY#3     H
| 01-C                     END
|    C*
45===C                     ENDSR
     C*==============================================================*
     I*/COPY PYRPGSRC,PYC02
     I*/COPY PYRPGSRC,PYC03
