     H****************************************************************
     H*   ªx¤Ó¸ê°T¬ì§Þ¶}µoªÑ¥÷¦³­­¤½¥q¡Ðª©Åv©Ò¦³    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA3061                                    *
     H*    PROGRAM NAME :Á~¸ê¸Õºâ§@·~                              *
     H*    AUTHOR       : A1413 CLOUD                                *
     H*    CREATE DATE  : 96/03/15                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :¤H¨ÆÁ~¸ê¨t²Î                              *
     H****************************************************************
     H            Y
     FPYEMPF  IP  E           K        DISK
     FPYPWPF  UF  E           K        DISK                      A
     FPYWDPF  UF  E           K        DISK                      A
     FPYDWPF  UF  E           K        DISK                      A
     FPYPYPF  IF  E           K        DISK
     FPYPDPF  IF  E           K        DISK
     FPYOSPF  IF  E           K        DISK
     FPYSSPF  IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FPYTAPF  IF  E           K        DISK
     FPYTIPF  UF  E           K        DISK
     F*PYE1PF  IF  E           K        DISK
     F*PYE2PF  IF  E           K        DISK
     FPYE4PF  IF  E           K        DISK
     F*PYE5LF01UF  E           K        DISK                      A
     FPYL1LF01IF  E           K        DISK
     FPYL2PF  IF  E           K        DISK
     F*PYL3PF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     F*PYTXPF  IF  E           K        DISK
     F*PT#YPF  IF  E           K        DISK
     FPYHDPF  IF  E           K        DISK
     E*---------------------------------------------------------------
     E                    A1         99  2               .Á~¸ê¶µ¥Ø
     E                    A2         99  7 0             .¶µ¥Øª÷ÃB
     E* DESCENDING
     E                    E2         10  5 0D            °·«O²²ÄÝ
     E*---------------------------------------------------------------
     I/COPY QDDSSRC,PYPMDS01
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I                                      201 2080$A8YMD
     I*
     I                                      501 502 DPW01
     I                                      503 5060DPW03
     I                                      508 508 DPW04
     I                                      511 5160WPW03
     I                                      511 5140WPW03Y
     I                                      515 5160WPW03M
     I                                      601 601 DOPT
     I*
     I*PYDA01      DS                            256
     I*                                       50  50 PYD01B
     I*                                       52  52 PYD01C
     I*
     I            DS
     I                                        1   80WFYMD
     I                                        1   60WFYM
     I                                        1   40WFY
     I                                        5   60WFM
     I                                        7   80WFD
     I*
     I            DS
     I                                        1   80WTYMD
     I                                        1   60WTYM
     I                                        1   40WTY
     I                                        5   60WTM
     I                                        7   80WTD
     I*
     I            DS
     I                                        1   80EM13
     I                                        1   60EM13YM
     I                                        7   80EM13D
     I*
     I            DS
     I                                        1   80EM19
     I                                        1   60EM19YM
     I                                        5   60EM19M
     I                                        7   80EM19D
     I*
     I            DS
     I                                        1   80EM17
     I                                        1   60EM17YM
     I                                        7   80EM17D
     I*
     I            DS
     I                                        1   80EM951
     I                                        1   60EM951M
     I*
     I            DS
     I                                        1   3 K#Y03
     I                                        1   10K#Y031
     I                                        3   30K#Y032
     I*
     I*           DS
     I*                                       1   80TX04
     I*                                       1   60TX04M
     I*
     I            DS
     I                                        1  30 INSR
     I                                        1   10INSR1
     I                                        3   30INSR2
     I                                        5   80INSR3
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN WD05      #WD05
     C           *LIKE     DEFN WD06      #WD06
     C           *LIKE     DEFN PW18      #PW18
     C*
     C           *LIKE     DEFN CM14      DFMT
     C           *LIKE     DEFN CM15      DTYPE
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYPM     KLIST
     C                     KFLD           PM01
     C                     KFLD           DPW01
     C           KEYPY     KLIST
     C                     KFLD           EM01             ¤½¥q§O
     C                     KFLD           EM02             ­û¤u¥N¸¹
     C*PY#YPF
     C*          KEY#Y     KLIST                           *DETIL FILE
     C*                    KFLD           #Y01
     C*                    KFLD           #Y02
     C*PYPWPF
     C           KEYPW     KLIST
     C                     KFLD           EM01             ¤½¥q
     C                     KFLD           WPW03            ¦~¤ë
     C                     KFLD           DPW04            ´Á§O
     C                     KFLD           EM02             ¤u¸¹
     C*PYPDPF
     C           KEYPD     KLIST
     C                     KFLD           EM01             ¤½¥q§O
     C                     KFLD           EM02             ­û¤u¥N¸¹
     C*PYWDPF
     C           KEYWD     KLIST
     C                     KFLD           WD01             ¤½¥q½s¸¹
     C                     KFLD           WD03             ¦~¤ë
     C                     KFLD           WD04             ´Á§O
     C                     KFLD           WD02             ­û¤u½s¸¹
     C                     KFLD           WD05             Á~¸ê¶µ¥Ø
     C*PYHDPF
     C           KEYHD     KLIST
     C                     KFLD           WD01             ¤½¥q½s¸¹
     C                     KFLD           WD02             ­û¤u½s¸¹
     C                     KFLD           WD03             ¦~¤ë
     C                     KFLD           HD04             ´Á§O
     C                     KFLD           HD05             Á~¸ê¶µ¥Ø
     C*
     C           KEYHD1    KLIST
     C                     KFLD           WD01             ¤½¥q½s¸¹
     C                     KFLD           WD02             ­û¤u½s¸¹
     C                     KFLD           WD03             ¦~¤ë
     C                     KFLD           WHD04   1        ´Á§O
     C                     KFLD           WHD05   2        Á~¸ê¶µ¥Ø
     C*+EASON
     C           KEYHD2    KLIST
     C                     KFLD           WD01             ¤½¥q½s¸¹
     C                     KFLD           WD02             ­û¤u½s¸¹
     C                     KFLD           WD03             ¦~¤ë
     C*
     C           KEYWD1    KLIST
     C                     KFLD           WD01             ¤½¥q½s¸¹
     C                     KFLD           WD03             ¦~¤ë
     C                     KFLD           WD04             ´Á§O
     C                     KFLD           WD02             ­û¤u½s¸¹
     C*
     C           KEYOS     KLIST
     C                     KFLD           EM01             ¤½¥q½s¸¹
     C                     KFLD           EM02             ­û¤u½s¸¹
     C                     KFLD           WPW03            ¦~¤ë
     C                     KFLD           DPW04            ´Á§O
     C*
     C           KEYE1     KLIST
     C                     KFLD           EM01             ¤½¥q½s¸¹
     C                     KFLD           EM02             ­û¤u½s¸¹
     C                     KFLD           WTYMD            ¥Í®Ä¤é
     C*
     C*          KEYE2     KLIST
     C*                    KFLD           E101             ¤½¥q½s¸¹
     C*                    KFLD           E102             ­û¤u½s¸¹
     C*                    KFLD           E103
     C*PYSSPF
     C           KEYSS     KLIST
     C                     KFLD           SS18             ¤½¥q½s¸¹
     C                     KFLD           SS01             Á~¸ê¶µ¥Ø
     C*PYDWPF
     C           KEYDW     KLIST
     C                     KFLD           EM01             ¤½¥q½s¸¹
     C                     KFLD           WPW03            Á~¸ê¦~¤ë
     C                     KFLD           EM02             ­û¤u½s¸¹
     C*
     C*          KEYL4     KLIST
     C*                    KFLD           L401             ¤½¥q½s¸¹
     C*                    KFLD           L402             ­û¤u½s¸¹
     C*          KEYE5     KLIST
     C*                    KFLD           EM01             ¤½¥q½s¸¹
     C*                    KFLD           EM02             ­û¤u½s¸¹
     C*                    KFLD           WPW03            Á~¸ê¦~¤ë
     C*          KEYE5A    KLIST
     C*                    KFLD           EM01             ¤½¥q½s¸¹
     C*                    KFLD           EM02             ­û¤u½s¸¹
     C*                    KFLD           WPW03            Á~¸ê¦~¤ë
     C*                    KFLD           E204             §Ç¸¹
     C*
     C*          KEYTX     KLIST
     C*                    KFLD           EM01             ¤½¥q
     C*                    KFLD           EM02             ­û¤u
     C*                    KFLD           TX031            ²§°Ê¤jÃþ
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010                     .INIT
     C*TEST<<<<<
     C*          EM02      IFEQ '996038'
     C*          EM02      OREQ '996039'
     C*                    ELSE
     C*                    GOTO NEXT2
     C*                    ENDIF
     C*TEST>>>>>
     C                     EXSR RTN020                     .DATA SEL.
     C*
  01-C           SWEM      IFEQ 'Y'
    C                     EXSR RTN025                     .CLEAR PW
    C*GET¤u§@¤é¼Æ¤Î­pÁ~¤ñ²v-- PW07,JRATE
    C                     EXSR RTN030                     .EM DATA
    C*
    C           KEYPY     CHAINPY0                  40
  02-C           *IN40     IFEQ '0'
    C           PW07      ORGT 0                          ¤u§@¤Ñ¼Æ
    C                     EXSR RTN040                     .MAIN
  02-C                     END
    C*TEST
    C*          NEXT2     TAG
    C*
  01-C                     END
     C*==============================================================*
     C*          RTN010... INITIAL PROCESS
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     SETON                     10
|    C*
|    C*GET PAYROLL PARAMETER
|    C                     MOVEL'01'      PM01
|    C           KEYPM     CHAINPM0                  40
|    C   40                MOVE *ZERO     PM03
|    C*
|    C*GET PAYROLL PARAMETER
|    C           DPW01     CHAINCM0                  40
|    C                     MOVE CM14      DFMT
|    C                     MOVE CM15      DTYPE
|    C*
|    C*GET THIS MONTH FIRST DATE (WFYMD)  YYYYMM01
|    C                     Z-ADD01        WFYMD
|    C                     Z-ADDWPW03     WFYM
|    C*
|    C*GET THIS MONTH LAST DATE (WTYMD)
|    C                     Z-ADD0         WTYMD   80
|    C                     Z-ADDWFYM      WTYM
|    C                     CALL 'P34'
|    C                     PARM WFYM      P3401I  60
|    C                     PARM '2'       P3403I  1
|    C                     PARM '1'       P3404I  1
|    C                     PARM           P3411O  1
|    C                     PARM           P3412O  20
|    C                     MOVE P3412O    WTYMD
|    C*TAX
|    C           '0'       CHAINTA0                  40
|    C*°·«O°Ñ¼Æ
|    C                     READ E40                      40
|    C*³Ò«O°Ñ¼Æ
|    C                     READ L20                      40
|    C*
|    C           DPW01     CHAINCM0                  40
|    C  N40                MOVELCM13      SS18
|    C   40                MOVELDPW01     SS18             ¤½¥q§O
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN020... DATA SELECT (SWEM)
     C*==============================================================*
02===C           RTN020    BEGSR
|    C*
|    C                     Z-ADD0         I1
|    C*
|    C                     MOVEL'Y'       SWEM    1 P
|    C*Â÷Â¾¤p©ó­pÁ~°_©l¤é¥N'N'
| 01-C           EM19      IFNE *ZERO
|   C           EM19      ANDLTWFYMD
|   C                     MOVEL'N'       SWEM
| 01-C                     END
|    C*¯dÂ¾¤p©ó­pÁ~°_©l¤é¥N'N'
| 02-C           EM11      IFEQ 'R'
|   C           EM17      ANDLTWFYMD
|   C                     MOVEL'N'       SWEM
| 02-C                     END
|    C*ªø¯f
|    C*          EM11      IFEQ 'S'
|    C*          EM951     ANDLTWFYMD
|    C*                    MOVEL'N'       SWEM
|    C*                    END
|    C*¨ìÂ¾¤j©ó­pÁ~²×¤î¤é¥N'N'
| 03-C           EM13      IFGT WTYMD
|   C                     MOVEL'N'       SWEM
| 03-C                     END
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN025... CLEAR PW FIELD
     C*==============================================================*
03===C           RTN025    BEGSR
|    C*
|    C                     Z-ADD0         I1      20       .INDEX-PAY
|    C                     MOVEL*BLANK    A1
|    C                     MOVEL*ZERO     A2
|    C                     Z-ADD0         WAMT    70
|    C*
|    C                     MOVELEM01      PW01
|    C                     MOVELEM02      PW02
|    C                     Z-ADDWPW03     PW03
|    C                     MOVELDPW04     PW04
|    C                     Z-ADD*ZERO     PW05
|    C                     Z-ADD*ZERO     PW07
|    C                     Z-ADD*ZERO     PW14
|    C                     Z-ADD*ZERO     PW15
|    C                     Z-ADD*ZERO     PW16
|    C                     Z-ADD*ZERO     PW17
|    C                     Z-ADD*ZERO     PW18
|    C                     Z-ADD*ZERO     PW19
|    C                     MOVELEM11      PW20
|    C                     Z-ADD*ZERO     PW22
|    C                     Z-ADD*ZERO     PW24
|    C                     Z-ADD*ZERO     PW26
|    C                     Z-ADD*ZERO     PW27
|    C                     Z-ADD*ZERO     PW28
|    C                     Z-ADD*ZERO     PW29
|    C                     Z-ADD*ZERO     PW30
|    C                     Z-ADD*ZERO     PW30
|    C                     Z-ADD*ZERO     PW31
|    C                     Z-ADD*ZERO     PW32
|    C                     Z-ADD*ZERO     PW33
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN030... GET EMPLOYEE DATA
     C*==============================================================*
04===C           RTN030    BEGSR
|    C*                    Z-ADD0         WJOBM   70
|    C*                    Z-ADDWTD       WJOBD   20
|    C*                    SELEC
|    C*¨ìÂ¾¤ëµ¥©ó­pÁ~¤ë­pºâ¤u§@¤Ñ¼Æ
|    C*          EM13YM    WHEQ WFYM
|    C*          EM19YM    IFNE WFYM
|    C*                    CALL 'P33'
|    C*                    PARM EM13      P3301I  80
|    C*                    PARM WFYMD     P3302I  80
|    C*                    PARM '2'       P3303I  1
|    C*                    PARM '1'       P3304I  1
|    C*          WJOBM     PARM           P3311O  70
|    C*          WJOBD     PARM           P3312O  20
|    C*                    ELSE
|    C*                    CALL 'P33'
|    C*                    PARM EM13      P3301I  80
|    C*                    PARM EM19      P3302I  80
|    C*                    PARM '2'       P3303I  1
|    C*                    PARM '1'       P3304I  1
|    C*          WJOBM     PARM           P3311O  70
|    C*          WJOBD     PARM           P3312O  20
|    C*                    ENDIF
|    C*Â÷Â¾¤ëµ¥©ó­pÁ~¤ë­pºâ¤u§@¤Ñ¼Æ
|    C*          EM19YM    WHEQ WFYM
|    C*                    CALL 'P33'
|    C*                    PARM WFYMD     P3301I  80
|    C*                    PARM EM19      P3302I  80
|    C*                    PARM '2'       P3303I  1
|    C*                    PARM '1'       P3304I  1
|    C*          WJOBM     PARM           P3311O  70
|    C*          WJOBD     PARM           P3312O  20
|    C*                    ENDSL
|    C*¤u§@¤Ñ¼Æ­pÁ~¤ñ²v
|    C*          WJOBD     DIV  WTD       JRATE   54H
|    C*
|    C*----------------------------------------------------------------
|    C                     MOVELDPW01     WD01             ¤½¥q½s¸¹
|    C                     Z-ADDWPW03     WD03             ¦~¤ë
|    C                     MOVELDPW04     WD04             ´Á§O
|    C                     MOVELEM02      WD02             ­û¤u½s¸¹
|    C                     MOVEL*BLANK    WD05             Á~¸ê¶µ¥Ø
|    C*----------------------------------------------------------------
|    C                     MOVELDPW01     DW01             ¤½¥q½s¸¹
|    C                     MOVELEM02      DW02             ­û¤u½s¸¹
|    C                     Z-ADDWPW03     DW03             ¦~¤ë
|    C                     Z-ADD0         DW04             °·«Oª÷ÃB
|    C                     Z-ADD0         DW05             ¤½¥q°·«O
|    C                     Z-ADD0         DW06             ³Ò«Oª÷ÃB
|    C                     Z-ADD0         DW07             ¤½¥q³Ò«O
|    C                     Z-ADD0         DW08             ³Ò°h§ë«O
|    C                     Z-ADD0         DW09             ¥ø·~´£¼·
|    C                     Z-ADD$A8YMD    DW97
|    C                     TIME           DW98
|    C                     MOVEL$USER     DW99
|    C*----------------------------------------------------------------
|    C*¤u§@¤Ñ¼Æ
|    C                     Z-ADDWFYMD     #YMDF            .­pÁ~°_¤é
|    C                     Z-ADDWTYMD     #YMDT            .­pÁ~¤î¤é
|    C*¥»¤ë¤é¾ú¤Ñ¼Æ
|    C                     CALL 'P34'
|    C                     PARM WPW03     P3401I  60
|    C                     PARM '2'       P3403I  1
|    C                     PARM '1'       P3404I  1
|    C                     PARM           P3411O  1
|    C                     PARM           P3412O  20
|    C                     Z-ADDP3412O    WTD
|    C*¥»¤ë¤é¾ú¤Ñ¼Æ
|    C                     Z-ADDWTD       PW07
|    C*
|    C*¥»¤ë·s¶i¤H­ûÆæ¤u§@¤Ñ¼Æ¡Ð¨ìÂ¾¤é¦Ü¤ë©³¤éÆæ
| 01-C           EM13      IFGE #YMDF
|   C           EM13      ANDLE#YMDT
|   C*
|   C                     CALL 'P32'
|   C                     PARM EM13      P3201I  80
|   C                     PARM WTYMD     P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C           P3211O    ADD  1         PW07
|   C                     Z-ADDEM13      #YMDF
| 01-C                     END
|    C*
|    C*¥»¤ëÂ÷Â¾¤H­ûÆæ¤u§@¤é¼Æ­pºâ¡Ð­pÁ~°_¤é¦ÜÂ÷Â¾¤é¶¡¤Ñ¼ÆÆæ
| 02-C           EM19      IFNE *ZERO
|   C           EM19YM    ANDLEWFYM
|   C*Â÷Â¾¤é¡Õ­pÁ~°_¤é¡A¤u§@¤é¼Æ¡×¢¯
| 03-C           EM19      IFLT #YMDF
|   C                     Z-ADD*ZERO     PW07
|   C                     Z-ADDEM19      #YMDT
|   C                     GOTO E030
| 03*C                     ELSE
|   C                     CALL 'P32'
|   C                     PARM #YMDF     P3201I  80
|   C                     PARM EM19      P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C                     ADD  1         P3211O
|   C                     Z-ADDP3211O    PW07
|   C                     Z-ADDEM19      #YMDT
| 03-C                     END
| 02-C                     END
|    C*
|    C*¥»´Á¶¡¯dÂ¾¤H­ûÆæ¤u§@¤é¼Æ­pºâ¡Ð­pÁ~°_¤é¦Ü¯dÂ¾¤é¶¡¤Ñ¼ÆÆæ
| 04-C           EM11      IFEQ 'R'
|   C           EM17YM    ANDLEWFYM
|   C*¯dÂ¾¤é¡Õ­pÁ~°_¤é¡A¤u§@¤é¼Æ¡×¢¯
| 05-C           EM17      IFLT #YMDF
|   C                     Z-ADD*ZERO     PW07
|   C                     Z-ADDEM17      #YMDT
|   C                     GOTO E030
| 05*C                     ELSE
|   C                     CALL 'P32'
|   C                     PARM #YMDF     P3201I  80
|   C                     PARM EM17      P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C                     ADD  1         P3211O
|   C                     Z-ADDP3211O    PW07
|   C                     Z-ADDEM17      #YMDT
| 05-C                     END
| 04-C                     END
|    C*
|    C*¥»´Á¶¡ªø¯f¤H­ûÆæ¤u§@¤é¼Æ­pºâ¡Ð­pÁ~°_¤é¦Ü¯dÂ¾¤é¶¡¤Ñ¼ÆÆæ
| 06-C           EM11      IFEQ 'S'
|   C           EM951M    ANDLEWFYM
|   C*¯dÂ¾¤é¡Õ­pÁ~°_¤é¡A¤u§@¤é¼Æ¡×¢¯
| 07-C           EM951     IFLT #YMDF
|   C                     Z-ADD*ZERO     PW07
|   C                     Z-ADDEM951     #YMDT
|   C                     GOTO E030
| 07*C                     ELSE
|   C                     CALL 'P32'
|   C                     PARM #YMDF     P3201I  80
|   C                     PARM EM951     P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C                     ADD  1         P3211O
|   C                     Z-ADDP3211O    PW07
|   C                     Z-ADDEM951     #YMDT
| 07-C                     END
| 06-C                     END
|    C*
|    C*¥»´Á¶¡¯dÂ¾°±Á~¤é¼Æ¦©°£
| 08-C           EM11      IFNE 'R'
|   C           EM18      ANDGE#YMDF
|   C           EM17      ANDLE#YMDT
|   C*
| 09-C           EM17      IFGE #YMDF
|   C                     Z-ADDEM17      P3201I
| 09*C                     ELSE
|   C                     Z-ADD#YMDF     P3201I
| 09-C                     END
| 10-C           EM18      IFLE #YMDT
|   C                     Z-ADDEM18      P3202I
| 10*C                     ELSE
|   C                     Z-ADD#YMDT     P3202I
| 10-C                     END
|   C*
|   C                     CALL 'P32'
|   C                     PARM           P3201I  80
|   C                     PARM           P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C                     SUB  P3211O    PW07
| 08-C                     END
|    C*
|    C*¥»´Á¶¡ªø¯f°±Á~¤é¼Æ¦©°£
| 11-C           EM11      IFNE 'S'
|   C           EM952     ANDGE#YMDF
|   C           EM951     ANDLE#YMDT
|   C*
| 12-C           EM951     IFGE #YMDF
|   C                     Z-ADDEM951     P3201I
| 12*C                     ELSE
|   C                     Z-ADD#YMDF     P3201I
| 12-C                     END
| 13-C           EM952     IFLE #YMDT
|   C                     Z-ADDEM952     P3202I
| 13*C                     ELSE
|   C                     Z-ADD#YMDT     P3202I
| 13-C                     END
|   C                     CALL 'P32'
|   C                     PARM           P3201I  80
|   C                     PARM           P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C                     SUB  P3211O    PW07
| 11-C                     END
|    C*
|    C           E030      TAG
|    C*
|    C                     Z-ADD0         JRATE   54H      ­pÁ~¤ñ²v
| 14-C           PW07      IFLE *ZERO
|   C                     Z-ADD*ZERO     PW07
| 14*C                     ELSE
|   C*¤u§@¤Ñ¼Æ­pÁ~¤ñ²v
|   C           PW07      DIV  WTD       JRATE
| 14-C                     END
|    C*
04===C           END030    ENDSR
     C*==============================================================*
     C*          RTN040... MAIN PROCESS
     C*==============================================================*
05===C           RTN040    BEGSR
|    C*
|    C*GET­pºâ¹ê»â¥»Á~-- PM301
|    C                     EXSR RTN115
|    C*GET­pºâ¬z¶Kª÷ÃB--
|    C                     EXSR RTN120
|    C*
|    C*°·«O¶O(52)- PM319, PW24, PW25
|    C*¥ý­pºâ°·«O¶O¡G¦]»ÝGET°·«O¥»¤H¸É§U½X
|    C                     EXSR RTN147
|    C*
|    C*³Ò«O¶O(51)-PM310, PW19, PW22
|    C                     EXSR RTN145
|    C*---------------------------------------
|    C*°h¥ðª÷(56)-PM352
|    C                     EXSR RTN146
|    C*---------------------------------------
|    C*Á~¸ê²§°ÊÀÉ(PYOSPF) +Á~¸ê¤u§@ÀÉ(PYWDPF)
|    C                     EXSR RTN150
|    C*---------------------------------------------------------------
|    C*Á~©w¶µ¥Ø---> PYWDPF, PW16-PW18
|    C*                    EXSR RTN165
|    C*---------------------------------------------------------------
|    C*Á~©w¶µ¥Ø: PYWDPF --> PYPWPF
|    C                     EXSR RTN250
|    C*---------------------------------------
|    C*©T©wÁ~¸ê©Ò±oµ|(PW15, PM318)
|    C                     EXSR RTN170
|    C*¼úª÷©Ò±oµ|(PM311)
|    C                     EXSR RTN175
|    C*---------------------------------------
|    C*
|    C                     Z-ADD$A8YMD    PW97
|    C                     TIME           WTIME  120
|    C                     MOVELWTIME     PW98
|    C                     MOVEL$USER     PW99
|    C*
|    C                     Z-ADDWPW03     PW03
|    C*                    ADD  #PW18     PW18
|    C*
|    C           KEYPW     CHAINPW0                  48
| 01-C           *IN48     IFEQ '1'
|   C                     WRITEPW0
| 01*C                     ELSE
|   C                     UPDATPW0
| 01-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*   RTN115... ¹ê»â¥»Á~­pºâPY03
     C*==============================================================*
06===C           RTN115    BEGSR
|    C*
|    C*¹ê»â¥»Á~PYSSPF = '00'
|    C                     MOVEL'00'      WD05             Á~¸ê¶µ¥Ø
|    C           PY03      MULT JRATE     WD06             ¶µ¥Øª÷ÃB
| 01-C           WD06      IFGT 0
|   C                     Z-ADDWD06      PW05
|   C                     WRITEWD0
| 01-C                     ENDIF
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*   RTN120... ¹ê»â¬z¶Kª÷ÃB
     C*==============================================================*
07===C           RTN120    BEGSR
|    C*
|    C*¬z¶K¶µ¥ØKEYPD = ¤½¥q§O+­û¤u¥N¸¹
|    C                     MOVEL*BLANK    WD05             Á~¸ê¶µ¥Ø
|    C                     Z-ADD0         WD06             ¶µ¥Øª÷ÃB
|    C           KEYPD     SETLLPD0
|    C           KEYPD     READEPD0                      44
| 01-C           *IN44     DOWEQ'0'
|   C*                    ADD  1         I1
|   C                     MOVELPD03      WD05             Á~¸ê¶µ¥Ø
|   C           PD04      MULT JRATE     WD06             ¶µ¥Øª÷ÃB
| 02-C           WD06      IFGT 0
|   C                     WRITEWD0
| 02-C                     ENDIF
|   C           KEYPD     READEPD0                      44
| 01-C                     ENDDO
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*   RTN145... GET ³Ò«O¶O-PM310
     C*==============================================================*
08===C           RTN145    BEGSR
|    C*
|    C                     MOVEL*BLANK    WD05             Á~¸ê¶µ¥Ø
|    C                     Z-ADD0         WD06             ¶µ¥Øª÷ÃB
|    C*¥¼§ë«O
| 01-C           EM14      IFEQ *ZERO
|   C           EM14      ORGT WTYMD
|   C                     GOTO END145
| 01-C                     END
|    C*
|    C                     Z-ADDWFYMD     #YMDF   80       .­pºâ°_¤é
|    C*¥»¤ë·s¶i¤H­û
| 02-C           EM13YM    IFEQ WTYM
|   C                     Z-ADDEM13      #YMDF
| 02-C                     END
|    C*
| 03-C           EM14      IFGT #YMDF
|   C                     Z-ADDEM14      #YMDF
| 03-C                     END
|    C*
|    C                     Z-ADDWTYMD     #YMDT   80       .­pºâ¤î¤é
|    C*Â÷Â¾
| 04-C           EM19      IFNE *ZERO
|   C           EM19      ANDLE#YMDT
|   C                     Z-ADDEM19      #YMDT
| 04-C                     END
|    C*
| 05-C           EM16      IFNE *ZERO
|   C           EM16      ANDLE#YMDT
|   C                     Z-ADDEM16      #YMDT
| 05-C                     END
|    C*
| 06-C           #YMDT     IFLE #YMDF
|   C                     GOTO END145
| 06-C                     END
|    C*
|    C*³Ò«O¶O()ªí¥|±Ë¤­¤J
|    C*((§ë«Oª÷ÃBX³Ò¤u«OÀI­t¾á¤ñ²vX­û¤u­t¾á¤ñ²v
|    C*          X¦bÂ¾¤Ñ¼Æ/¤u§@¤Ñ¼Æ) X¸É§U¤ñ²v) +
|    C*((§ë«Oª÷ÃBX´N·~«OÀI­t¾á¤ñ²vX­û¤u­t¾á¤ñ²v X
|    C*          X¦bÂ¾¤Ñ¼Æ/¤u§@¤Ñ¼Æ) X¸É§U¤ñ²v ) =­û¤u­t¾áª÷ÃB
|    C* µù2¤ë¥÷Â÷Â¾¤H­ûªº¦Û¥I³Ò«O¶O¬O¥H28¤Ñ­p,
|    C*              ¦Ó¤£¬O¥H³Ò«O§½³W©wªº30¤Ñ
|    C*
|    C*³Ò«O¶O§ë«Oª÷ÃB(PYL1PF),³Ò«O¶O²v(PYL2PF)
|    C                     Z-ADD0         TEMP    70
|    C                     Z-ADD0         TEMP1   70
|    C                     Z-ADD0         PW19L1  72       ³Ò«O­t¾á
|    C                     Z-ADD0         PW19DW  72       ¤½¥q­t¾á
|    C*
|    C           KEYDW     CHAINDW0                  40
|    C*
|    C           EM23      SETLLL10
|    C           EM23      READEL10                      45
| 07-C           *IN45     IFEQ '0'
|   C           L102      MULT L201      PW19L1
|   C                     MULT L202      PW19L1
|   C           L102      MULT L201      PW19DW
|   C                     MULT L204      PW19DW
|   C                     Z-ADDL102      DW06
| 07*C                     ELSE
|   C* ­Y§ë«Oª÷ÃB¨S¦³¦b¯Å¶Z¤¤,´N¥Î§ë«Oª÷ÃB*³Ò«O¶O²v*­û¤u­t¾á²v
|   C           EM23      MULT L201      PW19L1
|   C                     MULT L202      PW19L1
|   C           EM23      MULT L201      PW19DW
|   C                     MULT L204      PW19DW
|   C                     Z-ADDEM23      DW06
| 07-C                     ENDIF
|    C*
| 08-C           EM19M     IFNE 2
|   C                     MULT PW07      PW19L1           ­¼¤u§@¤Ñ¼Æ
|   C                     DIV  WTD       PW19L1    H      °£¤é¾ä¤Ñ¼Æ
|   C                     Z-ADDPW19L1    TEMP      H
|   C                     Z-ADDTEMP      PW19L1
|   C                     MULT PW07      PW19DW           ­¼¤u§@¤Ñ¼Æ
|   C                     DIV  WTD       PW19DW    H      °£¤é¾ä¤Ñ¼Æ
|   C                     Z-ADDPW19DW    TEMP1     H
|   C                     Z-ADDTEMP1     PW19DW
| 08*C                     ELSE
|   C                     MULT PW07      PW19L1
|   C                     DIV  30        PW19L1    H
|   C                     Z-ADDPW19L1    TEMP      H
|   C                     Z-ADDTEMP      PW19L1
|   C                     MULT PW07      PW19DW
|   C                     DIV  30        PW19DW    H
|   C                     Z-ADDPW19DW    TEMP1     H
|   C                     Z-ADDTEMP1     PW19DW
| 08-C                     ENDIF
|    C*¦©¸É§U¤ñ²v
| 09-C           INSR      IFNE *BLANK
|   C*
|   C           INSR1     DIV  INSR2     INSRR1  32H
|   C           1         SUB  INSRR1    INSRR2  32H
|   C                     MULT INSRR2    PW19L1    H
|   C                     Z-ADDPW19L1    TEMP      H
|   C                     Z-ADDTEMP      PW19L1
|   C*
| 09-C                     ENDIF
|    C*
|    C*§PÂ_­û¤u¬O§_¬°¤£¶·´N·~«OÀI(EM104)----------------------------
|    C                     Z-ADD0         PW19L6  72       ´N·~­t¾á
|    C                     Z-ADD0         PW19WD  72       ¤½¥q­t¾á
|    C*                    MOVELEM01      L301
|    C*                    MOVELEM02      L302
|    C*          KEYL3     CHAINL30                  47
|    C*          *IN47     IFEQ '1'
| 10-C           EM104     IFEQ 'Y'
|   C*
|   C           EM23      SETLLL10
|   C           EM23      READEL10                      45
| 11-C           *IN45     IFEQ *OFF
|   C           L102      MULT L206      PW19L6
|   C                     MULT L202      PW19L6
|   C           L102      MULT L206      PW19WD
|   C                     MULT L204      PW19WD
| 11*C                     ELSE
|   C*­Y§ë«Oª÷ÃB¨S¦³¦b¯Å¶Z¤¤,´N¥Î§ë«Oª÷ÃB*³Ò«O¶O²v*­û¤u­t¾á²v
|   C           EM23      MULT L206      PW19L6
|   C                     MULT L202      PW19L6
|   C           EM23      MULT L206      PW19WD
|   C                     MULT L204      PW19WD
| 11-C                     ENDIF
|   C*
| 12-C           EM19M     IFNE 2
|   C                     MULT PW07      PW19L6           ­¼¤u§@¤Ñ¼Æ
|   C                     DIV  WTD       PW19L6    H      °£¤é¾ä¤Ñ¼Æ
|   C                     Z-ADDPW19L6    TEMP      H
|   C                     Z-ADDTEMP      PW19L6
|   C                     MULT PW07      PW19WD           ­¼¤u§@¤Ñ¼Æ
|   C                     DIV  WTD       PW19WD    H      °£¤é¾ä¤Ñ¼Æ
|   C                     Z-ADDPW19WD    TEMP1     H
|   C                     Z-ADDTEMP1     PW19WD
| 12*C                     ELSE
|   C                     MULT PW07      PW19L6
|   C                     DIV  30        PW19L6    H
|   C                     Z-ADDPW19L6    TEMP      H
|   C                     Z-ADDTEMP      PW19L6
|   C                     MULT PW07      PW19WD
|   C                     DIV  30        PW19WD    H
|   C                     Z-ADDPW19WD    TEMP1     H
|   C                     Z-ADDTEMP1     PW19WD
| 12-C                     ENDIF
|   C*
|   C*¦©¸É§U¤ñ²v
| 13-C           INSR      IFNE *BLANK
|   C*
|   C*          INSR1     DIV  INSR2     INSRR1  32H
|   C*          1         SUB  INSRR1    INSRR2  32H
|   C                     MULT INSRR2    PW19L6    H
|   C                     Z-ADDPW19L6    TEMP      H
|   C                     Z-ADDTEMP      PW19L6
|   C*
| 13-C                     ENDIF
|   C*
| 10-C                     ENDIF
|    C*
|    C           PW19L1    ADD  PW19L6    PW19
|    C           PW19DW    ADD  PW19WD    DW07
| 14-C           DW07      IFGT 0
|   C  N40                UPDATDW0
|   C   40                WRITEDW0
| 14-C                     ENDIF
|    C*
| 15-C           PW19      IFGT *ZERO
|   C                     MOVEL'51'      WD05
|   C                     Z-ADDPW19      WD06
|   C                     WRITEWD0
| 15-C                     END
|    C*
|    C*<<<<<--------------------------------------------------         ---------
|    C*³Ò«O¶O
|    C*L201 =³Ò«O¶O²v¢Ï(0.065) ==>¥»°ê­û¤u
|    C*L2012=³Ò«O¶O²v¢Ð(0.055) ==>1.¥~³Ò
|    C*                            2.¦~ÄÖ¤j©ó60·³,
|    C*                            3.¦~ÄÖ¤p©ó15·³.
|    C*                    CALL 'P33'
|    C*                    PARM EM33      P3301I  80
|    C*                    PARM WFYMD     P3302I  80
|    C*                    PARM '2'       P3303I  1
|    C*                    PARM '1'       P3304I  1
|    C*                    PARM           P3311O  70
|    C*                    PARM           P3312O  20
|    C*          P3311O    DIV  12        MMM     20H
|    C*
|    C*³Ò«O¶O
|    C*                    MOVEL'A'       TX031
|    C*          KEYTX     SETGTTX0
|    C*                    READPTX0                      46
|    C*          *IN46     IFEQ '0'
|    C*          TX04M     IFLT WTYM
|    C*          TX032     IFEQ '3'                        .³Ò«O°h«O
|    C*                    Z-ADD0         TX05
|    C*                    END
|    C*                    END
|    C*          TX04M     IFEQ WTYM
|    C*          TX032     IFEQ '2'                        .³Ò«O½Õ¾ã
|    C*                    Z-ADDTX05      TX05
|    C*                    END
|    C*                    END
|    C*
|    C*          EM321     IFEQ 'F'
|    C*          TX05      MULT L2012     WAMT      H
|    C*                    ELSE
|    C*          MMM       IFGT 60
|    C*          MMM       ORLT 15
|    C*          TX05      MULT L2012     WAMT      H
|    C*                    ELSE
|    C*          TX05      MULT L201      WAMT      H
|    C*                    END
|    C*                    END
|    C*                    END
|    C*                    Z-ADDPM102     PW22
|    C*
|    C*          #YMDF     IFNE WFYMD
|    C*          #YMDT     ORNE WTYMD
|    C*
|    C*                    CALL 'P32'
|    C*                    PARM #YMDF     P3201I  80
|    C*                    PARM #YMDT     P3202I  80
|    C*                    PARM '2'       P3203I  1
|    C*                    PARM '1'       P3204I  1
|    C*                    PARM           P3211O  90
|    C*
|    C*Â÷Â¾¤Ñ¼Æ¤£§t·í¤Ñ¤é´ÁEX: 1/15Â÷Â¾«h­pÁ~¤Ñ¼Æ¦@¦³14¤Ñ
|    C*
|    C*                    Z-ADDP3211O    PW22
|    C*                    MULT P3211O    WAMT      H
|    C*                    DIV  PM102     WAMT      H
|    C*                    END
|    C*
|    C*                    Z-ADDWAMT      PW19      H
|    C*
|    C*          PW19      IFGT *ZERO
|    C*                    ADD  1         I1
|    C*                    MOVEL'51'      WD05
|    C*
|    C*¦©¸É§U
|    C*          WE108     IFNE 0
|    C*          1         SUB  WE108     WAMT
|    C*                    ELSE
|    C*                    Z-ADD1         WAMT
|    C*                    END
|    C*          WAMT      MULT L202      WAMT      H
|    C*          PW19      MULT WAMT      WD06      H
|    C*                    END
|    C*----------------------------------------------------------------
|    C*          WD06      IFGT 0
|    C*                    WRITEWD0
|    C*                    END
|    C*>>>>>-----------------------------------------------------------
08===C           END145    ENDSR
     C*==============================================================*
     C*   RTN146... GET °h¥ðª÷-PM352 (­û¤u¦Û´£°h¥ðª÷)
     C*==============================================================*
09===C           RTN146    BEGSR
|    C*
|    C                     MOVEL*BLANK    WD05             Á~¸ê¶µ¥Ø
|    C                     Z-ADD0         WD06             ¶µ¥Øª÷ÃB
|    C*
|    C                     Z-ADD*ZERO     DH605   60
|    C                     Z-ADD*ZERO     DH606   60
|    C                     Z-ADD*ZERO     H409    60
|    C                     Z-ADD*ZERO     P1014I
|    C                     Z-ADD*ZERO     P1015I
|    C                     CALL 'PYH120'
|    C                     PARM EM01      P1011I  2         ¤½¥q½s¸¹
|    C                     PARM EM02      P1012I  8         ­û¤u½s¸¹
|    C                     PARM WPW03     P1013I  60        Á~¸ê¤ë¥÷
|    C           DH605     PARM           P1014I  60        ¦Û´£ª÷ÃB
|    C           DH606     PARM           P1015I  60        ¥ø´£ª÷ÃB
|    C           H409      PARM           P1016I  60        ª÷ÃB
|    C                     PARM           @RTNC   2
|    C*
| 01-C           DH605     IFNE *ZERO
|   C                     MOVEL'56'      WD05
|   C                     Z-ADDDH605     WD06
|   C*
|   C                     WRITEWD0
| 01-C                     END
|    C*
|    C           KEYDW     CHAINDW0                  40
|    C                     Z-ADDH409      DW08
|    C                     Z-ADDDH606     DW09
| 02-C           DW09      IFGT 0
|   C  N40                UPDATDW0
|   C   40                WRITEDW0
| 02-C                     ENDIF
|    C*
09===C           END146    ENDSR
     C*==============================================================*
     C*   RTN147... GET °·«O¶O-PM319
     C*==============================================================*
10===C           RTN147    BEGSR
|    C*
|    C                     Z-ADD0         WD06             ¶µ¥Øª÷ÃB
|    C*
     C           KEYDW     CHAINTI0                  40
     C  N40                DELETTI0
|    C*
|    C                     CALL 'PYH126'
|    C                     PARM EM01      P1011I  2         ¤½¥q½s¸¹
|    C                     PARM EM02      P1012I  8         ­û¤u½s¸¹
|    C                     PARM WPW03     P1013I  60        Á~¸ê¤ë¥÷
|    C           PW24      PARM           P1014I  60        Á~¸ê¤ë¥÷
|    C*
|    C*                    MOVEL*BLANK    WD05             Á~¸ê¶µ¥Ø
|    C*                    Z-ADD0         WD06             ¶µ¥Øª÷ÃB
|    C*                    MOVEL*BLANK    INSR
|    C*GET¨ì¥»¤ë©³¤§§ë«Oª¬ªp
|    C*          KEYE1     SETGTE10
|    C*          KEYPY     REDPEE10                      40
|    C*  40                GOTO END147                     µL§ë«O
|    C*
|    C*          E106      IFEQ 0                          ¥þ³¡°±«O
|    C*                    GOTO END147
|    C*                    END
|    C*
|    C*                    Z-ADDWTYMD     #YMDT             ­pºâ¤î¤é
|    C*Â÷Â¾¡A·í¤ë¤£­p
| 01-C*          EM19      IFNE *ZERO
|   C*          EM19      ANDLT#YMDT
|   C*                    GOTO END147
| 01-C*                    END
|    C*
|    C*°±«O¡A·í¤ë¤£­p
| 02-C*          E104      IFEQ '3'                        °±«O
|   C*          E103      ANDLT#YMDT
|   C*                    GOTO END147
| 02-C*                    END
|    C*°·«O¶O¡×§ë«Oª÷ÃB(E105)X¶O²v(E401) X­û¤u­t¾á²v(E402)
|    C*          E105      MULT E401      TP24    94H
|    C*          TP24      MULT E402      TP25    70H
|    C*                    Z-ADDTP25      PW24    70H
|    C*                    Z-ADD1         PW26    10       §ë«O¤H¼Æ
|    C*                    Z-ADD0         PWAMT   70       ¸É§U²Ö¿n
|    C*                    Z-ADD0         TPANT   70       ¸É§Uª÷ÃB¼È
|    C*                    Z-ADDE105      DW04             °·«O§ë«Oª÷
|    C*                    Z-ADD0         E204              §Ç¸¹
|    C*
|    C*¤½¥q­t¾á°·«O¡×§ë«Oª÷ÃB(E105)X¶O²v(E401) X¤½¥q­t¾á²v(E403)
|    C*
|    C*          KEYDW     CHAINDW0                  40
|    C*
|    C*                    Z-ADD0         TP27    94H
|    C*                    Z-ADD0         TP28    94H
|    C*          TP24      MULT E403      TP27
|    C*          TP27      MULT E404      TP28
|    C*                    Z-ADDTP28      DW05      H      °·«O­t¾á
| 03-C*          DW05      IFGT 0
|   C* N40                UPDATDW0
|   C*  40                WRITEDW0
| 03-C*                    ENDIF
|    C*
|    C* ­pºâ°·«O¸É§U´Ú¡Ð­û¤u²²ÄÝ
|    C*                    Z-ADD0         II      20       °·«OINDEX
|    C*          KEYE2     SETLLE20
|    C*          KEYE2     READEE20                      46
| 04-C*          *IN46     DOWEQ'0'
|   C*
| 05-C*-EASON    E205      IFEQ '3'                        ²²ÄÝ°h«O
| 05-C*          E205      IFEQ 'Y'                        ²²ÄÝ°h«O
|   C*                    GOTO NEXT1
| 05-C*                    END
|   C*
|   C*                    Z-ADD0         TPANT
|   C*                    MOVEL*BLANK    INSR
| 06-C*          E211      IFNE *BLANK
|   C*                    MOVEL'INSR'    #Y01
|   C*                    MOVELE211      #Y02
|   C*                    MOVEL*BLANK    #Y03
|   C*          KEY#Y     CHAIN#Y0                  40
| 07-C*          *IN40     IFEQ '0'
|   C*                    MOVEL#Y03      INSR
|   C*
|   C*          TP25      MULT INSR1     TPANT
|   C*                    DIV  INSR2     TPANT
|   C*          TPANT     ADD  INSR3     TPANT
|   C*
| 07-C*                    ENDIF
| 06-C*                    ENDIF
|   C*
|   C*                    ADD  1         II
| 08-C*          TPANT     IFGE TP25
|   C*                    Z-ADDTP25      E2,II
| 08*C*                    ELSE
|   C*                    Z-ADDTPANT     E2,II
| 08-C*                    ENDIF
|   C*
| 09-C*          PW26      IFLT 4
|   C*                    ADD  1         PW26
| 09-C*                    ENDIF
|   C*
|   C*          NEXT1     TAG
|   C*
|   C*          KEYE2     READEE20                      46
| 04-C*                    ENDDO
|    C*¨úª÷ÃB³Ì°ªªº«e3¤H
|    C*                    SORTAE2
|    C*                    Z-ADD1         II
| 10-C*          1         DO   3         II
| 11-C*          E2,II     IFGT 0
|   C*                    ADD  E2,II     PWAMT
| 11-C*                    ENDIF
| 10-C*                    ENDDO
|    C*
|    C*                    CLEARE2
|    C* ­pºâ°·«O¸É§U´Ú¡Ð­û¤u
|    C*                    Z-ADD0         TPANT
|    C*                    MOVEL*BLANK    INSR
| 12-C*          E108      IFNE *BLANK
|   C*                    MOVEL'INSR'    #Y01
|   C*                    MOVELE108      #Y02
|   C*                    MOVEL*BLANK    #Y03
|   C*          KEY#Y     CHAIN#Y0                  40
| 13-C*          *IN40     IFEQ '0'
|   C*                    MOVEL#Y03      INSR
|   C*
|   C*          TP25      MULT INSR1     TPANT
|   C*                    DIV  INSR2     TPANT
|   C*          TPANT     ADD  INSR3     TPANT
|   C*
| 13-C*                    ENDIF
| 12-C*                    ENDIF
|    C*
| 14-C*          TPANT     IFGE TP25
|   C*                    ADD  TP25      PWAMT
| 14*C*                    ELSE
|   C*                    ADD  TPANT     PWAMT
| 14-C*                    ENDIF
|    C*­pºâ­û¤uÀ³­t¾á°·«O¶O
|    C*          TP25      MULT PW26      PW24
|    C*                    SUB  PWAMT     PW24
|    C*
| 15-C*          PW24      IFGT *ZERO
|   C*                    MOVEL'52'      WD05
|   C*                    Z-ADDPW24      WD06      H
| 15-C*                    END
|    C*
| 16-C*          WD06      IFGT 0
|   C*                    WRITEWD0
| 16-C*                    END
|    C*
|    C*°h«O¡A·í¤ë¤£­p
|    C*          E104      IFEQ '9'                        °h«O
|    C*          E103      ANDLT#YMDT
|    C*                    GOTO END147
|    C*                    END
|    C*<<<<<-----------------------------------------------------------
|    C*                    SETOF                     4241
|    C*°·«O¶O¡×§ë«OÃB¢æ¶O²v
|    C*                    Z-ADDE114      PW24    70
|    C*                    Z-ADD1         PW26    10
|    C*                    Z-ADD0         E204
|    C*          KEYE5A    CHAINE50                  42
|    C*                    EXSR RTN14A
|    C*  42                WRITEE50
|    C* N42                UPDATE50
|    C*­pºâ°·«O¸É§U´Ú¡Ð¥»¤H
|    C*                    Z-ADD*ZERO     WE108   54       ¥»¤H¡Ð¸É§U
|    C*          E108      IFNE *BLANK                     ¦³¸É§U
|    C*                    MOVEL'INSR'    W#Y01     P
|    C*                    MOVELE108      W#Y02     P
|    C*          KEY#Y     CHAIN#Y0                  40
|    C*          *IN40     IFEQ '0'
|    C*                    MOVEL#Y03      K#Y03
|    C*
|    C*          K#Y03     IFNE 'ALL'                      ÅU¥D
|    C*
|    C*          K#Y03     IFNE '0/0'
|    C*          K#Y03     ANDNE'3/4'
|    C*          K#Y032    ANDNE0
|    C*          K#Y031    DIV  K#Y032    WE108   54H
|    C*                    END
|    C*
|    C*          K#Y03     IFEQ '0/0'                      ­û¤u¥þÃB­t¾á
|    C*                    Z-ADD*ZERO     WE108   54H
|    C*                    END
|    C*
|    C*          K#Y03     IFEQ '3/4'                      ¸É§U¢°¡þ¢³¾á
|    C*          1         DIV  K#Y032    WE108   54H
|    C*                    END
|    C*
|    C*          E108      IFEQ '1'                        ¥_¥«¥þ¸É¤W­­$604
|    C*          K#Y03     ANDEQ'1/1'
|    C*                    Z-ADD1         WE108
|    C*                    END
|    C*
|    C*          E108      IFEQ '0'                        ¬F©²¥þ¸É
|    C*          K#Y03     ANDEQ'1/1'
|    C*                    Z-ADD1         WE108
|    C*                    END
|    C*
|    C*                    END
|    C*
|    C*                    END
|    C*
|    C*                    END
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*­pºâ°·«O¸É§U´Ú¡Ð²²ÄÝ
|    C*          KEYE2     SETLLE20
|    C*          KEYE2     READEE20                      46
|    C*          *IN46     DOWEQ'0'
|    C*
|    C*---------------------------------------------------------------
|    C*                    EXSR RTN14B
|    C*          PW26      IFLT 4
|    C*                    ADD  E214      PW24
|    C*                    END
|    C*                    ADD  1         PW26
|    C*          KEYE5A    CHAINE50                  41
|    C*  41                WRITEE50
|    C* N41                UPDATE50
|    C*          KEYE2     READEE20                      46
|    C*                    END
|    C*----------------------------------------------------------------
|    C           PW24      IFGT *ZERO
|    C                     MOVEL'52'      WD05
|    C                     ADD  PW24      WD06      H
|    C                     END
|    C*----------------------------------------------------------------
|    C           WD06      IFGT 0
|    C                     WRITEWD0
|    C                     END
|    C*>>>>>----------------------------------------------------------
10===C           END147    ENDSR
     C*==============================================================*
     C*          RTN14A....PYE1PF FIELD TO PYE5PF                    *
     C*==============================================================*
     C*          RTN14A    BEGSR
     C*
     C*                    MOVELE101      E501             ¤½¥q½s¸¹
     C*                    MOVELE102      E502             ­û¤u½s¸¹
     C*                    Z-ADDE103      E503             ¥Í®Ä¤é´Á
     C*                    Z-ADD0         E504             §Ç¸¹
     C*                    MOVELE104      E505             ²§°ÊÃþ§O
     C*                    MOVELEM03      E506             ²²ÄÝ©m¦W
     C*                    MOVELEM31      E507             ¨­¥÷ÃÒ¸¹
     C*                    Z-ADDEM33      E508             ¥X¥Í¤é´Á
     C*                    MOVEL'0'       E509             ²²ÄÝºÙ¿×
     C*                    MOVEL'N'       E510             ¥Á°ê«e¥X¥Í
     C*                    MOVELE108      E511             ¸É§U½X
     C*                    MOVEL*BLANK    E512             »¡©úµù¸Ñ
     C*                    Z-ADDE105      E513             §ë«Oª÷ÃB
     C*                    Z-ADDE114      E514             À³Ãº«O¶O
     C*                    Z-ADDWPW03     E515             Á~¸ê¦~¤ë
     C*                    MOVELE109      E516             °·«O¦a°Ï
     C*                    Z-ADD$A8YMD    E597
     C*                    TIME           E598
     C*                    MOVEL$USER     E599
     C*
     C*                    ENDSR
     C*==============================================================*
     C*          RTN14B ...PYE2PF FIELD TO PYE5PF                    *
     C*==============================================================*
     C*          RTN14B    BEGSR
     C*
     C*                    MOVELE201      E501             ¤½¥q½s¸¹
     C*                    MOVELE202      E502             ­û¤u½s¸¹
     C*                    Z-ADDE203      E503             ¥Í®Ä¤é´Á
     C*                    MOVELE204      E504             §Ç¸¹
     C*                    MOVELE205      E505             ²§°Ê§O
     C*                    MOVELE206      E506             ²²ÄÝ©m¦W
     C*                    MOVELE207      E507             ¨­¥÷ÃÒ¸¹
     C*                    Z-ADDE208      E508             ¥X¥Í¤é´Á
     C*                    MOVELE209      E509             ²²ÄÝºÙ¿×
     C*                    MOVELE210      E510             ¥Á°ê«e¥X¥Í
     C*                    MOVELE211      E511             ¸É§U½X
     C*                    MOVELE212      E512             »¡©úµù¸Ñ
     C*                    Z-ADDE213      E513             §ë«Oª÷ÃB
     C*                    Z-ADDE214      E514             À³Ãº«O¶O
     C*                    Z-ADDWPW03     E515             Á~¸ê¦~¤ë
     C*                    MOVELE215      E516             °·«O¦a°Ï
     C*                    Z-ADD$A8YMD    E597
     C*                    TIME           E598
     C*                    MOVEL$USER     E599
     C*
     C*                    ENDSR
     C*==============================================================*
     C*   RTN150... Á~¸ê²§°ÊÀÉ(PYOSPF) +Á~¸ê¤u§@ÀÉ(PYWDPF)
     C*==============================================================*
11===C           RTN150    BEGSR
|    C*
|    C                     MOVEL*BLANK    WD05             Á~¸ê¶µ¥Ø
|    C                     Z-ADD0         WD06             ¶µ¥Øª÷ÃB
|    C*¬z¶K¶µ¥ØKEYOS = ¤½¥q§O+­û¤u¥N¸¹+¦~¤ë+´Á§O+Á~¸ê¶µ¥Ø
|    C           KEYOS     SETLLOS0
|    C           KEYOS     READEOS0                      44
| 01-C           *IN44     DOWEQ'0'
|   C                     MOVELOS05      WD05             Á~¸ê¶µ¥Ø
|   C           KEYWD     CHAINWD0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     ADD  OS06      WD06             ¶µ¥Øª÷ÃB
|   C                     UPDATWD0
| 02*C                     ELSE
|   C                     Z-ADDOS06      WD06             ¶µ¥Øª÷ÃB
|   C                     WRITEWD0
| 02-C                     ENDIF
|   C           KEYOS     READEOS0                      44
| 01-C                     ENDDO
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*   RTN170... GET ©T©wÁ~¸ê©Ò±oµ| & PYPWPF
     C*==============================================================*
12===C           RTN170    BEGSR
|    C*
|    C           KEYPW     CHAINPW0                  46
| 01-C           *IN46     IFEQ '1'
|   C           PW17      SUB  PW28      WAMT
| 01-C                     END
|    C*
| 02-C           WAMT      IFLE *ZERO
|   C                     GOTO END170
| 02-C                     END
|    C*
| 03-C           EM101     IFEQ '1'
|   C                     Z-ADDWAMT      PI1     80
|   C                     MOVELEM34      PI2     1
|   C                     Z-ADDEM35      PI3     20
|   C                     CALL 'PYS306'                   .TAX
|   C                     PARM           PI1
|   C                     PARM           PI2
|   C                     PARM           PI3
|   C                     PARM           PO1     70
|   C                     PARM           PO2     53
| 03-C                     END
|    C*
|    C                     Z-ADDPO2       TAXR    53
|    C*
| 04-C           EM101     IFEQ '2'
|   C                     Z-ADD0.1       PO2
|   C           WAMT      MULT PO2       PO1       H
| 04-C                     END
|    C*
| 05-C           EM101     IFEQ '3'
|   C                     Z-ADD0.2       PO2
|   C           WAMT      MULT PO2       PO1       H
| 05-C                     END
|    C*
| 06-C           EM101     IFEQ '4'
|   C                     Z-ADD*ZERO     PO2
|   C                     Z-ADDEM102     PO1       H
| 06-C                     END
|    C*¥[¤J¥»¤ë¤G¤Q¸¹¤§·~ÁZ¼úª÷©Ò±oµ|
|    C*                    MOVEL'2'       HD04
|    C*                    MOVEL'14'      HD05
|    C*                    Z-ADD0         HD06
|    C*          KEYHD     CHAINHD0                  40
|    C*          *IN40     IFEQ '0'
|    C*          HD06      MULT 0.06      TAX1    70
|    C*          TAX1      ADD  PO1       PO1
|    C*                    Z-ADDTAX1      PO3     70
|    C*                    END
|    C*****************************************
|    C*          PO3       IFGT *ZERO
|    C*                    MOVEL'54'      WD05
|    C*                    Z-ADD#WD06     WD06
|    C*          KEYWD     CHAINWD0                  40
|    C*  40                WRITEWD0
|    C* N40                DO
|    C*                    ADD  #WD06     WD06
|    C*                    UPDATWD0
|    C*                    ENDDO
|    C*                    MOVEL'54'      #WD05
|    C*                    EXSR RTN260
|    C*                    END
|    C*****************************************
|    C                     Z-ADDPO2       PW15
|    C*
| 07-C           PO1       IFGT *ZERO
|   C                     MOVEL'53'      WD05
|   C                     Z-ADDPO1       WD06
|   C           KEYWD     CHAINWD0                  40
|   C   40                WRITEWD0
| 08-C  N40                DO
|   C                     ADD  PO1       WD06
|   C                     UPDATWD0
| 08-C                     ENDDO
|   C                     MOVEL'53'      #WD05
|   C                     Z-ADDPO1       #WD06
|   C                     EXSR RTN260
| 07-C                     END
|    C*
12===C           END170    ENDSR
     C*==============================================================*
     C*   RTN175... ­pºâ¼úª÷©Ò±oµ| & PYPWPF
     C*==============================================================*
13===C           RTN175    BEGSR
|    C*-EASON
|    C*          PW27      SUB  PW29      WAMT
|    C*          WAMT      IFLE *ZERO
|    C*                    GOTO END175
|    C*                    END
|    C*
|    C*          WAMT      MULT TA07      #WD06     H
|    C*-EASON
|    C                     Z-ADD0         TAX1    70
|    C                     Z-ADD0         #WD06
|    C*
|    C*¦¹¬°¥ý§PÂ_PYPWPF´Á§O¬°'01'ªº¬O§_¦³¼úª÷
|    C*¦]¬°¥u¦³°µ¹ï´Á§O¬°'01'ªº§@§ì­Èªº³¡¤À
|    C*
|    C           PW27      SUB  PW29      WAMT
| 01-C           WAMT      IFGT 0
|   C           WAMT      MULT TA07      #WD06     H
| 01-C                     END
|    C*¼úª÷µ|=«D©T©wÁ~¸ê©Ò±oX¼úª÷µ|²v
|    C*¦A§PÂ_¥H¼g¨ìPYHDPFªº¤W´Á¼úª÷³¡¥÷(¦b°µ²Ö¥[ªº³¡¥÷)
|    C                     Z-ADD0         HD06
|    C                     MOVEL'2'       WHD04
|    C                     MOVEL'14'      WHD05
|    C           KEYHD1    CHAINHD0                  40
| 02-C           *IN40     IFEQ '0'
|   C           HD06      MULT 0.06      TAX1    70
|   C           TAX1      ADD  #WD06     #WD06
| 02-C                     ENDIF
|    C*
| 03-C           #WD06     IFGT *ZERO
|   C                     MOVEL'54'      WD05
|   C                     Z-ADD#WD06     WD06
|   C           KEYWD     CHAINWD0                  40
|   C   40                WRITEWD0
| 04-C  N40                DO
|   C                     ADD  #WD06     WD06
|   C                     UPDATWD0
| 04-C                     ENDDO
|   C                     MOVEL'54'      #WD05
|   C                     EXSR RTN260
| 03-C                     END
|    C*
13===C           END175    ENDSR
     C*==============================================================*
     C*          RTN250... Á~¸ê¶µ¥Ø¡Ð¤@
     C*==============================================================*
14===C           RTN250    BEGSR
|    C*
|    C           KEYWD1    SETLLWD0
|    C           KEYWD1    READEWD0                      44
| 01-C           *IN44     DOWEQ'0'
|   C*
|   C                     MOVELWD05      SS01             Á~¸ê¥N½X
|   C           KEYSS     CHAINSS0                  40
| 02-C           *IN40     IFEQ '0'
|   C*
| 03-C           SS04      IFEQ 'B'                        .´î¶µ
|   C*
| 04-C           SS03      IFEQ 'N'                        .§Kµ|
|   C                     ADD  WD06      PW18
| 04*C                     ELSE                            .À³µ|
| 05-C           SS11      IFEQ '1'                        .©T©w
|   C                     ADD  WD06      PW28
| 05*C                     ELSE                            .«D©T©w
|   C                     ADD  WD06      PW29
| 05-C                     END
| 04-C                     END
|   C*
| 03*C                     ELSE                            .¥[¶µ
|   C*
| 06-C           SS03      IFEQ 'N'                        .§Kµ|
|   C                     ADD  WD06      PW16
| 06*C                     ELSE                            .À³µ|
| 07-C           SS11      IFEQ '1'                        .©T©w
|   C                     ADD  WD06      PW17
| 07*C                     ELSE                            .«D©T©w
|   C                     ADD  WD06      PW27
| 07-C                     END
| 06-C                     END
|   C*
| 03-C                     END
| 02-C                     END
|   C*
|   C           KEYWD1    READEWD0                      44
| 01-C                     ENDDO
|    C*
14===C           END250    ENDSR
     C*==============================================================*
     C*          RTN260... Á~¸ê¶µ¥Ø¡Ð¤@
     C*==============================================================*
15===C           RTN260    BEGSR
|    C*
|    C                     MOVEL#WD05     SS01             Á~¸ê¥N½X
|    C           KEYSS     CHAINSS0                  40
| 01-C           *IN40     IFEQ '0'
|   C*
| 02-C           SS04      IFEQ 'B'                        .´î¶µ
|   C*
| 03-C           SS03      IFEQ 'N'                        .§Kµ|
|   C                     ADD  #WD06     PW18
| 03*C                     ELSE                            .À³µ|
| 04-C           SS11      IFEQ '1'                        .©T©w
|   C                     ADD  #WD06     PW28
| 04*C                     ELSE                            .«D©T©w
|   C                     ADD  #WD06     PW29
| 04-C                     END
| 03-C                     END
|   C*
| 02*C                     ELSE                            .¥[¶µ
|   C*
| 05-C           SS03      IFEQ 'N'                        .§Kµ|
|   C                     ADD  #WD06     PW16
| 05*C                     ELSE                            .À³µ|
| 06-C           SS11      IFEQ '1'                        .©T©w
|   C                     ADD  #WD06     PW17
| 06*C                     ELSE                            .«D©T©w
|   C                     ADD  #WD06     PW27
| 06-C                     END
| 05-C                     END
|   C*
| 02-C                     END
| 01-C                     END
|    C*
15===C           END260    ENDSR
