     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA304                                     *
     H*    PROGRAM NAME :員工調薪試算作業                        *
     H*    AUTHOR       : A1274 EVA                                  *
     H*    CREATE DATE  : 90/07/25                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     F*PYSHLF01IF  E           K        DISK
     FPYA304D CF  E                    WORKSTN
     E*---------------------------------------------------------------*
     ILDA        UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I*
     I                                      501 502 DRV01
     I                                      503 5050DRV03
     I                                      509 5120WRV03
     I                                      518 5240DYMD
     I                                      525 5320WYMD
     I                                      601 6020DRV04
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN CM004O    DFMT
     C           *LIKE     DEFN CM005O    DTYPE
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYSH     KLIST
     C                     KFLD           DRV01            公司
     C                     KFLD           WYMD             生效日期
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INI. RTN.
     C*
  01-C           *IN03     DOWEQ'0'
    C                     EXSR R1000                      *MAIN
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL ROUTINE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   *NAMVAR
|    C*
|    C*------------------------------------------------------------***
|    C                     Z-ADD*ZERO     DRV03
|    C                     Z-ADD*ZERO     WRV03
|    C                     Z-ADD*ZERO     DYMD
|    C                     Z-ADD*ZERO     DYMD
|    C                     Z-ADD*ZERO     DRV04
|    C*------------------------------------------------------------***
|    C                     MOVEL$COR      DRV01
| 01-C           $RMK03    IFNE 'Y'
|   C                     SETOF                     32
| 01*C                     ELSE
|   C                     SETON                     32
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 .... MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     SETON                     97
|    C                     EXFMTDSPC1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
|    C                     EXSR R1A00                      *CHK SCREEN1
|    C*
| 02-C           *IN99     IFEQ '0'
|   C           *IN13     ANDEQ'1'
|   C                     EXSR R1B00                      *PROCESS
| 02-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1A00 ....CHECK SCREEN1
     C*==============================================================*
03===C           R1A00     BEGSR
|    C*
|    C* << CHACK 公司別NOT *BLANK >>
| 01-C           DRV01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO E1A00
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DRV01     CM001I  2         公司代號
|    C                     PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C           DFMT      PARM           CM004O  1         日期格式
|    C           DTYPE     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 02-C           CM099O    IFEQ 'N'
|   C                     SETON                     6099
|   C                     MOVEL'US#0099' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 02-C                     END
|    C   99                GOTO E1A00
|    C*
| 03-C           CM099O    IFEQ *BLANK
|   C                     SETON                     6099
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C   99                GOTO E1A00
|    C*------------------------------------------------------------****
|    C*考績年度
| 04-C           DRV03     IFEQ *ZERO
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 04*C                     ELSE
|   C           DRV03     ADD  1911      WRV03
| 03-C                     END
|    C   99                GOTO E1A00
     C*
|    C*------------------------------------------------------------****
|    C*生效日期
| 04-C           DYMD      IFEQ *ZERO
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 04*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM DYMD      P3001I  80
|   C                     PARM DFMT      P3002I  1
|   C                     PARM DTYPE     P3003I  1
|   C                     PARM           P3011O  1
| 05-C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 05-C                     END
| 04-C                     END
|    C   99                GOTO E1A00
|    C*
|    C                     CALL 'P31'
|    C                     PARM DYMD      P3101I  80
|    C                     PARM DFMT      P3102I  1
|    C                     PARM DTYPE     P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           WYMD      PARM           P3111O  80
     C*
     C*生效日期不可存在調薪主檔中
     C*          KEYSH     CHAINSH0                  40
     C*          *IN40     IFEQ '0'
|   C*                    SETON                     606299
|   C*                    MOVEL'UPT2020' ERRID
|   C*                    MOVEL'PTMF'    ERRF
| 03-C*                    END
|    C*  99                GOTO E1A00
|    C*------------------------------------------------------------****
|    C*
03===C           E1A00     ENDSR
     C*==============================================================*
     C*          R1B00 .... PROCESS
     C*==============================================================*
04===C           R1B00     BEGSR
|    C*
|    C                     SETON                     96
|    C                     WRITEDSPC1
|    C*
|    C                     OUT  *NAMVAR
|    C                     CALL 'PYA3041C'
|    C*
|    C                     SETON                     93
|    C                     SETOF                     96
|    C*
04===C                     ENDSR
