     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA3361                                    *
     H*    PROGRAM NAME :住宿費確認作業　　　                      *
     H*    AUTHOR       : A1336 KLAUS                                *
     H*    CREATE DATE  : 91/07/22                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FPYOSPFX IP  E           K        DISK
     F            OS0                               KRENAMEOS0X
     F*PYPMPF  IF  E           K        DISK
     FPYOSPF  UF  E           K        DISK                      A
     E*---------------------------------------------------------------
     IOS0X
     I              OS01                            OS01X
     I              OS02                            OS02X
     I              OS03                            OS03X
     I              OS04                            OS04X
     I              OS05                            OS05X
     I              OS06                            OS06X
     I              OS07                            OS07X
     I              OS08                            OS08X
     I              OS97                            OS97X
     I              OS98                            OS98X
     I              OS99                            OS99X
     I/COPY PYDDSSRC,PYPMDS01
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I                                      201 2080$A8YMD
     I*
     I                                      501 502 DOS01X
     I                                      503 5070DOS03X
     I                                      603 6050DOS03Y
     I                                      606 6070DOS03M
     I                                      508 5130WOS03X
     I*
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYOS     KLIST
     C                     KFLD           OS01X
     C                     KFLD           OS02X
     C                     KFLD           OS03X
     C                     KFLD           OS04X
     C                     KFLD           OS05X
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C                     EXSR RTN030                     .EM DATA
     C*
     C*==============================================================*
     C*          RTN030... INITIAL PROCESS
     C*==============================================================*
01===C           RTN030    BEGSR
|    C*
     C                     MOVELOS01X     OS01
     C                     MOVELOS02X     OS02
     C                     Z-ADDOS03X     OS03
     C                     MOVELOS04X     OS04
     C                     MOVELOS05X     OS05
     C                     Z-ADDOS06X     OS06
     C                     Z-ADDOS07X     OS07
     C                     Z-ADDOS08X     OS08
     C                     Z-ADDOS97X     OS97
     C                     Z-ADDOS98X     OS98
     C                     MOVELOS99X     OS99
|    C*
|    C           KEYOS     CHAINOS0                  40
| 07-C           *IN40     IFEQ '1'
|   C                     WRITEOS0
| 07*C                     ELSE
|   C                     UPDATOS0
| 07-C                     END
|    C*
02===C           END030    ENDSR
     C*==============================================================*
