     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA310                                     *
     H*    PROGRAM NAME :員工晉升試算作業                        *
     H*    AUTHOR       : A1336 KLAUS                                *
     H*    CREATE DATE  : 91/09/26                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     F*PYT8PF  IF  E           K        DISK
     FPYA310D CF  E                    WORKSTN
     E*---------------------------------------------------------------*
     ILDA        UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I*
     I                                      501 502 DT801
     I                                      503 510 DT802
     I                                      511 5170DT804
     I                                      518 5250WT804
     I                                      526 5270DTT1
     I                                      528 5300DTT2
     I                                      531 544 DSH05
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN CM004O    DFMT
     C           *LIKE     DEFN CM005O    DTYPE
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYT8     KLIST
     C                     KFLD           DT801            公司
     C                     KFLD           WT804            生效日期
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INI. RTN.
     C*
  01-C           *IN03     DOWEQ'0'
    C                     EXSR R1000                      *MAIN
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL ROUTINE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   *NAMVAR
|    C*
|    C*------------------------------------------------------------***
|    C                     MOVEL*BLANK    DT802
|    C                     Z-ADD*ZERO     DT804
|    C                     Z-ADD*ZERO     WT804
|    C                     Z-ADD*ZERO     DTT1
|    C                     Z-ADD*ZERO     DTT2
|    C                     MOVEL*BLANK    DSH05
|    C*------------------------------------------------------------***
|    C                     MOVEL$COR      DT801
| 01-C           $RMK03    IFNE 'Y'
|   C                     SETOF                     32
| 01*C                     ELSE
|   C                     SETON                     32
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 .... MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     SETON                     97
|    C                     EXFMTDSPC1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
|    C                     EXSR R1A00                      *CHK SCREEN1
|    C*
| 02-C           *IN99     IFEQ '0'
|   C           *IN13     ANDEQ'1'
|   C                     EXSR R1B00                      *PROCESS
| 02-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1A00 ....CHECK SCREEN1
     C*==============================================================*
03===C           R1A00     BEGSR
|    C*
|    C* << CHACK 公司別NOT *BLANK >>
| 01-C           DT801     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO E1A00
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DT801     CM001I  2         公司代號
|    C                     PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C           DFMT      PARM           CM004O  1         日期格式
|    C           DTYPE     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 02-C           CM099O    IFEQ 'N'
|   C                     SETON                     6099
|   C                     MOVEL'US#0099' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 02-C                     END
|    C   99                GOTO E1A00
|    C*
| 03-C           CM099O    IFEQ *BLANK
|   C                     SETON                     6099
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C   99                GOTO E1A00
|    C*------------------------------------------------------------****
|    C*生效日期
| 04-C           DT804     IFEQ *ZERO
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 04*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM DT804     P3001I  80
|   C                     PARM DFMT      P3002I  1
|   C                     PARM DTYPE     P3003I  1
|   C                     PARM           P3011O  1
| 05-C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 05-C                     END
| 04-C                     END
|    C   99                GOTO E1A00
|    C*
|    C                     CALL 'P31'
|    C                     PARM DT804     P3101I  80
|    C                     PARM DFMT      P3102I  1
|    C                     PARM DTYPE     P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           WT804     PARM           P3111O  80
|    C*------------------------------------------------------------****
|    C*晉升職級
| 06-C           DTT1      IFEQ *ZERO
|   C           DTT2      ANDEQ*ZERO
|   C                     MOVEL'UPT0130' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     636499
| 06-C                     END
|    C   99                GOTO E1A00
|    C*
| 07-C           DTT1      IFNE *ZERO
| 08-C           DTT2      ANDNE*ZERO
|   C                     MOVEL'UPT0131' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     636499
| 08-C                     END
|   C   99                GOTO E1A00
|   C*
|   C*------------------------------------------------------------****
|   C*
03===C           E1A00     ENDSR
     C*==============================================================*
     C*          R1B00 .... PROCESS
     C*==============================================================*
04===C           R1B00     BEGSR
|    C*
|    C                     SETON                     96
|    C                     WRITEDSPC1
|    C*
|    C                     OUT  *NAMVAR
|    C                     CALL 'PYA3101C'
|    C*
|    C                     SETON                     93
|    C                     SETOF                     96
|    C*
04===C                     ENDSR
