     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA3063                                    *
     H*    PROGRAM NAME :薪資試算作業－外勞                        *
     H*    AUTHOR       :                                            *
     H*    CREATE DATE  : 78/09/06                                   *
     H*    UPDATE DATE  : 90/03/21 A1274 EVA                         *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FPYEMPF  IP  E           K        DISK
     FPYPWPF  UF  E           K        DISK                      A
     FPYWDPF  UF  E           K        DISK                      A
     FPYE5LF01UF  E           K        DISK                      A
     F*PYPHPF  IF  E           K        DISK
     FPYPYPF  IF  E           K        DISK
     FPYPDPF  IF  E           K        DISK
     FPYODPF  IF  E           K        DISK
     FPYSHPF  IF  E           K        DISK
     FPYSDPF  IF  E           K        DISK
     FPYOSPF  IF  E           K        DISK
     FPYSSPF  IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FPYOVPF  UF  E           K        DISK
     FPYOVLF01IF  E           K        DISK
     F            OV0                               KRENAMEOVL1
     FPYLVPF  UF  E           K        DISK
     FPYLVLF02IF  E           K        DISK
     F            LV0                               KRENAMELVL2
     FPYTAPF  IF  E           K        DISK
     FPYLNPF  IF  E           K        DISK
     FPYJTPF  IF  E           K        DISK
     FPYLCPF  IF  E           K        DISK
     F*PYT5LF01IF  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYTRPF  IF  E           K        DISK
     FPYE1PF  IF  E           K        DISK
     FPYE2PF  IF  E           K        DISK
     FPYE4PF  IF  E           K        DISK
     F*PYE7PF  IF  E           K        DISK
     FPYL2PF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     F*PT#YPF  IF  E           K        DISK
     F*PYWHPF  IF  E           K        DISK
     FPYX1PF  IF  E           K        DISK
     FPYX9PF  IF  E           K        DISK
     F*PYPD1PF IF  E           K        DISK
     FPYPD1LF2IF  E           K        DISK
     FPYPD2PF IF  E           K        DISK
     FPYPQLF02IF  E           K        DISK
     FPYTXPF  IF  E           K        DISK
     FPYPSPF  IF  E           K        DISK
     FPYLIPF  IF  E           K        DISK
     E*---------------------------------------------------------------
     E                    A1         50  2               .薪資項目
     E                    A2         50  7 0             .項目金額
     E*
     E                    B1         50  2               .固定項目
     E                    B2         50  7 0             .調薪前
     E                    B3         50  7 0             .調薪後
     E                    B4         50  7 0             .項目金額
     E*
     E                    C1         50  1               .請假項目
     E                    C2         50  7 2             .調薪前時數
     E                    C3         50  7 2             .調薪後時數
     E                    C4         50  7 0             .項目金額
     E*---------------------------------------------------------------
     I*
     IOV0
     I              OV45                            OV45A
     I              OV46                            OV46A
     I              OV47                            OV47A
     I              OV48                            OV48A
     I*
     ILV0
     I              LV15                            LV15A
     I*
     I/COPY PYDDSSRC,PYPMDS01
     I/COPY PYRPGSRC,PYC02I
     I/COPY PYRPGSRC,PYC03I
     I/COPY PYDDSSRC,PYEMDS01
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I                                      201 2080$A8YMD
     I*
     I                                      501 502 DPW01
     I*                                     503 5060DPW03
     I*                                     503 5040DPW03Y
     I*                                     505 5060DPW03M
     I                                      507 507 DPW04
     I                                      511 5160WPW03
     I                                      511 5140WPW03Y
     I                                      601 601 DOPT
     I                                      515 5160WPW03M
     I                                      603 6070DPW03
     I                                      603 6050DPW03Y
     I                                      606 6070DPW03M
     I*
     IPYDA01      DS                            256
     I                                       50  50 PYD01B
     I                                       52  52 PYD01C
     I*
     I            DS
     I                                        1   80WFYMD
     I                                        1   60WFYM
     I                                        1   40WFY
     I                                        5   60WFM
     I                                        7   80WFD
     I*
     I            DS
     I                                        1   80WNYMD
     I                                        1   60WNYM
     I                                        1   40WNY
     I                                        5   60WNM
     I                                        7   80WND
     I*
     I            DS
     I                                        1   80EM13
     I                                        1   60EM13YM
     I                                        7   80EM13D
     I*
     I            DS
     I                                        1   80EM19
     I                                        1   60EM19YM
     I                                        7   80EM19D
     I*
     I            DS
     I                                        1   80EM17
     I                                        1   60EM17YM
     I                                        7   80EM17D
     I*
     I            DS
     I                                        1   80EM18
     I                                        1   60EM18YM
     I                                        7   80EM18D
     I*
     I            DS
     I                                        1   80EM14
     I                                        1   60EM14YM
     I                                        7   80EM14D
     I*
     I            DS
     I                                        1   80EM16
     I                                        1   60EM16YM
     I                                        7   80EM16D
     I*
     I            DS
     I                                        1   80EM951
     I                                        1   60EM951M
     I                                        7   80EM951D
     I*
     I            DS
     I                                        1   80EM952
     I                                        1   60EM952M
     I                                        7   80EM952D
     I            DS
     I                                        1   2 EM06
     I                                        1   20EM061
     I*
     I            DS
     I                                        1   80SH03
     I                                        7   80SH03D
     I*
     I            DS
     I                                        1   80WLV03
     I                                        1   40WLV03Y
     I                                        5   60WLV03M
8503AI**          DS
 .   I**                                      1   3 K#Y03
 .   I**                                      1   10K#Y031
8503AI**                                      3   30K#Y032
     I*
     I            DS
     I                                        1   80WYMD
     I                                        1   60WYM
     I                                        5   60WMM
     I                                        7   80WDD
     I*           DS
     I*                                       1  62 EM39
     I*                                       1   5 EM391
     I*住宿費
     I            DS
     I                                        1   80KYMD
     I                                        1   60KYM
     I                                        7   80KDD
     I            DS
     I                                        1   80LI04
     I                                        1   40LI04Y
     I                                        1   60LI04YM
     I                                        5   60LI04M
     I                                        7   80LI04D
     I*最後一筆住宿日期
     I            DS
     I                                        1   80LI1
     I                                        1   40LI1Y
     I                                        1   60LI1YM
     I                                        5   60LI1M
     I                                        7   80LI1D
     I*最後第二筆住宿日期
     I            DS
     I                                        1   80LI12
     I                                        1   40LI12Y
     I                                        1   60LI12YM
     I                                        5   60LI12M
     I                                        7   80LI12D
     I*最後一筆退宿日期
     I            DS
     I                                        1   80LI2
     I                                        1   40LI2Y
     I                                        1   60LI2YM
     I                                        5   60LI2M
     I                                        7   80LI2D
     I*最後第二筆退宿日期
     I            DS
     I                                        1   80LI22
     I                                        1   40LI22Y
     I                                        1   60LI22YM
     I                                        5   60LI22M
     I                                        7   80LI22D
     I*
     IPYLVT     E DSPYLVLF02
     IPYLVTD      DS                          1  65
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN SH03      KSH03
     C           *LIKE     DEFN SH03      SH03M
     C           *LIKE     DEFN SH03      WSH03
     C           *LIKE     DEFN LV03      KLV03
     C           *LIKE     DEFN LV04      KLV04
     C           *LIKE     DEFN LV96      KLV96
     C           *LIKE     DEFN LV04      OLV04
     C           *LIKE     DEFN OV96      KOV96
     C           *LIKE     DEFN OV07      SOV07
     C           *LIKE     DEFN OV08      SOV08
     C           *LIKE     DEFN OV09      SOV09
     C           *LIKE     DEFN OV10      SOV10
     C           *LIKE     DEFN OV11      SOV11
     C           *LIKE     DEFN OV21      SOV21
     C           *LIKE     DEFN OV22      SOV22
     C           *LIKE     DEFN OV23      SOV23
     C           *LIKE     DEFN OV24      SOV24
     C           *LIKE     DEFN OV25      SOV25
     C           *LIKE     DEFN OV27      SOV27
     C           *LIKE     DEFN OV28      SOV28
     C           *LIKE     DEFN OV29      SOV29
     C           *LIKE     DEFN OV30      SOV30
     C           *LIKE     DEFN PW05      PW05M
     C           *LIKE     DEFN WD05      #WD05
     C           *LIKE     DEFN WD06      #WD06
     C           *LIKE     DEFN TR04      KTR04
     C           *LIKE     DEFN TR03      KTR03
     C           *LIKE     DEFN EM10      #EM10
     C           *LIKE     DEFN EM05      #EM05
     C           *LIKE     DEFN EM041     #EM041
     C           *LIKE     DEFN EM042     #EM042
     C           *LIKE     DEFN EM043     #EM043
     C           *LIKE     DEFN EM044     #EM044
     C           *LIKE     DEFN LC05      WLC05
     C           *LIKE     DEFN LC05      WLC051
     C*911028    *LIKE     DEFN T502      KT502
     C*911028    *LIKE     DEFN T507      KT507
     C           *LIKE     DEFN PW07      PW07M
     C           *LIKE     DEFN OS05      KOS05
     C*
     C           *LIKE     DEFN CM14      DFMT
     C           *LIKE     DEFN CM15      DTYPE
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYPM     KLIST
     C                     KFLD           PM01
     C                     KFLD           DPW01
     C           KEYPY     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C*PYPWPF
     C           KEYPW     KLIST
     C                     KFLD           EM01             公司
     C                     KFLD           WFYM             年月
     C                     KFLD           DPW04            期別
     C                     KFLD           EM02             工號
     C*PYPWPF
     C           KEYPW1    KLIST
     C                     KFLD           EM01             公司
     C                     KFLD           WPW03            年月
     C                     KFLD           DPW04            期別
     C                     KFLD           EM02             工號
     C*PYPDPF
     C           KEYPD     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C           KEYPD1    KLIST
     C                     KFLD           EM01             公司
     C                     KFLD           EM02             工號
     C                     KFLD           PD03P   2        薪項
     C           KEYPD2    KLIST
     C                     KFLD           EM01             公司
     C                     KFLD           EM135            組別
     C*
     C           KEYPDA    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           PD102
     C           KEYPDB    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           PD202
     C           KEYSH     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           KSH03
     C           KEYSD     KLIST
     C                     KFLD           SH01             公司編號
     C                     KFLD           SH02             員工編號
     C                     KFLD           SH03             生效日期
     C*PYLVPF
     C           KEYLVA    KLIST
     C                     KFLD           LV01             公司
     C                     KFLD           LV02             員工
     C                     KFLD           LV03             請假日期
     C                     KFLD           LV04             假別
     C*PYLVLF02
     C           KEYLV1    KLIST
     C                     KFLD           EM01             公司
     C                     KFLD           EM02             員工
     C                     KFLD           WPW03            計薪年月
     C           KEYLV2    KLIST
     C                     KFLD           EM01             公司
     C                     KFLD           EM02             員工
     C                     KFLD           WPW03            計薪年月
     C                     KFLD           KLV04            假別
     C*PYOVLF01
     C           KEYOV     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           WPW03            計薪年月
     C*PYOVPF
     C           KEYOV1    KLIST
     C                     KFLD           OV01
     C                     KFLD           OV02
     C                     KFLD           OV03
     C*PYWDPF
     C           KEYWD     KLIST
     C                     KFLD           KWD01            公司
     C                     KFLD           KWD03            年月
     C                     KFLD           KWD04            期別
     C                     KFLD           KWD02            員工
     C                     KFLD           KWD05            薪項
     C           KEYWD2    KLIST
     C                     KFLD           KWD01            公司
     C                     KFLD           KWD03            年月
     C                     KFLD           KWD04            期別
     C                     KFLD           KWD02            員工
     C*
     C           KEYOS     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           WPW03
     C                     KFLD           DPW04
     C           KEYOS1    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           WPW03
     C                     KFLD           DPW04
     C                     KFLD           KOS05
     C           KEYTR     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           KTR04            生效日期
     C                     KFLD           KTR03            類別
     C           KEYTR1    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           WFYMD            生效日期
     C           KEYE1     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           WTYMD
     C*911029    KEYPH     KLIST
     C*911029              KFLD           EM01
     C*911029              KFLD           EM02
     C*911029              KFLD           WPW03
     C*911029              KFLD           PH04
     C           KEYDP     KLIST
     C                     KFLD           #EM041
     C                     KFLD           #EM042
     C                     KFLD           #EM043
     C                     KFLD           #EM044
     C           KEYE2     KLIST
     C                     KFLD           E101
     C                     KFLD           E102
     C                     KFLD           E103
     C*PYSSPF
     C           KEYSS     KLIST
     C                     KFLD           CM13
     C                     KFLD           #WD05
     C           KEYSS1    KLIST
     C                     KFLD           CM13
     C                     KFLD           WD05
     C           KEYWSS    KLIST
     C                     KFLD           CM13
     C                     KFLD           KWD05
     C*
     C*911028    KEYT5     KLIST
     C*911028              KFLD           EM01
     C*911028              KFLD           EM02
     C*911028              KFLD           KT507
     C*911028              KFLD           KT502
     C**         KEY#Y     KLIST
     C**                   KFLD           #Y01
     C**                   KFLD           #Y02
     C           KEYWH     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           WPW03
     C*PYX1PF
     C           KEYX1A    KLIST
     C                     KFLD           EM01             公司
     C                     KFLD           EM02             員工
     C                     KFLD           WTYMD            生效日期
     C           KEYX1B    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C*PYE5PF
     C           KEYE5     KLIST
     C                     KFLD           E101             公司編號
     C                     KFLD           E102             員工編號
     C                     KFLD           WPW03            薪資年月
     C           KEYE5A    KLIST
     C                     KFLD           E201             公司編號
     C                     KFLD           E202             員工編號
     C                     KFLD           WPW03            薪資年月
     C                     KFLD           E204             序號
     C*
     C                     MOVEL'A'       TX031
     C           KEYTX     KLIST
     C                     KFLD           EM01             公司
     C                     KFLD           EM02             員工
     C                     KFLD           TX031            異動大類
     C*RTN138住宿費--------------------------------------------------
     C           KEYLI     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02             員工編號
     C*                    KFLD           WFYMD
     C           KEYPS     KLIST
     C                     KFLD           EM06             職等編號
     C                     KFLD           EM07             職級編號
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010                     .INIT
     C*
     C                     EXSR RTN020                     .DATA SEL.
     C*
     C                     Z-ADD0         I1      20       .INDEX-PAY
     C                     MOVEL*BLANK    A1
     C                     MOVEL*ZERO     A2
     C*
  01-C           SWEM      IFEQ 'Y'
    C                     EXSR RTN025                     .CLEAR PW
    C                     EXSR RTN030                     .EM DATA
    C*
    C           KEYPY     CHAINPY0                  40
  02-C           *IN40     IFEQ '0'
    C*
    C           KEYPW1    CHAINPW0                  48
    C                     EXSR RTN040                     .MAIN
  02-C                     END
  01-C                     END
     C*
     C*==============================================================*
     C*          RTN010... INITIAL PROCESS
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     SETON                     10
|    C                     Z-ADD0         WLV03
|    C*
|    C*GET PAYROLL PARAMETER
|    C                     MOVEL'01'      PM01
|    C           KEYPM     CHAINPM0                  40
|    C*
|    C*ADD BY JADI LEE
|    C   40                MOVE *ZERO     PM03
|    C*
|    C*GET PAYROLL PARAMETER
|    C           DPW01     CHAINCM0                  40
|    C                     MOVE CM14      DFMT
|    C                     MOVE CM15      DTYPE
|    C*
|    C*GET THIS YEAR AND YEAR FROM-TO DATE (#C03O1, #C03O2, #C03O3)
|    C                     Z-ADDWPW03     #C03I1  60
|    C*                    EXSR #C0300
|    C*
|    C*GET THIS MONTH FIRST DATE (WFYMD)  YYYYMM01
|    C                     Z-ADD01        WFYMD
|    C                     MOVELWPW03     WFYM
|    C*
|    C*GET THIS MONTH LAST DATE (WTYMD)
|    C                     MOVELWFYM      WTYMD   80
|    C                     CALL 'P34'
|    C                     PARM WFYM      P3401I  60
|    C                     PARM '2'       P3403I  1
|    C                     PARM '1'       P3404I  1
|    C                     PARM           P3411O  1
|    C                     PARM           P3412O  20
|    C                     MOVE P3412O    WTYMD
|    C*
|    C*每月工作天數一律以３０天計算                      *YH USE ONLY
|    C**911215             MOVE 30        WTYMD
|    C*
|    C*二月份未滿30天日數計算
|    C                     MOVE WTYMD     WM2A    20
| 01-C           WM2A      IFLT 30
|   C           30        SUB  WM2A      WM2A
| 01*C                     ELSE
|   C                     Z-ADD*ZERO     WM2A
| 01-C                     END
|    C*
|    C*GET NEXT MONTH FIRST DATE(WNYMD)
|    C                     Z-ADDWFYM      WNYM
|    C                     ADD  1         WNM
| 02-C           WNM       IFGT 12
|   C                     ADD  1         WNY
|   C                     SUB  12        WNM
| 02-C                     END
|    C                     Z-ADD01        WND
|    C*TAX
|    C           '0'       CHAINTA0                  40
|    C*健保參數
|    C                     READ E40                      40
|    C*勞保參數
|    C                     READ L20                      40
|    C*遲到次數設定
|    C           '0'       CHAINOD0                  40
|    C*
|    C                     Z-ADD0         #C02F
|    C                     Z-ADD0         #C02T
|    C                     Z-ADD0         #EM13
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN020... DATA SELECT (SWEM)
     C*==============================================================*
02===C           RTN020    BEGSR
|    C*
|    C                     Z-ADD0         I1
|    C*
|    C                     MOVEL'Y'       SWEM    1 P
|    C*離職
| 01-C           EM19      IFNE *ZERO
|   C           EM19      ANDLTWFYMD
|   C                     MOVEL'N'       SWEM
| 01-C                     END
|    C*留職
| 02-C           EM11      IFEQ 'R'
|   C           EM17      ANDLTWFYMD
|   C                     MOVEL'N'       SWEM
| 02-C                     END
|    C*長病
| 03-C           EM11      IFEQ 'S'
|   C           EM951     ANDLTWFYMD
|   C                     MOVEL'N'       SWEM
| 03-C                     END
|    C*到職
| 04-C           EM13YM    IFGT WFYM
|   C                     MOVEL'N'       SWEM
| 04-C                     END
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN025... CLEAR PW FIELD
     C*==============================================================*
03===C           RTN025    BEGSR
|    C*
|    C                     MOVELEM01      PW01
|    C                     MOVELEM02      PW02
|    C                     Z-ADDWPW03     PW03
|    C                     MOVELDPW04     PW04
|    C                     Z-ADD*ZERO     PW05
|    C                     Z-ADD*ZERO     PW07
|    C                     Z-ADD*ZERO     PW14
|    C                     Z-ADD*ZERO     PW15
|    C                     Z-ADD*ZERO     PW16
|    C                     Z-ADD*ZERO     PW17
|    C                     Z-ADD*ZERO     PW18
|    C                     Z-ADD*ZERO     PW19
|    C                     MOVELEM11      PW20
|    C                     Z-ADD*ZERO     PW22
|    C                     Z-ADD*ZERO     PW24
|    C                     Z-ADD*ZERO     PW26
|    C                     Z-ADD*ZERO     PW27
|    C                     Z-ADD*ZERO     PW28
|    C                     Z-ADD*ZERO     PW29
|    C                     Z-ADD*ZERO     PW30
|    C                     Z-ADD*ZERO     PW31
|    C                     Z-ADD*ZERO     PW32
|    C                     Z-ADD*ZERO     PW33
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN030... GET EMPLOYEE DATA
     C*==============================================================*
04===C           RTN030    BEGSR
|    C*
|    C*GET薪資主檔
|    C           KEYPY     CHAINPY0                  40
|    C   40                Z-ADD*ZERO     PY03
|    C*
|    C*GET月底薪制，職稱，全勤獎金有無(#EM10,#EM05,JT07)
|    C*GET月底部門，駐外津貼，房屋津貼，加班計算(#EM041,2,3,4,DP03,5,7)
|    C                     EXSR RTN201
|    C*################################################################
|    C*上期薪資資料
|    C**         KEYPH     CHAINPH0                  40
|    C**         *IN40     IFEQ '1'
|    C**                   Z-ADD*ZERO     PH30
|    C**                   Z-ADD*ZERO     PH17
|    C**                   END
|    C*
|    C*上期借支PM312,PW30
|    C**                   Z-ADDPH30      PW30
|    C**         PH30      IFNE *ZERO
|    C**                   MOVELPM312     #WD05
|    C**                   Z-ADDPH30      #WD06
|    C**                   EXSR RTN250
|    C**                   END
|    C*################################################################
|    C*計算已到職月日數
|    C                     Z-ADD0         WJOBM   70
|    C                     Z-ADD0         WJOBD   20
|    C                     CALL 'P33'
|    C                     PARM EM13      P3301I  80
|    C                     PARM WFYMD     P3302I  80
|    C                     PARM '2'       P3303I  1
|    C                     PARM '1'       P3304I  1
|    C           WJOBM     PARM           P3311O  70
|    C           WJOBD     PARM           P3312O  20
|    C*
04===C           END030    ENDSR
     C*==============================================================*
     C*          RTN040... MAIN PROCESS
     C*==============================================================*
05===C           RTN040    BEGSR
|    C*
|    C                     SETON                     99
|    C                     MOVEL'N'       WSTOP   1        .全勤獎金
|    C*
|    C*GET本薪與調薪前薪資(PW05,PW05M,SH03M)
|    C                     EXSR RTN105
|    C*
|    C*GET工作日數＆計算實領本薪--PW07&PM301
|    C                     EXSR RTN115
|    C*
|    C*GET扣薪請假時數---PW14,請假扣款
|    C   99                EXSR RTN110
|    C*
|    C*加班費，電報，忘打卡，遲到，早退--PM303-PM305,7,8,9
|    C                     EXSR RTN130
|    C*
|    C*全勤獎金PM309 ---當月份全勤獎金
| 01-C           WSTOP     IFEQ 'N'
|   C           JT07      ANDEQ'Y'                        .有全勤
|   C                     EXSR RTN135
| 01-C                     END
|    C*
|    C*團保費繳款金額
|    C                     EXSR RTN120
|    C*
|    C*請假扣款金額
|    C                     EXSR RTN112
|    C*
|    C*駐外，房屋津貼
|    C*                    EXSR RTN137
|    C*
|    C*住宿費
|    C                     EXSR RTN138
|    C*
|    C*健保費-PM319, PW24, PW25
|    C*先計算健保費：因需GET健保本人補助碼
|    C                     EXSR RTN147
|    C*
|    C*勞保費-PM310, PW19, PW22
|    C                     EXSR RTN145
|    C*---------------------------------------
|    C*生產獎金-PM326
|    C                     EXSR RTN148
|    C*---------------------------------------
|    C*績效獎金-PM308
|    C                     EXSR RTN149
|    C*---------------------------------------
|    C*
|    C*其它扣款--2.貸款:PM313
|    C                     EXSR RTN160
|    C*
|    C*其它扣款--3.工會費:PM332 (有加入工會者才扣）
| 02-C           EM25      IFEQ 'Y'
|   C                     EXSR RTN180
| 02-C                     END
|    C*
|    C*薪定項目---> PYWDPF, PW16-PW18
|    C                     EXSR RTN165
|    C*
|    C*獎金所得稅(PM311)
|    C                     EXSR RTN175
|    C*
|    C                     Z-ADD$A8YMD    PW97
|    C                     TIME           WTIME  120
|    C                     MOVELWTIME     PW98
|    C                     MOVEL$USER     PW99
|    C*
|    C                     Z-ADDWPW03     PW03
|    C*
| 03-C           *IN48     IFEQ '1'
|   C                     WRITEPW0
| 03*C                     ELSE
|   C                     UPDATPW0
| 03-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*   RTN105... GET 本月本薪- PW05
     C*             GET 本調薪前薪資 -PW05M,日期=SH03M
     C*==============================================================*
06===C           RTN105    BEGSR
|    C*
|    C*本月底薪資
|    C                     MOVEL'N'       SWSH    1        .未調薪
|    C                     Z-ADDPY03      PW05             .底薪
|    C*
|    C*以基準檔之項目金額計算
|    C                     Z-ADD*ZERO     WBASE1  70       時薪基準
|    C*
|    C                     Z-ADDPY03      WBASE1           本俸
|    C*
|    C*          EM01      SETLLPD10
|    C*          EM01      READEPD10                     46
|    C           KEYPD2    SETLLPD10
|    C           KEYPD2    READEPD10                     46
| 01-C           *IN46     DOWEQ'0'
|   C*
|   C                     SETOF                     45
|   C           KEYPDA    CHAINPD0                  45
|   C  N45                ADD  PD04      WBASE1
|   C*
|   C*          EM01      READEPD10                     46
|   C           KEYPD2    READEPD10                     46
| 01-C                     END
|    C*
|    C*計算時薪：按規定工作天數及時數換算出
|    C           WBASE1    DIV  PM101     WBASE1
|    C                     DIV  PM102     WBASE1    H
|    C*
|    C                     Z-ADDWTYMD     KSH03
|    C           KEYSH     SETGTSH0
|    C           KEYPY     READESH0                      40
|    C*
| 02-C           *IN40     IFEQ '0'
|   C           SH06      ANDNE*ZERO
|   C                     Z-ADDSH07      PW05
|   C                     MOVEL'Y'       SWSH
| 02-C                     END
|    C*
|    C                     EXSR RTN260                     .固定項目
|    C*----
|    C*本月調薪（一個月最多調薪一次）
|    C                     MOVEL'N'       SWSH             .未調薪
|    C                     Z-ADDWFYMD     KSH03
|    C           KEYSH     SETGTSH0
|    C           KEYPY     READESH0                      40
|    C*
| 03-C           *IN40     IFEQ '0'
|   C           SH03      ANDLEWTYMD
|   C           SH06      ANDNE*ZERO
|   C                     MOVEL'Y'       SWSH
| 03-C                     END
|    C*調薪前
| 04-C           SWSH      IFEQ 'N'
|   C                     Z-ADDPW05      PW05M
|   C                     Z-ADD*ZERO     SH03M
|   C                     Z-ADDWNYMD     WSH03
| 04*C                     ELSE
|   C                     Z-ADDSH07      PW05M
|   C                     Z-ADDSH03      SH03M            .調薪日期
|   C                     Z-ADDSH03      WSH03            .調薪日期
|   C                     EXSR RTN270                     .固定項目
| 04-C                     END
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*   RTN110... GET 扣薪請假時數--- PW14
     C*==============================================================*
07===C           RTN110    BEGSR
|    C*
|    C                     MOVE *BLANK    OLV04
|    C                     Z-ADD*ZERO     WPW14
|    C                     MOVEL*BLANKS   C1
|    C                     Z-ADD*ZERO     C2
|    C                     Z-ADD*ZERO     C3
|    C                     Z-ADD*ZERO     C4
|    C                     Z-ADD*ZERO     SPW14   83       .請假
|    C                     Z-ADD*ZERO     TPW14   83       .請假
|    C                     Z-ADD*ZERO     SLV11   30       .交通津貼
|    C                     Z-ADD*ZERO     SLV12   30       .大夜班津貼
|    C                     Z-ADD*ZERO     W309    83       .全勤獎金
|    C*
|    C                     Z-ADD*ZERO     LV03
|    C                     Z-ADD*ZERO     LV05
|    C                     Z-ADD1         J       30
|    C*
|    C           KEYLV1    SETLLLVL2
|    C           KEYLV1    READELVL2                     42
|    C*
|    C  N42                MOVELLV04      OLV04
|    C*
| 01-C           *IN42     DOWEQ'0'
| 02-C           LV05      IFLT WSH03                      調薪日
|   C*
| 03-C           LV04      IFNE OLV04
|   C*
|   C                     EXSR RTN220
|   C                     EXSR RTN230
|   C*
|   C                     MOVELOLV04     C1,J
|   C                     Z-ADDSPW14     C2,J
|   C                     ADD  SPW14     TPW14
|   C                     Z-ADD*ZERO     SPW14
|   C                     ADD  1         J
|   C                     MOVELLV04      OLV04
| 03-C                     END
|   C*
|   C                     EXSR RTN210
| 02-C                     END
|   C*
|   C           KEYLV1    READELVL2                     42
|   C*
|   C   42                EXSR RTN220
|   C   42                EXSR RTN230
|   C   42                MOVELOLV04     C1,J
|   C   42                Z-ADDSPW14     C2,J
|   C   42                ADD  SPW14     TPW14
|   C   42                Z-ADD*ZERO     SPW14
|   C   42                ADD  1         J
| 01-C                     END
|    C*有調薪
| 04-C           SWSH      IFEQ 'Y'
|   C           KEYLV1    SETLLLVL2
|   C           KEYLV1    READELVL2                     42
|   C*
|   C                     MOVELLV04      OLV04
|   C                     Z-ADD*ZERO     WPW14   62
|   C*
| 05-C           *IN42     DOWEQ'0'
| 06-C           LV05      IFLT WNYMD
|   C*
| 07-C           LV04      IFNE OLV04
|   C*
|   C                     EXSR RTN220
|   C                     EXSR RTN230
|   C*
|   C                     Z-ADD1         WI      20
|   C           OLV04     LOKUPC1,WI                    40
| 08-C           *IN40     IFEQ '0'
|   C                     MOVELOLV04     C1,J
|   C                     Z-ADDSPW14     C3,J
|   C                     ADD  1         J
| 08*C                     ELSE
|   C                     Z-ADDSPW14     C3,WI
| 08-C                     END
|   C*
|   C                     ADD  SPW14     TPW14
|   C                     Z-ADD*ZERO     SPW14
|   C                     MOVELLV04      OLV04
| 07-C                     END
|   C*
| 09-C           LV03      IFGE WSH03
|   C                     EXSR RTN210
| 09-C                     END
|   C*
| 06-C                     END
|   C*
|   C           KEYLV1    READELVL2                     42
|   C   42                EXSR RTN220
|   C   42                EXSR RTN230
|   C   42                Z-ADD1         WI
|   C   42      OLV04     LOKUPC1,WI                    40
| 10-C   42      *IN40     IFEQ '0'
|   C                     MOVELOLV04     C1,J
|   C                     Z-ADDSPW14     C3,J
|   C                     ADD  1         J
| 10*C                     ELSE
|   C                     Z-ADDSPW14     C3,WI
| 10-C                     END
|   C*
|   C   42                ADD  SPW14     TPW14
|   C   42                Z-ADD*ZERO     SPW14
|   C   42                ADD  1         J
| 05-C                     END
| 04-C                     END
|    C*
|    C                     Z-ADDTPW14     PW14      H
|    C*
07===C           END110    ENDSR
     C*==============================================================*
     C*   RTN112... GET 扣薪請假時數＆金額
     C*==============================================================*
08===C           RTN112    BEGSR
|    C*----------------------------------------------------------------
|    C                     Z-ADD*ZERO     WBASE2 103       時薪基準
|    C*
|    C                     Z-ADDPY03      WBASE2           本俸
|    C*
|    C           EM01      SETLLPD20
|    C           EM01      READEPD20                     46
| 03-C           *IN46     DOWEQ'0'
|   C*
|   C                     SETOF                     45
|   C           KEYPDB    CHAINPD0                  45
|   C  N45                ADD  PD04      WBASE2
|   C*
|   C           EM01      READEPD20                     46
| 03-C                     END
|    C*
|    C*計算時薪：按規定工作天數及時數換算出
|    C                     Z-ADD*ZERO     COST   103       時薪基準
|    C           WBASE2    DIV  PM101     COST
|    C                     DIV  PM102     COST
|    C                     Z-ADD0         KWD06  103
|    C*------------------------------------------------------------***
|    C****************************************************************
|    C*事假，病假，曠職，其他請假扣款，家顧及風災假（同事假）
|    C                     Z-ADD0         HOURS   41
|    C*------------------------------------------------------------***
|    C*事假、事無、家顧（視同事假）PM104、Ｊ、Ｙ
|    C                     Z-ADD*ZERO     #WD06
|    C*
|    C                     MOVE PM104     KLV04            事假代碼
|    C           KEYLV2    SETLLLVL2
|    C           KEYLV2    READELVL2                     42
| 01-C           *IN42     DOWEQ'0'
|   C*
| 02-C           LV04      IFEQ PM104                      事假Ｉ
|   C           LV04      OREQ 'J'                        事無Ｊ
|   C           LV04      OREQ 'Y'                        家顧Ｙ
|   C*
|   C*911230S-----------------------
| 03-C           LV05      IFLT #YMDT
|   C           LV09      MULT PM101     HOURS
|   C                     ADD  LV08      HOURS
| 03-C                     END
| 02-C                     END
|   C*
|   C                     Z-ADD0         KWD06  103
|   C                     Z-ADD0         LV15A
| 04-C           HOURS     IFNE 0
|   C           HOURS     MULT COST      KWD06
|   C*
|   C           PM104     CHAINLC0                  41
| 05-C           *IN41     IFEQ '0'
|   C                     MULT LC05      KWD06     H
| 05-C                     END
|   C*將每筆請假扣款金額寫回請假主檔
|   C           KEYLVA    CHAINLV0                  42
| 06-C           *IN42     IFEQ '0'
|   C                     Z-ADDKWD06     LV15A
|   C                     UPDATLV0
| 06-C                     END
| 04-C                     END
|   C*
|   C                     ADD  KWD06     #WD06
|   C*911230E----------------------
|   C           KEYLV2    READELVL2                     42
| 01-C                     END
|    C*
| 07-C           #WD06     IFNE 0
|   C                     MOVELPM327     #WD05
|   C                     EXSR RTN250
| 07-C                     END
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++***
|    C*曠職Ｖ
|    C                     Z-ADD*ZERO     HOURS
|    C                     Z-ADD*ZERO     #WD06
|    C*
|    C                     MOVE PM330     KLV04            曠職代碼
|    C           KEYLV2    SETLLLVL2
|    C           KEYLV2    READELVL2                     42
| 08-C           *IN42     DOWEQ'0'
|   C*
| 09-C           LV05      IFLT #YMDT
|   C           LV09      MULT PM101     HOURS
|   C                     ADD  LV08      HOURS
| 09-C                     END
|   C*
|   C                     Z-ADD0         KWD06
|   C                     Z-ADD0         LV15A
| 10-C           HOURS     IFNE 0
|   C           HOURS     MULT COST      KWD06
|   C*
|   C           PM104     CHAINLC0                  41
| 11-C           *IN41     IFEQ '0'
|   C                     MULT LC05      KWD06     H
| 11-C                     END
|   C*將每筆請假扣款金額寫回請假主檔
|   C           KEYLVA    CHAINLV0                  42
| 12-C           *IN42     IFEQ '0'
|   C                     Z-ADDKWD06     LV15A
|   C                     UPDATLV0
| 12-C                     END
| 10-C                     END
|   C*
|   C                     ADD  KWD06     #WD06
|   C           KEYLV2    READELVL2                     42
| 08-C                     END
|    C*
| 13-C           #WD06     IFNE 0
|   C                     MOVELPM330     #WD05
|   C                     EXSR RTN250
| 13-C                     END
|    C*
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++***
|    C*病假、病診、生理假（視同病假）PM105、Ｗ、Ｚ
|    C                     Z-ADD0         #WD06
|    C                     Z-ADD0         HOURS   41
|    C*
|    C                     MOVE PM105     KLV04            .病假代碼
|    C           KEYLV2    SETLLLVL2
|    C           KEYLV2    READELVL2                     42
| 14-C           *IN42     DOWEQ'0'
|   C*
| 15-C           LV04      IFEQ PM105                      病假Ｓ
|   C           LV04      OREQ 'W'                        病診Ｗ
|   C           LV04      OREQ 'Z'                        生理假Ｚ
|   C*
| 16-C           LV05      IFLT #YMDT
|   C           LV09      MULT PM101     HOURS
|   C                     ADD  LV08      HOURS
| 16-C                     END
| 15-C                     END
|   C*
|   C                     Z-ADD0         KWD06
|   C                     Z-ADD0         LV15A
| 17-C           HOURS     IFNE 0
|   C           HOURS     MULT COST      KWD06
|   C*
|   C           PM104     CHAINLC0                  41
| 18-C           *IN41     IFEQ '0'
|   C                     MULT LC05      KWD06     H
| 18-C                     END
|   C*將每筆請假扣款金額寫回請假主檔
|   C           KEYLVA    CHAINLV0                  42
| 19-C           *IN42     IFEQ '0'
|   C                     Z-ADDKWD06     LV15A
|   C                     UPDATLV0
| 19-C                     END
| 17-C                     END
|   C*
|   C                     ADD  KWD06     #WD06
|   C*911230E----------------------
|   C           KEYLV2    READELVL2                     42
| 14-C                     END
|    C*
| 20-C           #WD06     IFNE 0
|   C                     MOVELPM328     #WD05
|   C                     EXSR RTN250
| 20-C                     END
|    C*------------------------------------------------------------***
|    C*
08===C           END112    ENDSR
     C*==============================================================*
     C*   RTN115... 工作日數，實領本薪計算PW07,PM301
     C*==============================================================*
09===C           RTN115    BEGSR
|    C*
|    C                     Z-ADD0         TOT     70
|    C*
|    C*工作天數
|    C                     EXSR RTN240                     .工作天數
|    C*
| 01-C           PW07      IFLT *ZERO
|   C                     Z-ADD*ZERO     PW07
| 01-C                     END
|    C*
|    C*          PW14      DIV  PM101     WDAYX   62H      .請假
|    C*                    SUB  WDAYX     PW07      H
|    C*
|    C*實領本薪
|    C                     ADD  1         I1
|    C                     MOVELPM301     A1,I1            .項目
| 02-C           PW07      IFEQ PM102
|   C                     Z-ADDPW05M     A2,I1
|   C                     Z-ADDPW05M     WAMT
| 02*C                     ELSE
|   C           PW05M     MULT PW07      WAMT   218H
|   C           WAMT      DIV  PM102     A2,I1     H
| 02-C                     END
|    C*
|    C*本月調薪金額追加
| 03-C           SH03M     IFNE *ZERO
|   C           SH03M     ANDLT#YMDT                      .計薪止日
|   C*
|   C                     CALL 'P32'
|   C                     PARM SH03M     P3201I  80
|   C                     PARM #YMDT     P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C*
|   C           PW05      SUB  PW05M     WAMT   218
|   C           WAMT      DIV  PM102     WAMT      H
|   C                     MULT P3211O    WAMT
|   C                     ADD  WAMT      A2,I1     H
| 03-C                     END
|    C*
|    C*應工作天數#PM102,發薪比例#SALR
| 04-C           #EM10     IFEQ '2'                        半薪
|   C                     Z-ADD15        #PM102  20
|   C                     Z-ADD0.5       #SALR   21
| 04-C                     END
| 05-C           #EM10     IFEQ '1'                        全薪
|   C                     Z-ADDPM102     #PM102
|   C                     Z-ADD1         #SALR
| 05-C                     END
| 06-C           #EM10     IFEQ '3'                        無薪
|   C                     Z-ADDPM102     #PM102
|   C*911230              Z-ADD*ZERO     #SALR
|   C                     Z-ADD1         #SALR
| 06-C                     END
|    C*實領本薪
|    C           A2,I1     MULT #SALR     A2,I1     H
|    C*
|    C                     Z-ADDA2,I1     TOT
|    C*
|    C                     EXSR RTN280
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          RTN120... GET團保費繳交金額 *YH USE ONLY
     C*==============================================================*
10===C           RTN120    BEGSR
|    C*
|    C*日籍主管不扣團保費
| 01-C           EM321     IFEQ 'F'                        外國籍
|   C                     GOTO END120
| 01-C                     END
|    C*
|    C*GET到本月底之投保狀況
|    C           KEYX1A    SETGTX10
|    C           KEYX1B    REDPEX10                      40
|    C   40                GOTO END120                     無投保
|    C*
|    C                     Z-ADDWFYMD     #YMDF
|    C                     Z-ADDWNYMD     #YMDT   80       .計算止日
|    C*離職，當月不計
| 02-C           EM19      IFNE *ZERO
|   C           EM19      ANDLT#YMDT
|   C                     GOTO END120
| 02-C                     END
|    C*停保，當月不計
| 03-C           X104      IFEQ '3'                        退保
|   C           X103      ANDLT#YMDT
|   C                     GOTO END120
| 03-C                     END
|    C*退保，當月不計
| 04-C           X104      IFEQ '9'                        退保
|   C           X103      ANDLT#YMDT
|   C                     GOTO END120
| 04-C                     END
|    C*
|    C*應繳保費總額＝０，當月不計
| 05-C           X105      IFEQ *ZERO                      無保費
|   C           X103      ANDLT#YMDT
|   C                     GOTO END120
| 05-C                     END
|    C*
|    C*到職滿一年員工團保費有折扣：PYX9PF
|    C                     Z-ADD*ZERO     WX906   52
|    C           *LOVAL    SETLLX90
|    C                     READ X90                      41
| 06-C           *IN41     IFEQ '0'
|   C           X906      DIV  100       WX906
| 06*C                     ELSE
|   C                     Z-ADD0         WX906
| 06-C                     END
|    C*
|    C                     CALL 'P33'
|    C                     PARM EM13      P3301I  80
|    C                     PARM WFYMD     P3302I  80
|    C                     PARM '2'       P3303I  1
|    C                     PARM '1'       P3304I  1
|    C           WJOBM     PARM           P3311O  70
|    C           WJOBD     PARM           P3312O  20
|    C*
| 07-C           WJOBM     IFGE 12
|   C           X105      MULT WX906     WAMT
| 07*C                     ELSE
|   C                     Z-ADDX105      WAMT
| 07-C                     END
|    C*
|    C*團保費'78'
| 08-C           WAMT      IFNE *ZERO
|   C                     ADD  1         I1
|   C                     MOVEL'78'      A1,I1
|   C                     Z-ADDWAMT      A2,I1     H
| 08-C                     END
|    C*
10===C           END120    ENDSR
     C*==============================================================*
     C*   RTN130... GET 加班（值班）費與時數-PW31-PW33, PM303-PM305
     C*==============================================================*
11===C           RTN130    BEGSR
|    C*
|    C                     Z-ADD*ZERO     WSUBT   73
|    C                     Z-ADD*ZERO     CCC     73
|    C                     Z-ADD*ZERO     WTAXHA  73       .加班總時數
|    C                     Z-ADD*ZERO     WTAXH   51       .應稅時數
|    C                     Z-ADD*ZERO     WTAXH1  51       .免稅時數
|    C*免稅
|    C                     Z-ADD*ZERO     UOV07   73       平常加班時數
|    C                     Z-ADD*ZERO     UOV08   73       超時加班時數
|    C                     Z-ADD*ZERO     UOV10   73       假日加班時數
|    C                     Z-ADD*ZERO     UOV17   73       假日超時加班時數
|    C                     Z-ADD*ZERO     UOV45   70       平常加班金額
|    C                     Z-ADD*ZERO     UOV46   70       超時加班金額
|    C                     Z-ADD*ZERO     UOV47   70       假日加班金額
|    C                     Z-ADD*ZERO     UOV48   70       假日超時加班金額
|    C*應稅
|    C                     Z-ADD*ZERO     VOV07   73       平常加班時數
|    C                     Z-ADD*ZERO     VOV08   73       超時加班時數
|    C                     Z-ADD*ZERO     VOV10   73       假日加班時數
|    C                     Z-ADD*ZERO     VOV17   73       假日超時加班時數
|    C                     Z-ADD*ZERO     VOV45   70       平常加班金額
|    C                     Z-ADD*ZERO     VOV46   70       超時加班金額
|    C                     Z-ADD*ZERO     VOV47   70       假日加班金額
|    C                     Z-ADD*ZERO     VOV48   70       假日超時加班金額
|    C*
|    C                     Z-ADD*ZERO     ROV07   73
|    C                     Z-ADD*ZERO     ROV08   73
|    C                     Z-ADD*ZERO     ROV10   73
|    C                     Z-ADD*ZERO     ROV17   73
|    C                     Z-ADD*ZERO     ROV45   70
|    C                     Z-ADD*ZERO     ROV46   70
|    C                     Z-ADD*ZERO     ROV47   70
|    C                     Z-ADD*ZERO     ROV48   70
|    C*
|    C                     Z-ADD*ZERO     COST             每小時加班費
|    C*
|    C*法定免稅時數(WTAXFH)
| 01-C           EM32      IFEQ 'M'                        .MALE
|   C                     Z-ADDPM113     WTAXFH  51
| 01*C                     ELSE                            .FEMALE
|   C                     Z-ADDPM114     WTAXFH  51
| 01-C                     END
|    C*
|    C*加班費計算：應免稅時數
|    C                     EXSR RTN13A                     應免稅時數
|    C*
11===C           END130    ENDSR
     C*==============================================================*
     C*          RTN131...加班費計算：勞基法
     C*==============================================================*
12===C           RTN131    BEGSR
|    C*
|    C*--------------------------------------------------------------**
|    C*說明：員工加班時數若超過法定免稅加班時數
|    C*      則多出的時數以應稅加班費來計算
|    C*      另外．時數的控制順序則按日期先後來累計
|    C*        計算的優先順序則按平日．超時．假日．假日超時順序來累計
|    C*------------------------------------------------------------***
|    C                     Z-ADD*ZERO     WSUBT   73
|    C                     Z-ADD*ZERO     AAA     73
|    C                     Z-ADD*ZERO     CCC     73
|    C                     Z-ADD*ZERO     WTAXHA  73
|    C                     Z-ADD*ZERO     WTAXHB  73       .加班總時數
|    C                     Z-ADD*ZERO     WTAXH   51
|    C                     Z-ADD*ZERO     WTAXH1  51
|    C                     Z-ADD*ZERO     UOV07   73       平常加班時數
|    C                     Z-ADD*ZERO     UOV08   73       超時加班時數
|    C                     Z-ADD*ZERO     UOV10   73       假日加班時數
|    C                     Z-ADD*ZERO     UOV17   73       假日超時加班時數
|    C                     Z-ADD*ZERO     VOV07   73       平常加班時數
|    C                     Z-ADD*ZERO     VOV08   73       超時加班時數
|    C                     Z-ADD*ZERO     VOV10   73       假日加班時數
|    C                     Z-ADD*ZERO     VOV17   73       假日超時加班時數
|    C                     Z-ADD*ZERO     ROV07   73       平常加班時數
|    C                     Z-ADD*ZERO     ROV08   73       超時加班時數
|    C                     Z-ADD*ZERO     ROV10   73       假日加班時數
|    C                     Z-ADD*ZERO     ROV17   73       假日超時加班時數
|    C*
|    C*法定免稅時數(WTAXFH)
| 01-C           EM32      IFEQ 'M'                        .MALE
|   C                     Z-ADDPM113     WTAXFH  51
| 01*C                     ELSE                            .FEMALE
|   C                     Z-ADDPM114     WTAXFH  51
| 01-C                     END
|    C*
|    C*加班費計算：應免稅時數
|    C                     EXSR RTN13A                     應免稅時數
|    C*
12===C           END131    ENDSR
     C*==============================================================*
     C*          RTN13A...加班費計算：應／免稅時數
     C*==============================================================*
13===C           RTN13A    BEGSR
|    C*
|    C*累計加班時數： OV07.OV08.OV10.OV17
|    C           KEYOV     SETLLOVL1
|    C           KEYOV     READEOVL1                     42
| 01-C           *IN42     DOWEQ'0'
|   C*------------------------------------------------------------***
|    C*
|    C                     Z-ADD0         WBASE2 103       本俸
|    C                     Z-ADDPY03      WBASE2           本俸
|    C*
|    C           EM01      SETLLPD20
|    C           EM01      READEPD20                     46
| 03-C           *IN46     DOWEQ'0'
|   C*
|   C                     SETOF                     45
|   C           KEYPDB    CHAINPD0                  45
|   C  N45                ADD  PD04      WBASE2
|   C*
|   C           EM01      READEPD20                     46
| 03-C                     END
|   C*------------------------------------------------------------***
|   C*
|   C*計算時薪：按規定工作天數及時數換算出
|   C                     Z-ADD*ZERO     COST   103       時薪基準
|   C           WBASE2    DIV  PM101     COST
|   C                     DIV  PM102     COST      H
|   C*加班費＝基數＊加班薪資比
|   C*　　　平日加班費＝基數＊PM115 (平日加班薪資比）
|   C*　　　超時加班費＝基數＊PM116 (超時加班薪資比）
|   C*　　　假日加班費＝基數＊PM117 (假日加班薪資比）
|   C*　　　假日超時費＝基數＊PM118 (假日超時加班薪資比）
|   C*------------------------------------------------------------***
| 02-C           OV07      IFNE *ZERO                      平日加班時數
|   C                     ADD  OV07      WTAXHA
|   C           OV07      MULT COST      DOV45   83
|   C           DOV45     MULT PM115     OV45      H
|   C*
| 03-C           WTAXHA    IFLE WTAXFH
|   C                     ADD  OV07      UOV07            未稅時數
|   C                     ADD  OV45      UOV45            未稅金額
| 03*C                     ELSE
|   C*
|   C           WTAXHA    SUB  WTAXFH    WSUBT
|   C           OV07      SUB  WSUBT     ROV07
| 04-C           ROV07     IFGT *ZERO
|   C                     ADD  WSUBT     VOV07            應稅時數
|   C           WSUBT     MULT COST      ROV45
|   C                     ADD  ROV45     VOV45            應稅金額
|   C                     ADD  ROV07     UOV07            未稅時數
|   C           ROV07     MULT COST      ROV45
|   C                     ADD  ROV45     UOV45            未稅金額
| 04*C                     ELSE
|   C                     ADD  OV07      VOV07
| 04-C                     END
| 03-C                     END
|   C*
| 02-C                     END
|   C*
|   C                     Z-ADDWTAXHA    CCC
|   C*------------------------------------------------------------***
| 05-C           OV08      IFNE *ZERO                      超時加班
|   C                     ADD  OV08      WTAXHA
|   C           OV08      MULT COST      DOV46   83
|   C           DOV46     MULT PM116     OV46      H      每小時金額
|   C*
| 06-C           WTAXHA    IFLE WTAXFH
|   C                     ADD  OV08      UOV08            未稅
|   C                     ADD  OV46      UOV46            未稅金額
| 06*C                     ELSE
|   C*
|   C           WTAXHA    SUB  WTAXFH    WSUBT
|   C           OV08      SUB  WSUBT     ROV08
| 07-C           ROV08     IFGT *ZERO
|   C                     ADD  WSUBT     VOV08            應稅時數
|   C           WSUBT     MULT COST      ROV46
|   C                     ADD  ROV46     VOV46            應稅金額
|   C                     ADD  ROV08     UOV08            未稅時數
|   C           ROV08     MULT COST      ROV46
|   C                     ADD  ROV46     UOV46            未稅金額
| 07*C                     ELSE
|   C                     ADD  OV08      VOV08
| 07-C                     END
| 06-C                     END
|   C*
| 05-C                     END
|   C*
|   C                     Z-ADDWTAXHA    CCC
|   C*------------------------------------------------------------***
| 08-C           OV10      IFNE *ZERO                      假日加班
|   C                     ADD  OV10      WTAXHA
|   C           OV10      MULT COST      DOV47   83
|   C           DOV47     MULT PM117     OV47      H      每小時金額
|   C*
| 09-C           WTAXHA    IFLE WTAXFH
|   C                     ADD  OV10      UOV10            未稅
|   C                     ADD  OV47      UOV47            未稅金額
| 09*C                     ELSE
|   C*
|   C           WTAXHA    SUB  WTAXFH    WSUBT
|   C           OV10      SUB  WSUBT     ROV10
| 10-C           ROV10     IFGT *ZERO
|   C                     ADD  WSUBT     VOV10            應稅時數
|   C           WSUBT     MULT COST      ROV47
|   C                     ADD  ROV47     VOV47            應稅金額
|   C                     ADD  ROV10     UOV10            未稅時數
|   C           ROV10     MULT COST      ROV47
|   C                     ADD  ROV47     UOV47            未稅金額
| 10*C                     ELSE
|   C                     ADD  OV10      VOV10
| 10-C                     END
| 09-C                     END
|   C*
| 08-C                     END
|   C*
|   C                     Z-ADDWTAXHA    CCC
|   C*------------------------------------------------------------***
| 11-C           OV17      IFNE *ZERO                      假日超時加班
|   C                     ADD  OV17      WTAXHA
|   C           OV17      MULT COST      DOV48   83
|   C           DOV48     MULT PM118     OV48      H      每小時金額
|   C*
| 12-C           WTAXHA    IFLE WTAXFH
|   C                     ADD  OV17      UOV17            未稅
|   C                     ADD  OV48      UOV48            未稅金額
| 12*C                     ELSE
|   C*
|   C           WTAXHA    SUB  WTAXFH    WSUBT
|   C           OV17      SUB  WSUBT     ROV17
| 13-C           ROV17     IFGT *ZERO
|   C                     ADD  WSUBT     VOV17            應稅時數
|   C           WSUBT     MULT COST      ROV48
|   C                     ADD  ROV48     VOV48            應稅金額
|   C                     ADD  ROV17     UOV17            未稅時數
|   C           ROV17     MULT COST      ROV48
|   C                     ADD  ROV47     UOV48            未稅金額
| 13*C                     ELSE
|   C                     ADD  OV17      VOV17
| 13-C                     END
| 12-C                     END
|   C*
| 11-C                     END
|   C*
|   C                     Z-ADDWTAXHA    CCC
|   C*------------------------------------------------------------***
|   C           KEYOV1    CHAINOV0                  40
| 14-C           *IN40     IFEQ '0'
|   C                     Z-ADDOV45      OV45A
|   C                     Z-ADDOV46      OV46A
|   C                     Z-ADDOV47      OV47A
|   C                     Z-ADDOV48      OV48A
|   C                     UPDATOV0
| 14-C                     END
|   C*------------------------------------------------------------***
|   C           KEYOV     READEOVL1                     42
| 01-C                     END
|    C*------------------------------------------------------------***
|    C*免稅時數
|    C           UOV07     ADD  UOV08     WTAXH1           .免稅時數
|    C                     ADD  UOV10     WTAXH1
|    C                     ADD  UOV17     WTAXH1
|    C*應稅時數
|    C           VOV07     ADD  VOV08     WTAXH            .應稅時數
|    C                     ADD  VOV10     WTAXH
|    C                     ADD  VOV17     WTAXH
|    C*------------------------------------------------------------***
|    C*免稅加班費
|    C                     Z-ADD*ZERO     WTAX2   70H
|    C           UOV45     ADD  UOV46     WTAX2
|    C                     ADD  UOV47     WTAX2
|    C                     ADD  UOV48     WTAX2
|    C*
|    C*應稅加班費
|    C                     Z-ADD*ZERO     WTAX1   70H
|    C           VOV45     ADD  VOV46     WTAX1
|    C                     ADD  VOV47     WTAX1
|    C                     ADD  VOV48     WTAX1
|    C*
|    C*------------------------------------------------------------***
|    C*應稅加班時數，金額PW31,WTAX1
|    C                     Z-ADDWTAXH     PW31
| 15-C           WTAX1     IFNE *ZERO
|   C                     MOVELPM303     #WD05            應稅加班費
|   C                     Z-ADDWTAX1     #WD06
|   C                     EXSR RTN250
| 15-C                     END
|    C*
|    C*免稅加班時數，金額PW32,WTAX2
|    C                     Z-ADDWTAXH1    PW32
| 16-C           WTAX2     IFNE *ZERO
|   C                     MOVELPM304     #WD05            免稅加班費
|   C                     Z-ADDWTAX2     #WD06
|   C                     EXSR RTN250
| 16-C                     END
|    C*
13===C           END13A    ENDSR
     C*==============================================================*
     C*   RTN135... GET 全勤獎金-PM321
     C*==============================================================*
14===C           RTN135    BEGSR
|    C*
|    C*是否有全勤獎金
| 01-C           EM12      IFEQ 'N'
|   C                     GOTO END135
| 01-C                     END
|    C*
|    C*全勤：本月無請假，非本月新進離職者
|    C           KEYLV1    CHAINLVL2                 40
| 02-C           *IN40     IFEQ '0'
|   C                     GOTO END135
| 02-C                     END
|    C*
|    C*全勤獎金：PM128//PM321
|    C                     Z-ADDPM128     WAMT      H
|    C*
| 03-C           WAMT      IFNE *ZERO
|   C                     ADD  1         I1
|   C                     MOVELPM321     A1,I1
|   C                     Z-ADDWAMT      A2,I1     H
| 03-C                     END
|    C*
14===C           END135    ENDSR
     C*==============================================================*
     C*   RTN137... GET 駐外津貼-PM302,房屋津貼PM306
     C*==============================================================*
15===C           RTN137    BEGSR
|    C*
| 01-C           WJOBM     IFLT 3                          未滿3個月
|   C                     GOTO END137
| 01-C                     END
|    C*
| 02-C           EM19      IFNE *ZERO                      本月已離職
|   C           EM19      ANDLEWFYMD
|   C                     GOTO END137
| 02-C                     END
|    C*駐外津貼
|    C*          DP03      IFNE 0
|    C*                    ADD  1         I1
|    C*                    MOVELPM302     A1,I1
|    C*                    Z-ADDDP03      A2,I1     H
|    C*                    END
|    C*房屋津貼
|    C*          DP05      IFNE 0
|    C*          EM32      ANDEQ'M'                        男生
|    C*          EM34      ANDEQ'M'                        已婚
|    C*                    ADD  1         I1
|    C*                    MOVELPM306     A1,I1
|    C*                    Z-ADDDP05      A2,I1     H
|    C*                    END
|    C*
15===C           END137    ENDSR
     C*==============================================================*
     C*   RTN138... GET 住宿費
     C*==============================================================*
16===C           RTN138    BEGSR
|    C*
|    C*員工沒有住宿退宿資料
|    C           KEYLI     CHAINLI0                  41
| 01-C           *IN41     IFEQ '1'
|   C                     GOTO END138
| 01-C                     END
|    C*
|    C*GET EMPLOYEE DATA
|    C           *LOVAL    SETLLLI0
|    C                     Z-ADD*ZERO     YY1     20       *資料次數
|    C                     Z-ADD*ZERO     SDD     20       *相差日數
|    C                     Z-ADD*ZERO     X       21       *住宿費率
|    C                     Z-ADD*ZERO     LI1              *1住宿日期
|    C                     Z-ADD*ZERO     LI2              *1退宿日期
|    C                     Z-ADD*ZERO     LI12             *2住宿日期
|    C                     Z-ADD*ZERO     LI22             *2退宿日期
|    C*計算住宿日數
|    C*LI03=申請類別 LI04=生效日期
|    C*
|    C           KEYLI     SETGTLI0
|    C                     READPLI0                      46
| 02-C           *IN46     DOWEQ'0'
|   C*
|   C                     ADD  1         YY1              *資料次數
|   C*最後一筆資料
| 03-C           YY1       IFEQ 1
| 04-C           LI03      IFEQ '1'
|   C                     Z-ADDLI04      LI1              *1住宿日期
| 04-C                     END
| 05-C           LI03      IFEQ '2'
|   C                     Z-ADDLI04      LI2              *1退宿日期
| 05-C                     END
| 03-C                     END
|   C*最後第二筆資料
|   C*
| 06-C           YY1       IFEQ 2
| 07-C           LI03      IFEQ '1'
|   C                     Z-ADDLI04      LI12             *2住宿日期
| 07-C                     END
| 08-C           LI03      IFEQ '2'
|   C                     Z-ADDLI04      LI22             *2退宿日期
| 08-C                     END
| 06-C                     END
|   C*
| 09-C           YY1       IFGT 2
|   C                     LEAVE
| 09-C                     END
|   C*
|   C                     READPLI0                      46
| 02-C                     END
|    C*最後一筆資料是退宿---------------
|    C*處理年月前退宿
| 10-C           WFYM      IFGT LI2YM                      *1退宿年月
|   C                     GOTO END138
| 10-C                     END
|    C*處理年月後退宿
| 11-C           WFYM      IFLT LI2YM                      *1退宿年月
|   C                     Z-ADD1         X
| 11-C                     END
|    C**處理年月＝退宿年月
| 12-C           WFYM      IFEQ LI2YM                      *1退宿年月
|   C*
| 13-C           WFYM      IFNE LI12YM                     *2住宿年月
| 14-C           LI2D      IFGT 15
|   C                     Z-ADD1         X
| 14*C                     ELSE
|   C                     Z-ADD0.5       X
| 14-C                     END
| 13-C                     END
|   C*
| 15-C           WFYM      IFEQ LI12YM                     *2住宿年月
|   C           LI2D      SUB  LI12D     SDD              *相差天數
| 16-C           SDD       IFGT 15
|   C                     Z-ADD1         X
| 16*C                     ELSE
|   C                     Z-ADD0.5       X
| 16-C                     END
| 15-C                     END
|   C*
| 12-C                     END
|    C*最後一筆資料是住宿---------------
|    C*處理年月後住宿
| 17-C           WFYM      IFLT LI1YM                      *1住宿年月
|   C                     GOTO END138
| 17-C                     END
|    C*處理年月前住宿
| 18-C           WFYM      IFGT LI1YM                      *1住宿年月
|   C                     Z-ADD1         X
| 18-C                     END
|    C**處理年月＝住宿年月
| 19-C           WFYM      IFEQ LI1YM                      *1住宿年月
|   C*
| 20-C           WFYM      IFNE LI22YM                     *2退宿年月
| 21-C           LI2D      IFGT 15
|   C                     Z-ADD1         X
| 21*C                     ELSE
|   C                     Z-ADD0.5       X
| 21-C                     END
| 20-C                     END
|   C*
| 22-C           WFYM      IFEQ LI22YM                     *2退宿年月
|   C           LI1D      SUB  LI22D     SDD
| 23-C           SDD       IFGT 15
|   C                     Z-ADD1         X
| 23*C                     ELSE
|   C                     Z-ADD0.5       X
| 23-C                     END
| 22-C                     END
|   C*
| 19-C                     END
|    C*------------------------------------------------------------
|    C*
|    C           LI09      MULT X         WAMT             *金額
|    C*住宿費'69'
| 24-C           WAMT      IFNE *ZERO
|   C                     ADD  1         I1
|   C                     MOVELPM325     A1,I1
|   C                     Z-ADDWAMT      A2,I1     H
| 24-C                     END
|    C*
16===C           END138    ENDSR
     C*==============================================================*
     C*   RTN145... GET 勞保費-PM310
     C*==============================================================*
17===C           RTN145    BEGSR
|    C*未投保
| 01-C           EM14      IFEQ *ZERO
|   C           EM14      ORGT WTYMD
|   C                     GOTO END145
| 01-C                     END
|    C*
|    C                     Z-ADDWFYMD     #YMDF   80
|    C*本月新進人員
| 02-C           EM13YM    IFEQ WFYM
|   C                     Z-ADDEM13      #YMDF
| 02-C                     END
|    C*
| 03-C           EM14      IFGT #YMDF
|   C                     Z-ADDEM14      #YMDF
| 03-C                     END
|    C*
|    C                     Z-ADDWNYMD     #YMDT   80       .計算止日
|    C*離職
| 04-C           EM19      IFNE *ZERO
|   C           EM19      ANDLT#YMDT
|   C                     Z-ADDEM19      #YMDT
| 04-C                     END
|    C*
| 05-C           EM16      IFNE *ZERO
|   C           EM16      ANDLT#YMDT
|   C                     Z-ADDEM16      #YMDT
| 05-C                     END
|    C*
| 06-C           #YMDT     IFLE #YMDF
|   C                     GOTO END145
| 06-C                     END
|    C*
|    C*勞保費
|    C*L201 =勞保費率Ａ(0.065) ==>本國員工
|    C*L2012=勞保費率Ｂ(0.055) ==>1.外勞
|    C*                            2.年齡大於60歲,
|    C*                            3.年齡小於15歲.
|    C                     CALL 'P33'
|    C                     PARM EM33      P3301I  80
|    C                     PARM WFYMD     P3302I  80
|    C                     PARM '2'       P3303I  1
|    C                     PARM '1'       P3304I  1
|    C                     PARM           P3311O  70
|    C                     PARM           P3312O  20
|    C           P3311O    DIV  12        MMM     20
|    C*
|    C*勞保費
|    C           KEYTX     SETGTTX0
|    C                     READPTX0                      46
| 07-C           *IN46     IFEQ '0'
| 08-C           TX032     IFEQ '3'
|   C                     Z-ADD0         TX05
| 08-C                     END
|   C*
| 09-C           EM321     IFEQ 'F'
|   C           TX05      MULT L2012     WAMT
| 09*C                     ELSE
| 10-C           MMM       IFGT 60
|   C           MMM       ORLT 15
|   C           TX05      MULT L2012     WAMT
| 10*C                     ELSE
|   C           TX05      MULT L201      WAMT
| 10-C                     END
| 09-C                     END
| 07-C                     END
|    C                     Z-ADDPM102     PW22
|    C*
| 11-C           #YMDF     IFNE WFYMD
|   C           #YMDT     ORNE WNYMD
|   C*
|   C                     CALL 'P32'
|   C                     PARM #YMDF     P3201I  80
|   C                     PARM #YMDT     P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C*
|   C*功學社：離職天數不含當天日期EX: 1/15離職則計薪天數共有14天
|   C*
|   C                     Z-ADDP3211O    PW22
|   C                     MULT P3211O    WAMT
|   C                     DIV  PM102     WAMT
| 11-C                     END
|    C*
|    C                     Z-ADDWAMT      PW19      H
|    C*
| 12-C           PW19      IFGT *ZERO
|   C                     ADD  1         I1
|   C                     MOVELPM310     A1,I1
|   C*
|   C                     Z-ADD1         WAMT
|   C           WAMT      MULT L202      WAMT
|   C           PW19      MULT WAMT      A2,I1     H
| 12-C                     END
|    C*
17===C           END145    ENDSR
     C*==============================================================*
     C*   RTN147... GET 健保費-PM319
     C*==============================================================*
18===C           RTN147    BEGSR
|    C*
|    C*GET到本月底之投保狀況
|    C           KEYE1     SETGTE10
|    C           KEYPY     REDPEE10                      40
|    C   40                GOTO END147                     無投保
|    C*
| 01-C           E106      IFEQ 0                          全部停保
|   C                     GOTO END147
| 01-C                     END
|    C*本月健保費－是扣上月的健保費用 (EL USE)
|    C*　　　　　　故健保計算止日，為計算到本月１日之前。
|    C                     Z-ADDWFYMD     #YMDF             計算止日
|    C*離職，當月不計
| 02-C           EM19      IFNE *ZERO
|   C           EM19      ANDLT#YMDF
|   C                     GOTO END147
| 02-C                     END
|    C*
|    C*停保，當月不計
| 03-C           E104      IFEQ '3'                        停保
|   C           E103      ANDLT#YMDF
|   C                     GOTO END147
| 03-C                     END
|    C*退保，當月不計
| 04-C           E104      IFEQ '9'                        退保
|   C           E103      ANDLT#YMDF
|   C                     GOTO END147
| 04-C                     END
|    C*----------------------------------------------------------------
|    C                     SETOF                     4241
|    C*健保費＝投保額Ｘ費率
|    C                     Z-ADDE114      PW24    70
|    C                     Z-ADD1         PW26    10
|    C                     Z-ADD0         E204
|    C           KEYE5     CHAINE50                  42
|    C                     EXSR RTN14A
|    C   42                WRITEE50
|    C  N42                UPDATE50
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*計算健保補助款－眷屬
|    C           KEYE2     SETLLE20
|    C           KEYE2     READEE20                      46
| 05-C           *IN46     DOWEQ'0'
|   C*
|   C*911215    E205      IFEQ '3'
|   C*911215    E205      OREQ '5'
|   C*911215    E205      OREQ '9'
|   C*911215              GOTO END147
|   C*911215              END
|   C*---------------------------------------------------------------
|   C                     EXSR RTN14B
|   C                     ADD  E214      PW24
|   C                     ADD  1         PW26
|   C           KEYE5A    CHAINE50                  41
|   C   41                WRITEE50
|   C  N41                UPDATE50
|   C           KEYE2     READEE20                      46
| 05-C                     END
|    C*---------------------------------------------------------------
| 06-C           PW24      IFGT *ZERO
|   C                     ADD  1         I1
|   C                     MOVELPM319     A1,I1
|   C*
|   C                     ADD  PW24      A2,I1     H
| 06-C                     END
|    C*----------------------------------------------------------------
18===C           END147    ENDSR
     C*==============================================================*
     C*          RTN14A....PYE1PF FIELD TO PYE5PF                    *
     C*==============================================================*
19===C           RTN14A    BEGSR
|    C*
|    C                     MOVELE101      E501             公司編號
|    C                     MOVELE102      E502             員工編號
|    C                     Z-ADDE103      E503             生效日期
|    C                     Z-ADD0         E504             序號
|    C                     MOVELE104      E505             異動類別
|    C                     MOVELEM03      E506             眷屬姓名
|    C                     MOVELEM31      E507             身份證號
|    C                     Z-ADDEM33      E508             出生日期
|    C                     MOVEL'0'       E509             眷屬稱謂
|    C                     MOVEL'N'       E510             民國前出生
|    C                     MOVELE108      E511             補助碼
|    C                     MOVEL*BLANK    E512             說明註解
|    C                     Z-ADDE105      E513             投保金額
|    C                     Z-ADDE114      E514             應繳保費
|    C                     Z-ADDWPW03     E515             薪資年月
|    C                     MOVELE109      E516             健保地區
|    C                     Z-ADD$A8YMD    E597
|    C                     TIME           E598
|    C                     MOVEL$USER     E599
|    C*
19===C                     ENDSR
     C*==============================================================*
     C*          RTN14B ...PYE2PF FIELD TO PYE5PF                    *
     C*==============================================================*
20===C           RTN14B    BEGSR
|    C*
|    C                     MOVELE201      E501             公司編號
|    C                     MOVELE202      E502             員工編號
|    C                     Z-ADDE203      E503             生效日期
|    C                     MOVELE204      E504             序號
|    C                     MOVELE205      E505             異動別
|    C                     MOVELE206      E506             眷屬姓名
|    C                     MOVELE207      E507             身份證號
|    C                     Z-ADDE208      E508             出生日期
|    C                     MOVELE209      E509             眷屬稱謂
|    C                     MOVELE210      E510             民國前出生
|    C                     MOVELE211      E511             補助碼
|    C                     MOVELE212      E512             說明註解
|    C                     Z-ADDE213      E513             投保金額
|    C                     Z-ADDE214      E514             應繳保費
|    C                     Z-ADDWPW03     E515             薪資年月
|    C                     MOVELE215      E516             健保地區
|    C                     Z-ADD$A8YMD    E597
|    C                     TIME           E598
|    C                     MOVEL$USER     E599
|    C*
20===C                     ENDSR
     C*==============================================================*
     C*          RTN148...生產獎金PM326 *EL USE ONLY
     C*==============================================================*
21===C           RTN148    BEGSR
|    C*
|    C                     Z-ADD*ZERO     WAMT
|    C*
|    C           KEYLV1    CHAINPQ0                  46
|    C  N46                Z-ADDPQ10      WAMT
|    C   46                Z-ADD0         WAMT
|    C*
|    C*生產獎金：PM326
| 01-C           WAMT      IFNE *ZERO
|   C                     ADD  1         I1
|   C                     MOVELPM326     A1,I1
|   C                     Z-ADDWAMT      A2,I1     H
| 01-C                     END
|    C*
21===C           END148    ENDSR
     C*==============================================================*
     C*          RTN149...績效獎金PM308 *EL USE ONLY
     C*==============================================================*
22===C           RTN149    BEGSR
|    C*
|    C                     Z-ADD*ZERO     WAMT
|    C*
| 01-C           EM133     IFEQ 'C'
|   C           EM133     OREQ ' '
|   C           KEYPS     CHAINPS0                  40
|   C  N40                ADD  PS10      WAMT
|   C*
|   C*同月中生產註記變動者（例由Ａ或Ｂ－＞空白）
|   C*
|   C           KEYTR1    SETGTTR0
|   C           KEYPY     READETR0                      40
|   C*
| 02-C           *IN40     IFEQ '0'
| 03-C           TR231     IFEQ 'A'
|   C           TR231     OREQ 'B'
| 04-C           TR232     IFEQ ' '
|   C           TR04      SUB  WTYMD     DAYS    20
|   C           WAMT      DIV  30        WAMT
|   C                     MULT DAYS      WAMT
| 04-C                     END
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C*績效獎金：PM308
| 05-C           WAMT      IFNE *ZERO
|   C                     ADD  1         I1
|   C                     MOVELPM308     A1,I1
|   C                     Z-ADDWAMT      A2,I1     H
| 05-C                     END
|    C*
22===C           END149    ENDSR
     C*==============================================================*
     C*   RTN160... GET 扣項    -PM131:貸款
     C*==============================================================*
23===C           RTN160    BEGSR
|    C*
|    C*貸款
|    C           KEYPY     SETLLLN0
|    C           KEYPY     READELN0                      42
|    C*
|    C                     Z-ADD*ZERO     WPM313
|    C*
| 01-C           *IN42     DOWEQ'0'
|   C*
|   C                     Z-ADD*ZERO     WAMT
| 02-C           WFYM      IFEQ LN09                       .最後一期
|   C                     Z-ADDLN10      WAMT
| 02*C                     ELSE
| 03-C           WFYM      IFEQ LN06                       .第一期
|   C                     Z-ADDLN07      WAMT
| 03*C                     ELSE
| 04-C           WFYM      IFGT LN06                       .每一期
|   C           WFYM      ANDLTLN09
|   C                     Z-ADDLN08      WAMT
| 04-C                     END
| 03-C                     END
| 02-C                     END
|   C*
| 05-C           WAMT      IFNE *ZERO
|   C                     ADD  WAMT      WPM313  70H
| 05-C                     END
|   C*
|   C           KEYPY     READELN0                      42
| 01-C                     END
|    C*
| 06-C           WPM313    IFNE *ZERO
|   C                     ADD  1         I1
|   C                     MOVELPM313     A1,I1
|   C                     Z-ADDWPM313    A2,I1
| 06-C                     END
|    C*
23===C                     ENDSR
     C*==============================================================*
     C*   RTN165... GET 薪資固定項目
     C*==============================================================*
24===C           RTN165    BEGSR
|    C*
|    C*固定項目
|    C                     Z-ADD1         K1      20
| 01-C           K1        DOWLEIB
|   C*
| 02-C           B1,K1     IFNE *BLANK
|   C           B4,K1     ANDNE*ZERO
|   C                     MOVELB1,K1     #WD05
|   C                     Z-ADDB4,K1     #WD06
|   C                     EXSR RTN250
| 02-C                     END
|   C*
|   C                     ADD  1         K1
| 01-C                     END
|    C*
|    C*變動項目
|    C           KEYOS     SETLLOS0
|    C           KEYOS     READEOS0                      42
|    C*
| 03-C           *IN42     DOWEQ'0'
|   C*
|   C                     MOVELOS05      #WD05
| 04-C           OS06      IFNE *ZERO
|   C                     Z-ADDOS06      #WD06
| 04*C                     ELSE
|   C           OS07      MULT OS08      #WD06
| 04-C                     END
|   C                     EXSR RTN250
|   C*
|   C           KEYOS     READEOS0                      42
| 03-C                     END
|    C*
|    C*系統設定
|    C                     Z-ADD1         K1      20
| 05-C           K1        DOWLEI1
|   C*
| 06-C           A1,K1     IFNE *BLANK
|   C           A2,K1     ANDNE*ZERO
|   C                     MOVELA1,K1     #WD05
|   C                     Z-ADDA2,K1     #WD06
|   C                     EXSR RTN250
| 06-C                     END
|   C*
|   C                     ADD  1         K1
| 05-C                     END
|    C*
24===C                     ENDSR
     C*==============================================================*
     C*   RTN175... 計算獎金所得稅 & PYPWPF
     C*==============================================================*
25===C           RTN175    BEGSR
|    C*
|    C                     Z-ADD0         WDAY    40
|   C                     CALL 'P32'
|   C                     PARM EM13      P3201I  80
|   C                     PARM WTYMD     P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C                     Z-ADDP3211O    WDAY
|    C*
|    C           KEYWD2    SETLLWD0
|    C           KEYWD2    READEWD0                      46
|    C           *IN46     DOWEQ'0'
|    C*
|    C           KEYSS1    CHAINSS0                  40
| 02-C           *IN40     IFEQ '0'
|    C           SS04      IFEQ 'A'
|    C           SS01      ANDNE'33'
|    C                     ADD  WD06      WAMT
| 01-C                     END
|    C*
|    C           SS04      IFEQ 'B'
|    C                     SUB  WD06      WAMT
| 01-C                     END
| 01-C                     END
|    C*
|    C           KEYWD2    READEWD0                      46
| 01-C                     END
|    C*
| 01-C           WAMT      IFLE *ZERO
|   C                     GOTO END175
| 01-C                     END
|    C*
|    C*（計薪當月之最後一日）－（到職日）
|    C*ＩＦ＜　１８３，則計算基礎＊２０％
|    C*ＩＦ＞＝１８３，則計算基礎＊６％
|    C           WDAY      IFLT 183
|    C           WAMT      MULT 0.2       #WD06     H
|    C                     ELSE
|    C           WAMT      MULT 0.06      #WD06     H
|    C                     END
|    C*
| 02-C           #WD06     IFNE *ZERO
|   C                     MOVELPM311     #WD05
|   C                     EXSR RTN250
| 02-C                     END
|    C*
25===C           END175    ENDSR
     C*==============================================================*
     C*   RTN180... GET 扣項    -PM332:工會費
     C*==============================================================*
26===C           RTN180    BEGSR
|    C*
|    C                     ADD  1         I1
|    C                     MOVELPM332     A1,I1
|    C                     Z-ADDPM129     A2,I1
|    C*
26===C                     ENDSR
     C*==============================================================*
     C*   RTN201... GET 某一時間點薪制，職務-#EM10, #EM05
     C*==============================================================*
27===C           RTN201    BEGSR
|    C*
|    C                     MOVELEM041     #EM041
|    C                     MOVELEM042     #EM042
|    C                     MOVELEM043     #EM043
|    C                     MOVELEM044     #EM044
|    C                     MOVELEM05      #EM05
|    C                     MOVELEM10      #EM10
|    C                     MOVELWTYMD     KTR04
|    C                     MOVEL*HIVAL    KTR03
|    C           KEYTR     SETGTTR0
|    C           KEYPY     READETR0                      40
|    C*
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELTR051     #EM041
|   C                     MOVELTR052     #EM042
|   C                     MOVELTR053     #EM043
|   C                     MOVELTR054     #EM044
|   C                     MOVELTR07      #EM05
|   C                     MOVELTR11      #EM10
| 01-C                     END
|    C*全勤獎金有無
|    C           #EM05     CHAINJT0                  40
|    C   40                MOVEL'Y'       JT07
|    C*駐外津貼，房屋津貼，加班計算
|    C           KEYDP     CHAINDP0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     Z-ADD0         DP03
|   C                     Z-ADD0         DP05
|   C                     MOVEL'1'       DP07
| 02-C                     END
|    C*
27===C                     ENDSR
     C*==============================================================*
     C*   RTN210... 假別扣薪請假時數累計--- WPW14
     C*==============================================================*
28===C           RTN210    BEGSR
|    C*
|    C*只處理本月資料
|    C*                    MOVELLV03      LV03YM  60
|    C*          LV03YM    IFNE WPW03
|    C*                    GOTO END210
|    C*                    END
|    C*
|    C                     ADD  LV08      WPW14
|    C           LV09      MULT PM101     WHOUR  149
|    C                     ADD  WHOUR     WPW14     H
|    C*
|    C                     ADD  LV11      SLV11
|    C                     ADD  LV12      SLV12
|    C*
| 01-C           LV04      IFEQ PM104
|   C           LV04      OREQ PM110
|   C           LV04      OREQ PM127
|   C                     ADD  WPW14     W309
| 01-C                     END
|    C*
28===C           END210    ENDSR
     C*==============================================================*
     C*   RTN220... 假別扣薪請假時數判別--- WPW14
     C*             假別本年度已休時數累計-- WPW14A
     C*==============================================================*
29===C           RTN220    BEGSR
|    C*
|    C           OLV04     CHAINLC0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL'1'       LC03
|   C                     Z-ADD999       LC04
|   C                     Z-ADD0         LC08
|   C                     Z-ADD0         LC09
|   C                     MOVEL'1'       LC10
|   C                     Z-ADD999       LC11
|   C                     GOTO END220
| 01-C                     END
|    C*
|    C*有薪且不限天數者不計算
| 02-C           LC03      IFEQ '1'
|   C           LC04      ANDEQ999
|   C                     GOTO END220
| 02-C                     END
|    C*
|    C*無薪
| 03-C           LC03      IFEQ '2'
|   C           LC09      ANDEQ0                          無超扣
|   C                     GOTO END220
| 03-C                     END
|    C*
|    C*有部份計薪－計算本年度已請時數(WPW14A)
|    C                     MOVELPYLVT     PYLVTD
|    C*
|    C                     Z-ADDLV03      WLV03
| 04-C           WLV03M    IFGT PM103
|   C           WLV03Y    ADD  1         #C02I1  40
| 04*C                     ELSE
|   C                     Z-ADDWLV03Y    #C02I1
| 04-C                     END
|    C*
|    C                     EXSR #C0200                     在職月數
|    C                     MOVEL#C02T     WC02TD  80
|    C                     MOVE '31'      WC02TD
|    C*
|    C                     MOVELOLV04     KLV04
|    C                     Z-ADD*ZERO     WPW14A  62
|    C           KEYLV2    SETLLLVL2
|    C           KEYLV2    READELVL2                     40
| 05-C           *IN40     DOWEQ'0'
|   C*
| 06-C           LV96      IFNE *ZERO
|   C                     ADD  LV08      WPW14A
|   C           LV09      MULT PM101     WHOUR
|   C                     ADD  WHOUR     WPW14A    H
| 06-C                     END
|   C*
|   C           KEYLV2    READELVL2                     40
| 05-C                     END
|    C*
| 07-C           SWSH      IFEQ 'Y'
|   C                     ADD  C2,J      WPW14A
| 07-C                     END
|    C*
|    C                     MOVELPYLVTD    PYLVT
|    C*
29===C           END220    ENDSR
     C*==============================================================*
     C*   RTN230... 扣薪請假時數累計--- SPW14
     C*==============================================================*
30===C           RTN230    BEGSR
|    C*
| 01-C           LV04      IFEQ PM127
|   C                     MOVEL'Y'       WSTOP
| 01-C                     END
|    C*
|    C*當月有請無全勤假者'Y'-> WSTOP無全勤獎金
| 02-C           LC07      IFEQ 'N'                        .無全勤
|   C           WPW14     ANDNE*ZERO
| 02-C                     END
|    C*
|    C*無薪
| 03-C           LC03      IFEQ '2'
| 04-C           LC09      IFEQ 0                          .無超扣
|   C                     ADD  WPW14     SPW14
|   C*
| 04*C                     ELSE                            .有超扣
|   C*不需超扣的天數計算
|   C           LC08      MULT PM101     WHOUR            .計薪時數
|   C                     MULT #C02M1    WHOUR            .新進比率
|   C                     DIV  12        WHOUR     H
|   C*
| 05-C           WHOUR     IFGT WPW14A
|   C                     SUB  WPW14A    WHOUR            .剩下不扣
| 05*C                     ELSE
|   C                     Z-ADD*ZERO     WHOUR
| 05-C                     END
|   C*
| 06-C           WPW14     IFLE WHOUR
|   C                     ADD  WPW14     SPW14
| 06*C                     ELSE
|   C                     ADD  WHOUR     SPW14
|   C           WPW14     SUB  WHOUR     WHOUR            .超扣時數
|   C           WHOUR     MULT LC09      WHOUR            .X超比
|   C                     ADD  WHOUR     SPW14
| 06-C                     END
|   C*
| 04-C                     END
| 03-C                     END
|    C*
|    C*有部份計薪
| 07-C           LC03      IFEQ '1'
|   C           LC04      ANDNE999
|   C*
|   C           LC04      MULT PM101     WHOUR            .計薪時數
|   C                     MULT #C02M1    WHOUR            .新進比率
|   C                     DIV  12        WHOUR     H
|   C*
|   C           LC10      MULT PM101     WHOUR1           .計薪時數
|   C                     MULT #C02M1    WHOUR1           .新進比率
|   C                     DIV  12        WHOUR1 149H
|   C*
|   C           1         SUB  LC05      WLC05            .扣薪比率
|   C           1         SUB  LC11      WLC051           .扣薪比率
|   C*
|   C           WPW14     ADD  WPW14A    WPW14B 149H
|   C*
| 08-C                     SELEC
|   C           WPW14A    WHLE WHOUR
| 09-C           WPW14B    IFLE WHOUR
|   C           WPW14     MULT WLC05     WAMT      H
|   C                     ADD  WAMT      SPW14     H      .扣部份薪
| 09*C                     ELSE
| 10-C           WPW14B    IFLE WHOUR1
|   C           WHOUR     SUB  WPW14A    WAMT      H
|   C           WAMT      MULT WLC05     WAMT      H
|   C                     ADD  WAMT      SPW14     H      .扣部份薪
|   C           WPW14B    SUB  WHOUR     WHOUR     H
|   C           WHOUR     MULT WLC051    WAMT      H
|   C                     ADD  WAMT      SPW14     H      .扣全薪
| 10*C                     ELSE
|   C           WHOUR     SUB  WPW14A    WAMT      H
|   C           WAMT      MULT WLC05     WAMT      H
|   C                     ADD  WAMT      SPW14     H      .扣部份薪
|   C           WHOUR1    SUB  WHOUR     WAMT      H
|   C           WAMT      MULT WLC051    WAMT      H
|   C                     ADD  WAMT      SPW14     H      .扣部份薪
|   C           WPW14B    SUB  WHOUR1    WHOUR1    H
|   C                     ADD  WHOUR1    SPW14     H      .扣全薪
| 10-C                     END
| 09-C                     END
|   C*
|   C           WPW14A    WHGT WHOUR
|   C           WPW14A    ANDLEWHOUR1
| 11-C           WPW14B    IFLE WHOUR1
|   C           WPW14     MULT WLC051    WAMT      H
|   C                     ADD  WAMT      SPW14     H      .扣部份薪
| 11*C                     ELSE
|   C           WHOUR1    SUB  WPW14A    WAMT      H
|   C           WAMT      MULT WLC051    WAMT      H
|   C                     ADD  WAMT      SPW14     H      .扣部份薪
|   C           WPW14B    SUB  WHOUR1    WHOUR1    H
|   C                     ADD  WHOUR1    SPW14     H      .扣全薪
| 11-C                     END
|   C*
|   C                     OTHER
|   C                     ADD  WPW14     SPW14     H
| 08-C                     END
| 07-C                     END
|    C* TEMP FIELD CLEAR
|    C                     Z-ADD*ZERO     WPW14
|    C*
30===C           END230    ENDSR
     C*==============================================================*
     C*   RTN240... 工作日數計算PW07
     C*==============================================================*
31===C           RTN240    BEGSR
|    C*
|    C                     Z-ADDWFYMD     #YMDF            .計薪起日
|    C                     Z-ADDWNYMD     #YMDT            .計薪止日
|    C*
|    C*本月工作日數(30 DAYS)
|    C                     Z-ADDPM102     PW07
|    C*
|    C*本月新進人員も工作天數－到職日至月底日も
| 01-C           EM13      IFGT WFYMD
|   C*
|   C                     CALL 'P32'
|   C                     PARM EM13      P3201I  80
|   C                     PARM WTYMD     P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C           P3211O    ADD  1         PW07
|   C                     Z-ADDEM13      #YMDF
| 01-C                     END
|    C*
|    C*離職人員も工作日數計算－計薪起日至離職日間天數も
| 02-C           EM19      IFNE *ZERO
|   C           EM19YM    ANDLEWFYM
|   C*                    MOVEL'Y'       WSTOP            .無全勤
|   C*離職日＜計薪起日，工作日數＝０
| 03-C           EM19      IFLT #YMDF
|   C                     Z-ADD*ZERO     PW07
|   C                     Z-ADDEM19      #YMDT
|   C                     GOTO END240
| 03*C                     ELSE
|   C                     CALL 'P32'
|   C                     PARM #YMDF     P3201I  80
|   C                     PARM EM19      P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C                     ADD  1         P3211O
|   C                     Z-ADDP3211O    PW07
|   C                     Z-ADDEM19      #YMDT
| 03-C                     END
| 02-C                     END
|    C*
|    C*本期間留職人員も工作日數計算－計薪起日至留職日間天數も
| 04-C           EM11      IFEQ 'R'
|   C           EM17YM    ANDLEWFYM
|   C*                    MOVEL'Y'       WSTOP            .無全勤
|   C*留職日＜計薪起日，工作日數＝０
| 05-C           EM17      IFLT #YMDF
|   C                     Z-ADD*ZERO     PW07
|   C                     Z-ADDEM17      #YMDT
|   C                     GOTO END240
| 05*C                     ELSE
|   C                     CALL 'P32'
|   C                     PARM #YMDF     P3201I  80
|   C                     PARM EM17      P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C                     ADD  1         P3211O
|   C                     Z-ADDP3211O    PW07
|   C                     Z-ADDEM17      #YMDT
| 05-C                     END
| 04-C                     END
|    C*
|    C*本期間長病人員も工作日數計算－計薪起日至留職日間天數も
| 06-C           EM11      IFEQ 'S'
|   C           EM951M    ANDLEWFYM
|   C*                    MOVEL'Y'       WSTOP            .無全勤
|   C*留職日＜計薪起日，工作日數＝０
| 07-C           EM951     IFLT #YMDF
|   C                     Z-ADD*ZERO     PW07
|   C                     Z-ADDEM951     #YMDT
|   C                     GOTO END240
| 07*C                     ELSE
|   C                     CALL 'P32'
|   C                     PARM #YMDF     P3201I  80
|   C                     PARM EM951     P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C                     ADD  1         P3211O
|   C                     Z-ADDP3211O    PW07
|   C                     Z-ADDEM951     #YMDT
| 07-C                     END
| 06-C                     END
|    C*
|    C*本期間留職停薪日數扣除
| 08-C           EM11      IFNE 'R'
|   C           EM18      ANDGT#YMDF
|   C           EM17      ANDLT#YMDT
|   C*
| 09-C           EM17      IFGE #YMDF
|   C                     Z-ADDEM17      P3201I
| 09*C                     ELSE
|   C                     Z-ADD#YMDF     P3201I
| 09-C                     END
| 10-C           EM18      IFLT #YMDT
|   C                     Z-ADDEM18      P3202I
| 10*C                     ELSE
|   C                     Z-ADD#YMDT     P3202I
| 10-C                     END
|   C*
|   C                     CALL 'P32'
|   C                     PARM           P3201I  80
|   C                     PARM           P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C*
|   C                     SUB  P3211O    PW07
| 08-C                     END
|    C*
|    C*本期間長病停薪日數扣除
| 11-C           EM11      IFNE 'S'
|   C           EM952     ANDGT#YMDF
|   C           EM951     ANDLT#YMDT
|   C*                    MOVEL'Y'       WSTOP            .無全勤
|   C*
| 12-C           EM951     IFGE #YMDF
|   C                     Z-ADDEM951     P3201I
| 12*C                     ELSE
|   C                     Z-ADD#YMDF     P3201I
| 12-C                     END
| 13-C           EM952     IFLT #YMDT
|   C                     Z-ADDEM952     P3202I
| 13*C                     ELSE
|   C                     Z-ADD#YMDT     P3202I
| 13-C                     END
|   C                     CALL 'P32'
|   C                     PARM           P3201I  80
|   C                     PARM           P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C*
|   C                     SUB  P3211O    PW07
| 11-C                     END
|    C*
31===C           END240    ENDSR
     C*==============================================================*
     C*          RTN250... 薪資項目－一
     C*==============================================================*
32===C           RTN250    BEGSR
|    C*
| 01-C           #WD06     IFEQ *ZERO
|   C                     GOTO END250
| 01-C                     END
|    C*
|    C           KEYSS     CHAINSS0                  40
| 02-C           *IN40     IFEQ '0'
|   C*
| 03-C           SS04      IFEQ 'B'                        .減項
|   C*
| 04-C           SS03      IFEQ 'N'                        .免稅
|   C                     ADD  #WD06     PW18
| 04*C                     ELSE                            .應稅
| 05-C           SS11      IFEQ '1'                        .固定
|   C                     ADD  #WD06     PW28
| 05*C                     ELSE                            .非固定
|   C                     ADD  #WD06     PW29
| 05-C                     END
| 04-C                     END
|   C*
| 03*C                     ELSE                            .加項
|   C*
| 06-C           SS03      IFEQ 'N'                        .免稅
|   C                     ADD  #WD06     PW16
| 06*C                     ELSE                            .應稅
| 07-C           SS11      IFEQ '1'                        .固定
|   C                     ADD  #WD06     PW17
| 07*C                     ELSE                            .非固定
|   C                     ADD  #WD06     PW27
| 07-C                     END
| 06-C                     END
|   C*
| 03-C                     END
| 02-C                     END
|    C*
|    C                     MOVELPW01      KWD01   2
|    C                     MOVELPW02      KWD02   8
|    C                     Z-ADDWPW03     KWD03   60
|    C                     MOVELPW04      KWD04   1
|    C                     MOVEL#WD05     KWD05   2
|    C           KEYWD     CHAINWD0                  40
|    C*
| 08-C           *IN40     IFEQ '0'
|   C                     ADD  #WD06     WD06
|   C                     UPDATWD0
| 08*C                     ELSE
|   C                     MOVELPW01      WD01
|   C                     MOVELPW02      WD02
|   C                     Z-ADDWPW03     WD03
|   C                     MOVELPW04      WD04
|   C                     MOVEL#WD05     WD05
|   C                     Z-ADD#WD06     WD06
|   C                     WRITEWD0
| 08-C                     END
|    C*
32===C           END250    ENDSR
     C*==============================================================*
     C*          RTN251.. 薪資項目－二
     C*==============================================================*
33===C           RTN251    BEGSR
|    C*
| 01-C           WD06      IFEQ *ZERO
|   C                     GOTO END251
| 01-C                     END
|    C*
|    C           KEYWSS    CHAINSS0                  42
| 02-C           *IN42     IFEQ '0'
|   C*
| 03-C           SS04      IFEQ 'B'                        .減項
|   C*
| 04-C           SS03      IFEQ 'N'                        .免稅
|   C                     ADD  WD06      PW18
| 04*C                     ELSE                            .應稅
| 05-C           SS11      IFEQ '1'                        .固定
|   C                     ADD  WD06      PW28
| 05*C                     ELSE                            .非固定
|   C                     ADD  WD06      PW29
| 05-C                     END
| 04-C                     END
|   C*
| 03*C                     ELSE                            .加項
|   C*
| 06-C           SS03      IFEQ 'N'                        .免稅
|   C                     ADD  WD06      PW16
| 06*C                     ELSE                            .應稅
| 07-C           SS11      IFEQ '1'                        .固定
|   C                     ADD  WD06      PW17
| 07*C                     ELSE                            .非固定
|   C                     ADD  WD06      PW27
| 07-C                     END
| 06-C                     END
|   C*
| 03-C                     END
| 02-C                     END
|    C*
33===C           END251    ENDSR
     C*==============================================================*
     C*          RTN260... 薪資固定項目－本月底薪資
     C*==============================================================*
34===C           RTN260    BEGSR
|    C*
|    C                     MOVEL*BLANK    B1
|    C                     MOVEL*ZERO     B2
|    C                     MOVEL*ZERO     B3
|    C                     MOVEL*ZERO     B4
|    C                     Z-ADD*ZERO     IB      20       .固定數
|    C*
| 01-C           SWSH      IFEQ 'N'                        .未調薪
|   C*
|   C           KEYPY     SETLLPD0
|   C           KEYPY     READEPD0                      42
| 02-C           *IN42     DOWEQ'0'
|   C                     ADD  1         IB
|   C                     MOVELPD03      B1,IB
|   C                     Z-ADDPD04      B3,IB
|   C           KEYPY     READEPD0                      42
| 02-C                     END
|   C*
| 01*C                     ELSE                            .有調薪
|   C           KEYSD     SETLLSD0
|   C           KEYSD     READESD0                      42
| 03-C           *IN42     DOWEQ'0'
|   C*
| 04-C           SD05      IFNE *ZERO
|   C                     ADD  1         IB
|   C                     MOVELSD04      B1,IB
|   C                     Z-ADDSD05      B3,IB
| 04-C                     END
|   C*
|   C           KEYSD     READESD0                      42
| 03-C                     END
|   C*
| 01-C                     END
|    C*
34===C                     ENDSR
     C*==============================================================*
     C*   RTN270... 薪資固定項目－調薪前薪資
     C*==============================================================*
35===C           RTN270    BEGSR
|    C*
|    C           KEYSD     SETLLSD0
|    C           KEYSD     READESD0                      42
|    C*
| 01-C           *IN42     DOWEQ'0'
|   C*
| 02-C           SD05      IFNE *ZERO
|   C                     Z-ADD1         I2      20
|   C           SD04      LOKUPB1,I2                    40
|   C*
| 03-C           *IN40     IFEQ '0'
|   C                     ADD  1         IB
|   C                     MOVELSD04      B1,IB
|   C                     Z-ADDSD05      B2,IB
| 03*C                     ELSE
|   C                     Z-ADDSD05      B2,I2
| 03-C                     END
|   C*
| 02-C                     END
|   C           KEYSD     READESD0                      42
| 01-C                     END
|    C*
35===C                     ENDSR
     C*==============================================================*
     C*   RTN280... 薪資固定項目－本月應給付
     C*==============================================================*
36===C           RTN280    BEGSR
|    C*
|    C                     Z-ADD1         I2
| 01-C           I2        DOWLEIB
|   C*
| 02-C           SH03M     IFEQ *ZERO                      .未調薪
|   C                     Z-ADDB3,I2     B2,I2
| 02-C                     END
|   C*
| 03-C           PW07      IFEQ PM102
|   C                     Z-ADDB2,I2     B4,I2
| 03*C                     ELSE
|   C           B2,I2     MULT PW07      WAMT
|   C           WAMT      DIV  PM102     B4,I2     H
| 03-C                     END
|   C*
|   C*本月調薪金額追加
| 04-C           SH03M     IFNE *ZERO                      .破月調薪
|   C           SH03M     ANDLT#YMDT                      .計薪止日
|   C           B3,I2     SUB  B2,I2     WAMT
|   C           WAMT      DIV  PM102     WAMT      H
|   C                     MULT P3211O    WAMT
|   C                     ADD  WAMT      B4,I2     H
| 04-C                     END
|   C*
|   C*應工作天數#PM102,發薪比例#SALR
|   C*          #EM10     IFEQ '1'                        半薪
|   C*                    Z-ADD15        #PM102  20
|   C*                    Z-ADD0.5       #SALR   21
|   C*                    END
|   C*          #EM10     IFEQ '2'                        全薪
|   C*                    Z-ADDPM102     #PM102
|   C*                    Z-ADD1         #SALR
|   C*                    END
|   C*          #EM10     IFEQ '3'                        無薪
|   C*                    Z-ADDPM102     #PM102
|   C*                    Z-ADD*ZERO     #SALR
|   C*                    END
|   C*
|   C*實領固定薪項
| 05-C*920319    B1,I2     IFEQ '12'
|   C*920319    B4,I2     MULT 0.5       B4,I2     H
| 05*C*920319              ELSE
|   C*920319    B4,I2     MULT 1         B4,I2     H
| 05-C*920319              END
|   C*920319
|   C                     ADD  1         I2
| 01-C                     END
|    C*
36===C                     ENDSR
     C*==============================================================*
     I/COPY PYRPGSRC,PYC02
     I/COPY PYRPGSRC,PYC03
