     A****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA4201                                    *
     H*    PROGRAM NAME :產生排班資料                            *
     H*    AUTHOR       : SHARON                                     *
     H*    CREATE DATE  : 94/01/14 A1386                             *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FPYEMPF  IF  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYT2PF  IP  E           K        DISK
     FPYA420W UF  E           K        DISK                      A
     I*---------------------------------------------------------------*
     E                    @T3        31  2               刷卡別
     I*---------------------------------------------------------------*
     I           UDS
     I                                      101 110 $USER
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      201 2060$A8YM
     I                                      201 2040$A8Y
     I                                      211 2160DDATE
     I*
     I            DS
     I                                        1   80DSDATE
     I                                        1   60DSYYMM
     I                                        7   80DSDD
     I            DS
     I                                        1   7 EM04
     I                                        1   1 EM041
     I                                        2   2 EM042
     I                                        3   3 EM043
     I                                        4   7 EM044
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEY4W     KLIST
     C                     KFLD           W201
     C                     KFLD           W202
     C                     KFLD           W203
     C           KEYEM     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C           KEYDP     KLIST
     C                     KFLD           DP011
     C                     KFLD           DP012
     C                     KFLD           DP013
     C                     KFLD           DP014
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     MOVEA*BLANKS   @T3
     C                     MOVEAT205      @T3
     C*
|    C                     Z-ADD0         X       20
|    C           LOOP      TAG
|    C                     ADD  1         X
|    C           X         IFGT 31
|    C                     GOTO NEXT
|    C                     END
|    C           @T3,X     IFNE *BLANKS
|    C                     MOVE T201      W201
|    C                     MOVE T202      W202
|    C                     Z-ADDT203      DSYYMM
|    C                     Z-ADDX         DSDD
|    C                     Z-ADDDSDATE    W203
|    C           KEY4W     CHAINPYA420W              40
|    C                     MOVEA@T3,X     W205
|    C                     MOVE T206      W206
|    C*
|    C                     MOVE T201      EM01
|    C                     MOVE T202      EM02
|    C           KEYEM     CHAINPYEMPF               44
|    C   44                DO
|    C                     MOVE *BLANKS   W206
|    C                     MOVE *BLANKS   W207
|    C                     END
|    C  N44                DO
|    C                     MOVE EM04      W206
|    C                     MOVE EM041     DP011
|    C                     MOVE EM042     DP012
|    C                     MOVE EM043     DP013
|    C                     MOVE EM044     DP014
|    C           KEYDP     CHAINPYDPPF               45
|    C   45                MOVE *BLANKS   W207
|    C  N45                MOVE DP02      W207
|    C                     END
|    C*
|    C   40                WRITEW20
|    C  N40                UPDATW20
|    C                     END
|    C                     GOTO LOOP
     C*
     C           NEXT      TAG
