     A****************************************************************
     H*   獂び戈癟м秨祇Τそ⌒舦┮Τ    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA4131                                    *
     H*    PROGRAM NAME :疭ヰ挡衡矪瞶                          *
     H*    AUTHOR       :                                            *
     H*    CREATE DATE  : 91/11/19                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :ㄆ羱戈╰参                              *
     H****************************************************************
     FPYEMPF  IP  E           K        DISK
     FPYLTPF  UF  E           K        DISK                      A
     FPYPYPF  IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FPYLUPF  UF  E           K        DISK                      A
     FPY2HPF  UF  E           K        DISK                      A
     I*================================================================
     I/COPY PYDDSSRC,PYPMDS01
     I/COPY PYDDSSRC,PYEMDS01
     I           UDS
     I                                      101 110 $USER
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      201 2060$A8YM
     I                                      201 2040$A8Y
     I                                      211 2160DDATE
     I*
     I                                      501 502 DEM01
     I                                      503 5050DYY
     I                                      506 5090WYY
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEY2H     KLIST
     C                     KFLD           EM01             そ絪腹
     C                     KFLD           EM02             絪腹
     C                     KFLD           WYY              
     C           KEY2H1    KLIST
     C                     KFLD           EM01             そ絪腹
     C                     KFLD           EM02             絪腹
     C                     KFLD           LYEAR            
     C           KEYPY     KLIST
     C                     KFLD           EM01             そ絪腹
     C                     KFLD           EM02             絪腹
     C           KEYLT     KLIST
     C                     KFLD           EM01             そ絪腹
     C                     KFLD           EM02             絪腹
     C                     KFLD           WYY              
     C           KEYLT1    KLIST
     C                     KFLD           EM01             そ絪腹
     C                     KFLD           EM02             絪腹
     C                     KFLD           LYEAR            
     C*PYLUPF
     C                     Z-ADD12        LMTH    20       る┏
     C           KEYLU     KLIST
     C                     KFLD           EM01             そ絪腹
     C                     KFLD           EM02             絪腹
     C                     KFLD           LYEAR            
     C                     KFLD           LMTH             る┏
     C           KEYLU1    KLIST
     C                     KFLD           EM01             そ絪腹
     C                     KFLD           EM02             絪腹
     C                     KFLD           WYY              さ
     C                     KFLD           LMTH             さる┏
     C*PYPMPF
     C                     MOVEL'01'      PM01    2
     C           KEYPM     KLIST
     C                     KFLD           PM01
     C                     KFLD           EM01             そ絪腹
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C           KEYPM     CHAINPM0                  41
  01-C           *IN41     IFEQ '0'
    C*
    C                     MOVELEM01      H201      P      そ
    C                     MOVELEM02      H202      P      
    C           DYY       ADD  1911      WYY
    C                     MOVELWYY       H203             疭ヰ
    C           WYY       MULT 100       KK      60       疭ヰ
    C           KK        ADD  12        H207             矪瞶る
    C*
    C*-------------------------------------------------------------***
    C*ヰ干ヰ肂璸衡
    C*
    C                     Z-ADD*ZERO     YSR     70       ヰ干祇
    C                     Z-ADD*ZERO     HSAR   103       羱
    C                     Z-ADD*ZERO     WPY03   70       ┏羱
    C*
    C           WYY       SUB  1         LYEAR   40
    C*          KEYLU     CHAINLU0                  46
  02-C*          *IN46     IFEQ '0'
    C*          LU05      SUB  LU06      WLU     51
  03-C*          WLU       IFEQ *ZERO
    C*                    Z-ADD*ZERO     YSR
  03*C*                    ELSE
    C*
    C           KEYPY     CHAINPY0                  47
    C  N47                Z-ADDPY03      WPY03
    C*
  04-C           EM100     IFEQ '1'                        る羱
    C           WPY03     DIV  PM102     HSAR      H
    C                     DIV  PM101     HSAR      H
  04*C                     ELSE
  05-C           EM100     IFEQ '2'                        ら羱
    C           WPY03     DIV  PM101     HSAR      H
  05-C                     END
  04-C                     END
    C*          HSAR      MULT WLU       YSR       H      ヰ干祇
  03-C*                    END
    C*
  02-C*                    END
    C*-------------------------------------------------------------***
    C           KEY2H     CHAINH20                  43
  06-C           *IN43     IFEQ '1'
    C*-------------------------------------------------------------***
    C*疭ヰぱ计璸衡疭ヰ计∽疭ヰぱ计’⒎
    C*
    C                     Z-ADD*ZERO     H204
    C*
    C*疭ヰ膀非る∽讽⒈る
    C*⒂㈡璸衡⒏ぇ疭ヰ疭ヰ膀非る∽⒏〓⒈
    C*
    C                     Z-ADD*ZERO     H203YM  60       セ膀非る
    C                     MOVELH203      H203YM
    C                     MOVE 12        H203YM
    C                     Z-ADD*ZERO     YMD     80
    C                     MOVELH203YM    YMD
    C                     MOVE 31        YMD
    C*
    C*る∽膀非る⌒戮ら戳る∠
    C*
    C                     Z-ADD*ZERO     WMM     40
    C                     Z-ADD*ZERO     KMM     40
    C                     Z-ADD*ZERO     WRKY    20
    C                     Z-ADD*ZERO     WRKM    20
    C                     CALL 'P33'
    C                     PARM EM13      P3301I  80       戮ら
    C                     PARM YMD       P3302I  80
    C                     PARM '2'       P3303I  1
    C                     PARM '1'       P3304I  1
    C           WMM       PARM           P3311O  70
    C                     PARM           P3312O  20
    C                     ADD  1         WMM              羆る计
    C**---------------------------------------------------------------
    C*璸衡痙戮氨羱る羆计
  07-C           EM261     IFNE 0
    C           EM261     DIV  30        KMM
    C*斗Ι埃痙戮氨羱琿琌羆る计
    C           WMM       SUB  KMM       WMM
  07-C                     END
    C                     Z-ADDWMM       H216
    C**---------------------------------------------------------------
    C           WMM       DIV  12        WRKY             计
    C                     MVR            WRKM             る计
    C*
    C                     Z-ADD*ZERO     DAY     52
    C                     Z-ADD*ZERO     DAY1    52
    C                     Z-ADD*ZERO     AA      20
    C                     Z-ADD*ZERO     BB      11
    C*----------------------------------------------------------------
    C*耞セ疭ヰぱ计
  08-C                     SELEC
    C*る≌
    C*疭ヰぱ计∽ぱ
    C           WMM       WHLT 12
    C                     Z-ADD0         H204
    C*る≈≌⒈
    C*疭ヰぱ计∽⒍’る〓⒈
    C           WMM       WHGT 12
    C           WMM       ANDLT24
    C           WRKM      MULT 7         DAY
    C           DAY       DIV  12        DAY
    C                     Z-ADDDAY       AA
    C                     Z-ADDDAY       BB
    C                     Z-ADDAA        H204
    C*
  09-C           BB        IFGT 0.5
    C                     ADD  1         H204
  09*C                     ELSE
    C                     ADD  0.5       H204
  09-C                     END
    C*
    C*る≈∽⒈≌∽⒉
    C*疭ヰぱ计∽⒍ぱ
    C           WMM       WHGE 24
    C           WMM       ANDLE36
    C                     Z-ADD7         H204
    C*
    C*る≈⒉≌⒊
    C*疭ヰぱ计∽’る〓⒈∠⒍’⒈⌒る〓⒈
    C           WMM       WHGT 36
    C           WMM       ANDLT48
    C           WRKM      MULT 10        DAY1
    C           DAY1      DIV  12        DAY1
    C*
    C           12        SUB  WRKM      WRKM
    C           WRKM      MULT 7         DAY
    C           DAY       DIV  12        DAY
    C*
    C                     ADD  DAY1      DAY
    C                     Z-ADDDAY       AA
    C                     Z-ADDDAY       BB
    C                     Z-ADDAA        H204
    C*
  10-C           BB        IFGT 0.5
    C                     ADD  1         H204
  10*C                     ELSE
    C                     ADD  0.5       H204
  10-C                     END
    C*
    C*る≈∽⒊≌∽⒋
    C*疭ヰぱ计∽ぱ
    C           WMM       WHGE 48
    C           WMM       ANDLE60
    C                     Z-ADD10        H204
    C*
    C*る≈⒋≌⒌
    C*疭ヰぱ计∽⒊’る〓⒈∠’⒈⌒る〓⒈
    C           WMM       WHGT 60
    C           WMM       ANDLT72
    C           WRKM      MULT 14        DAY1
    C           DAY1      DIV  12        DAY1
    C*
    C           12        SUB  WRKM      WRKM
    C           WRKM      MULT 10        DAY
    C           DAY       DIV  12        DAY
    C*
    C                     ADD  DAY1      DAY
    C                     Z-ADDDAY       AA
    C                     Z-ADDDAY       BB
    C                     Z-ADDAA        H204
    C*
  11-C           BB        IFGT 0.5
    C                     ADD  1         H204
  11*C                     ELSE
    C                     ADD  0.5       H204
  11-C                     END
    C*
    C*る≈∽⒌≌∽
    C*疭ヰぱ计∽⒊ぱ
    C           WMM       WHGE 72
    C           WMM       ANDLE120
    C                     Z-ADD14        H204
    C*
    C*る≈≌
    C*疭ヰぱ计∽⒊∠る〓⒈
    C           WMM       WHGT 120
    C           WMM       ANDLT132
    C           WRKM      DIV  12        DAY
    C                     ADD  14        DAY
    C                     Z-ADDDAY       AA
    C                     Z-ADDDAY       BB
    C                     Z-ADDAA        H204
    C*
  12-C           BB        IFGT 0.5
    C                     ADD  1         H204
  12*C                     ELSE
    C                     ADD  0.5       H204
  12-C                     END
    C*
    C*る≈∽
    C*疭ヰぱ计∽14ぱ硋仓
    C           WMM       WHGE 132
    C                     Z-ADD132       XXX     40
    C                     Z-ADD14        DAY
  13-C           WMM       DOWGEXXX
    C                     ADD  12        WXXX    40
  14-C           XXX       IFGE WXXX
    C                     ADD  12        XXX
    C                     ADD  1         DAY
  14-C                     END
  13-C                     END
    C                     Z-ADDDAY       H204
    C*
    C*疭ヰ程⒉ぱ
  15-C           H204      IFGT 30
    C                     Z-ADD30        H204
  15-C                     END
    C*
  08-C                     END
    C*
    C*-------------------------------------------------------------***
    C*璸衡膀非璸羱羆计
    C*玡ゼヰぱ计∽ヰ干祇
    C*
    C                     SUB  1         WYY              
    C*
    C                     Z-ADD*ZERO     HR      41       膀非计
    C*
    C                     Z-ADD*ZERO     TOT1    41
    C                     Z-ADD*ZERO     FLDT1   41       ヰ羆计
    C                     Z-ADD*ZERO     FLDT2   41       ヰ羆计
    C                     Z-ADD*ZERO     FLDT3   41       ゼヰ羆计
    C                     Z-ADD*ZERO     H205             安ч祇⌒ぱ计
    C                     Z-ADD*ZERO     H205H            安ч祇⌒计
    C                     Z-ADD*ZERO     H208             ヰ安⌒ぱ
    C                     Z-ADD*ZERO     H208H            ヰ安⌒
    C                     Z-ADD*ZERO     H209             ヰ安⌒ぱ
    C                     Z-ADD*ZERO     H209H            ヰ安⌒
    C                     Z-ADD*ZERO     H210             ゼヰ安⌒ぱ
    C                     Z-ADD*ZERO     H210H            ゼヰ安⌒
    C*
    C*LT10=セ疭ヰ安
    C*LT11=セヰ⌒ぱ LT13=锣ヰ⌒ぱ LT15=箇⌒ぱ
    C*LT12=セヰ⌒ LT14=锣ヰ⌒ LT16=箇⌒
    C*
    C           KEYLT1    CHAINLT0                  40
  16-C           *IN40     IFEQ '0'
    C*
    C                     Z-ADDLT15      LT15L   30
    C                     Z-ADDLT16      LT16L   10
    C*
    C           LT10      ADD  LT13      TOT1    41
    C                     ADD  LT15      TOT1
    C           TOT1      MULT 8         FLDT1   41
    C                     ADD  LT14      FLDT1
    C                     ADD  LT16      FLDT1            ヰ羆计
    C*
    C           LT11      MULT 8         FLDT2   41
    C                     ADD  LT12      FLDT2            ヰ羆计
    C*
    C           FLDT1     SUB  FLDT2     FLDT3   41       ゼヰ羆计
    C*                    SUB  WLU       FLDT3                    计
    C*
  16-C                     END
    C*
    C                     ADD  1         WYY
    C*
    C*ヰ安ぱ计计
  17-C           FLDT1     IFNE *ZERO
    C           FLDT1     DIV  PM101     H208
    C                     MVR            H208H
  17-C                     END
    C*
    C*ヰ安ぱ计计
  18-C           FLDT2     IFNE *ZERO
    C           FLDT2     DIV  PM101     H209
    C                     MVR            H209H
  18-C                     END
    C*
    C*ゼヰ安ぱ计计
  13-C           FLDT3     IFNE *ZERO
    C           FLDT3     DIV  PM101     H210
    C                     MVR            H210H
  13-C                     END
    C*
    C*
    C*                    Z-ADDYSR       H206
     C                     EXSR RTN300
    C*-------------------------------------------------------------***
    C*ч祇肂ぃ箂
  19-C           H206      IFLE *ZERO
    C                     Z-ADD*ZERO     H206
  19-C                     END
    C*
     C*940105 ALLEN SUB 1 H203    SUB 100 H207
     C*                    SUB  1         H203
     C*                    SUB  100       H207
    C                     Z-ADD$A8YMD    H297
    C                     TIME           H298
    C                     MOVEL$USER     H299
    C*
    C                     WRITEH20
  06-C                     END
    C*-------------------------------------------------------------***
    C           KEYLU1    CHAINLU0                  43
  20-C           *IN43     IFEQ '1'
    C*
    C                     MOVELH201      LU01      P      そ
    C                     MOVELH202      LU02      P      
    C                     Z-ADDH203      LU03             
    C                     Z-ADD12        LU04             る
    C                     Z-ADDFLDT3     LU05             セヰ安⌒ぱ
    C                     Z-ADD0         LU06             セヰ安⌒
    C                     Z-ADD$A8YMD    LU97             癘魁穝ら戳
    C                     TIME           LU98
    C                     MOVEL$USER     LU99
    C                     WRITELU0
  20-C                     END
    C*
    C*-------------------------------------------------------------***
    C           KEYLT     CHAINLT0                  43
  21-C           *IN43     IFEQ '1'
    C*
    C                     MOVELH201      LT01      P      そ
    C                     MOVELH202      LT02      P      
    C                     Z-ADDWYY       LT03             疭ヰ
    C                     Z-ADDH204      LT10             セ疭ヰぱ计
    C                     Z-ADD0         LT11             セヰ安⌒ぱ
    C                     Z-ADD0         LT12             セヰ安⌒
    C                     Z-ADDH210      LT13             锣ヰ安⌒ぱ
    C                     Z-ADDH210H     LT14             锣ヰ安⌒
    C                     Z-ADD0         LT15             箇安⌒ぱ
    C                     Z-ADD0         LT16             箇安⌒
    C                     Z-ADDLT15L     LT17             安⌒ぱ
    C                     Z-ADDLT16L     LT18             安⌒
    C                     Z-ADD0         LT20
    C                     Z-ADD0         LT21
    C                     Z-ADD0         LT22
    C                     Z-ADD0         LT23
    C                     Z-ADD0         LT24
    C                     Z-ADD0         LT25
    C                     Z-ADD0         LT26
    C                     Z-ADD0         LT96             羱戈矪瞶る
    C                     Z-ADD$A8YMD    LT97             癘魁穝ら戳
    C                     TIME           LT98
    C                     MOVEL$USER     LT99
    C                     WRITELT0
  21-C                     END
    C*
  01-C                     END
     C*
     C*===============================================================
     C* RTN300
     C*==============================================================
01===C           RTN300    BEGSR
|    C*LT10=セ疭ヰ安
|    C*LT11=セヰ⌒ぱ LT13=锣ヰ⌒ぱ LT15=箇⌒ぱ
|    C*LT12=セヰ⌒ LT14=锣ヰ⌒ LT16=箇⌒
|    C*
|    C           KEYLT1    CHAINLT0                  40
| 01-C           *IN40     IFEQ '0'
|   C*
|   C           LT11      MULT 8         FLD     40
|   C           FLD       ADD  LT12      FLD
|   C*
|   C           LT10      MULT 8         FLD2    40
|   C           LT13      MULT 8         FLD3    40
|   C           FLD3      ADD  LT14      FLD3
|   C*
| 02-C           FLD       IFLE FLD2
|   C*
|   C           FLD3      MULT HSAR      H206
| 02*C                     ELSE
|   C           FLD       SUB  FLD2      FLD5    40
|   C           FLD5      MULT HSAR      H206
|   C*
| 02-C                     END
| 01-C                     END
01===C                     ENDSR
