     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM NAME : PYA4012                                    *
     H*    PROGRAM NAME :公司獎金資料建立　                        *
     H*    AUTHER       : EVA A1274                                  *
     H*    CREATE DATE  : 89/04/08                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYEMPF  IP  E           K        DISK
     FPYPBPF  UF  E           K        DISK                      A
     E*---------------------------------------------------------------
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      211 2160DDATE
     I*
     I                                      501 502 DEM01
     I                                      503 5060WYEAR
     I                                      507 508 DTYPE
     I                                      509 5160WYMD
     I                                      509 5140WPB05
     I                                      515 5160WPB05D
     I                                      531 535 DEM04S
     I                                      536 540 DEM04E
     I                                      541 545 WEM04S
     I                                      546 550 WEM04E
     I                                      559 559 DOPT
     I                                      560 5660DMNY
     I                                      601 640 DPB13
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*==============================================================*
     C*                    KEY  LIST
     C*==============================================================*
     C*
     C           KEYPB     KLIST
     C                     KFLD           DEM01            .公司
     C                     KFLD           EM02             .員工
     C                     KFLD           WYEAR            .獎金年度
     C                     KFLD           DTYPE            .獎金類別
     C                     KFLD           WPB05            .發放年月
     C                     KFLD           WPB05D           .發放日期
     C*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     .INIT.
     C*
     C*
     C*
     C                     EXSR RTN202                     .固定金額
     C*
     C*
     C                     EXSR RTN400                     . WRITE PB0
     C*==============================================================*
     C*          RTN010... INITIAL PROCESS
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*     RTN202 :固定金額獎金
     C*==============================================================*
02===C           RTN202    BEGSR
|    C*
|    C*                    Z-ADDDMNY      PB06             .獎金金額
|    C*
02===C           END202    ENDSR
     C*==============================================================*
     C*          RTN400   寫入獎金資料檔中　 PYPBPF
     C*==============================================================*
03===C           RTN400    BEGSR
|    C*
|    C*
|    C           KEYPB     CHAINPB0                  43
| 01-C           *IN43     IFEQ '0'
|   C           PB96      ANDEQ*ZERO                      .未核定
|   C                     EXSR RTN401
|   C*
|   C*獎金金額＝0時．該筆資料不寫入
| 02-C           PB06      IFEQ *ZERO
|   C                     DELETPB0
| 02*C                     ELSE
|   C                     UPDATPB0
| 02-C                     END
|   C*
|   C*-------------------------------------------------------------***
| 01*C                     ELSE
|   C                     EXSR RTN401
|   C*
|   C*獎金金額＝0時．該筆資料不寫入
| 03-C           PB06      IFEQ *ZERO
|   C                     GOTO END400
| 03*C                     ELSE
|   C                     WRITEPB0
| 03-C                     END
| 01-C                     END
|    C*
03===C           END400    ENDSR
     C*==============================================================*
     C*          RTN401    GET DATA FOR CHECKING PYPBPF
     C*==============================================================*
04===C           RTN401    BEGSR
|    C*
|    C                     MOVELDEM01     PB01             .公司編號
|    C                     MOVELEM02      PB02             .員工編號
|    C                     Z-ADDWYEAR     PB03             .獎金年度
|    C                     MOVELDTYPE     PB04             .獎金類別
|    C                     Z-ADDWPB05     PB05             .發放年月
|    C                     Z-ADDWPB05D    PB05D            .發放日
|    C                     Z-ADDDMNY      PB06             .獎金金額
|    C*
|    C                     Z-ADD*ZERO     PB07             .獎金稅率
|    C                     Z-ADD*ZERO     PB08
|    C*
|    C                     Z-ADD*ZERO     PB09             .勞保費　
|    C                     Z-ADD*ZERO     PB10             .健保費　
|    C                     Z-ADD*ZERO     PB11             .其他扣項
|    C                     Z-ADD*ZERO     PB12
|    C*
|    C           PB06      SUB  PB08      PB12             .實領總額
|    C                     MOVELDPB13     PB13             .發放說明
|    C                     Z-ADD*ZERO     PB96             .核定日期
|    C                     Z-ADD$A8YMD    PB97
|    C                     TIME           WTIME  120
|    C                     MOVELWTIME     PB98
|    C                     MOVEL$USER     PB99
|    C*
04===C           END401    ENDSR
     C*==============================================================*
