     A****************************************************************
     H*   獂び戈癟м秨祇Τそ⌒舦┮Τ    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA4071                                    *
     H*    PROGRAM NAME :安уΩ矪瞶                          *
     H*    AUTHOR       : TOM T.                                     *
     H*    CREATE DATE  : 89/11/29                                   *
     H*    UPDATE DATE  : 90/05/25 A1274 EVA                         *
     H*    SYSTEM       :ㄆ羱戈╰参                              *
     H****************************************************************
     FPYEMPF  IP  E           K        DISK
     F*PYVAPF  IF  E           K        DISK
     FPYLTPF  IF  E           K        DISK
     FPYPYPF  IF  E           K        DISK
     FPYPDPF  IF  E           K        DISK
     FPYPD1PF IF  E           K        DISK
     FPYPSPF  IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FPY2HPF  UF  E           K        DISK                      A
     I*================================================================
     I/COPY PYDDSSRC,PYPMDS01
     I           UDS
     I                                      101 110 $USER
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      203 2060$A8YM
     I                                      201 2040$A8Y
     I                                      211 2160DDATE
     I*
     I                                      501 502 DER01
     I                                      503 5070DER03
     I                                      503 5050DER03Y
     I                                      506 5070DER03M
     I                                      511 5160WER03
     I                                      511 5140WER03Y
     I            DS
     I                                        1   80ER03
     I                                        1   50ER03Y
     I                                        5   60ER03M
     I                                        1   60ER03YM
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEY2H     KLIST
     C                     KFLD           DER01            そ絪腹
     C                     KFLD           EM02             絪腹
     C                     KFLD           H203             
     C           KEYPY     KLIST
     C                     KFLD           DER01            そ絪腹
     C                     KFLD           EM02             絪腹
     C           KEYLT     KLIST
     C                     KFLD           DER01            そ絪腹
     C                     KFLD           EM02             絪腹
     C                     KFLD           WER03Y           
     C*PYPMPF
     C                     MOVEL'01'      PM01    2
     C           KEYPM     KLIST
     C                     KFLD           PM01
     C                     KFLD           DER01            そ絪腹
     C           KEYPDA    KLIST
     C                     KFLD           DER01            そ絪腹
     C                     KFLD           EM02             絪腹
     C                     KFLD           PD102            羱戈兜ヘ
     C           KEYPS     KLIST
     C                     KFLD           EM06             戮单絪腹
     C                     KFLD           EM07             戮絪腹
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C                     MOVELWER03     WYM     60
     C*
     C                     MOVELEM01      H201      P      そ
     C           KEYPM     CHAINPM0                  41
  01-C           *IN41     IFEQ '0'
    C*
    C                     MOVELEM02      H202      P      
    C                     MOVELWER03Y    H203             疭ヰ
    C                     Z-ADDWER03     H207             矪瞶る
    C*
    C*-------------------------------------------------------------***
    C           KEY2H     CHAINPY2HPF               43
  02-C           *IN43     IFEQ '1'
    C*-------------------------------------------------------------***
    C*疭ヰぱ计璸衡疭ヰ计∽疭ヰぱ计’⒎
    C*
    C                     Z-ADD*ZERO     H204
    C*
    C*疭ヰ膀非る∽讽⒈る
    C*⒂㈡璸衡⒏ぇ疭ヰ疭ヰ膀非る∽⒏〓⒈
    C*
    C                     Z-ADD*ZERO     H203YM  60       セ膀非る
    C                     MOVELH203      H203YM
    C                     MOVE 12        H203YM
    C                     Z-ADD*ZERO     YMD     80
    C                     MOVELH203YM    YMD
    C                     MOVE 31        YMD
    C*
    C*る∽膀非る⌒戮ら戳る∠
    C*
    C                     Z-ADD*ZERO     WMM     40
    C                     Z-ADD*ZERO     KMM     40
    C                     Z-ADD*ZERO     WRKY    20
    C                     Z-ADD*ZERO     WRKM    20
    C                     CALL 'P33'
    C                     PARM EM13      P3301I  80       戮ら
    C                     PARM YMD       P3302I  80
    C                     PARM '2'       P3303I  1
    C                     PARM '1'       P3304I  1
    C           WMM       PARM           P3311O  70
    C                     PARM           P3312O  20
    C                     ADD  1         WMM              羆る计
    C**---------------------------------------------------------------
    C*璸衡痙戮氨羱る羆计
    C           EM261     IFNE 0
    C           EM261     DIV  30        KMM
    C*斗Ι埃痙戮氨羱琿琌羆る计
    C           WMM       SUB  KMM       WMM
    C                     END
    C**---------------------------------------------------------------
    C           WMM       DIV  12        WRKY             计
    C                     MVR            WRKM             る计
    C*
    C                     Z-ADD*ZERO     DAY     52
    C                     Z-ADD*ZERO     DAY1    52
    C                     Z-ADD*ZERO     AA      20
    C                     Z-ADD*ZERO     BB      11
    C*----------------------------------------------------------------
    C*耞セ疭ヰぱ计
  03-C                     SELEC
    C*る≌
    C*疭ヰぱ计∽ぱ
    C           WMM       WHLT 12
    C                     Z-ADD0         H204
    C*る≈≌⒈
    C*疭ヰぱ计∽⒍’る〓⒈
    C           WMM       WHGT 12
    C           WMM       ANDLT24
    C           WRKM      MULT 7         DAY
    C           DAY       DIV  12        DAY
    C                     Z-ADDDAY       AA
    C                     Z-ADDDAY       BB
    C                     Z-ADDAA        H204
    C*
  04-C           BB        IFGT 0.5
    C                     ADD  1         H204
  04*C                     ELSE
    C                     ADD  0.5       H204
  04-C                     END
    C*
    C*る≈∽⒈≌∽⒉
    C*疭ヰぱ计∽⒍ぱ
    C           WMM       WHGE 24
    C           WMM       ANDLE36
    C                     Z-ADD7         H204
    C*
    C*る≈⒉≌⒊
    C*疭ヰぱ计∽’る〓⒈∠⒍’⒈⌒る〓⒈
    C           WMM       WHGT 36
    C           WMM       ANDLT48
    C           WRKM      MULT 10        DAY1
    C           DAY1      DIV  12        DAY1
    C*
    C           12        SUB  WRKM      WRKM
    C           WRKM      MULT 7         DAY
    C           DAY       DIV  12        DAY
    C*
    C                     ADD  DAY1      DAY
    C                     Z-ADDDAY       AA
    C                     Z-ADDDAY       BB
    C                     Z-ADDAA        H204
    C*
  05-C           BB        IFGT 0.5
    C                     ADD  1         H204
  05*C                     ELSE
    C                     ADD  0.5       H204
  05-C                     END
    C*
    C*る≈∽⒊≌∽⒋
    C*疭ヰぱ计∽ぱ
    C           WMM       WHGE 48
    C           WMM       ANDLE60
    C                     Z-ADD10        H204
    C*
    C*る≈⒋≌⒌
    C*疭ヰぱ计∽⒊’る〓⒈∠’⒈⌒る〓⒈
    C           WMM       WHGT 60
    C           WMM       ANDLT72
    C           WRKM      MULT 14        DAY1
    C           DAY       DIV  12        DAY1
    C*
    C           12        SUB  WRKM      WRKM
    C           WRKM      MULT 7         DAY
    C           DAY       DIV  12        DAY
    C*
    C                     ADD  DAY1      DAY
    C                     Z-ADDDAY       AA
    C                     Z-ADDDAY       BB
    C                     Z-ADDAA        H204
    C*
  06-C           BB        IFGT 0.5
    C                     ADD  1         H204
  06*C                     ELSE
    C                     ADD  0.5       H204
  06-C                     END
    C*
    C*る≈∽⒌≌∽
    C*疭ヰぱ计∽⒊ぱ
    C           WMM       WHGE 72
    C           WMM       ANDLE120
    C                     Z-ADD14        H204
    C*
    C*る≈≌
    C*疭ヰぱ计∽⒊∠る〓⒈
    C           WMM       WHGT 120
    C           WMM       ANDLT132
    C           WRKM      DIV  12        DAY
    C                     ADD  14        DAY
    C                     Z-ADDDAY       AA
    C                     Z-ADDDAY       BB
    C                     Z-ADDAA        H204
    C*
  07-C           BB        IFGT 0.5
    C                     ADD  1         H204
  07*C                     ELSE
    C                     ADD  0.5       H204
  07-C                     END
    C*
    C*る≈∽
    C*疭ヰぱ计∽⒊∠⌒∠る〓⒈
    C           WMM       WHGE 132
    C                     ADD  14        WRKY
    C           WRKY      SUB  10        WRKY
    C           WRKM      DIV  12        DAY
    C                     ADD  WRKY      DAY
    C                     Z-ADDDAY       AA
    C                     Z-ADDDAY       BB
    C                     Z-ADDAA        H204
    C*
  08-C           BB        IFGT 0.5
    C                     ADD  1         H204
  08*C                     ELSE
    C                     ADD  0.5       H204
  08-C                     END
    C*
  03-C                     END
    C*
    C*-------------------------------------------------------------***
    C*璸衡膀非璸羱羆计
    C*ゼヰぱ计≌∽疭ヰ羆计ぇ⒋玥场烩疭ヰゼヰ
    C*ゼヰぱ计≈∽疭ヰ羆计ぇ⒋患┑
    C*禬⒋ぇ计患┑
    C*
    C                     SUB  1         WER03Y           
    C*
    C                     Z-ADD*ZERO     HR      41       膀非计
    C*
    C                     Z-ADD*ZERO     TOT1    41
    C                     Z-ADD*ZERO     FLDT1   41       ヰ羆计
    C                     Z-ADD*ZERO     FLDT2   41       ヰ羆计
    C                     Z-ADD*ZERO     FLDT3   41       ゼヰ羆计
    C                     Z-ADD*ZERO     H205             安ч祇⌒ぱ计
    C                     Z-ADD*ZERO     H205H            安ч祇⌒计
    C                     Z-ADD*ZERO     H208             ヰ安⌒ぱ
    C                     Z-ADD*ZERO     H208H            ヰ安⌒
    C                     Z-ADD*ZERO     H209             ヰ安⌒ぱ
    C                     Z-ADD*ZERO     H209H            ヰ安⌒
    C                     Z-ADD*ZERO     H210             ゼヰ安⌒ぱ
    C                     Z-ADD*ZERO     H210H            ゼヰ安⌒
    C*
    C*LT10=セ疭ヰ安
    C*LT11=セヰ⌒ぱ LT13=锣ヰ⌒ぱ LT15=箇⌒ぱ
    C*LT12=セヰ⌒ LT14=锣ヰ⌒ LT16=箇⌒
    C*
    C           KEYLT     CHAINLT0                  40
  09-C           *IN40     IFEQ '0'
    C*
    C           LT10      ADD  LT13      TOT1    41
    C                     ADD  LT15      TOT1
    C           TOT1      MULT 8         FLDT1   41
    C                     ADD  LT14      FLDT1
    C                     ADD  LT16      FLDT1            ヰ羆计
    C*
    C           LT11      MULT 8         FLDT2   41
    C                     ADD  LT12      FLDT2            ヰ羆计
    C*
    C           FLDT1     SUB  FLDT2     FLDT3   41       ゼヰ羆计
    C*
  09-C                     END
    C                     ADD  1         WER03Y
    C*
    C*ヰ安ぱ计计
  10-C           FLDT1     IFNE *ZERO
    C           FLDT1     DIV  PM101     H208
    C                     MVR            H208H
  10-C                     END
    C*
    C*ヰ安ぱ计计
  11-C           FLDT2     IFNE *ZERO
    C           FLDT2     DIV  PM101     H209
    C                     MVR            H209H
  11-C                     END
    C*
    C*ゼヰ安ぱ计计
  12-C           FLDT3     IFNE *ZERO
    C           FLDT3     DIV  PM101     H210
    C                     MVR            H210H
  12-C                     END
    C*
    C*ч祇膀非计∽疭ヰ计ぇ⒋
    C           LT10      MULT PM108     HR
    C           HR        MULT 0.5       HR
    C*
    C*安ч祇ぱ计计
    C*程ч祇疭ヰ计ぇ⒋
  13-C           FLDT3     IFGE HR
    C           FLDT3     SUB  HR        CC      41
    C           CC        DIV  PM101     H210             ゼヰ⌒ぱ计
    C                     MVR            H210H            ゼヰ⌒计
    C           HR        DIV  PM101     H205             ч祇ぱ计
    C                     MVR            H205H            ч祇计
  13*C                     ELSE
    C           FLDT3     DIV  PM101     H205
    C                     MVR            H205H
  13-C                     END
    C*-------------------------------------------------------------***
    C           KEYPS     CHAINPS0                  40
    C*膟ぃ祇ч祇
    C*戮嘿絏=(B1,DA,DB,DC,DD)ぃ祇ч祇
    C*戮单=(11,12)ぃ祇ч祇
  14-C           EM321     IFEQ 'F'                        瓣
    C*911018S   EM05      OREQ 'B1'
    C*          EM05      OREQ 'DA'
    C*          EM05      OREQ 'DB'
    C*          EM05      OREQ 'DC'
    C*          EM05      OREQ 'DD'
    C*          PS01      OREQ '11'
    C*911018E   PS01      OREQ '12'
    C                     Z-ADD*ZERO     H206
    C*
  14*C                     ELSE
    C*
    C*璸衡莱祇ぇ璸衡膀非肂
    C*膀非郎ぇ兜ヘ肂璸衡
    C*
    C                     Z-ADD*ZERO     SAR     70
    C                     Z-ADD*ZERO     HMNY    81       羱
    C                     Z-ADD*ZERO     H206
    C*
    C           KEYPY     CHAINPYPYPF               40
  15-C           *IN40     IFEQ '0'
    C                     Z-ADDPY03      SAR
    C                     Z-ADDPY03      H211             セ肂
  15-C                     END
    C*
    C           DER01     SETLLPD10
    C           DER01     READEPD10                     46
  17-C           *IN46     DOWEQ'0'
    C*
    C                     SETOF                     45
    C           KEYPDA    CHAINPD0                  45
    C  N45                ADD  PD04      SAR
    C*
    C           DER01     READEPD10                     46
  17-C                     END
    C*
    C*烩ネ玻贱罿贱蠢
  16-C           EM133     IFEQ 'A'
    C           EM133     OREQ 'B'
    C           KEYPS     CHAINPS0                  40
    C  N40                ADD  PS10      SAR
  16-C                     END
    C*
    C*-------------------------------------------------------------***
    C*чら计彼き
    C                     Z-ADD*ZERO     WH205   42
    C           HR        DIV  PM108     WH205
    C*-------------------------------------------------------------***
    C*(羱兜羆〓⒉’逞緇ぱ计∽ヰ安
    C           SAR       DIV  30        HMNY             ら羱
    C           HMNY      MULT WH205     H206      H      ч祇肂
    C*-------------------------------------------------------------***
    C*ч祇肂ぃ箂
  19-C           H206      IFLE *ZERO
    C                     Z-ADD*ZERO     H206
  19-C                     END
    C*
  14-C                     END
    C*
    C                     Z-ADD$A8YMD    H297
    C                     TIME           H298
    C                     MOVEL$USER     H299
    C*-------------------------------------------------------------***
    C*
    C                     WRITEH20
  02-C                     END
    C*
  01-C                     END
     C*
     C*==============================================================*
