     H****************************************************************
     H*            泛太資訊科技開發股份有限公司－版權所有          *
     H*--------------------------------------------------------------*
     H*    PROGRAM NAME : PYA411                                     *
     H*    AUTHOR       : A1325  SANTOS                              *
     H*    CREATE DATE  : 91/07/19                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       : MIRS                                       *
     H*    SUBSYSTEM    : EL                                         *
     H****************************************************************
     FPYPPPF  UF  E           K        DISK                      A
     FPYPQPF  UF  E           K        DISK                      A
     FPYEMLF07IF  E           K        DISK
     FPYEMLF02IF  E           K        DISK
     F            EM0                               KRENAMEEML2
     FPYTRLF01IF  E           K        DISK
     FPYTRLF02IF  E           K        DISK
     F            TR0                               KRENAMETRL2
     FPYTRLF03IF  E           K        DISK
     F            TR0                               KRENAMETRL3
     FPYT7LF01IF  E           K        DISK
     FPYLVLF07IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FPYT2LF01IF  E           K        DISK
     FPYOVLF01IF  E           K        DISK
     FPYT1PF  IF  E           K        DISK
     FPYA411D CF  E                    WORKSTN      KINFDS DSPFDS
     F                                        RRN   KSFILE SFLSR
     E*---------------------------------------------------------------*
     E                    @A01        5  1               作業權利
     E                    WFUN    5   5  6               作業方式
     E                    WA         16  2               檢查SFL資料是否重復
     E                    @T1        31  2               排班工時
     E                    @AR1      999  8               員工編號
     E                    @DAY       31  8 0             休假日期
     E*---------------------------------------------------------------*
     IEML2
     I              EM01                            EM01L
     I              EM02                            EM02L
     I              EM03                            EM03L
     I              EM031                           EM031L
     I              EM041                           EM041L
     I              EM042                           EM042L
     I              EM043                           EM043L
     I              EM044                           EM044L
     I              EM11                            EM11L
     I              EM13                            EM13L
     I              EM19                            EM19L
     I              EM20                            EM20L
     ITRL2
     I              TR01                            TR01L
     I              TR011                           TR011L
     I              TR012                           TR012L
     I              TR02                            TR02L
     I              TR03                            TR03L
     I              TR04                            TR04L
     I              TR051                           TR051L
     I              TR052                           TR052L
     I              TR053                           TR053L
     I              TR054                           TR054L
     I              TR061                           TR061L
     I              TR062                           TR062L
     I              TR063                           TR063L
     I              TR064                           TR064L
     I              TR07                            TR07L
     I              TR08                            TR08L
     I              TR09                            TR09L
     I              TR10                            TR10L
     I              TR11                            TR11L
     I              TR12                            TR12L
     I              TR13                            TR13L
     I              TR14                            TR14L
     I              TR15                            TR15L
     I              TR16                            TR16L
     I              TR17                            TR17L
     I              TR18                            TR18L
     I              TR19                            TR19L
     I              TR20                            TR20L
     I              TR211                           TR211L
     I              TR212                           TR212L
     I              TR213                           TR213L
     I              TR214                           TR214L
     I              TR215                           TR215L
     I              TR216                           TR216L
     I              TR221                           TR221L
     I              TR222                           TR222L
     I              TR231                           TR231L
     I              TR232                           TR232L
     I              TR96                            TR96L
     I              TR97                            TR97L
     I              TR98                            TR98L
     I              TR99                            TR99L
     ITRL3
     I              TR01                            TR01A
     I              TR011                           TR011A
     I              TR012                           TR012A
     I              TR02                            TR02A
     I              TR03                            TR03A
     I              TR04                            TR04A
     I              TR051                           TR051A
     I              TR052                           TR052A
     I              TR053                           TR053A
     I              TR054                           TR054A
     I              TR061                           TR061A
     I              TR062                           TR062A
     I              TR063                           TR063A
     I              TR064                           TR064A
     I              TR07                            TR07A
     I              TR08                            TR08A
     I              TR09                            TR09A
     I              TR10                            TR10A
     I              TR11                            TR11A
     I              TR12                            TR12A
     I              TR13                            TR13A
     I              TR14                            TR14A
     I              TR15                            TR15A
     I              TR16                            TR16A
     I              TR17                            TR17A
     I              TR18                            TR18A
     I              TR19                            TR19A
     I              TR20                            TR20A
     I              TR211                           TR211A
     I              TR212                           TR212A
     I              TR213                           TR213A
     I              TR214                           TR214A
     I              TR215                           TR215A
     I              TR216                           TR216A
     I              TR221                           TR221A
     I              TR222                           TR222A
     I              TR231                           TR231A
     I              TR232                           TR232A
     I              TR96                            TR96A
     I              TR97                            TR97A
     I              TR98                            TR98A
     I              TR99                            TR99A
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I                                    B 378 3790#DRRN
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I*
     I            DS
     I                                        1  62 @T1
     I                                        1  62 DT205
     I*
     I            DS
     I                                        1   7 PP04
     I                                        1   1 PP041
     I                                        2   2 PP042
     I                                        3   3 PP043
     I                                        4   7 PP044
     I            DS
     I                                        1   7 PQ04
     I                                        1   1 PQ041
     I                                        2   2 PQ042
     I                                        3   3 PQ043
     I                                        4   7 PQ044
     I            DS
     I                                        1   7 DPP04
     I                                        1   1 DPP041
     I                                        2   2 DPP042
     I                                        3   3 DPP043
     I                                        4   7 DPP044
     I            DS
     I                                        1   7 EM04
     I                                        1   1 EM041
     I                                        2   2 EM042
     I                                        3   3 EM043
     I                                        4   7 EM044
     I            DS
     I                                        1   7 TR05
     I                                        1   1 TR051
     I                                        2   2 TR052
     I                                        3   3 TR053
     I                                        4   7 TR054
     I            DS
     I                                        1   7 TR06
     I                                        1   1 TR061
     I                                        2   2 TR062
     I                                        3   3 TR063
     I                                        4   7 TR064
     I            DS
     I                                        1   7 TR05L
     I                                        1   1 TR051L
     I                                        2   2 TR052L
     I                                        3   3 TR053L
     I                                        4   7 TR054L
     I            DS
     I                                        1   7 TR06L
     I                                        1   1 TR061L
     I                                        2   2 TR062L
     I                                        3   3 TR063L
     I                                        4   7 TR064L
     I            DS
     I                                        1   7 TR05A
     I                                        1   1 TR051A
     I                                        2   2 TR052A
     I                                        3   3 TR053A
     I                                        4   7 TR054A
     I            DS
     I                                        1   7 TR06A
     I                                        1   1 TR061A
     I                                        2   2 TR062A
     I                                        3   3 TR063A
     I                                        4   7 TR064A
     I            DS
     I                                        1   80DYMD
     I                                        1   40DYY
     I                                        1   60DYM
     I                                        5   60DMM
     I                                        7   80DD
     I            DS
     I                                        1   80KYMD
     I                                        1   40KYY1
     I                                        1   60KYM1
     I                                        5   60KMM1
     I                                        7   80KD1
     I            DS
     I                                        1   80WDATE
     I                                        1   40WYY
     I                                        1   60WYM
     I                                        5   60WMM
     I                                        7   80WDD
     I            DS
     I                                        1   80DEM13
     I                                        1   40EM13Y
     I                                        5   60EM13M
     I                                        1   60EM13YM
     I                                        7   80EM13D
     I            DS
     I                                        1   80DEM19
     I                                        1   40EM19Y
     I                                        5   60EM19M
     I                                        1   60EM19YM
     I                                        7   80EM19D
     I            DS
     I                                        1   80KEM13
     I                                        1   40KEM13Y
     I                                        5   60KEM13M
     I                                        1   60KMN2
     I                                        7   80KEM13D
     I/COPY PYDDSSRC,PYPMDS01
     I/COPY PYDDSSRC,PYEMDS01
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN CM004O    DFMT
     C           *LIKE     DEFN CM005O    DTYPE
     C           *LIKE     DEFN RRN       @DRCD            DSP REC NUM
     C           *LIKE     DEFN RRN       @PRCD            PAGE REC
     C           *LIKE     DEFN RRN       @LRRN            LAST REC NUM
     C           *LIKE     DEFN RRN       @LPAGE           LAST PAGE
     C           *LIKE     DEFN RRN       @PRRN            PROMPT USE
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYT7     KLIST                           *PYT7LF01
     C                     KFLD           DPP01            公司別
     C                     KFLD           KYMD             日期　
     C           KEYPP     KLIST                           *PYEMPF
     C                     KFLD           DPP01            公司別
     C                     KFLD           WPP03   60       計薪年月
     C                     KFLD           DPP041           部門編號
     C                     KFLD           DPP042           部門編號
     C                     KFLD           DPP043           部門編號
     C                     KFLD           DPP044           部門編號
     C           KEYPP1    KLIST                           *PYEMPF
     C                     KFLD           DPP01            公司別
     C                     KFLD           WPP03   60       計薪年月
     C                     KFLD           DPP041           部門編號
     C                     KFLD           DPP042           部門編號
     C                     KFLD           DPP043           部門編號
     C                     KFLD           DPP044           部門編號
     C                     KFLD           DPP06            獎金註記
     C           KEYPQ     KLIST                           *PYEMPF
     C                     KFLD           DPP01            公司別
     C                     KFLD           WPP03            計薪年月
     C                     KFLD           DPP041           部門編號
     C                     KFLD           DPP042           部門編號
     C                     KFLD           DPP043           部門編號
     C                     KFLD           DPP044           部門編號
     C                     KFLD           DPQ05            員工編號
     C           KEYPQ1    KLIST                           *PYEMPF
     C                     KFLD           DPP01            公司別
     C                     KFLD           WPP03   60       計薪年月
     C                     KFLD           DPP041           部門編號
     C                     KFLD           DPP042           部門編號
     C                     KFLD           DPP043           部門編號
     C                     KFLD           DPP044           部門編號
     C           KEYEM     KLIST                           *PYEMPF
     C                     KFLD           DPP01            公司別
     C                     KFLD           DPP041           部門編號
     C                     KFLD           DPP042           部門編號
     C                     KFLD           DPP043           部門編號
     C                     KFLD           DPP044           部門編號
     C           KEYEM1    KLIST                           *PYEMLF02
     C                     KFLD           TR02A            員工編號
     C                     KFLD           DPP01            公司別
     C           KEYEM2    KLIST                           *PYEMLF02
     C                     KFLD           PQ05             員工編號
     C                     KFLD           DPP01            公司別
     C           KEYEM3    KLIST                           *PYEMLF02
     C                     KFLD           DPQ05            員工編號
     C                     KFLD           DPP01            公司別
     C           KEYLV     KLIST                           *PYEMPF
     C                     KFLD           DPP01            公司別
     C                     KFLD           DPP04            部門代碼
     C                     KFLD           DPQ05            員工編號
     C                     KFLD           WPP03            計薪年月
     C           KEYT2     KLIST                           *PYEMPF
     C                     KFLD           DPP01            公司別
     C                     KFLD           DPP04            部門代碼
     C                     KFLD           DPQ05            員工編號
     C                     KFLD           KYM1             計薪年月
     C           KEYOV     KLIST                           *PYEMPF
     C                     KFLD           DPP01            公司別
     C                     KFLD           DPQ05            員工編號
     C                     KFLD           WPP03            計薪年月
     C                     KFLD           DPP04            部門代碼
     C           KEYT1     KLIST                           *PYEMPF
     C                     KFLD           DXF02   2        班別代碼
     C           KEYTR     KLIST                           *PYTRLF01
     C                     KFLD           DPP01            公司別
     C                     KFLD           DPP01            公司別
     C                     KFLD           DPP041           部門編號
     C                     KFLD           DPP042           部門編號
     C                     KFLD           DPP043           部門編號
     C                     KFLD           DPP044           部門編號
     C                     KFLD           DPQ05            員工編號
     C                     KFLD           KYMD             生效日期
     C           KEYTR0    KLIST                           *PYTRLF01
     C                     KFLD           DPP01            公司別
     C                     KFLD           DPP01            公司別
     C                     KFLD           DPP041           部門編號
     C                     KFLD           DPP042           部門編號
     C                     KFLD           DPP043           部門編號
     C                     KFLD           DPP044           部門編號
     C                     KFLD           DPQ05            員工編號
     C           KEYTR1    KLIST                           *PYTRLF01
     C                     KFLD           TR01L            公司別
     C                     KFLD           TR011L           公司別
     C                     KFLD           TR051L           部門編號
     C                     KFLD           TR052L           部門編號
     C                     KFLD           TR053L           部門編號
     C                     KFLD           TR054L           部門編號
     C                     KFLD           TR02L            員工編號
     C                     KFLD           TR04L            生效日期
     C           KEYTR2    KLIST                           *PYTRLF01
     C                     KFLD           DPP01            公司別
     C                     KFLD           DPP01            公司別
     C                     KFLD           DPP041           部門編號
     C                     KFLD           DPP042           部門編號
     C                     KFLD           DPP043           部門編號
     C                     KFLD           DPP044           部門編號
     C                     KFLD           DPQ05            員工編號
     C                     KFLD           TR04             生效日期
     C           KEYTR3    KLIST                           *PYTRLF01
     C                     KFLD           DPP01            公司別
     C                     KFLD           DPP01            公司別
     C                     KFLD           DPP041           部門編號
     C                     KFLD           DPP042           部門編號
     C                     KFLD           DPP043           部門編號
     C                     KFLD           DPP044           部門編號
     C                     KFLD           KYMD             生效日期
     C           KEYTR4    KLIST                           *PYTRLF01
     C                     KFLD           DPP01            公司別
     C                     KFLD           DPP01            公司別
     C                     KFLD           DPP041           部門編號
     C                     KFLD           DPP042           部門編號
     C                     KFLD           DPP043           部門編號
     C                     KFLD           DPP044           部門編號
     C           KEYTR5    KLIST                           *PYTRLF01
     C                     KFLD           DPP01            公司別
     C                     KFLD           DPP01            公司別
     C                     KFLD           DPP041           部門編號
     C                     KFLD           DPP042           部門編號
     C                     KFLD           DPP043           部門編號
     C                     KFLD           DPP044           部門編號
     C                     KFLD           DPQ05            員工編號
     C                     KFLD           HNUM             生效日期
     C           KEYPM     KLIST                           *PYPMPF
     C                     KFLD           WPB01
     C                     KFLD           DPP01
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
    C           SCID      CASEQ'SC02'    R2000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     MOVEL'SC01'    SCID    4
|    C* FUN AUT
|    C                     MOVE $ADD      @A01,1
|    C                     MOVE $UPD      @A01,2
|    C                     MOVE $DLT      @A01,4
|    C                     MOVE $INQ      @A01,5
|    C*
|    C*
|    C                     Z-ADD1         DOPT
|    C                     Z-ADD0         DPP03
|    C                     Z-ADD0         WPP03
|    C*
|    C                     Z-ADD*ZERO     PP03DX  50
|    C*
|    C                     MOVEL*BLANK    DPP04
|    C                     MOVEL*BLANK    DPP04N
|    C                     MOVEL*BLANK    DPP06
|    C                     Z-ADD0         DPP07
|    C                     Z-ADD0         DPP08
|    C                     Z-ADD0         DPP09
|    C                     Z-ADD0         HPP09
|    C                     Z-ADD0         DPP10
|    C*
|    C                     Z-ADD1         DD               *日期
|    C                     MOVEL*BLANK    @T1              *班表
|    C*
|    C                     MOVEL$COR      DPP01
| 01-C           $RMK03    IFNE 'Y'
|   C                     SETOF                     32
| 01*C                     ELSE
|   C                     SETON                     32
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
|   C                     EXSR R1E00
|   C                     GOTO E1000
| 02-C                     END
|    C*
| 03-C           *IN18     IFEQ '1'                        *BROWSE
|   C                     EXSR R1A00
|   C                     GOTO E1000
| 03-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 04-C           *IN99     IFEQ '0'
|   C                     EXSR R1C00
|   C                     MOVEL'SC02'    SCID             *SCR2
| 05-C           *IN99     IFEQ '1'
|   C                     MOVEL'SC01'    SCID             *SCR2
| 05-C                     END
| 04-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1A00 ....全頁查詢 (PF18 : CALL SUB-PROGRAM)
     C*==============================================================*
03===C           R1A00     BEGSR
|    C* AUT CHECK
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM 'PYI411'  S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     99
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C   99                GOTO E1A00
|    C*
|    C*----------------------------------------------------------------
|    C                     CALL 'PYI411'
|    C                     PARM DPP01     I301I1  2         公司編號
|    C           DPP03     PARM DPP03     I301I2  50        計薪年月
|    C           DPP06     PARM DPP06     I411I3  1         註記
|    C           DPP09     PARM DPP09     I411I4  90        應計金額
|    C           DPP10     PARM DPP10     I411I5  90        實際金額
|    C           DPP07     PARM DPP07     I411I6  70        應計工時
|    C           DPP08     PARM DPP08     I411I7  70        實際工時
|    C           DPP04     PARM DPP04     I411I8  7         部門代號
|    C*----------------------------------------------------------------
|    C                     PARM           @RTNC   2          FUN KEY
|    C                     Z-ADDDPP09     HPP09              *SAVE
|    C*
| 02-C           @RTNC     IFEQ '03'
|   C                     SETON                     03
| 02-C                     END
|    C*
03===C           E1A00     ENDSR
     C*==============================================================*
     C*          R1B00 ....SCREEN CHECK
     C*==============================================================*
04===C           R1B00     BEGSR
|    C* CHK FUN AUT
| 01-C           @A01,DOPT IFNE 'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 01-C                     END
|    C   99                GOTO E1B00
|    C*---------------------------------------------------------------
|    C* << CHACK 公司別NOT *BLANK >>
|    C                     MOVEL*BLANK    DPP01N
| 02-C           DPP01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DPP01     CM001I  2         公司代號
|    C           DPP01N    PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C           DFMT      PARM           CM004O  1         日期格式
|    C           DTYPE     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 03-C           CM099O    IFEQ 'N'
|   C                     SETON                     6099
|   C                     MOVEL'US#0099' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 03-C                     END
|    C   99                GOTO E1B00
|    C*
| 04-C           CM099O    IFEQ *BLANK
|   C                     SETON                     6099
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 04-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*+<<DATA CHECK>>+++++++++++++++++++++++++++++++++++++++++++++++++
|    C*計薪年月
| 05-C           DPP03     IFEQ 0
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 05-C                     END
|    C   99                GOTO E1B00
|    C*日期格式轉換
|    C                     Z-ADDDPP03     DYM
|    C                     CALL 'P31'
|    C                     PARM DYMD      P3101I  80
|    C                     PARM DFMT      P3102I  1
|    C                     PARM DTYPE     P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C                     PARM           P3111O  80
|    C                     Z-ADDP3111O    DYMD
|    C*計薪年月
|    C                     CALL 'P30'
|    C                     PARM DYMD      P3001I  80
|    C                     PARM DFMT      P3002I  1
|    C                     PARM DTYPE     P3003I  1
|    C                     PARM           P3001O  1
| 06-C           P3001O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 06-C                     END
|    C   99                GOTO E1B00
|    C                     Z-ADDDYM       WPP03
|    C*
|    C*---------------------------------------------------------------
|    C*部門別
|    C           KEYEM     CHAINEM0                  41
|    C                     CALL 'PYSCM1'
|    C                     PARM DPP01     CM101I  2         公司代號
|    C                     PARM DPP04     CM102I  7         部門代號
|    C                     PARM           CM103O 14         部門名稱
|    C                     PARM           CM199O  1         存在否？
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 07-C           CM199O    IFEQ 'N'
|   C                     SETON                     6399
|   C                     MOVEL'US#0098' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 07-C                     END
|    C   99                GOTO E1B00
|    C*
| 08-C           CM199O    IFEQ *BLANK
|   C           *IN41     OREQ '1'
|   C                     SETON                     6399
|   C                     MOVEL'US#1111' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 08-C                     END
|    C   99                GOTO E1B00
|    C*部門名稱
|    C                     CALL 'P65'
|    C                     PARM CM103O    P6501I 80
|    C                     PARM 7         P6502I  30
|    C           DPP04N    PARM           P6501O 80
|    C                     PARM           P6502O 80
|    C*
|    C           KEYPP1    CHAINPP0                  40
| 09-C           DOPT      IFEQ 1                          *ADD
|   C           *IN40     ANDEQ'0'
|   C                     MOVEL'UPT2020' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606163
|   C                     SETON                     1199
| 09-C                     END
|    C   99                GOTO E1B00
|    C*
| 10-C           DOPT      IFNE 1                          *UPD,DEL,INQ
| 11-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606163
|   C                     SETON                     1199
| 11*C                     ELSE
|   C                     MOVELPP06      DPP06
| 12-C           DPP09     IFEQ 0
|   C                     Z-ADDPP09      DPP09
|   C                     Z-ADDPP09      HPP09
| 12-C                     END
| 11-C                     END
| 10-C                     END
|    C   99                GOTO E1B00
|    C*獎金確認後不得修改或刪除
|    C                     MOVE '01'      WPB01   2
|    C           KEYPM     CHAINPM0                  41    *PYPMPF
|    C*
| 13-C           *IN41     IFEQ '0'
|   C           DOPT      ANDNE5                          *INQ
|   C           DPP03     ANDLEPM202
|   C                     MOVEL'UMI0240' ERRID
|   C                     MOVEL'CEMF'    ERRF
|   C                     SETON                     606163
|   C                     SETON                     1199
| 13-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*獎金註記DPP06
| 14-C           DPP06     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 14-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*---------------------------------------------------------------
|    C*應計金額
| 15-C           DPP09     IFEQ 0
|   C           DOPT      ANDEQ1
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 15-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     Z-ADDDYMD      KYMD
|    C                     SUB  1         KMM1
| 16-C           KMM1      IFLE 0
|   C                     SUB  1         KYY1
|   C                     Z-ADD12        KMM1
| 16-C                     END
|    C*本月天數　　　
|    C                     CALL 'P34'
|    C                     PARM KYM1      P3401I  60
|    C                     PARM '2'       P3403I  1
|    C                     PARM '1'       P3404I  1
|    C                     PARM           P3411O  1
|    C                     PARM           P3412O  20
|    C                     Z-ADDP3412O    DNUM    20       *本月天數
|    C*
|    C*SAVE 休假日期
|    C                     Z-ADD0         NN      20
|    C                     Z-ADD1         X
|    C                     Z-ADD1         KD1
|    C                     MOVEL*BLANK    @DAY             *休假日
|    C           KEYT7     SETLLT70
|    C           DPP01     READET70                      46
| 17-C           *IN46     DOWEQ'0'
|   C           T701      ANDLTDYMD
|   C*
|   C                     Z-ADDT701      @DAY,X
|   C                     ADD  1         X                *IDX
|   C                     ADD  1         NN               *休假天數
|   C*
|   C           DPP01     READET70                      46
| 17-C                     END
|    C*
|    C*----------------------------------------------------------------
|    C*
04===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....SCREEN 2, 3 PREPARE
     C*==============================================================*
05===C           R1C00     BEGSR
|    C*
|    C                     MOVE WFUN,DOPT DFUN
|    C                     EXSR R1CC0                      *INIT SFL
|    C                     SETOF                     313233
|    C* ADD
| 01-C           DOPT      IFEQ 1
|   C                     SETON                     31
|   C                     SETON                     33
|   C*                    END
|   C                     EXSR R1CA0                      *INIT HEAD
|   C                     EXSR R1CF0                      *READ DETAIL
|   C                     EXSR R1CG0                      *獎金計算
|   C                     EXSR R1CD0                      *ADD *BLANK
| 01-C                     END
|    C* UPD
| 02-C           DOPT      IFEQ 2
|   C                     SETON                     31
|   C                     SETON                     33
|   C*
|   C                     EXSR R1CB0                      *HEADING
|   C                     EXSR R1CE0                      *READ DETAIL
| 03-C           DPP09     IFNE HPP09
|   C                     EXSR R1CG0                      *ADD *BLANK
| 03-C                     END
|   C                     EXSR R1CD0                      *ADD *BLANK
| 02-C                     END
|    C* DEL & INQ
| 04-C           DOPT      IFEQ 4
|   C           DOPT      OREQ 5
|   C                     EXSR R1CB0                      *HEADING
|   C                     EXSR R1CE0                      *READ DETAIL
|   C                     SETON                     53    *SFLEND
| 04-C                     END
|    C*SFLDSP
| 05-C           @LRRN     IFGT 0
|   C                     Z-ADD1         DRRN
|   C                     SETON                     50    *SFLDSP
| 05*C                     ELSE
|   C                     SETON                     99    *NO DTA
|   C                     MOVEL'UPT2050' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 05-C                     END
|    C*
|    C* RELEASE FILE (ADD & INQUIRY)++++++++++++++++++++++++++++++++++*
| 06-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 5
|   C           *LOVAL    SETLLPP0
|   C           *LOVAL    SETLLPQ0
| 06-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R1CA0 ....SFL HEAD INIT : ADD (NO COPY)
     C*==============================================================*
06===C           R1CA0     BEGSR
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* << ADD : SUBFILE HEAD DATA INITAILIZE>>
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C                     Z-ADD0         DPP07
|    C                     Z-ADD0         DPP08
|    C                     Z-ADD0         DPP10
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R1CB0 ....SFL HEAD INIT : U/D/I/A-COPY
     C*==============================================================*
07===C           R1CB0     BEGSR
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* << U/D/I AND ADD-COPY : SUBFILE HEAD DATA INITAILIZE>>
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C                     Z-ADD0         DPP07
|    C                     Z-ADD0         DPP08
|    C                     Z-ADD0         DPP10
|    C           KEYPP     CHAINPP0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     Z-ADDPP07      DPP07
|   C                     Z-ADDPP08      DPP08
|   C                     Z-ADDPP10      DPP10
| 01-C                     END
|    C*
07===C                     ENDSR
     C*=============================================================*
     C*          R1CC0 ....SUBFILE INIT
     C*=============================================================*
08===C           R1CC0     BEGSR
|    C* SFL SETTING ++++++++++++++++++++++++++++++++++++++++++++++++++
|    C                     Z-ADD10        @PRCD            *PGE RCD
|    C                     Z-ADD11        @SFTOP  20       *SFL TOP LIN
|    C                     Z-ADD19        @SFBOT  20       *SFL BOT LIN
|    C                     Z-ADD1         @LNUM   20       *明細行數
|    C* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C                     Z-ADD0         DRRN
|    C                     Z-ADD0         RRN
|    C                     Z-ADD0         @LRRN            *LAST RRN
|    C                     Z-ADD0         @DRCD            *DSP RCD
|    C*
|    C                     SETOF                     51    *SFLDSPCTL
|    C*
|    C                     SETON                     52    *SFLCLR
|    C                     WRITESFLCR
|    C                     SETOF                     52
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     SETOF                     5053  *SFLDSP,END
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          R1CD0 ... SFL DATA INIT
     C*==============================================================*
09===C           R1CD0     BEGSR
|    C*
|    C                     SETOF                     54    *54 FOR BLANK LOOP
|    C                     SETON                     32
|    C                     Z-ADD@LRRN     RRN
|    C*
|    C           @LRRN     DIV  @PRCD     @LPAGE
|    C                     ADD  1         @LPAGE
|    C           @LPAGE    MULT @PRCD     @DRCD
|    C*
|    C                     EXSR R1CD1                      *INIT SFLDTA
| 01-C           RRN       DOWLT@DRCD
|   C*
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN       @LRRN
|    C                     Z-ADDRRN       DRRN
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          R1CD1 ... SFL INIT DATA ADD
     C*==============================================================*
10===C           R1CD1     BEGSR
|    C*
|    C                     MOVEL*BLANK    DDEL             * DEL
|    C                     MOVEL'Y'       DNEW             *檢查碼　
|    C                     MOVEL*BLANK    DPQ05            *員工編號
|    C                     MOVEL*BLANK    DEM03            *員工姓名
|    C                     Z-ADD0         DPQ08            *實際工時
|    C                     Z-ADD0         DPQ10            *實際金額
|    C                     Z-ADD0         DPQ07            *應計工時
|    C                     Z-ADD0         DPQ09            *應計金額
|    C*                                                       　　
10===C                     ENDSR
     C*==============================================================*
     C*          R1CF0 ....SFL DATA INIT
     C*==============================================================*
11===C           R1CF0     BEGSR
|    C*
|    C                     SETON                     54    *54
|    C                     Z-ADD1         S       30
|    C                     MOVEL*BLANK    @AR1
|    C                     MOVEL*BLANK    DNEW
|    C                     MOVEL*BLANK    DDEL             * DEL
|    C* 1.現職人員
|    C           KEYEM     SETLLEM0
|    C           KEYEM     READEEM0                      46
|    C*      K--------------------------------------------------------
|    C*                    SETON                     31
|    C*
|    C                     Z-ADD*ZERO     DPP07
|    C                     Z-ADD*ZERO     DPP08
|    C                     Z-ADD*ZERO     DPQ08
|    C                     Z-ADD*ZERO     DPQ10
|    C                     Z-ADD*ZERO     DPQ07
|    C                     Z-ADD*ZERO     DPQ09
| 01-C           *IN46     DOWEQ'0'
|   C                     Z-ADDEM13      DEM13            *EM13 SAVE
|   C                     Z-ADDEM19      DEM19            *EM19 SAVE
|   C*「新進人員破月或新進未滿一個月且離職者」生產獎金BY工時，以班
|   C*表計算
|   C                     Z-ADD1         KD1
| 02-C           EM11      IFEQ *BLANK
|   C           EM11      OREQ 'Y'
|   C           EM13      ANDLEKYMD
|   C           EM19      ANDGTKYMD
|   C           EM11      OREQ 'Y'
|   C           EM13      ANDGEKYMD
|   C           EM13      ANDLTDYMD
|   C*
| 03-C           EM20      IFEQ 0
|   C           EM19      ANDNE0
|   C                     CALL 'P32'
|   C                     PARM EM13      P3201I  80
|   C                     PARM EM19      P3202I  80
|   C                     PARM DFMT      P3203I  1
|   C                     PARM DTYPE     P3204I  1
|   C                     PARM           P3211O  90
|   C                     Z-ADDP3211O    N1      90
| 03-C                     END
|   C*
|   C*計算到職日之次月份
|   C                     Z-ADDEM13      KEM13            *EM13 SAVE
|   C                     ADD  1         KEM13M
| 04-C           KEM13M    IFGT 12
|   C                     ADD  1         KEM13Y
|   C                     Z-ADD1         KEM13M
| 04-C                     END
|   C*
| 05-C           EM20      IFEQ 0
|   C           EM13YM    ANDEQKYM1
|   C           EM20      OREQ 0
|   C           EM19YM    ANDEQKYM1
|   C           EM19YM    ANDEQKMN2
|   C*註記'A'
| 06-C           DPP06     IFEQ 'A'
|   C           EM133     ANDEQ'A'
|   C*
|   C                     MOVELEM02      DPQ05            *員工編號
|   C                     MOVELEM03      DEM03            *員工姓名
|   C*
|   C                     EXSR R1CF5
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
|   C                     ADD  1         S
|   C                     MOVELDPQ05     @AR1,S
| 06-C                     END
|   C*註記'B'
| 07-C           DPP06     IFEQ 'B'
|   C           EM133     ANDEQ'B'
|   C*
|   C                     MOVELEM02      DPQ05            *員工編號
|   C                     MOVELEM03      DEM03            *員工姓名
|   C*
|   C                     EXSR R1CF2
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
|   C                     ADD  1         S
|   C                     MOVELDPQ05     @AR1,S
| 07-C                     END
|   C*註記'C'
| 08-C           DPP06     IFEQ 'C'
|   C           EM133     ANDEQ'C'
|   C*
|   C                     MOVELEM02      DPQ05            *員工編號
|   C                     MOVELEM03      DEM03            *員工姓名
|   C*
|   C                     EXSR R1CF5
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
|   C                     ADD  1         S
|   C                     MOVELDPQ05     @AR1,S
| 08-C                     END
|   C*-----------------------------------------------------
| 05*C                     ELSE
|   C*--強迫以不排班計算--*
|   C                     MOVEL*BLANK    DEM104  1        *排班否?
|   C*註記'A'
| 09-C           DPP06     IFEQ 'A'
|   C           EM133     ANDEQ'A'
|   C*
|   C                     MOVELEM02      DPQ05            *員工編號
|   C                     MOVELEM03      DEM03            *員工姓名
|   C*
|   C                     EXSR R1CF1
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
|   C                     ADD  1         S
|   C                     MOVELDPQ05     @AR1,S
| 09-C                     END
|   C*註記'B'
| 10-C           DPP06     IFEQ 'B'
|   C           EM133     ANDEQ'B'
|   C*
|   C                     MOVELEM02      DPQ05            *員工編號
|   C                     MOVELEM03      DEM03            *員工姓名
|   C*
|   C                     EXSR R1CF2
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
|   C                     ADD  1         S
|   C                     MOVELDPQ05     @AR1,S
| 10-C                     END
|   C*註記'C'
| 11-C           DPP06     IFEQ 'C'
|   C           EM133     ANDEQ'C'
|   C*
|   C                     MOVELEM02      DPQ05            *員工編號
|   C                     MOVELEM03      DEM03            *員工姓名
|   C*
|   C                     EXSR R1CF1
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
|   C                     ADD  1         S
|   C                     MOVELDPQ05     @AR1,S
| 11-C                     END
|   C*
| 05-C                     END
|   C*
| 02-C                     END
|   C*      K--------------------------------------------------------
|   C           KEYEM     READEEM0                      46
| 01-C                     END
|    C*
|    C                     Z-ADD1         KD1
|    C*2.非現職人員（轉出員工資料）
|    C           KEYTR3    SETLLTRL3
|    C           KEYTR4    READETRL3                     46
| 12-C           *IN46     DOWEQ'0'
|   C           TR04A     ANDLTDYMD
|   C*
|   C           KEYEM1    CHAINEML2                N40
|   C*
| 13-C           EM11L     IFEQ *BLANK
|   C           EM11L     OREQ 'Y'
|   C           EM13L     ANDLEKYMD
|   C           EM19L     ANDGTKYMD
|   C           EM11L     OREQ 'Y'
|   C           EM13L     ANDGEKYMD
|   C           EM13L     ANDLTDYMD
|   C*有異動,且生產獎金註記相同才計算 　　　　　　　　　
| 14-C           TR05A     IFNE TR06A
|   C*
| 15-C           EM20L     IFEQ 0
|   C           EM19L     ANDNE0
|   C                     CALL 'P32'
|   C                     PARM EM13L     P3201I  80
|   C                     PARM EM19L     P3202I  80
|   C                     PARM DFMT      P3203I  1
|   C                     PARM DTYPE     P3204I  1
|   C                     PARM           P3211O  90
|   C                     Z-ADDP3211O    N1      90
| 15-C                     END
|   C*
|   C                     Z-ADDEM13L     DEM13            *EM13 SAVE
|   C                     Z-ADDEM19L     DEM19            *EM19 SAVE
|   C*「新進人員破月或新進未滿一個月且離職者」生產獎金BY工時，以班
| 16-C           EM20L     IFEQ 0
|   C           EM13YM    ANDEQKYM1
|   C           EM20L     OREQ 0
|   C           EM19YM    ANDEQKYM1
|   C           EM19      ANDLTDYM
|   C*
|   C*註記'A'
| 17-C           DPP06     IFEQ 'A'
|   C           TR231A    ANDEQ'A'
|   C                     Z-ADD1         X       30
|   C           TR02A     LOKUP@AR1,X                   45
| 18-C           *IN45     IFEQ '0'
|   C*
|   C                     MOVELTR02A     DPQ05            *員工編號
|   C           KEYEM1    CHAINEML2                 40
|   C  N40                MOVELEM03L     DEM03            *員工姓名
|   C   40                MOVEL*BLANK    DEM03            *員工姓名
|   C*
|   C                     EXSR R1CF6
|   C                     ADD  1         S
|   C                     MOVELTR02A     @AR1,S
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
| 18-C                     END
| 17-C                     END
|   C*註記'B'
| 19-C           DPP06     IFEQ 'B'
|   C           TR231A    ANDEQ'B'
|   C                     Z-ADD1         X       30
|   C           TR02A     LOKUP@AR1,X                   45
| 20-C           *IN45     IFEQ '0'
|   C*
|   C                     MOVELTR02A     DPQ05            *員工編號
|   C           KEYEM1    CHAINEML2                 40
|   C  N40                MOVELEM03L     DEM03            *員工姓名
|   C   40                MOVEL*BLANK    DEM03            *員工姓名
|   C*
|   C                     EXSR R1CF4
|   C                     ADD  1         S
|   C                     MOVELTR02A     @AR1,S
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
| 20-C                     END
| 19-C                     END
|   C*註記'C'
| 21-C           DPP06     IFEQ 'C'
|   C           TR231A    ANDEQ'C'
|   C                     Z-ADD1         X       30
|   C           TR02A     LOKUP@AR1,X                   45
| 22-C           *IN45     IFEQ '0'
|   C*
|   C                     MOVELTR02A     DPQ05            *員工編號
|   C           KEYEM1    CHAINEML2                 40
|   C  N40                MOVELEM03L     DEM03            *員工姓名
|   C   40                MOVEL*BLANK    DEM03            *員工姓名
|   C*
|   C                     EXSR R1CF6
|   C                     ADD  1         S
|   C                     MOVELTR02A     @AR1,S
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
| 22-C                     END
| 21-C                     END
|   C*
| 16*C                     ELSE
|   C*註記'A'
| 23-C           DPP06     IFEQ 'A'
|   C           TR231A    ANDEQ'A'
|   C                     Z-ADD1         X       30
|   C           TR02A     LOKUP@AR1,X                   45
| 24-C           *IN45     IFEQ '0'
|   C*
|   C                     MOVELTR02A     DPQ05            *員工編號
|   C           KEYEM1    CHAINEML2                 40
|   C  N40                MOVELEM03L     DEM03            *員工姓名
|   C   40                MOVEL*BLANK    DEM03            *員工姓名
|   C*
|   C                     EXSR R1CF3
|   C                     ADD  1         S
|   C                     MOVELTR02A     @AR1,S
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
| 24-C                     END
| 23-C                     END
|   C*註記'B'
| 25-C           DPP06     IFEQ 'B'
|   C           TR231A    ANDEQ'B'
|   C                     Z-ADD1         X       30
|   C           TR02A     LOKUP@AR1,X                   45
| 26-C           *IN45     IFEQ '0'
|   C*
|   C                     MOVELTR02A     DPQ05            *員工編號
|   C           KEYEM1    CHAINEML2                 40
|   C  N40                MOVELEM03L     DEM03            *員工姓名
|   C   40                MOVEL*BLANK    DEM03            *員工姓名
|   C*
|   C                     EXSR R1CF4
|   C                     ADD  1         S
|   C                     MOVELTR02A     @AR1,S
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
| 26-C                     END
| 25-C                     END
|   C*註記'C'
| 27-C           DPP06     IFEQ 'C'
|   C           TR231A    ANDEQ'C'
|   C                     Z-ADD1         X       30
|   C           TR02A     LOKUP@AR1,X                   45
| 28-C           *IN45     IFEQ '0'
|   C*
|   C                     MOVELTR02A     DPQ05            *員工編號
|   C           KEYEM1    CHAINEML2                 40
|   C  N40                MOVELEM03L     DEM03            *員工姓名
|   C   40                MOVEL*BLANK    DEM03            *員工姓名
|   C*
|   C                     EXSR R1CF3
|   C                     ADD  1         S
|   C                     MOVELTR02A     @AR1,S
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
| 28-C                     END
| 27-C                     END
|   C*
| 16-C                     END
|   C*
| 14-C                     END
|   C*
| 13-C                     END
|   C*
|   C           KEYTR4    READETRL3                     46
| 12-C                     END
|    C*
|    C                     SETON                     5053
|    C*
|    C                     Z-ADDRRN       @LRRN
|    C                     Z-ADDRRN       DRRN
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          R1CF1 ....註記'A'
     C*==============================================================*
12===C           R1CF1     BEGSR
|    C*
|    C*1.實際工時
|    C*
| 01-C           DEM104    IFEQ 'Y'
|   C*A排班工時
|   C                     MOVEL*BLANK    @T1
|   C           KEYT2     CHAINT20                  40
|   C  N40                MOVELT205      DT205
|   C*
|   C                     Z-ADD1         I       30       *INX
|   C                     Z-ADD*ZERO     PQ081   52       新進工時
|   C                     Z-ADD*ZERO     PQ082   52       非新進工時
| 02-C           I         DOWLE31
|   C*
| 03-C           @T1,I     IFNE *BLANK                     *有排班
|   C                     Z-ADDI         KD1              *日期
|   C                     Z-ADD0         DXF12   31
|   C                     MOVEL@T1,I     DXF02            *班別代碼
|   C           KEYT1     CHAINT10                  40
| 04-C           *IN40     IFEQ '0'
|   C           T115      DIV  60        WFLD1   21H
|   C           WFLD1     ADD  T114      DXF12
| 04-C                     END
|   C*
|   C*** 1.無人事異動
| 05-C           KYMD      IFGE EM21
|   C*   **新進人員
| 06-C           KYMD      IFLT EM20
|   C           EM20      OREQ 0
|   C                     ADD  DXF12     PQ081
| 06-C                     END
|   C*   **非新進人員
| 07-C           KYMD      IFGT EM20
|   C           EM20      ANDGT0
|   C                     ADD  DXF12     PQ082
| 07-C                     END
|   C*
| 05-C                     END
|   C*** 2.有人事異動
| 08-C           KYMD      IFLT EM21
|   C*   **判斷部門之有效區間
|   C*   **訖日HNUM
|   C                     Z-ADDDYMD      HNUM
|   C           KEYTR     SETLLTRL2
|   C           KEYTR0    READETRL2                     46
| 09-C           *IN46     DOWEQ'0'
|   C           TR04L     ANDLEDYMD
|   C*
| 10-C           TR05L     IFNE TR06L
|   C                     Z-ADDTR04L     HNUM    80
| 10-C                     END
|   C*
|   C           KEYTR0    READETRL2                     46
| 09-C                     END
|   C*
|   C*   **起日LNUM
|   C                     Z-ADDKYMD      LNUM
|   C           KEYTR5    SETLLTR0
|   C           KEYTR0    REDPETR0                      46
| 11-C           *IN46     DOWEQ'0'
|   C           TR04      ANDGTKYMD
|   C*
| 12-C           TR05      IFNE TR06
|   C                     Z-ADDTR04      LNUM    80
| 12-C                     END
|   C*
|   C           KEYTR0    REDPETR0                      46
| 11-C                     END
|   C*
| 13-C           KYMD      IFGE LNUM
|   C           KYMD      ANDLTHNUM
|   C*
|   C*       A.新進人員
| 14-C           KYMD      IFLT EM20
|   C           EM20      OREQ 0
|   C                     ADD  DXF12     PQ081
| 14-C                     END
|   C*     B.非新進人員
| 15-C           KYMD      IFGT EM20
|   C           EM20      ANDGT0
|   C                     ADD  DXF12     PQ082
| 15-C                     END
|   C*
| 13-C                     END
| 08-C                     END
|   C*
| 03-C                     END
|   C*
|   C                     ADD  1         I
|   C*
| 02-C                     END
|   C*
| 01*C                     ELSE
|   C*B非排班工時
|   C                     Z-ADD1         I       30       *INX
|   C                     Z-ADD*ZERO     PQ081   52       新進工時
|   C                     Z-ADD*ZERO     PQ082   52       非新進工時
| 16-C           I         DOWLEDNUM
|   C*判斷是否假日
|   C                     Z-ADDI         KD1              *日期
|   C                     Z-ADD1         X       30
|   C           KYMD      LOKUP@DAY,X                   45
| 17-C           *IN45     IFEQ '0'
|   C*
|   C*** 1.無人事異動
| 18-C           KYMD      IFGE EM21
|   C*   **新進人員
| 19-C           KYMD      IFLT EM20
|   C           EM20      OREQ 0
|   C                     ADD  8         PQ081
| 19-C                     END
|   C*   **非新進人員
| 20-C           KYMD      IFGT EM20
|   C           EM20      ANDGT0
|   C                     ADD  8         PQ082
| 20-C                     END
|   C*
| 18-C                     END
|   C*** 2.有人事異動
| 21-C           KYMD      IFLT EM21
|   C*   **判斷部門之有效區間
|   C*   **訖日HNUM
|   C                     Z-ADDDYMD      HNUM
|   C           KEYTR     SETLLTRL2
|   C           KEYTR0    READETRL2                     46
| 22-C           *IN46     DOWEQ'0'
|   C           TR04L     ANDLEDYMD
|   C*
| 23-C           TR05L     IFNE TR06L
|   C                     Z-ADDTR04L     HNUM    80
| 23-C                     END
|   C*
|   C           KEYTR0    READETRL2                     46
| 22-C                     END
|   C*
|   C*   **起日LNUM
|   C                     Z-ADDKYMD      LNUM
|   C           KEYTR5    SETLLTR0
|   C           KEYTR0    REDPETR0                      46
| 24-C           *IN46     DOWEQ'0'
|   C           TR04      ANDGTKYMD
|   C*
| 25-C           TR05      IFNE TR06
|   C                     Z-ADDTR04      LNUM    80
| 25-C                     END
|   C*
|   C           KEYTR0    REDPETR0                      46
| 24-C                     END
|   C*
| 26-C           KYMD      IFGE LNUM
|   C           KYMD      ANDLTHNUM
|   C*
|   C*       A.新進人員
| 27-C           KYMD      IFLT EM20
|   C           EM20      OREQ 0
|   C                     ADD  8         PQ081
| 27-C                     END
|   C*     B.非新進人員
| 28-C           KYMD      IFGT EM20
|   C           EM20      ANDGT0
|   C                     ADD  8         PQ082
| 28-C                     END
|   C*
| 26-C                     END
| 21-C                     END
|   C*
| 17-C                     END
|   C*
|   C                     ADD  1         I
| 16-C                     END
|   C*
| 01-C                     END
|    C*實際工時= (新進工時も0.7) +非新進工時
|    C                     MULT 0.7       PQ081     H
|    C           PQ081     ADD  PQ082     WPQ08   52
|    C*請假時數 DLV08
|    C                     Z-ADD0         DLV08   52
|    C                     Z-ADD0         DLV09   30
|    C           KEYLV     SETLLLV0
|    C           KEYLV     READELV0                      46
| 29-C           *IN46     DOWEQ'0'
|   C*
| 30-C           LV04      IFNE 'A'                        *年假
|   C                     ADD  LV08      DLV08
|   C                     ADD  LV09      DLV09
| 30-C                     END
|   C*
|   C           KEYLV     READELV0                      46
| 29-C                     END
|    C*   -天轉換小時
| 31-C           DLV09     IFGT 0
|   C           DLV09     MULT 8         WLV09   41H
|   C                     ADD  WLV09     DLV08
|   C*
| 31-C                     END
|    C*加班時數  DOV07
|    C                     Z-ADD0         DOV07   52
|    C           KEYOV     SETLLOV0
|    C           KEYOV     READEOV0                      46
| 32-C           *IN46     DOWEQ'0'
|   C*
|   C                     ADD  OV07      DOV07
|   C                     ADD  OV08      DOV07
|   C                     ADD  OV09      DOV07
|   C                     ADD  OV10      DOV07
|   C*
|   C           KEYOV     READEOV0                      46
| 32-C                     END
|    C*實際工時=排班工時+加班工時-請假工時
|    C           WPQ08     ADD  DOV07     DPQ08
|    C                     SUB  DLV08     DPQ08            *實際工時
|    C*
|    C* 2.應計工時=實際工時
|    C                     Z-ADDDPQ08     DPQ07
|    C*小計
|    C                     ADD  DPQ07     DPP07            應計總工時
|    C                     ADD  DPQ08     DPP08            實際總工時
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          R1CF2 ....註記'B'
     C*==============================================================*
13===C           R1CF2     BEGSR
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C                     Z-ADD0         DPQ07            應計工時
|    C                     Z-ADD0         DPQ08            實際工時
|    C*1.無人事異動
| 01-C           KYMD      IFGE EM21
|   C*  A.應計工時240 小時
|   C                     Z-ADD0         DPQ08            實際工時
|   C                     Z-ADD0         WPQ07   52
|   C                     Z-ADD240       DPQ07
| 02-C           EM13      IFGT KYMD                       *破月
|   C                     CALL 'P32'
|   C                     PARM EM13      P3201I  80
|   C                     PARM DYMD      P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C           P3211O    MULT 8         DPQ07
| 02-C                     END
|   C*    -新進人員實際工時打七折
| 03-C           EM20      IFGT KYMD
| 04-C           EM20      IFGE DYMD
|   C                     MULT 0.7       DPQ07
|   C*
| 04*C                     ELSE
|   C                     Z-ADDKYMD      D1
|   C*
| 05-C           KYMD      IFLT EM13
|   C                     Z-ADDEM13      D1
| 05-C                     END
|   C*
|   C                     CALL 'P32'
|   C                     PARM D1        P3201I  80
|   C                     PARM EM20      P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C           WPQ07     PARM           P3211O  90
|   C*
|   C                     MULT 8         WPQ07     H
|   C                     MULT 0.3       WPQ07     H
|   C                     SUB  WPQ07     DPQ07
| 04-C                     END
| 03-C                     END
|   C*  B.實際工時DPQ08
|   C*    實際工時= 240 +  加班時數　－　請假時數
| 06-C           KYMD      IFGE EM21
|   C                     Z-ADDDPQ07     DPQ08
| 06-C                     END
| 01-C                     END
|    C*2.有人事異動
|    C                     Z-ADD0         WFLD2   30
|    C                     Z-ADD0         KPQ08   52
|    C                     Z-ADD0         KPQ081  52
|    C                     Z-ADD0         D1      80       *日期訖日
|    C*
| 07-C           KYMD      IFLT EM21
|   C                     MOVEL*BLANK    @CHK    1        *轉出檢查
|   C*
|   C           KEYTR     SETLLTR0
|   C           KEYTR0    READETR0                      46
| 08-C           *IN46     DOWEQ'0'
|   C           TR04      ANDLTDYMD
|   C*有異動,且生產獎金註記相同才計算 　　　　　　　　　
| 09-C           TR05      IFNE TR06
|   C           TR232     ANDEQDPP06
|   C*      .計算在本部門天數
|   C           KEYTR2    SETLLTRL2
|   C           KEYTR0    READETRL2                     47
|   C*
|   C                     Z-ADDDYMD      D1
| 10-C           *IN47     DOWEQ'0'
|   C           TR04L     ANDLEDYMD                       *本月資料
|   C*
| 11-C           TR05L     IFNE TR06L                      *部門不同
|   C                     Z-ADDTR04L     D1
|   C                     LEAVE
| 11-C                     END
|   C*
|   C           KEYTR0    READETRL2                     47
| 10-C                     END
|   C*
|   C                     CALL 'P32'
|   C                     PARM TR04      P3201I  80
|   C                     PARM D1        P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C           WFLD2     PARM           P3211O  90
|   C*新進人員天數
| 12-C           EM20      IFGE TR04
|   C                     Z-ADD0         WFLD3   30
|   C                     Z-ADDTR04      D3      80
|   C                     Z-ADDD1        D4      80
| 13-C           EM20      IFGE TR04
|   C                     Z-ADDEM20      D3      80
| 13-C                     END
| 14-C           EM20      IFLE TR04
|   C                     Z-ADDEM20      D4      80
| 14-C                     END
|   C                     CALL 'P32'
|   C                     PARM D3        P3201I  80
|   C                     PARM D4        P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C           WFLD3     PARM           P3211O  90
|   C                     ADD  WFLD3     KPQ081           新進天數
| 12-C                     END
|   C*
|   C                     ADD  WFLD2     KPQ08            在部門天數數
|   C*
|   C*資料轉入前是否有轉出資料，若有轉出資料需累加
| 15-C           @CHK      IFEQ *BLANK
|   C           KEYTR2    SETLLTRL2
|   C           KEYTR0    REDPETRL2                     40
| 16-C           *IN40     IFEQ '0'
|   C           TR04L     ANDGTKYMD
| 17-C           KYMD      IFGT EM13
|   C           TR04L     SUB  KYMD      WFLD2
| 17*C                     ELSE
|   C           TR04L     SUB  EM13      WFLD2
| 17-C                     END
|   C                     ADD  WFLD2     KPQ08            在部門天數數
| 16-C                     END
|   C                     MOVEL'Y'       @CHK
|   C*  -新進人員天數
| 18-C           EM20      IFGE KYMD
|   C                     Z-ADD0         WFLD3   30
|   C                     Z-ADDKYMD      D3      80
|   C                     Z-ADDTR04L     D4      80
| 19-C           EM13      IFGT KYMD
|   C                     Z-ADDEM13      D3      80
| 19-C                     END
| 20-C           EM20      IFLE TR04L
|   C                     Z-ADDEM20      D4      80
| 20-C                     END
|   C                     CALL 'P32'
|   C                     PARM D3        P3201I  80
|   C                     PARM D4        P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C           WFLD3     PARM           P3211O  90
|   C                     ADD  WFLD3     KPQ081           新進天數
| 18-C                     END
|   C*
| 15-C                     END
|   C*
| 09-C                     END
|   C*
|   C           KEYTR0    READETR0                      46
| 08-C                     END
|   C                     MULT 8         KPQ08
|   C                     MULT 2.4       KPQ081    H
|   C           KPQ08     SUB  KPQ081    DPQ08
|   C                     Z-ADDDPQ08     DPQ07
|   C*
| 07-C                     END
|    C*
|    C* C.請假時數 DLV08
|    C                     Z-ADD0         DLV08   52
|    C                     Z-ADD0         DLV09   30
|    C           KEYLV     SETLLLV0
|    C           KEYLV     READELV0                      46
| 21-C           *IN46     DOWEQ'0'
|   C*
| 22-C           LV04      IFNE 'A'                        *年假
|   C                     ADD  LV08      DLV08
|   C                     ADD  LV09      DLV09
| 22-C                     END
|   C*
|   C           KEYLV     READELV0                      46
| 21-C                     END
|    C*    -天轉換小時
| 23-C           DLV09     IFGT 0
|   C           DLV09     MULT 8         WLV09   41H
|   C                     ADD  WLV09     DLV08
| 23-C                     END
|    C*D.加班時數  DOV07
|    C                     Z-ADD0         DOV07   52
|    C           KEYOV     SETLLOV0
|    C           KEYOV     READEOV0                      46
| 24-C           *IN46     DOWEQ'0'
|   C*
|   C                     ADD  OV07      DOV07
|   C                     ADD  OV08      DOV07
|   C                     ADD  OV09      DOV07
|   C                     ADD  OV10      DOV07
|   C*
|   C           KEYOV     READEOV0                      46
| 24-C                     END
|    C*
|    C                     ADD  DOV07     DPQ08
|    C                     SUB  DLV08     DPQ08            *實際工時
|    C*小計
|    C                     ADD  DPQ07     DPP07            應計總工時
|    C                     ADD  DPQ08     DPP08            實際總工時
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          R1CF3 ....註記'A'
     C*==============================================================*
14===C           R1CF3     BEGSR
|    C*
|    C                     MOVEL*BLANK    DEM104  1        *排班否?
|    C* 1.實際工時
|    C*
| 01-C           DEM104    IFEQ 'Y'
|   C*A排班工時
|   C                     MOVEL*BLANK    @T1
|   C           KEYT2     CHAINT20                  40
|   C  N40                MOVELT205      DT205
|   C*
|   C                     Z-ADD1         I       30       *INX
|   C                     Z-ADD*ZERO     PQ081   52       新進工時
|   C                     Z-ADD*ZERO     PQ082   52       非新進工時
| 02-C           I         DOWLE31
|   C*
| 03-C           @T1,I     IFNE *BLANK                     *有排班
|   C                     Z-ADDI         KD1              *日期
|   C                     Z-ADD0         DXF12   31
|   C                     MOVEL@T1,I     DXF02            *班別代碼
|   C           KEYT1     CHAINT10                  40
| 04-C           *IN40     IFEQ '0'
|   C           T115      DIV  60        WFLD1   21H
|   C           WFLD1     ADD  T114      DXF12
| 04-C                     END
|   C*
|   C* 2.有人事異動
|   C*   **判斷部門之有效區間
|   C*   **訖日HNUM
|   C                     Z-ADDTR04A     HNUM
|   C           KEYTR     SETLLTRL2
|   C           KEYTR0    READETRL2                     46
| 05-C           *IN46     DOWEQ'0'
|   C           TR04L     ANDLEDYMD
|   C*
| 06-C           TR05L     IFNE TR06L
|   C                     Z-ADDTR04L     HNUM    80
| 06-C                     END
|   C*
|   C           KEYTR0    READETRL2                     46
| 05-C                     END
|   C*
|   C*   **起日LNUM
|   C                     Z-ADDKYMD      LNUM
|   C           KEYTR5    SETLLTR0
|   C           KEYTR0    REDPETR0                      46
| 07-C           *IN46     DOWEQ'0'
|   C           TR04      ANDGTKYMD
|   C*
| 08-C           TR05      IFNE TR06
|   C                     Z-ADDTR04      LNUM    80
| 08-C                     END
|   C*
|   C           KEYTR0    REDPETR0                      46
| 07-C                     END
|   C*
| 09-C           KYMD      IFGE LNUM
|   C           KYMD      ANDLTHNUM
|   C*
|   C*       A.新進人員
| 10-C           KYMD      IFLT EM20L
|   C           EM20L     OREQ 0
|   C                     ADD  DXF12     PQ081
| 10-C                     END
|   C*     B.非新進人員
| 11-C           KYMD      IFGT EM20L
|   C           EM20L     ANDGT0
|   C                     ADD  DXF12     PQ082
| 11-C                     END
|   C*
| 09-C                     END
|   C*
| 03-C                     END
|   C*
|   C                     ADD  1         I
|   C*
| 02-C                     END
|   C*
| 01*C                     ELSE
|   C*B非排班工時
|   C                     Z-ADD1         I       30       *INX
|   C                     Z-ADD*ZERO     PQ081   52       新進工時
|   C                     Z-ADD*ZERO     PQ082   52       非新進工時
| 12-C           I         DOWLEDNUM
|   C*判斷是否假日
|   C                     Z-ADDI         KD1              *日期
|   C                     Z-ADD1         X       30
|   C           KYMD      LOKUP@DAY,X                   45
| 13-C           *IN45     IFEQ '0'
|   C* 2.有人事異動
|   C*   **判斷部門之有效區間
|   C*   **訖日HNUM
|   C                     Z-ADDTR04A     HNUM
|   C           KEYTR     SETLLTRL2
|   C           KEYTR0    READETRL2                     46
| 14-C           *IN46     DOWEQ'0'
|   C           TR04L     ANDLEDYMD
|   C*
| 15-C           TR05L     IFNE TR06L
|   C                     Z-ADDTR04L     HNUM    80
| 15-C                     END
|   C*
|   C           KEYTR0    READETRL2                     46
| 14-C                     END
|   C*
|   C*   **起日LNUM
|   C                     Z-ADDKYMD      LNUM
|   C           KEYTR5    SETLLTR0
|   C           KEYTR0    REDPETR0                      46
| 16-C           *IN46     DOWEQ'0'
|   C           TR04      ANDGTKYMD
|   C*
| 17-C           TR05      IFNE TR06
|   C                     Z-ADDTR04      LNUM    80
| 17-C                     END
|   C*
|   C           KEYTR0    REDPETR0                      46
| 16-C                     END
|   C*
| 18-C           KYMD      IFGE LNUM
|   C           KYMD      ANDLTHNUM
|   C*
|   C*       A.新進人員
| 19-C           KYMD      IFLT EM20L
|   C           EM20L     OREQ 0
|   C                     ADD  8         PQ081
| 19-C                     END
|   C*     B.非新進人員
| 20-C           KYMD      IFGT EM20L
|   C           EM20L     ANDGT0
|   C                     ADD  8         PQ082
| 20-C                     END
|   C*
| 18-C                     END
|   C*
| 13-C                     END
|   C*
|   C                     ADD  1         I
| 12-C                     END
|   C*
| 01-C                     END
|    C*
|    C*3.排班工時= (新進工時も0.7) +非新進工時
|    C                     MULT 0.7       PQ081     H
|    C           PQ081     ADD  PQ082     WPQ08   52
|    C*
|    C*請假時數 DLV08
|    C                     Z-ADD0         DLV08   52
|    C                     Z-ADD0         DLV09   30
|    C           KEYLV     SETLLLV0
|    C           KEYLV     READELV0                      46
| 21-C           *IN46     DOWEQ'0'
|   C*
| 22-C           LV04      IFNE 'A'                        *年假
|   C                     ADD  LV08      DLV08
|   C                     ADD  LV09      DLV09
| 22-C                     END
|   C*
|   C           KEYLV     READELV0                      46
| 21-C                     END
|    C*   -天轉換小時
| 23-C           DLV09     IFGT 0
|   C           DLV09     MULT 8         WLV09   41H
|   C                     ADD  WLV09     DLV08
|   C*
| 23-C                     END
|    C*加班時數  DOV07
|    C                     Z-ADD0         DOV07   52
|    C           KEYOV     SETLLOV0
|    C           KEYOV     READEOV0                      46
| 24-C           *IN46     DOWEQ'0'
|   C*
|   C                     ADD  OV07      DOV07
|   C                     ADD  OV08      DOV07
|   C                     ADD  OV09      DOV07
|   C                     ADD  OV10      DOV07
|   C*
|   C           KEYOV     READEOV0                      46
| 24-C                     END
|    C*實際工時=排班工時+加班工時-請假工時
|    C           WPQ08     ADD  DOV07     DPQ08
|    C                     SUB  DLV08     DPQ08            *實際工時
|    C*
|    C* 2.應計工時=實際工時
|    C                     Z-ADDDPQ08     DPQ07
|    C*小計
|    C                     ADD  DPQ07     DPP07            應計總工時
|    C                     ADD  DPQ08     DPP08            實際總工時
|    C*
14===C                     ENDSR
     C*==============================================================*
     C*          R1CF4 ....註記'B'
     C*==============================================================*
15===C           R1CF4     BEGSR
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C* 1.應計工時240 小時
|    C*                    Z-ADD0         DPQ08
|    C*                    Z-ADD240       DPQ07
|    C*          EM13      IFGT KYMD                       *破月
|    C*                    CALL 'P32'
|    C*                    PARM EM13      P3201I  80
|    C*                    PARM DYMD      P3202I  80
|    C*                    PARM '2'       P3203I  1
|    C*                    PARM '1'       P3204I  1
|    C*          DPQ07     PARM           P3211O  90
|    C*                    END
|    C* 2.實際工時DPQ08
|    C*   B.有人事異動
|    C                     Z-ADD0         WFLD2   30
|    C                     Z-ADD0         KPQ08   52
|    C                     Z-ADD0         D1      80       *日期訖日
|    C*
|    C           KEYTR     SETLLTRL2
|    C           KEYTR0    READETRL2                     46
| 01-C           *IN46     DOWEQ'0'
|   C           TR04L     ANDLTDYMD
|   C*有異動,且生產獎金註記相同才計算 　　　　　　　　　
| 02-C           TR05L     IFNE TR06L
|   C           TR231L    ANDEQDPP06
|   C*      .計算在本部門天數
|   C           KEYTR1    SETLLTR0
|   C           KEYTR0    REDPETR0                      47
|   C*
| 03-C           TR04      IFGT KYMD
|   C                     Z-ADDTR04      D1
| 03*C                     ELSE
| 04-C           EM13      IFGT KYMD
|   C                     Z-ADDKYMD      D1
| 04-C                     END
| 03-C                     END
|   C*
| 05-C           *IN47     DOWEQ'0'
|   C           TR04      ANDGEKYMD
|   C*
| 06-C           TR04      IFGT KYMD
|   C           TR05      ANDNETR06                       *部門不同
|   C                     Z-ADDTR04      D1
|   C                     LEAVE
| 06-C                     END
|   C*
|   C           KEYTR0    REDPETR0                      47
| 05-C                     END
|   C*
|   C                     CALL 'P32'
|   C                     PARM D1        P3201I  80
|   C                     PARM TR04L     P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C           WFLD2     PARM           P3211O  90
|   C*
|   C                     ADD  WFLD2     KPQ08            在部門天數數
|   C*
|   C*新進人員天數
| 07-C           EM20      IFGE D1
|   C                     Z-ADD0         WFLD3   30
|   C                     Z-ADDD1        D3      80
|   C                     Z-ADDTR04L     D4      80
| 08-C           EM20      IFGE D1
|   C                     Z-ADDEM20      D3      80
| 08-C                     END
| 09-C           EM20      IFLE TR04L
|   C                     Z-ADDEM20      D4      80
| 09-C                     END
|   C                     CALL 'P32'
|   C                     PARM D3        P3201I  80
|   C                     PARM D4        P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C           WFLD3     PARM           P3211O  90
|   C                     ADD  WFLD3     KPQ081           新進天數
| 07-C                     END
|   C*
| 02-C                     END
|   C*
|   C           KEYTR0    READETRL2                     46
| 01-C                     END
|    C*
|    C                     MULT 8         KPQ08
|    C                     MULT 2.4       KPQ081
|    C           KPQ08     SUB  KPQ081    DPQ08
|    C                     Z-ADDDPQ08     DPQ07
|    C*
|    C* C.請假時數 DLV08
|    C                     Z-ADD0         DLV08   52
|    C                     Z-ADD0         DLV09   30
|    C           KEYLV     SETLLLV0
|    C           KEYLV     READELV0                      46
| 10-C           *IN46     DOWEQ'0'
|   C*
| 11-C           LV04      IFNE 'A'                        *年假
|   C                     ADD  LV08      DLV08
|   C                     ADD  LV09      DLV09
| 11-C                     END
|   C*
|   C           KEYLV     READELV0                      46
| 10-C                     END
|    C*    -天轉換小時
| 12-C           DLV09     IFGT 0
|   C           DLV09     MULT 8         WLV09   41H
|   C                     ADD  WLV09     DLV08
| 12-C                     END
|    C*D.加班時數  DOV07
|    C                     Z-ADD0         DOV07   52
|    C           KEYOV     SETLLOV0
|    C           KEYOV     READEOV0                      46
| 13-C           *IN46     DOWEQ'0'
|   C*
|   C                     ADD  OV07      DOV07
|   C                     ADD  OV08      DOV07
|   C                     ADD  OV09      DOV07
|   C                     ADD  OV10      DOV07
|   C*
|   C           KEYOV     READEOV0                      46
| 13-C                     END
|    C*
|    C                     ADD  DOV07     DPQ08
|    C                     SUB  DLV08     DPQ08            *實際工時
|    C*小計
|    C                     ADD  DPQ07     DPP07            應計總工時
|    C                     ADD  DPQ08     DPP08            實際總工時
|    C*
15===C                     ENDSR
     C*==============================================================*
     C*          R1CF5 ....註記'A' ,'C'新進或破月人員
     C*==============================================================*
16===C           R1CF5     BEGSR
|    C*
|    C*
|    C*「新進人員破月或新進未滿一個月且離職者」生產獎金BY工時，以班
|    C*表計算
|    C*
|    C*計算到職滿一個月之日期
| 01-C           N1        IFGT 30
|   C           EM19YM    ANDEQKYM1
|   C                     CALL 'P37'
|   C                     PARM EM13      P3701I  80
|   C                     PARM DFMT      P3702I  1
|   C                     PARM DTYPE     P3703I  1
|   C                     PARM 30        P3704I  40
|   C                     PARM           P3711O  80
|   C                     Z-ADDP3711O    KDATE   80
| 01-C                     END
|    C*
|    C                     Z-ADD0         WDATE   80
| 02-C           EM19      IFGE DYMD
|   C           EM13YM    ANDEQKYM1
|   C                     Z-ADDKYMD      WDATE
|   C                     Z-ADD31        WDD
| 02*C                     ELSE
| 03-C           EM19      IFGT KDATE
|   C                     Z-ADDKDATE     WDATE
| 03*C                     ELSE
|   C                     Z-ADDEM19      WDATE
| 03-C                     END
| 02-C                     END
|    C*1.實際工時
|    C****A排班工時
|    C                     MOVEL*BLANK    @T1
|    C           KEYT2     CHAINT20                  40
|    C  N40                MOVELT205      DT205
|    C*
| 04-C           EM13YM    IFEQ KYM1
|   C                     Z-ADDEM13D     I       30       *INX
| 04*C                     ELSE
|   C                     Z-ADD1         I       30       *INX
| 04-C                     END
|    C*
|    C                     Z-ADD*ZERO     PQ081   52       新進工時
|    C                     Z-ADD*ZERO     PQ082   52       非新進工時
|    C*          EM19YM    IFEQ KYM1
|    C*          N1        ANDGT30
|    C*                    SUB  1         WDD
|    C*                    END
|    C*
| 05-C           I         DOWLEWDD
|   C*
| 06-C           @T1,I     IFNE *BLANK                     *有排班
|   C                     Z-ADDI         KD1              *日期
|   C                     Z-ADD0         DXF12   31
|   C                     MOVEL@T1,I     DXF02            *班別代碼
|   C           KEYT1     CHAINT10                  40
| 07-C           *IN40     IFEQ '0'
|   C           T115      DIV  60        WFLD1   21H
|   C           WFLD1     ADD  T114      DXF12
| 07-C                     END
|   C*
|   C*** 1.無人事異動
| 08-C           KYMD      IFGE EM21
|   C*   **新進人員
| 09-C           KYMD      IFLT EM20
|   C           EM20      OREQ 0
|   C                     ADD  DXF12     PQ081
| 09-C                     END
|   C*   **非新進人員
| 10-C           KYMD      IFGT EM20
|   C           EM20      ANDGT0
|   C                     ADD  DXF12     PQ082
| 10-C                     END
|   C*
| 08-C                     END
|   C*** 2.有人事異動
| 11-C           KYMD      IFLT EM21
|   C*   **判斷部門之有效區間
|   C*   **訖日HNUM
|   C                     Z-ADDDYMD      HNUM
|   C           KEYTR     SETLLTRL2
|   C           KEYTR0    READETRL2                     46
| 12-C           *IN46     DOWEQ'0'
|   C           TR04L     ANDLEDYMD
|   C*
| 13-C           TR05L     IFNE TR06L
|   C                     Z-ADDTR04L     HNUM    80
| 13-C                     END
|   C*
|   C           KEYTR0    READETRL2                     46
| 12-C                     END
|   C*
|   C*   **起日LNUM
|   C                     Z-ADDKYMD      LNUM
|   C           KEYTR5    SETLLTR0
|   C           KEYTR0    REDPETR0                      46
| 14-C           *IN46     DOWEQ'0'
|   C           TR04      ANDGTKYMD
|   C*
| 15-C           TR05      IFNE TR06
|   C                     Z-ADDTR04      LNUM    80
| 15-C                     END
|   C*
|   C           KEYTR0    REDPETR0                      46
| 14-C                     END
|   C*
| 16-C           KYMD      IFGE LNUM
|   C           KYMD      ANDLTHNUM
|   C*
|   C*       A.新進人員
| 17-C           KYMD      IFLT EM20
|   C           EM20      OREQ 0
|   C                     ADD  DXF12     PQ081
| 17-C                     END
|   C*     B.非新進人員
| 18-C           KYMD      IFGT EM20
|   C           EM20      ANDGT0
|   C                     ADD  DXF12     PQ082
| 18-C                     END
|   C*
| 16-C                     END
| 11-C                     END
|   C*
| 06-C                     END
|   C*
|   C                     ADD  1         I
|   C*
| 05-C                     END
|    C*
|    C*B非排班工時
| 19-C           EM19YM    IFEQ KYM1
|   C           EM19      ANDGTKDATE
|   C*
|   C                     Z-ADDKDATE     DDATE
|   C           WDD       ADD  1         I       30       *INX
|   C*                    Z-ADD*ZERO     PQ081   52       新進工時
|   C*                    Z-ADD*ZERO     PQ082   52       非新進工時
| 20-C           I         DOWLTEM19D
|   C*判斷是否假日
|   C                     Z-ADDI         KD1              *日期
|   C                     Z-ADD1         X       30
|   C           KYMD      LOKUP@DAY,X                   45
| 21-C           *IN45     IFEQ '0'
|   C*
|   C*** 1.無人事異動
| 22-C           KYMD      IFGE EM21
|   C*   **新進人員
| 23-C           KYMD      IFLT EM20
|   C           EM20      OREQ 0
|   C                     ADD  8         PQ081
| 23-C                     END
|   C*   **非新進人員
| 24-C           KYMD      IFGT EM20
|   C           EM20      ANDGT0
|   C                     ADD  8         PQ082
| 24-C                     END
|   C*
| 22-C                     END
|   C*** 2.有人事異動
| 25-C           KYMD      IFLT EM21
|   C*   **判斷部門之有效區間
|   C*   **訖日HNUM
|   C                     Z-ADDDYMD      HNUM
|   C           KEYTR     SETLLTRL2
|   C           KEYTR0    READETRL2                     46
| 26-C           *IN46     DOWEQ'0'
|   C           TR04L     ANDLEDYMD
|   C*
| 27-C           TR05L     IFNE TR06L
|   C                     Z-ADDTR04L     HNUM    80
| 27-C                     END
|   C*
|   C           KEYTR0    READETRL2                     46
| 26-C                     END
|   C*
|   C*   **起日LNUM
|   C                     Z-ADDKYMD      LNUM
|   C           KEYTR5    SETLLTR0
|   C           KEYTR0    REDPETR0                      46
| 28-C           *IN46     DOWEQ'0'
|   C           TR04      ANDGTKYMD
|   C*
| 29-C           TR05      IFNE TR06
|   C                     Z-ADDTR04      LNUM    80
| 29-C                     END
|   C*
|   C           KEYTR0    REDPETR0                      46
| 28-C                     END
|   C*
| 30-C           KYMD      IFGE LNUM
|   C           KYMD      ANDLTHNUM
|   C*
|   C*       A.新進人員
| 31-C           KYMD      IFLT EM20
|   C           EM20      OREQ 0
|   C                     ADD  8         PQ081
| 31-C                     END
|   C*     B.非新進人員
| 32-C           KYMD      IFGT EM20
|   C           EM20      ANDGT0
|   C                     ADD  8         PQ082
| 32-C                     END
|   C*
| 30-C                     END
| 25-C                     END
|   C*
| 21-C                     END
|   C*
|   C                     ADD  1         I
| 20-C                     END
|   C*
| 19-C                     END
|    C*
|    C*實際工時= (新進工時も0.7) +非新進工時
|    C                     MULT 0.7       PQ081     H
|    C           PQ081     ADD  PQ082     WPQ08   52
|    C*請假時數 DLV08
|    C                     Z-ADD0         DLV08   52
|    C                     Z-ADD0         DLV09   30
|    C           KEYLV     SETLLLV0
|    C           KEYLV     READELV0                      46
| 33-C           *IN46     DOWEQ'0'
|   C*
| 34-C           LV04      IFNE 'A'                        *年假
|   C                     ADD  LV08      DLV08
|   C                     ADD  LV09      DLV09
| 34-C                     END
|   C*
|   C           KEYLV     READELV0                      46
| 33-C                     END
|    C*   -天轉換小時
| 35-C           DLV09     IFGT 0
|   C           DLV09     MULT 8         WLV09   41H
|   C                     ADD  WLV09     DLV08
|   C*
| 35-C                     END
|    C*加班時數  DOV07
|    C                     Z-ADD0         DOV07   52
|    C           KEYOV     SETLLOV0
|    C           KEYOV     READEOV0                      46
| 36-C           *IN46     DOWEQ'0'
|   C*
|   C                     ADD  OV07      DOV07
|   C                     ADD  OV08      DOV07
|   C                     ADD  OV09      DOV07
|   C                     ADD  OV10      DOV07
|   C*
|   C           KEYOV     READEOV0                      46
| 36-C                     END
|    C*實際工時=排班工時+加班工時-請假工時
|    C           WPQ08     ADD  DOV07     DPQ08
|    C                     SUB  DLV08     DPQ08            *實際工時
|    C*
|    C* 2.應計工時=實際工時
|    C                     Z-ADDDPQ08     DPQ07
|    C*小計
|    C                     ADD  DPQ07     DPP07            應計總工時
|    C                     ADD  DPQ08     DPP08            實際總工時
|    C*
16===C                     ENDSR
     C*==============================================================*
     C*          R1CF6 ....註記'A'
     C*==============================================================*
17===C           R1CF6     BEGSR
|    C*
|    C*計算到職滿一個月之日期
| 01-C           N1        IFGT 30
|   C           EM19YM    ANDEQKYM1
|   C                     CALL 'P37'
|   C                     PARM EM13L     P3701I  80
|   C                     PARM DFMT      P3702I  1
|   C                     PARM DTYPE     P3703I  1
|   C                     PARM 30        P3704I  40
|   C                     PARM           P3711O  80
|   C                     Z-ADDP3711O    KDATE   80
| 01-C                     END
|    C*
|    C                     Z-ADD0         WDATE   80
| 02-C           EM19L     IFGE DYMD
|   C           EM13YM    ANDEQKYM1
|   C                     Z-ADDKYMD      WDATE
|   C                     Z-ADD31        WDD
| 02*C                     ELSE
| 03-C           EM19L     IFGT KDATE
|   C                     Z-ADDKDATE     WDATE
| 03*C                     ELSE
|   C                     Z-ADDEM19      WDATE
| 03-C                     END
| 02-C                     END
|    C*「新進人員破月或新進未滿一個月且離職者」生產獎金BY工時，以班
|    C*表計算
|    C* 1.實際工時
|    C*
|    C*A排班工時
|    C                     MOVEL*BLANK    @T1
|    C           KEYT2     CHAINT20                  40
|    C  N40                MOVELT205      DT205
|    C*
| 04-C           EM13YM    IFEQ KYM1
|   C                     Z-ADDEM13D     I       30       *INX
| 04*C                     ELSE
|   C                     Z-ADD1         I       30       *INX
| 04-C                     END
|    C*
|    C                     Z-ADD*ZERO     PQ081   52       新進工時
|    C                     Z-ADD*ZERO     PQ082   52       非新進工時
|    C*          EM19YM    IFEQ KYM1
|    C*          N1        ANDGT30
|    C*                    SUB  1         WDD
|    C*                    END
| 05-C           I         DOWLEWDD
|   C*
| 06-C           @T1,I     IFNE *BLANK                     *有排班
|   C                     Z-ADDI         KD1              *日期
|   C                     Z-ADD0         DXF12   31
|   C                     MOVEL@T1,I     DXF02            *班別代碼
|   C           KEYT1     CHAINT10                  40
| 07-C           *IN40     IFEQ '0'
|   C           T115      DIV  60        WFLD1   21H
|   C           WFLD1     ADD  T114      DXF12
| 07-C                     END
|   C*
|   C* 2.有人事異動
|   C*   **判斷部門之有效區間
|   C*   **訖日HNUM
|   C                     Z-ADDTR04A     HNUM
|   C           KEYTR     SETLLTRL2
|   C           KEYTR0    READETRL2                     46
| 08-C           *IN46     DOWEQ'0'
|   C           TR04L     ANDLEDYMD
|   C*
| 09-C           TR05L     IFNE TR06L
|   C                     Z-ADDTR04L     HNUM    80
| 09-C                     END
|   C*
|   C           KEYTR0    READETRL2                     46
| 08-C                     END
|   C*
|   C*   **起日LNUM
|   C                     Z-ADDKYMD      LNUM
|   C           KEYTR5    SETLLTR0
|   C           KEYTR0    REDPETR0                      46
| 10-C           *IN46     DOWEQ'0'
|   C           TR04      ANDGTKYMD
|   C*
| 11-C           TR05      IFNE TR06
|   C                     Z-ADDTR04      LNUM    80
| 11-C                     END
|   C*
|   C           KEYTR0    REDPETR0                      46
| 10-C                     END
|   C*
| 12-C           KYMD      IFGE LNUM
|   C           KYMD      ANDLTHNUM
|   C*
|   C*       A.新進人員
| 13-C           KYMD      IFLT EM20L
|   C           EM20L     OREQ 0
|   C                     ADD  DXF12     PQ081
| 13-C                     END
|   C*     B.非新進人員
| 14-C           KYMD      IFGT EM20L
|   C           EM20L     ANDGT0
|   C                     ADD  DXF12     PQ082
| 14-C                     END
|   C*
| 12-C                     END
|   C*
| 06-C                     END
|   C*
|   C                     ADD  1         I
|   C*
| 05-C                     END
|    C*
|    C*B非排班工時
| 15-C           EM19YM    IFEQ KYM1
|   C           EM19L     ANDGTKDATE
|   C*
|   C                     Z-ADDKDATE     DDATE
|   C           WDD       ADD  1         I       30       *INX
|   C*                    Z-ADD*ZERO     PQ081   52       新進工時
|   C*                    Z-ADD*ZERO     PQ082   52       非新進工時
| 16-C           I         DOWLTEM19D
|   C*判斷是否假日
|   C                     Z-ADDI         KD1              *日期
|   C                     Z-ADD1         X       30
|   C           KYMD      LOKUP@DAY,X                   45
| 17-C           *IN45     IFEQ '0'
|   C* 2.有人事異動
|   C*   **判斷部門之有效區間
|   C*   **訖日HNUM
|   C                     Z-ADDTR04A     HNUM
|   C           KEYTR     SETLLTRL2
|   C           KEYTR0    READETRL2                     46
| 18-C           *IN46     DOWEQ'0'
|   C           TR04L     ANDLEDYMD
|   C*
| 19-C           TR05L     IFNE TR06L
|   C                     Z-ADDTR04L     HNUM    80
| 19-C                     END
|   C*
|   C           KEYTR0    READETRL2                     46
| 18-C                     END
|   C*
|   C*   **起日LNUM
|   C                     Z-ADDKYMD      LNUM
|   C           KEYTR5    SETLLTR0
|   C           KEYTR0    REDPETR0                      46
| 20-C           *IN46     DOWEQ'0'
|   C           TR04      ANDGTKYMD
|   C*
| 21-C           TR05      IFNE TR06
|   C                     Z-ADDTR04      LNUM    80
| 21-C                     END
|   C*
|   C           KEYTR0    REDPETR0                      46
| 20-C                     END
|   C*
| 22-C           KYMD      IFGE LNUM
|   C           KYMD      ANDLTHNUM
|   C*
|   C*       A.新進人員
| 23-C           KYMD      IFLT EM20L
|   C           EM20L     OREQ 0
|   C                     ADD  8         PQ081
| 23-C                     END
|   C*     B.非新進人員
| 24-C           KYMD      IFGT EM20L
|   C           EM20L     ANDGT0
|   C                     ADD  8         PQ082
| 24-C                     END
|   C*
| 22-C                     END
|   C*
| 17-C                     END
|   C*
|   C                     ADD  1         I
| 16-C                     END
|   C*
| 15-C                     END
|    C*
|    C*
|    C*3.排班工時= (新進工時も0.7) +非新進工時
|    C                     MULT 0.7       PQ081     H
|    C           PQ081     ADD  PQ082     WPQ08   52
|    C*
|    C*請假時數 DLV08
|    C                     Z-ADD0         DLV08   52
|    C                     Z-ADD0         DLV09   30
|    C           KEYLV     SETLLLV0
|    C           KEYLV     READELV0                      46
| 25-C           *IN46     DOWEQ'0'
|   C*
| 26-C           LV04      IFNE 'A'                        *年假
|   C                     ADD  LV08      DLV08
|   C                     ADD  LV09      DLV09
| 26-C                     END
|   C*
|   C           KEYLV     READELV0                      46
| 25-C                     END
|    C*   -天轉換小時
| 27-C           DLV09     IFGT 0
|   C           DLV09     MULT 8         WLV09   41H
|   C                     ADD  WLV09     DLV08
|   C*
| 27-C                     END
|    C*加班時數  DOV07
|    C                     Z-ADD0         DOV07   52
|    C           KEYOV     SETLLOV0
|    C           KEYOV     READEOV0                      46
| 28-C           *IN46     DOWEQ'0'
|   C*
|   C                     ADD  OV07      DOV07
|   C                     ADD  OV08      DOV07
|   C                     ADD  OV09      DOV07
|   C                     ADD  OV10      DOV07
|   C*
|   C           KEYOV     READEOV0                      46
| 28-C                     END
|    C*實際工時=排班工時+加班工時-請假工時
|    C           WPQ08     ADD  DOV07     DPQ08
|    C                     SUB  DLV08     DPQ08            *實際工時
|    C*
|    C* 2.應計工時=實際工時
|    C                     Z-ADDDPQ08     DPQ07
|    C*小計
|    C                     ADD  DPQ07     DPP07            應計總工時
|    C                     ADD  DPQ08     DPP08            實際總工時
|    C*
17===C                     ENDSR
     C*==============================================================*
     C*          R1CG0 ....計算實際獎金金額
     C*==============================================================*
18===C           R1CG0     BEGSR
|    C*
| 01-C           DOPT      IFGT 0
|   C*
|   C                     Z-ADD0         DPP10
|   C                     Z-ADD0         DMN
|   C                     Z-ADD0         DMN1
|   C*金額╱工時 DOLLAR
| 02-C           DPP06     IFEQ 'A'
| 03-C           DPP08     IFNE 0
|   C           DPP09     DIV  DPP08     DMN    158H      *BY實際工時
| 03-C                     END
| 04-C           DPP07     IFNE 0
|   C           DPP09     DIV  DPP07     DMN1   158H      *BY應計工時
| 04-C                     END
| 02-C                     END
| 05-C           DPP06     IFEQ 'B'
| 06-C           DPP07     IFNE 0
|   C           DPP09     DIV  DPP07     DMN    158H      *BY部門
| 06-C                     END
| 05-C                     END
| 07-C           DPP06     IFEQ 'C'
| 08-C           DPP08     IFNE 0
|   C           DPP09     DIV  DPP08     DMN    158H      *BY實際工時
| 08-C                     END
| 09-C           DPP07     IFNE 0
|   C           DPP09     DIV  DPP07     DMN1   158H      *BY應計工時
| 09-C                     END
| 07-C                     END
|   C*
|   C                     SETON                     54
|   C                     READCSFLSR                  5757
|   C*
| 10-C           *IN57     DOWEQ'0'
|   C*
| 11-C           DDEL      IFNE 'D'
|   C*
| 12-C           DPP06     IFEQ 'A'
|   C           DPQ07     MULT DMN1      DPQ09     H      *應計金額
|   C           DPQ08     MULT DMN       DPQ10     H
|   C                     ADD  DPQ10     DPP10            *實際金額
| 12-C                     END
| 13-C           DPP06     IFEQ 'B'
|   C           DPQ07     MULT DMN       DPQ09     H      *應計金額
|   C           DPQ08     MULT DMN       DPQ10     H
|   C                     ADD  DPQ10     DPP10            *實際金額
| 13-C                     END
| 14-C           DPP06     IFEQ 'C'
|   C           DPQ07     MULT DMN1      DPQ09     H      *應計金額
|   C           DPQ08     MULT DMN       DPQ10     H
|   C                     ADD  DPQ10     DPP10            *實際金額
| 14-C                     END
|   C*
| 11-C                     END
|   C*
|   C                     UPDATSFLSR
|   C*
|   C                     READCSFLSR                    57
| 10-C                     END
|   C*
| 01-C                     END
|    C*
18===C                     ENDSR
     C*==============================================================*
     C*          R1CE0 ....DETAIL DATA TO SFL
     C*==============================================================*
19===C           R1CE0     BEGSR
|    C*
|    C                     SETON                     54    *54
|    C                     MOVEL*BLANK    DDEL             * DEL
|    C*
|    C           KEYPP     SETLLPQ0
|    C           KEYPP     READEPQ0                      46*NF/EOF
|    C*
| 01-C           *IN46     DOWEQ'0'
|   C                     EXSR R1CE1
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
|   C           KEYPP     READEPQ0                      46*NF/EOF
| 01-C                     END
|    C*
|    C                     SETON                     53
|    C                     Z-ADDRRN       @LRRN
|    C*
19===C                     ENDSR
     C*==============================================================*
     C*          R1CE1 ....DETAIL DATA TO SFL
     C*==============================================================*
20===C           R1CE1     BEGSR
|    C*
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C*                    SETON                     31
|    C                     MOVELPQ05      DPQ05            *員工編號
|    C                     Z-ADDPQ07      DPQ07            *應計工時
|    C                     Z-ADDPQ08      DPQ08            *實際工時
|    C                     Z-ADDPQ09      DPQ09            *應計獎金
|    C                     Z-ADDPQ10      DPQ10            *實際獎金
|    C*員工姓名
|    C                     MOVEL*BLANK    DEM03
|    C           KEYEM2    CHAINEML2                 40
|    C  N40                MOVELEM03L     DEM03
|    C*
20===C                     ENDSR
     C*==============================================================*
     C*          R1E00 ....'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
21===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*部門編號DPQ05
| 01-C           #LIN      IFEQ 4
|   C           #COL      ANDGE53
|   C           #COL      ANDLE57
|   C                     CALL 'PYI512'
|   C           DPP04     PARM DPP04     I512I1  5         部門代碼
|   C                     PARM           @RTNC   2          FUN KEY
| 01-C                     END
|    C*
21===C                     ENDSR
     C*==============================================================*
     C*          R2000 ....'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
22===C           R2000     BEGSR
|    C*
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E2000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
| 03-C           DOPT      IFEQ 1
|   C           DOPT      OREQ 2
|   C                     EXSR R2E00                      *CHK SCR
| 03-C                     END
|   C                     GOTO E2000
| 02-C                     END
|    C*
| 04-C           *IN12     IFEQ '1'
|   C                     MOVEL'SC01'    SCID
|   C                     GOTO E2000
| 04-C                     END
|    C*
| 05-C           *IN25     IFEQ '1'                        *NEXT PAGE
| 06-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 2                          *UPDATE
|   C                     EXSR R1CD0
| 06*C                     ELSE
|   C                     MOVEL'CPF5203' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 06-C                     END
|   C                     GOTO E2000
| 05-C                     END
|    C*
|    C*
| 07-C           *IN05     IFEQ '1'
|   C                     EXSR R2B00                      *CHK SCR
|   C                     GOTO E2000
| 07-C                     END
|    C*
| 08-C           DOPT      IFEQ 1
|   C           DOPT      OREQ 2
|   C                     EXSR R2B00                      *CHK SCR
| 08-C                     END
|    C*
| 09-C           *IN99     IFEQ '0'
|   C**         *IN13     ANDEQ'1'                         SAVE
|   C                     EXSR R2D00                      *FILE UPD
|   C                     MOVE 'SC01'    SCID
| 09-C                     END
|    C*
22===C           E2000     ENDSR
     C*==============================================================*
     C*          R2B00 ....CHECK 'SC02' --- SFLSR
     C*==============================================================*
23===C           R2B00     BEGSR
|    C*
|    C                     Z-ADD*ZERO     CKFLD   10
|    C                     Z-ADD0         DPP07            應計總工時
|    C                     Z-ADD0         DPP08            實際總工時
|    C*CHECK HEADING
|    C*
|    C                     SETON                     54
|    C                     READCSFLSR                  5757
|    C*
| 01-C           *IN57     DOWEQ'0'
|   C           *IN99     ANDEQ'0'
|   C*
| 02-C           DDEL      IFNE 'D'
|   C                     EXSR R2B10
| 02-C                     END
|   C*
|   C                     UPDATSFLSR
|   C*
| 03-C           DPQ05     IFNE *BLANK
|   C           DDEL      ANDEQ*BLANKS
|   C                     Z-ADD1         CKFLD
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '1'
|   C                     Z-ADDRRN       DRRN
| 04*C                     ELSE
|   C                     READCSFLSR                    57
| 04-C                     END
|   C*
| 01-C                     END
|    C*
| 05-C           CKFLD     IFEQ 0
|   C                     MOVEL'UPT0130' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 05-C                     END
|    C   99                GOTO E2B00
|    C*
|    C                     EXSR R1CG0
|    C*
23===C           E2B00     ENDSR
     C*==============================================================*
     C*          R2B10 ....'SC02' CHECK - SFL DETAIL
     C*==============================================================*
24===C           R2B10     BEGSR
|    C*
|    C*實際工時
| 01-C           DNEW      IFEQ 'Y'
| 02-C           DPQ08     IFEQ 0
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 02-C                     END
|   C   99                GOTO E2B10
|   C*應計工時
| 03-C           DPQ07     IFEQ 0
|   C           DPP06     ANDEQ'B'
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 03-C                     END
|   C   99                GOTO E2B10
| 01-C                     END
|    C*
| 04-C           DPP06     IFEQ 'A'
|   C*                    Z-ADDDPQ08     DPQ07            應計工時
|   C                     ADD  DPQ07     DPP07            應計總工時
|   C                     ADD  DPQ08     DPP08            實際總工時
| 04-C                     END
|    C*
| 05-C           DPP06     IFEQ 'B'
|   C                     ADD  DPQ07     DPP07            應計總工時
|   C                     ADD  DPQ08     DPP08            實際總工時
| 05-C                     END
|    C*
| 06-C           DPP06     IFEQ 'C'
|   C*                    Z-ADDDPQ08     DPQ07            應計工時
|   C                     ADD  DPQ07     DPP07            應計總工時
|   C                     ADD  DPQ08     DPP08            實際總工時
| 06-C                     END
|    C*
|    C*
24===C           E2B10     ENDSR
     C*==============================================================*
     C*          R2E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
25===C           R2E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* <<SFL HEAD FIELD>>
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* SFL DETAIL
| 01-C           #LIN      IFLT @SFTOP
|   C           #LIN      ANDGT@SFBOT
|   C                     GOTO E2E00
| 01-C                     END
|    C* GET SFL REC
|    C           #LIN      SUB  @SFTOP    @PRRN
|    C           @PRRN     DIV  1         @PRRN
|    C                     MVR            @LINE   20
|    C*
|    C                     ADD  #DRRN     @PRRN            .PROMPT RRN
|    C           @PRRN     CHAINSFLSR                40
|    C   40                GOTO E2E00
|    C*
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
| 02-C           DNEW      IFEQ 'Y'
|   C* << SFLSR FIELD >>
| 03-C           @LINE     IFEQ 0
|   C           #COL      ANDGE10
|   C           #COL      ANDLE15
|   C                     CALL 'PYI101'
|   C                     PARM DPP01     P101I1  2         公司別
|   C           DPQ05     PARM DPQ05     P101I2  8         員工　
|   C                     PARM           @RTNC   2          FUN KEY
| 03-C                     END
|   C*
|   C           KEYEM3    CHAINEML2                 40
| 04-C           *IN40     IFEQ '0'
|   C                     CALL 'P65'
|   C                     PARM EM03L     P6501I 80
|   C                     PARM 9         P6502I  30
|   C           DEM03     PARM           P6501O 80
|   C                     PARM           P6502O 80
| 04-C                     END
|   C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|   C                     SETOF                     32
| 02*C                     ELSE
|   C                     SETON                     32
| 02-C                     END
|    C*
|    C* UPD SFL
|    C                     SETON                     54
|    C                     UPDATSFLSR
|    C*
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
25===C           E2E00     ENDSR
     C*==============================================================*
     C*          R2D00 ....FILE PROCESS
     C*==============================================================*
26===C           R2D00     BEGSR
|    C*
| 01-C           DOPT      CASEQ1         R2D10
|   C           DOPT      CASEQ2         R2D20
|   C           DOPT      CASEQ4         R2D30
| 01-C                     END
|    C*
26===C                     ENDSR
     C*==============================================================*
     C*          R2D10 ....FILE PROCESS : ADD
     C*==============================================================*
27===C           R2D10     BEGSR
|    C* DETAIL
|    C                     READCSFLSR                    57
|    C*
| 01-C           *IN57     DOWEQ'0'
|   C*
| 02-C           DPQ05     IFNE *BLANK
|   C*
| 03-C           DDEL      IFNE 'D'
|   C                     EXSR R2D12
|   C                     WRITEPQ0
| 03-C                     END
|   C*
| 02-C                     END
|   C*
|   C                     READCSFLSR                    57
| 01-C                     END
|    C* HEAD
|    C           KEYPQ1    CHAINPQ0                  42
| 04-C           *IN42     IFEQ '0'
|   C                     EXSR R2D11
|   C                     WRITEPP0
| 04-C                     END
|    C*
27===C                     ENDSR
     C*==============================================================*
     C*          R2D11 ....SCREEN FIELD TO FILE
     C*==============================================================*
28===C           R2D11     BEGSR
|    C*
|    C                     MOVELDPP01     PP01             *公司
|    C                     Z-ADDDYY       PP02             *獎金年度
|    C                     Z-ADDWPP03     PP03             *計薪年月
|    C                     Z-ADD0         PP03D            *發放日期
|    C                     MOVELDPP04     PP04             *部門
|    C                     MOVELDPP06     PP06             *獎金註記
|    C                     Z-ADDDPP07     PP07             應計總工時
|    C                     Z-ADDDPP08     PP08             實際總工時
|    C                     Z-ADDDPP09     PP09             應計總金額
|    C                     Z-ADDDPP10     PP10             實際總金額
|    C*
|    C                     MOVEL*BLANK    PP11
|    C                     MOVEL*BLANK    PP12
|    C                     Z-ADD0         PP13
|    C                     MOVEL*BLANK    PP95
|    C                     Z-ADD0         PP96
|    C*
|    C                     Z-ADD$A8YMD    PP97
|    C                     TIME           PP98
|    C                     MOVEL$USER     PP99
|    C*
28===C                     ENDSR
     C*==============================================================*
     C*          R2D12 ....FILE PROCESS : ADD  (ADD NEW)
     C*==============================================================*
29===C           R2D12     BEGSR
|    C*
|    C                     MOVELDPP01     PQ01             *公司
|    C                     Z-ADDDYY       PQ02             *獎金年度
|    C                     Z-ADDWPP03     PQ03             *計薪年月
|    C                     Z-ADD0         PQ03D            *發放日期
|    C                     MOVELDPP04     PQ04             *部門
|    C                     MOVELDPQ05     PQ05             *員工編號
|    C*
|    C                     Z-ADDDPQ07     PQ07             應計工時
|    C                     Z-ADDDPQ08     PQ08             實際工時
|    C                     Z-ADDDPQ09     PQ09             應計獎金
|    C                     Z-ADDDPQ10     PQ10             實際獎金
|    C*
|    C                     MOVEL*BLANK    PQ12
|    C                     Z-ADD0         PQ13
|    C*
|    C                     Z-ADD$A8YMD    PQ97
|    C                     TIME           PQ98
|    C                     MOVEL$USER     PQ99
|    C*
29===C                     ENDSR
     C*==============================================================*
     C*          R2D20 ....FILE PROCESS : UPD
     C*==============================================================*
30===C           R2D20     BEGSR
|    C* DETAIL
|    C*
|    C                     READCSFLSR                  5757
| 01-C           *IN57     DOWEQ'0'
|   C*
| 02-C           DPQ05     IFNE *BLANK
|   C*
|   C           KEYPQ     CHAINPQ0                  41
|   C*
| 03-C           DDEL      IFEQ 'D'
|   C  N41                DELETPQ0
| 03*C                     ELSE
|   C                     EXSR R2D12
|   C  N41                UPDATPQ0
|   C   41                WRITEPQ0
| 03-C                     END
|   C*
| 02-C                     END
|   C*
|   C                     READCSFLSR                    57
| 01-C                     END
|    C*
|    C           KEYPP1    CHAINPP0                  43
|    C                     EXSR R2D11
|    C  N43                UPDATPP0
|    C*
30===C                     ENDSR
     C*==============================================================*
     C*          R2D30 ....FILE PROCESS
     C*==============================================================*
31===C           R2D30     BEGSR
|    C* DETAIL
|    C           KEYPP     SETLLPQ0
|    C           KEYPP     READEPQ0                      46
| 01-C           *IN46     DOWEQ'0'
|   C                     DELETPQ0
|   C           KEYPP     READEPQ0                      46
| 01-C                     END
|    C*
|    C           KEYPQ1    CHAINPQ0                  42
|    C           KEYPP1    CHAINPP0                  43
|    C   42N43             DELETPP0
|    C*
31===C                     ENDSR
     C*==============================================================*
**
新增修改      刪除查詢
