     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA4171                                    *
     H*    PROGRAM NAME :公司獎金取消核定作業                      *
     H*    AUTHOR       : A1386 SHARON                               *
     H*    CREATE DATE  : 93/07/13                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FPYPBLF02UP  E           K        DISK
     FPYPCPF  UF  E           K        DISK
     E*---------------------------------------------------------------
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I                                      201 2080$A8YMD
     I*
     I                                      501 502 DPB01
     I                                      505 506 DPB04
     I                                      561 5630DPB03
     I                                      606 6110WOS03
     I*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYPB     KLIST
     C                     KFLD           DPB01
     C                     KFLD           WPB03
     C                     KFLD           DPB04
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C                     Z-ADD*ZERO     PB96
     C                     UPDATPB0
     C*
     CLR                   EXSR SRDEL
     C*==============================================================*
     C           SRDEL     BEGSR
     C*
     C           KEYPB     SETLLPC0
     C           KEYPB     READEPC0                      44
    *C           *IN44     DOWEQ'0'
     C                     DELETPC0
     C           KEYPB     READEPC0                      44
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C           *INZSR    BEGSR
     C*
     C           DPB03     ADD  1911      WPB03   40
     C*
     C                     ENDSR
