     H****************************************************************
     H*            泛太資訊科技開發股份有限公司－版權所有          *
     H*--------------------------------------------------------------*
     H*    PROGRAM NAME : PYA411                                     *
     H*    AUTHOR       : A1325  SANTOS                              *
     H*    CREATE DATE  : 91/07/30                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       : MIRS                                       *
     H*    SUBSYSTEM    : EL                                         *
     H*    REMARK       : 生產獎金資料確認                         *
     H****************************************************************
     FPYPPPF  UF  E           K        DISK
     FPYPQPF  IF  E           K        DISK
     FPYEMLF07IF  E           K        DISK
     FPYEMLF02IF  E           K        DISK
     F            EM0                               KRENAMEEML2
     FPYOSPF  UF  E           K        DISK                      A
     FPYA412D CF  E                    WORKSTN      KINFDS DSPFDS
     F                                        RRN   KSFILE SFLSR
     E*---------------------------------------------------------------*
     E                    @A01        5  1               作業權利
     E                    WFUN    5   5  6               作業方式
     E                    WA         16  2               檢查SFL資料是否重復
     E*---------------------------------------------------------------*
     IEML2
     I              EM01                            EM01L
     I              EM02                            EM02L
     I              EM03                            EM03L
     I              EM031                           EM031L
     I              EM041                           EM041L
     I              EM042                           EM042L
     I              EM043                           EM043L
     I              EM044                           EM044L
     I              EM20                            EM20L
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I                                    B 378 3790#DRRN
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I*
     I            DS
     I                                        1  62 @T1
     I                                        1  62 DT205
     I*
     I            DS
     I                                        1   5 PP04
     I                                        1   1 PP041
     I                                        2   2 PP042
     I                                        3   3 PP043
     I                                        4   5 PP044
     I            DS
     I                                        1   5 PQ04
     I                                        1   1 PQ041
     I                                        2   2 PQ042
     I                                        3   3 PQ043
     I                                        4   5 PQ044
     I            DS
     I                                        1   5 DPP04
     I                                        1   1 DPP041
     I                                        2   2 DPP042
     I                                        3   3 DPP043
     I                                        4   5 DPP044
     I            DS
     I                                        1   5 EM04
     I                                        1   1 EM041
     I                                        2   2 EM042
     I                                        3   3 EM043
     I                                        4   5 EM044
     I            DS
     I                                        1   5 TR06
     I                                        1   1 TR061
     I                                        2   2 TR062
     I                                        3   3 TR063
     I                                        4   5 TR064
     I            DS
     I                                        1   5 TR06L
     I                                        1   1 TR061L
     I                                        2   2 TR062L
     I                                        3   3 TR063L
     I                                        4   5 TR064L
     I            DS
     I                                        1   5 TR06A
     I                                        1   1 TR061A
     I                                        2   2 TR062A
     I                                        3   3 TR063A
     I                                        4   5 TR064A
     I            DS
     I                                        1   80DYMD
     I                                        1   40DYY
     I                                        1   60DYM
     I                                        5   60DMM
     I                                        7   80DD
     I            DS
     I                                        1   80DYMD1
     I                                        1   40DYY1
     I                                        1   60DYM1
     I                                        5   60DMM1
     I                                        7   80DD1
     I/COPY PYDDSSRC,PYPMDS01
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN CM004O    DFMT
     C           *LIKE     DEFN CM005O    DTYPE
     C           *LIKE     DEFN RRN       @DRCD            DSP REC NUM
     C           *LIKE     DEFN RRN       @PRCD            PAGE REC
     C           *LIKE     DEFN RRN       @LRRN            LAST REC NUM
     C           *LIKE     DEFN RRN       @LPAGE           LAST PAGE
     C           *LIKE     DEFN RRN       @PRRN            PROMPT USE
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYPP     KLIST                           *PYEMPF
     C                     KFLD           DPP01            公司別
     C                     KFLD           WPP03   60       發放年月
     C                     KFLD           DPP041           部門編號
     C                     KFLD           DPP042           部門編號
     C                     KFLD           DPP043           部門編號
     C                     KFLD           DPP044           部門編號
     C           KEYPP1    KLIST                           *PYEMPF
     C                     KFLD           DPP01            公司別
     C                     KFLD           WPP03   60       發放年月
     C                     KFLD           DPP041           部門編號
     C                     KFLD           DPP042           部門編號
     C                     KFLD           DPP043           部門編號
     C                     KFLD           DPP044           部門編號
     C                     KFLD           DPP06            獎金註記
     C           KEYPQ     KLIST                           *PYEMPF
     C                     KFLD           DPP01            公司別
     C                     KFLD           WPP03            發放年月
     C                     KFLD           DPP041           部門編號
     C                     KFLD           DPP042           部門編號
     C                     KFLD           DPP043           部門編號
     C                     KFLD           DPP044           部門編號
     C                     KFLD           DPQ05            員工編號
     C           KEYEM     KLIST                           *PYEMPF
     C                     KFLD           DPP01            公司別
     C                     KFLD           DPP041           部門編號
     C                     KFLD           DPP042           部門編號
     C                     KFLD           DPP043           部門編號
     C                     KFLD           DPP044           部門編號
     C           KEYEM1    KLIST                           *PYEMPF
     C                     KFLD           PQ05             員工編號
     C                     KFLD           DPP01            公司別
     C           KEYPQ1    KLIST                           *PYEMPF
     C                     KFLD           DPP01            公司別
     C                     KFLD           WPP03   60       發放年月
     C           KEYOS     KLIST                           *PYOSPF
     C                     KFLD           OS01             公司編號
     C                     KFLD           OS02             員工編號
     C                     KFLD           OS03             年月
     C                     KFLD           OS04             期別
     C                     KFLD           OS05             薪資項目
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
    C           SCID      CASEQ'SC02'    R2000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     MOVEL'SC01'    SCID    4
|    C* FUN AUT
|    C                     MOVE $ADD      @A01,1
|    C                     MOVE $UPD      @A01,2
|    C                     MOVE $DLT      @A01,4
|    C                     MOVE $INQ      @A01,5
|    C*
|    C*
|    C                     Z-ADD1         DOPT
|    C                     Z-ADD0         DPP03
|    C                     Z-ADD0         WPP03
|    C                     MOVEL*BLANK    DPP04
|    C                     MOVEL*BLANK    DPP04N
|    C                     MOVEL*BLANK    DPP06
|    C                     Z-ADD0         DPP07
|    C                     Z-ADD0         DPP08
|    C                     Z-ADD0         DPP09
|    C                     Z-ADD0         DPP10
|    C*
|    C                     Z-ADD1         DD               *日期
|    C                     MOVEL*BLANK    @T1
|    C*
|    C                     MOVEL$COR      DPP01
| 01-C           $RMK03    IFNE 'Y'
|   C                     SETOF                     32
| 01*C                     ELSE
|   C                     SETON                     32
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
|   C                     EXSR R1E00
|   C                     GOTO E1000
| 02-C                     END
|    C*
| 03-C           *IN18     IFEQ '1'                        *BROWSE
|   C                     EXSR R1A00
|   C                     GOTO E1000
| 03-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 04-C           *IN99     IFEQ '0'
|   C                     EXSR R1C00
|   C                     MOVEL'SC02'    SCID             *SCR2
| 05-C           *IN99     IFEQ '1'
|   C                     MOVEL'SC01'    SCID             *SCR2
| 05-C                     END
| 04-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1A00 ....全頁查詢 (PF18 : CALL SUB-PROGRAM)
     C*==============================================================*
03===C           R1A00     BEGSR
|    C* AUT CHECK
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM 'PYI411'  S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     99
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C   99                GOTO E1A00
|    C*
|    C                     CALL 'PYI411'
|    C*----------------------------------------------------------------
|    C                     PARM DPP01     I301I1  2         公司編號
|    C           DPP03     PARM DPP03     I301I2  60        發放年月
|    C           DPP06     PARM DPP06     I411I3  1         註記
|    C           DPP09     PARM DPP09     I411I4  90        應計金額
|    C           DPP10     PARM DPP10     I411I5  90        實際金額
|    C           DPP07     PARM DPP07     I411I6  70        應計工時
|    C           DPP08     PARM DPP08     I411I7  70        實際工時
|    C           DPP04     PARM DPP04     I411I8  5         部門代號
|    C*----------------------------------------------------------------
|    C                     PARM           @RTNC   2          FUN KEY
|    C*
| 02-C           @RTNC     IFEQ '03'
|   C                     SETON                     03
| 02-C                     END
|    C*
03===C           E1A00     ENDSR
     C*==============================================================*
     C*          R1B00 ....SCREEN CHECK
     C*==============================================================*
04===C           R1B00     BEGSR
|    C* CHK FUN AUT
| 01-C           @A01,DOPT IFNE 'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 01-C                     END
|    C   99                GOTO E1B00
|    C*---------------------------------------------------------------
|    C* << CHACK 公司別NOT *BLANK >>
|    C                     MOVEL*BLANK    DPP01N
| 02-C           DPP01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DPP01     CM001I  2         公司代號
|    C           DPP01N    PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C           DFMT      PARM           CM004O  1         日期格式
|    C           DTYPE     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 03-C           CM099O    IFEQ 'N'
|   C                     SETON                     6099
|   C                     MOVEL'US#0099' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 03-C                     END
|    C   99                GOTO E1B00
|    C*
| 04-C           CM099O    IFEQ *BLANK
|   C                     SETON                     6099
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 04-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*+<<DATA CHECK>>+++++++++++++++++++++++++++++++++++++++++++++++++
|    C*發放年月
| 05-C           DPP03     IFEQ 0
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 05-C                     END
|    C   99                GOTO E1B00
|    C*日期格式轉換
|    C                     Z-ADDDPP03     DYM
|    C                     CALL 'P31'
|    C                     PARM DYMD      P3101I  80
|    C                     PARM DFMT      P3102I  1
|    C                     PARM DTYPE     P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C                     PARM           P3111O  80
|    C                     Z-ADDP3111O    DYMD
|    C*發放年月
|    C                     CALL 'P30'
|    C                     PARM DYMD      P3001I  80
|    C                     PARM DFMT      P3002I  1
|    C                     PARM DTYPE     P3003I  1
|    C                     PARM           P3001O  1
| 06-C           P3001O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 06-C                     END
|    C   99                GOTO E1B00
|    C                     Z-ADDDYM       WPP03
|    C*
|    C*---------------------------------------------------------------
|    C*部門別
|    C           KEYEM     CHAINEM0                  41
|    C                     CALL 'PYSCM1'
|    C                     PARM DPP01     CM101I  2         公司代號
|    C                     PARM DPP04     CM102I  5         部門代號
|    C                     PARM           CM103O 14         部門名稱
|    C                     PARM           CM199O  1         存在否？
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 07-C           CM199O    IFEQ 'N'
|   C                     SETON                     6399
|   C                     MOVEL'US#0098' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 07-C                     END
|    C   99                GOTO E1B00
|    C*
| 08-C           CM199O    IFEQ *BLANK
|   C           *IN41     OREQ '1'
|   C                     SETON                     6399
|   C                     MOVEL'US#1111' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 08-C                     END
|    C   99                GOTO E1B00
|    C*部門名稱
|    C                     CALL 'P65'
|    C                     PARM CM103O    P6501I 80
|    C                     PARM 7         P6502I  30
|    C           DPP04N    PARM           P6501O 80
|    C                     PARM           P6502O 80
|    C*
|    C           KEYPP1    CHAINPP0                  40
|    C*
| 09-C           DOPT      IFEQ 1
| 10-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606163
|   C                     SETON                     1199
| 10*C                     ELSE
|   C*
     C                     Z-ADDPP07      DPP07            *應計總工
     C                     Z-ADDPP08      DPP08            *實際總工
     C                     Z-ADDPP09      DPP09            *應計總金
     C                     Z-ADDPP10      DPP10            *實際總金
|   C*
| 11-C           PP95      IFEQ 'Y'
|   C                     MOVEL'UPY0015' ERRID
|   C                     MOVEL'CEMF'    ERRF
|   C                     SETON                     606163
|   C                     SETON                     1199
| 11-C                     END
|   C*
| 10-C                     END
| 09-C                     END
|    C   99                GOTO E1B00
|    C*獎金註記DPP06
| 12-C           DPP06     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 12-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*---------------------------------------------------------------
|    C*應計金額
| 13-C*          DPP09     IFEQ 0
|   C*                    MOVEL'UPT0012' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6499
| 13-C*                    END
|   C*  99                GOTO E1B00
|    C*
|    C                     Z-ADDDYMD      DYMD1
|    C                     ADD  1         DMM1
| 14-C           DMM1      IFGT 12
|   C                     ADD  1         DYY1
|   C                     Z-ADD1         DMM1
| 14-C                     END
|    C*----------------------------------------------------------------
|    C*
04===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....SCREEN 2, 3 PREPARE
     C*==============================================================*
05===C           R1C00     BEGSR
|    C*
|    C                     MOVE WFUN,DOPT DFUN
|    C                     EXSR R1CC0                      *INIT SFL
|    C                     SETOF                     31
|    C* DEL & INQ
|    C                     EXSR R1CB0                      *HEADING
|    C                     EXSR R1CE0                      *READ DETAIL
|    C                     SETON                     53    *SFLEND
|    C*SFLDSP
| 01-C           @LRRN     IFGT 0
|   C                     Z-ADD1         DRRN
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     99    *NO DTA
|   C                     MOVEL'UPT2050' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C*
|    C* RELEASE FILE (ADD & INQUIRY)++++++++++++++++++++++++++++++++++*
| 02-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 5
|   C           *LOVAL    SETLLPP0
|   C           *LOVAL    SETLLPQ0
| 02-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R1CB0 ....SFL HEAD INIT : U/D/I/A-COPY
     C*==============================================================*
06===C           R1CB0     BEGSR
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* << U/D/I AND ADD-COPY : SUBFILE HEAD DATA INITAILIZE>>
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C                     Z-ADD0         DPP07
|    C                     Z-ADD0         DPP08
|    C                     Z-ADD0         DPP10
|    C           KEYPP     CHAINPP0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     Z-ADDPP07      DPP07
|   C                     Z-ADDPP08      DPP08
|   C                     Z-ADDPP10      DPP10
| 01-C                     END
|    C*
06===C                     ENDSR
     C*=============================================================*
     C*          R1CC0 ....SUBFILE INIT
     C*=============================================================*
07===C           R1CC0     BEGSR
|    C* SFL SETTING ++++++++++++++++++++++++++++++++++++++++++++++++++
|    C                     Z-ADD10        @PRCD            *PGE RCD
|    C                     Z-ADD11        @SFTOP  20       *SFL TOP LIN
|    C                     Z-ADD19        @SFBOT  20       *SFL BOT LIN
|    C                     Z-ADD1         @LNUM   20       *明細行數
|    C* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C                     Z-ADD0         DRRN
|    C                     Z-ADD0         RRN
|    C                     Z-ADD0         @LRRN            *LAST RRN
|    C                     Z-ADD0         @DRCD            *DSP RCD
|    C*
|    C                     SETOF                     51    *SFLDSPCTL
|    C*
|    C                     SETON                     52    *SFLCLR
|    C                     WRITESFLCR
|    C                     SETOF                     52
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     SETOF                     5053  *SFLDSP,END
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          R1CE0 ....DETAIL DATA TO SFL
     C*==============================================================*
08===C           R1CE0     BEGSR
|    C*
|    C                     SETON                     54    *54
|    C*
|    C           KEYPP     SETLLPQ0
|    C           KEYPP     READEPQ0                      46*NF/EOF
|    C*
| 01-C           *IN46     DOWEQ'0'
|   C                     EXSR R1CE1
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
|   C           KEYPP     READEPQ0                      46*NF/EOF
| 01-C                     END
|    C*
|    C                     SETON                     53
|    C                     Z-ADDRRN       @LRRN
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          R1CE1 ....DETAIL DATA TO SFL
     C*==============================================================*
09===C           R1CE1     BEGSR
|    C*
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C                     SETON                     31
|    C                     MOVELPQ05      DPQ05            *員工編號
|    C                     Z-ADDPQ07      DPQ07            *應計工時
|    C                     Z-ADDPQ08      DPQ08            *實際工時
|    C                     Z-ADDPQ09      DPQ09            *應計獎金
|    C                     Z-ADDPQ10      DPQ10            *實際獎金
|    C*員工姓名
|    C                     MOVEL*BLANK    DEM03
|    C           KEYEM1    CHAINEML2                 40
|    C  N40                MOVELEM03L     DEM03
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          R1E00 ....'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
10===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*部門編號DPQ05
| 01-C           #LIN      IFEQ 4
|   C           #COL      ANDGE53
|   C           #COL      ANDLE57
|   C                     CALL 'PYI512'
|   C           DPP04     PARM DPP04     I512I1  5         部門代碼
|   C                     PARM           @RTNC   2          FUN KEY
| 01-C                     END
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          R2000 ....'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
11===C           R2000     BEGSR
|    C*
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E2000
| 01-C                     END
|    C*
| 02-C*          *IN04     IFEQ '1'
| 03-C*          DOPT      IFEQ 1
|   C*          DOPT      OREQ 2
|   C*                    EXSR R2E00                      *CHK SCR
| 03-C*                    END
|   C*                    GOTO E2000
| 02-C*                    END
|    C*
| 04-C           *IN12     IFEQ '1'
|   C                     MOVEL'SC01'    SCID
|   C                     GOTO E2000
| 04-C                     END
|    C*
| 05-C*          *IN05     IFEQ '1'
|   C*                    EXSR R2B00                      *CHK SCR
|   C*                    GOTO E2000
| 05-C*                    END
|    C*
| 06-C           DOPT      IFEQ 1
|   C           DOPT      OREQ 2
|   C                     EXSR R2B00                      *CHK SCR
| 06-C                     END
|    C*
| 07-C           *IN99     IFEQ '0'
|   C**         *IN13     ANDEQ'1'                         SAVE
|   C                     EXSR R2D00                      *FILE UPD
|   C                     MOVE 'SC01'    SCID
| 07-C                     END
|    C*
11===C           E2000     ENDSR
     C*==============================================================*
     C*          R2B00 ....CHECK 'SC02' --- SFLSR
     C*==============================================================*
12===C           R2B00     BEGSR
|    C*
|    C*
12===C           E2B00     ENDSR
     C*==============================================================*
     C*          R2B10 ....'SC02' CHECK - SFL DETAIL
     C*==============================================================*
13===C           R2B10     BEGSR
|    C*
|    C*
13===C           E2B10     ENDSR
     C*==============================================================*
     C*          R2E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
14===C           R2E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* <<SFL HEAD FIELD>>
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
14===C           E2E00     ENDSR
     C*==============================================================*
     C*          R2D00 ....FILE PROCESS
     C*==============================================================*
15===C           R2D00     BEGSR
|    C*
| 01-C           DOPT      IFEQ 1
|   C                     EXSR R2D20
| 01-C                     END
|    C*
15===C                     ENDSR
     C*==============================================================*
     C*          R2D20 ....FILE PROCESS : UPD
     C*==============================================================*
16===C           R2D20     BEGSR
|    C*
|    C           KEYPP1    CHAINPP0                  41
|    C                     MOVEL'Y'       PP95             *獎金確認
|    C  N41                UPDATPP0
|    C*
|    C           KEYPQ1    SETLLPQ0
|    C           KEYPQ1    READEPQ0                      46*NF/EOF
| 01-C           *IN46     DOWEQ'0'
|   C                     EXSR R2D21
|   C           KEYPQ1    READEPQ0                      46*NF/EOF
| 01-C                     END
|    C*
16===C                     ENDSR
     C*==============================================================*
     C*          R2D21 ....FILE PROCESS
     C*==============================================================*
15===C           R2D21     BEGSR
|    C*
|    C           KEYOS     CHAINOS0                  41
|    C*
|    C                     MOVELPQ01      OS01             公司編號
|    C                     MOVELPQ02      OS02             員工編號
|    C                     Z-ADDPQ03      OS03             年月
|    C                     MOVEL'1'       OS04             期別
|    C                     MOVEL'13'      OS05             薪資項目
|    C                     Z-ADDPQ10      OS06             金額
|    C                     Z-ADD0         OS07             次數
|    C                     Z-ADD0         OS08             每次金額
|    C                     Z-ADD$A8YMD    OS97             　　　　
|    C                     TIME           OS98
|    C                     MOVEL$USER     OS99
|    C*
|    C   41                WRITEOS0
|    C  N41                UPDATOS0
|    C*
15===C                     ENDSR
     C*==============================================================*
**
確認                  查詢
