     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : PYA507                                     *
     H*    PROGRAM NAME :每月工作天數設定                          *
     H*    AUTHOR       : A1165 SERMON                               *
     H*    CREATE DATE  : 85/08/10                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FPYA1PF  UF  E           K        DISK                      A
     FPYA507D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     E*                   @A01        5  1               作業權利
     E                    @F01    5   5  6               作業說明
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I*LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      203 2080DDATE
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      201 2080$A8YMD
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYA1     KLIST                           *MAIN FILE
     C                     KFLD           WA101   40
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N99                EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
    C           SCID      CASEQ'SC02'    R2000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     IN   PTDA01
|    C*
|    C                     MOVE 'SC01'    SCID    4
|    C* FUN AUT
|    C*                    MOVE $ADD      @A01,1
|    C*                    MOVE $UPD      @A01,2
|    C*                    MOVE $DLT      @A01,4
|    C*                    MOVE $INQ      @A01,5
|    C*
|    C*                    Z-ADD$CHYMD    DDATE
|    C* SC01 FIELD INITIALIZE *--------------------------------------*
|    C                     Z-ADD1         DOPT
|    C                     MOVELDDATE     XA101   20
|    C                     Z-ADDXA101     DA101
|    C*--------------------------------------------------------------*
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E1000
| 01-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 02-C           *IN99     IFEQ '0'                        *SCR CHK OK
|   C                     EXSR R1C00                      *PRE-SC02
|   C                     MOVEL'SC02'    SCID
| 02-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1B00 .... 'SC01' SCREEN CHECK
     C*==============================================================*
03===C           R1B00     BEGSR
|    C*
|    C* CHK FUN AUT
|    C*          @A01,DOPT IFNE 'Y'
|    C*                    MOVEL'UPT2150' ERRID
|    C*                    MOVEL'PTMF'    ERRF
|    C*                    SETON                     99
|    C*                    END
|    C*  99                GOTO E1B00
|    C*
|    C* DATA CHECK *--------------------------------------------------*
|    C**************配合西元年使用
|    C**         DA101     IFEQ *ZERO
|    C**                   MOVEL'UPT0010' ERRID
|    C**                   MOVEL'PTMF'    ERRF
|    C**                   SETON                     6099
|    C**                   END
|    C** 99                GOTO E1B00
|    C**************
|    C                     CALL 'P82'
|    C                     PARM DA101     P8201I  40
|    C                     PARM '1'       P8202I  1
|    C                     PARM '1'       P8203I  1
|    C                     PARM '2'       P8204I  1
|    C                     PARM '1'       P8205I  1
|    C           WA101     PARM           P8211I  40
|    C*
|    C           KEYA1     CHAINA10                  40
|    C*
| 01-C           DOPT      IFEQ 1                          *ADD
|   C           *IN40     ANDEQ'0'
|   C                     MOVEL'UPT2020' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
| 02-C           DOPT      IFNE 1                          *UPD,DEL,INQ
|   C           *IN40     ANDEQ'1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
03===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....INIT 'SC02'
     C*==============================================================*
04===C           R1C00     BEGSR
|    C*
|    C                     MOVEL@F01,DOPT DFUN
|    C*
| 01-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 2                          *UPD
|   C                     SETON                     31    *CAN INPUT
| 01*C                     ELSE                            *DEL, INQ
|   C                     SETOF                     31    *INP PROTECT
| 01-C                     END
|    C*
| 02-C           DOPT      IFEQ 1                          *ADD
|   C                     EXSR R1C10
| 02*C                     ELSE                            *U/D/I
|   C                     EXSR R1C20
| 02-C                     END
|    C*
|    C* RELEASE FILE (ADD & INQUIRY)----------------------------------*
| 03-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 5                          *INQ
|   C           *LOVAL    SETLLA10
| 03-C                     END
|    C*---------------------------------------------------------------*
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R1C10 ....'SC02' FIELD INIT : ADD (NO COPY)
     C*==============================================================*
05===C           R1C10     BEGSR
|    C*
|    C                     Z-ADD*ZERO     DA102
|    C                     Z-ADD*ZERO     DA103
|    C                     Z-ADD*ZERO     DA104
|    C                     Z-ADD*ZERO     DA105
|    C                     Z-ADD*ZERO     DA106
|    C                     Z-ADD*ZERO     DA107
|    C                     Z-ADD*ZERO     DA108
|    C                     Z-ADD*ZERO     DA109
|    C                     Z-ADD*ZERO     DA110
|    C                     Z-ADD*ZERO     DA111
|    C                     Z-ADD*ZERO     DA112
|    C                     Z-ADD*ZERO     DA113
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*  R1C20 ....'SC02' FIELD INIT : UPD, DEL, INQ, (ADD & COPY)
     C*==============================================================*
06===C           R1C20     BEGSR
|    C*
|    C                     Z-ADDA102      DA102
|    C                     Z-ADDA103      DA103
|    C                     Z-ADDA104      DA104
|    C                     Z-ADDA105      DA105
|    C                     Z-ADDA106      DA106
|    C                     Z-ADDA107      DA107
|    C                     Z-ADDA108      DA108
|    C                     Z-ADDA109      DA109
|    C                     Z-ADDA110      DA110
|    C                     Z-ADDA111      DA111
|    C                     Z-ADDA112      DA112
|    C                     Z-ADDA113      DA113
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R2000 .... 'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
07===C           R2000     BEGSR
|    C*
|    C                     EXFMTDSPD2
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E2000
| 01-C                     END
|    C*
| 02-C           *IN12     IFEQ '1'                        *PREVIOUS
|   C* RELEAS FILE --------------------------------------------------*
|   C           *LOVAL    SETLLA10
|   C*---------------------------------------------------------------*
|   C                     MOVEL'SC01'    SCID
|   C                     GOTO E2000
| 02-C                     END
|    C*
| 03-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 2                          *UPD
|   C                     EXSR R2B00                      *SC02 CHK
| 03-C                     END
|    C*
| 04-C           *IN99     IFEQ '0'                        *CHK OK
|   C                     EXSR R2D00                      *FILE UPD
|   C                     MOVE 'SC01'    SCID
| 04-C                     END
|    C*
07===C           E2000     ENDSR
     C*==============================================================*
     C*          R2B00 ....'SC02' CHECK
     C*==============================================================*
08===C           R2B00     BEGSR
|    C*
| 01-C           DA102     IFGT 31
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 01-C                     END
|    C   99                GOTO E2B00
|    C*
| 02-C           DA103     IFGT 31
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 02-C                     END
|    C   99                GOTO E2B00
|    C*
| 03-C           DA104     IFGT 31
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 03-C                     END
|    C   99                GOTO E2B00
|    C*
| 04-C           DA105     IFGT 31
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 04-C                     END
|    C   99                GOTO E2B00
|    C*
| 05-C           DA106     IFGT 31
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6699
| 05-C                     END
|    C   99                GOTO E2B00
|    C*
| 06-C           DA107     IFGT 31
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6799
| 06-C                     END
|    C   99                GOTO E2B00
|    C*
| 07-C           DA108     IFGT 31
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6899
| 07-C                     END
|    C   99                GOTO E2B00
|    C*
| 08-C           DA109     IFGT 31
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6999
| 08-C                     END
|    C   99                GOTO E2B00
|    C*
| 09-C           DA110     IFGT 31
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7099
| 09-C                     END
|    C   99                GOTO E2B00
|    C*
| 10-C           DA111     IFGT 31
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7199
| 10-C                     END
|    C   99                GOTO E2B00
|    C*
| 11-C           DA112     IFGT 31
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7299
| 11-C                     END
|    C   99                GOTO E2B00
|    C*
| 12-C           DA113     IFGT 31
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7399
| 12-C                     END
|    C   99                GOTO E2B00
|    C*
08===C           E2B00     ENDSR
     C*==============================================================*
     C*          R2D00 ....FILE PROCESS
     C*==============================================================*
09===C           R2D00     BEGSR
|    C*
| 01-C           DOPT      CASEQ1         R2D10
|   C           DOPT      CASEQ2         R2D20
|   C           DOPT      CASEQ4         R2D30
| 01-C                     END
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          R2D10 ....FILE PROCESS : ADD
     C*==============================================================*
10===C           R2D10     BEGSR
|    C*
|    C                     EXSR R2D11
|    C                     WRITEA10
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          R2D11 ....SCREEN FIELD TO FILE
     C*==============================================================*
11===C           R2D11     BEGSR
|    C*
|    C                     Z-ADDWA101     A101
|    C                     Z-ADDDA102     A102
|    C                     Z-ADDDA103     A103
|    C                     Z-ADDDA104     A104
|    C                     Z-ADDDA105     A105
|    C                     Z-ADDDA106     A106
|    C                     Z-ADDDA107     A107
|    C                     Z-ADDDA108     A108
|    C                     Z-ADDDA109     A109
|    C                     Z-ADDDA110     A110
|    C                     Z-ADDDA111     A111
|    C                     Z-ADDDA112     A112
|    C                     Z-ADDDA113     A113
|    C                     TIME           A197
|    C                     Z-ADD$A8YMD    A198
|    C                     MOVEL$USER     A199
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          R2D20 ....FILE PROCESS : UPD
     C*==============================================================*
12===C           R2D20     BEGSR
|    C*
|    C                     EXSR R2D11
|    C                     UPDATA10
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          R2D30 ....FILE PROCESS
     C*==============================================================*
13===C           R2D30     BEGSR
|    C*
|    C                     DELETA10
|    C*
13===C                     ENDSR
**
新增修改      刪除查詢
