     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA534                                     *
     H*    PROGRAM NAME :團體保險費率設定                          *
     H*    AUTHOR       : A1274 EVA                                  *
     H*    CREATE DATE  : 89/08/21                                   *
     H*    UPDATE DATE  : 91/06/21 A1336 KLAUS                       *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FPYX9PF  UF  E           K        DISK                      A
     FPYA534D CF  E                    WORKSTN
     E*---------------------------------------------------------------*
     E                    @A01        5  1               作業權利
     E                    WFUN    5   5  6
     E*---------------------------------------------------------------*
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I                                    B 378 3790#DRRN
     I           UDS
     I                                      101 110 $USER
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      211 2160DDATE
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*PYX9PF
     C           KEYX9     KLIST
     C                     KFLD           DX901
     C**                   KFLD           DX902
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N99                EXSR R0100                      INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
    C           SCID      CASEQ'SC02'    R2000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                         LR
     C*==============================================================*
     C*          R0100.....INITIAL
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     MOVE 'SC01'    SCID    4
|    C* FUN AUT
|    C                     MOVE $ADD      @A01,1
|    C                     MOVE $UPD      @A01,2
|    C                     MOVE $DLT      @A01,4
|    C                     MOVE $INQ      @A01,5
|    C*
|    C* SC01 FIELD INITIALIZE *---------------------------------------
|    C                     MOVEL*BLANK    DX901
|    C***                  MOVEL*BLANK    DX902
|    C                     Z-ADD1         DOPT
|    C*
01===C                     ENDSR
     C*===============================================================*
     C*          R1000 .... 'SC01' SCREEN MAIN ROUTINE
     C*===============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C*
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'                        *PROMPT
|   C                     EXSR R1E00
|   C                     EXSR R1A00
|   C                     GOTO E1000
| 02-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 03-C           *IN99     IFEQ '0'                        *SCR CHK OK
|   C                     EXSR R1C00
|   C                     MOVEL'SC02'    SCID
| 03-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1A00 ....全頁查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
03===C           R1A00     BEGSR
|    C*
|    C* CALL SUB-PROGRAM
| 01-C           #FLD      IFEQ 'DX901'
|   C                     CALL 'PYI534'
|   C           DX901     PARM DX901     I001I1  3
|   C***        DX902     PARM DX902     I001I2  5
|   C                     PARM           @RTNC   2
| 01-C                     END
|    C*
|    C* RETURN CODE CHECK
| 02-C           @RTNC     IFEQ '03'                       *PF3
|   C                     SETON                     03
| 02-C                     END
|    C*
03===C           E1A00     ENDSR
     C*==============================================================*
     C*          R1B00....'SCR01' SCREEN CHECK
     C*===============================================================*
04===C           R1B00     BEGSR
|    C*
|    C*保險代號
| 01-C           DX901     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
| 02-C**         DX902     IFEQ *BLANK
|   C**                   MOVEL'UPT0010' ERRID
|   C**                   MOVEL'PTMF'    ERRF
|   C**                   SETON                     6199
| 02-C**                   END
|    C** 99                GOTO E1B00
|    C*
|    C*ADD
|    C           KEYX9     CHAINX90                  40
|    C*
| 03-C           DOPT      IFEQ 1
| 04-C           *IN40     IFEQ '0'
|   C                     SETON                     6061
|   C                     SETON                     99
|   C                     MOVEL'UPT2020' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 04-C                     END
|   C   99                GOTO E1B00
|   C*
| 03*C                     ELSE
|   C*
| 05-C           *IN40     IFEQ '1'
|   C                     SETON                     6061
|   C                     SETON                     99
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 05-C                     END
|   C   99                GOTO E1B00
|   C*
| 03-C                     END
|    C*
|    C*
04===C           E1B00     ENDSR
     C*===============================================================*
     C*          R1C00....INIT'SC02'
     C*===============================================================*
05===C           R1C00     BEGSR
|    C*
|    C*作業 DFUN
|    C                     MOVELWFUN,DOPT DFUN
|    C*
|    C                     SETOF                     31
|    C*ADD
| 01-C           DOPT      IFEQ 1
|   C                     SETON                     31
|   C                     EXSR R1CA0
| 01-C                     END
|    C*UPD
| 02-C           DOPT      IFEQ 2
|   C                     SETON                     31
|   C                     EXSR R1CB0
| 02-C                     END
|    C*DEL & INQ
| 03-C           DOPT      IFEQ 4
|   C           DOPT      OREQ 5
|   C                     EXSR R1CB0
| 03-C                     END
|    C*
|    C* RELEASE FILE (ADD & INQUIRY)----------------------------------*
| 04-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 5                          *INQ
|   C           *LOVAL    SETLLX90
| 04-C                     END
|    C*
05===C                     ENDSR
     C*===============================================================*
     C*          R1CA0 ....DSP2    INIT : ADD
     C*===============================================================*
06===C           R1CA0     BEGSR
|    C*
|    C                     Z-ADD*ZERO     DX910
|    C                     Z-ADD100       DX906
|    C                     Z-ADD*ZERO     DX905
|    C                     MOVEL*BLANK    DX909
|    C*
06===C                     ENDSR
     C*===============================================================*
     C*          R1CB0....DSP2     INIT : U/D/I
     C*===============================================================*
07===C           R1CB0     BEGSR
|    C*
|    C           KEYX9     CHAINX90                  40
|    C*
| 01-C           *IN40     IFEQ '0'
|   C                     Z-ADDX910      DX910
|   C                     Z-ADDX906      DX906
|   C                     Z-ADDX905      DX905
|   C                     MOVELX909      DX909
| 01-C                     END
|    C*
07===C                     ENDSR
     C*===============================================================*
     C*          R1E00   PROMPT
     C*===============================================================*
08===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*
08===C                     ENDSR
     C*===============================================================*
     C*          R2000 ....'SC02' SCREEN MAIN ROUTINE
     C*===============================================================*
09===C           R2000     BEGSR
|    C*
|    C                     EXFMTDSPD2
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E2000
| 01-C                     END
|    C*
|    C*          *IN05     IFEQ '1'                        *REFRESH
|    C*                    EXSR R2D40
|    C*                    GOTO E2000
|    C*                    END
|    C*
| 02-C           *IN12     IFEQ '1'                        *PREVIOUS
|   C           *LOVAL    SETLLX90
|   C                     MOVEL'SC01'    SCID
|   C                     GOTO E2000
| 02-C                     END
|    C*
| 03-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 2                          *UPD
|   C                     EXSR R2B00                      *SC02 CHK
| 03-C                     END
|    C*
| 04-C           *IN99     IFEQ '0'
|   C                     EXSR R2D00                      FILE PROCESS
|   C                     MOVE 'SC01'    SCID
| 04-C                     END
|    C*
09===C           E2000     ENDSR
     C*===============================================================*
     C*          R2B00 .... 'SC02' CHECK
     C*===============================================================*
10===C           R2B00     BEGSR
|    C*
|    C*應繳保費
| 01-C*          DX910     IFEQ *ZERO
|   C*                    SETON                     6499
|   C*                    MOVEL'UPT0010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
| 01-C*                    END
|    C*  99                GOTO E2B00
|    C*
|    C*折扣費率%
| 02-C           DX906     IFEQ *ZERO
|   C                     SETON                     6599
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|    C   99                GOTO E2B00
|    C*
10===C           E2B00     ENDSR
     C*===============================================================*
     C*          R2D00 .... FILE PROCESS
     C*===============================================================*
11===C           R2D00     BEGSR
|    C*
| 01-C           DOPT      CASEQ1         R2D10
|   C           DOPT      CASEQ2         R2D20
|   C           DOPT      CASEQ4         R2D30
| 01-C                     END
|    C*
11===C                     ENDSR
     C*
     C*===============================================================*
     C*          R2D10 ....FILE PROCESS :ADD
     C*===============================================================*
12===C           R2D10     BEGSR
|    C*
|    C                     MOVELDX901     X901
|    C**                   MOVELDX902     X902
|    C                     Z-ADDDX910     X910
|    C                     Z-ADDDX906     X906
|    C                     Z-ADDDX905     X905
|    C                     MOVELDX909     X909
|    C*
|    C                     WRITEX90
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          R2D20 ....FILE PROCESS
     C*==============================================================*
13===C           R2D20     BEGSR
|    C* DETAIL
|    C           KEYX9     CHAINX90                  40
| 01-C           *IN40     IFEQ '0'
|   C                     Z-ADDDX910     X910
|   C                     Z-ADDDX906     X906
|   C                     Z-ADDDX905     X905
|   C                     MOVELDX909     X909
|   C                     UPDATX90
| 01-C                     END
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          R2D30 ....FILE PROCESS :DELETE
     C*==============================================================*
     C*
14===C           R2D30     BEGSR
|    C*
|    C           KEYX9     CHAINX90                  40
| 01-C           *IN40     IFEQ '1'
|   C                     SETON                     6061
|   C                     SETON                     99
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C*
| 01*C                     ELSE
|   C*
|   C*          *IN40     IFEQ '0'
|   C                     DELETX90
| 01-C                     END
|    C*
14===C                     ENDSR
     C*===============================================================*
     C*          R2D40 ....FILE PROCESS :REFRESH
     C*===============================================================*
15===C           R2D40     BEGSR
|    C*
|    C           KEYX9     CHAINX90                  40
| 01-C           *IN40     IFEQ '0'
|   C                     Z-ADDDX910     X910
|   C                     Z-ADDDX906     X906
|   C                     Z-ADDDX905     X905
|   C                     MOVELDX909     X909
|   C                     UPDATX90
| 01-C                     END
|    C*
15===C                     ENDSR
     C*==============================================================*
**
新增修改      刪除查詢
