     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA539
     H*    PROGRAM NAME :團保調整批次作業　　                      *
     H*    AUTHOR       : A1328 JEFFREY                              *
     H*    CREATE DATE  : 900320                                     *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FPYX1LF02UF  E           K        DISK
     FPYX3PF  IF  E           K        DISK
     FPYX9PF  IF  E           K        DISK
     FPYA539D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     E                    @A01        5  1               作業權利
     E*                   WFUN    5   5  6
     E*---------------------------------------------------------------*
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I                                    B 378 3790#DRRN
     ILDA        UDS
     I                                      101 110 $USER
     I                                      187 1920DATE
     I                                      211 2160DDATE
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      201 2040YEAR
     I*          IDS
     I*                                       1   60YYMMS
     I*                                       1   40YY
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *LIKE     DEFN CM004O    DFMT
     C           *LIKE     DEFN CM005O    DTYPE
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYX1     KLIST
     C                     KFLD           X101             *公司
     C                     KFLD           X102             *員工編號
     C                     KFLD           X103             *生效日期
     C           KEYX31    KLIST
     C                     KFLD           X301             *公司
     C                     KFLD           X302             *員工編號
     C                     KFLD           X303             *生效日期
     C           KEYX3     KLIST
     C                     KFLD           X304             *保險代號
     C**                   KFLD           X305             *計劃代號
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     IN   LDA
|    C*
|    C*RENT AUTHORITY CHECK
|    C                     MOVELDDATE     P#103
|    C                     CALL 'L@CHK'
|    C                     PARM           P#103   6
|    C                     PARM '01'      P#106   2
|    C                     PARM '  '      P#104   6
|    C                     PARM '2'       PFUN    1
|    C*
|    C                     MOVE 'SC01'    SCID    4
|    C* FUN AUT
|    C                     MOVE $ADD      @A01,1
|    C                     MOVE $UPD      @A01,2
|    C                     MOVE $DLT      @A01,4
|    C                     MOVE $INQ      @A01,5
|    C*
|    C* SC01 FIELD INITIALIZE *--------------------------------------*
|    C*                    Z-ADD1         DOPT
|    C*------------------------------------------------------------****
|    C*公司別
|    C                     MOVEL$COR      DEM01
| 01-C           $RMK03    IFNE 'Y'
|   C                     SETOF                     32
| 01*C                     ELSE
|   C                     SETON                     32
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     SETON                     97
|    C                     EXFMTDSPC1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 02-C           *IN99     IFEQ '0'
|   C           *IN13     ANDEQ'1'
|   C                     EXSR R1C00                      *PROCESS
| 02-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1B00 ....SCREEN CHECK
     C*==============================================================*
03===C           R1B00     BEGSR
|    C*
|    C* CHK FUN AUT
|    C*          @A01,DOPT IFNE 'Y'
|    C*                    MOVEL'UPT2150' ERRID
|    C*                    MOVEL'PTMF'    ERRF
|    C*                    SETON                     99
|    C*                    END
|    C*  99                GOTO E1B00
|    C*---------------------------------------------------------------
|    C*公司別
| 01-C           DEM01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DEM01     CM001I  2         公司代號
|    C                     PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C                     PARM           CM004O  1         日期格式
|    C                     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C                     MOVE CM004O    DFMT
|    C                     MOVE CM005O    DTYPE
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 02-C           CM099O    IFEQ 'N'
|   C                     SETON                     6099
|   C                     MOVEL'US#0099' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
| 03-C           CM099O    IFEQ *BLANK
|   C                     SETON                     6099
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C   99                GOTO E1B00
|    C*
03===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....MOVE  SCREEN TO SCID
     C*==============================================================*
04===C           R1C00     BEGSR
|    C*
|    C                     SETON                     98
|    C                     WRITEDSPC1
|    C           *LOVAL    SETLLX10
|    C           DEM01     SETLLX10
|    C           DEM01     READEX10                      46
| 01-C           *IN46     DOWEQ'0'
|   C*
|   C                     Z-ADD0         TT01    70
|   C*
|   C*異動類別須等於1 2 4
| 02-C           X104      IFEQ '1'                        *異動類別
|   C           X104      OREQ '2'                        *異動類別
|   C           X104      OREQ '4'                        *異動類別
|   C*
|   C           KEYX1     SETLLX30
|   C           KEYX1     READEX30                      46
| 03-C           *IN46     DOWEQ'0'
|   C*
|   C           KEYX3     SETLLX90
|   C           KEYX3     READEX90                      46
| 04-C           *IN46     DOWEQ'0'
|   C*
|   C*累加應繳保費
|   C                     ADD  X910      TT01
|   C*
|   C           KEYX3     READEX90                      46
| 04-C                     END
|   C*
|   C           KEYX1     READEX30                      46
|   C   46                EXSR R1C10                      *勞保
| 03-C                     END
| 02-C                     END
|   C*
|   C           DEM01     READEX10                      46
| 01-C                     END
|    C*UPT2142--->作業完成
|    C                     MOVEL'UPT2142' ERRID
|    C                     MOVEL'PTMF'    ERRF
|    C                     SETON                       99
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R1C10 ....勞保WRITE PYX1PF &UPDAT PYX1PF
     C*==============================================================*
05===C           R1C10     BEGSR
|    C*
|    C*異動類別:(A1.勞保投保  A2.勞保調整  A4.勞保復保)
|    C*
|    C                     Z-ADDTT01      X105             *保費總額
|    C*
|    C                     Z-ADD$A8YMD    X197             *記錄更新日期
|    C                     TIME           X198             *
|    C                     MOVEL$USER     X199             *
|    C*
|    C                     UPDATX10
|    C*----------------------------------------------------------------
|    C*
05===C                     ENDSR
