      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      *    PROGRAM ID   : PYA511                                     *
      *    WRITTEN BY   : A1084 CHARLES                              *
      *    DATE WRITTEN : 79/06/04                                   *
      *    UPDATE DATE  :                                            *
      *    SYSTEM       : MIRS                                       *
      *    SUBSYSTEM    : PY                                         *
      *    PROCEDURE    :                                            *
      *    PURPOSE      :所得稅率表建立                            *
      *    INDICATOR:  03> END  AND BACK TO MAIN MENU                *
      *                12> BACK TO PREVIOUS SCREEN                   *
      *             60-68> FIELD ERROR DSPATR(PC RI)                 *
      *             98-94> ERROR MESSAGE                             *
      ****************************************************************
     FPYTAPF  UF  E           K        DISK                      A
     FPYTCPF  UF  E           K        DISK                      A
     FPYA511D CF  E                    WORKSTN
     F                                        RRN   KSFILE SFLSR
     I           UDS
     I                                      101 110 USER
     I                                      203 2080DDATE
     I                                      201 2080$A8YMD
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INITIAL
      *
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    RTN100           *SCREEN 1
    C           SCID      CASEQ'SC02'    RTN200           *SCREEN 2
  02-C                     END
     *
  01-C                     END
     C                     SETON                     LR
      *==============================================================*
      *          RTN010....INTRIAL VALUE
      *==============================================================*
01===C           RTN010    BEGSR
|    C                     MOVEL'SC01'    SCID    4
|    C           *LOVAL    SETLLTA0
|    C                     READ TA0                      40
|     *
| 01-C           *IN40     IFEQ '1'
|   C                     Z-ADD0         DTA02
|   C                     Z-ADD0         DTA03
|   C                     Z-ADD0         DTA04
|   C                     Z-ADD0         DTA05
|   C                     Z-ADD0         DTA06
|   C                     Z-ADD0         DTA07
|   C                     Z-ADD0         DTA08
|   C                     Z-ADD0         DTA09
|   C                     Z-ADD0         DTA10
|   C                     Z-ADD0         DTA11
|   C                     Z-ADD0         DTA12
| 01*C                     ELSE
|   C                     Z-ADDTA02      DTA02
|   C                     Z-ADDTA03      DTA03
|   C                     Z-ADDTA04      DTA04
|   C                     Z-ADDTA05      DTA05
|   C                     Z-ADDTA06      DTA06
|   C                     Z-ADDTA07      DTA07
|   C                     Z-ADDTA08      DTA08
|   C                     Z-ADDTA09      DTA09
|   C                     Z-ADDTA10      DTA10
|   C                     Z-ADDTA11      DTA11
|   C                     Z-ADDTA12      DTA12
| 01-C                     END
|     *
01===C                     ENDSR
      *==============================================================*
      *          RTN100....'SC01' SCREEN MAIN ROUTINE
      *==============================================================*
02===C           RTN100    BEGSR
|    C                     EXFMTDSPC1
|     *: CLEAR ALL ERROR USED INDICATOR :
|    C                     MOVEA*ALL'0'   *IN,60
|     *
| 01-C           *IN03     IFEQ '0'
| 02-C           *IN17     IFEQ '1'
|   C                     MOVE 'SC02'    SCID
| 02*C                     ELSE
|   C                     EXSR RTN110                     *SCN CHK
| 03-C           *IN99     IFEQ '0'
|   C                     EXSR RTN120                     *UPD PYTAPF
| 03-C                     END
| 02-C                     END
| 01-C                     END
|     *
02===C                     ENDSR
      *==============================================================*
      *          RTN110....SCREEN CHECK
      *==============================================================*
03===C           RTN110    BEGSR
|     *
| 01-C           DTA02     IFEQ 0
|   C                     SETON                     609899
| 01-C                     END
|    C   99                GOTO END110
|     *
| 02-C           DTA03     IFEQ 0
|   C                     SETON                     619899
| 02-C                     END
|    C   99                GOTO END110
|     *
| 03-C           DTA04     IFEQ 0
|   C                     SETON                     629899
| 03-C                     END
|    C   99                GOTO END110
|     *
| 04-C           DTA05     IFEQ 0
|   C                     SETON                     639899
| 04-C                     END
|    C   99                GOTO END110
|     *
| 05-C           DTA06     IFEQ 0
|   C                     SETON                     649899
| 05-C                     END
|    C   99                GOTO END110
|     *
| 06-C           DTA07     IFEQ 0
|   C                     SETON                     659899
| 06-C                     END
|    C   99                GOTO END110
|     *
| 07-C           DTA08     IFEQ 0
|   C                     SETON                     669899
| 07-C                     END
|    C   99                GOTO END110
|     *
| 08-C           DTA09     IFEQ 0
|   C                     SETON                     679899
| 08-C                     END
|    C   99                GOTO END110
|     *
| 09-C           DTA10     IFEQ 0
|   C                     SETON                     689899
| 09-C                     END
|    C   99                GOTO END110
|     *
|    C*810612    DTA11     IFEQ 0
|    C*                    SETON                     699899
|    C*                    END
|    C*  99                GOTO END110
|     *
| 10-C           DTA12     IFEQ 0
|   C                     SETON                     709899
| 10-C                     END
|    C   99                GOTO END110
|     *
03===C           END110    ENDSR
      *==============================================================*
      *          RTN120....INITIAL VALUE
      *==============================================================*
04===C           RTN120    BEGSR
|    C           *LOVAL    SETLLTA0
|    C                     READ TA0                      40
|    C                     Z-ADDDTA02     TA02
|    C                     Z-ADDDTA03     TA03
|    C                     Z-ADDDTA04     TA04
|    C                     Z-ADDDTA05     TA05
|    C                     Z-ADDDTA06     TA06
|    C                     Z-ADDDTA07     TA07
|    C                     Z-ADDDTA08     TA08
|    C                     Z-ADDDTA09     TA09
|    C                     Z-ADDDTA10     TA10
|    C                     Z-ADDDTA11     TA11
|    C                     Z-ADDDTA12     TA12
|    C                     Z-ADD$A8YMD    TA97
|    C                     TIME           WTIME  120
|    C                     MOVELWTIME     TA98
|    C                     MOVELUSER      TA99
|     *
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE '0'       TA01
|   C                     WRITETA0
| 01*C                     ELSE
|   C                     UPDATTA0
| 01-C                     END
|     *
04===C                     ENDSR
      *=============================================================*
      *          RTN200 :  SUBFILE ROUTINE                          *
      *=============================================================*
05===C           RTN200    BEGSR
|    C                     EXSR RTN210                     *INIT VARI
|    C                     EXSR RTN220                     *EXFMT SFL
|     ***********
| 01-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|    ****
| 02-C           *IN25     IFEQ '0'
|   C           *IN26     ANDEQ'0'
|   C                     EXSR RTN230                     *CHECK SFL
|    *
| 03-C           *IN99     IFEQ '0'
|   C                     CLOSEPYTCPF
|   C                     CALL 'PYS511'
|   C                     OPEN PYTCPF
|   C                     EXSR RTN240                     *PROCESS
|   C                     EXSR RTN210                     *REWRITE
| 03-C                     END
|    *
| 02*C                     ELSE
|    *
| 04-C           *IN25     IFEQ '1'                        *ROLLUP
|   C                     SETON                     98
|   C                     SETON                     53
|   C                     Z-ADD20        DRRN             *LAST PAGE  LL
| 04-C                     END
|    *
| 05-C           *IN26     IFEQ '1'                        *ROLLDOWN
|   C                     SETON                     97
|   C                     SETOF                     53
|   C                     Z-ADD1         DRRN             *FIRST PAGE LL
| 05-C                     END
| 02-C                     END
|    *
|   C                     EXSR RTN220                     *EXFMT SFL
| 01-C                     END
|     ***********
|    C                     MOVE 'SC01'    SCID
05===C                     ENDSR
      *=========================================================*
      *          RTN210 :  INITIAL                              *
      *=========================================================*
06===C           RTN210    BEGSR
|     *: INTRIAL VALUE :
|    C                     Z-ADD0         RRN     20
|    C                     Z-ADD1         WRRN    20
|    C                     Z-ADD1         DRRN    20
|     *: CLEAR SFL DATA :
|    C                     SETON                     52
|    C                     WRITESFLCR
|    C                     SETOF                     52
|    C           *LOVAL    SETLLTC0
|    C                     READ TC0                      40
|     *
| 01-C           RRN       DOWLT20
|   C                     ADD  1         RRN
| 02-C           *IN40     IFEQ '1'
|   C                     Z-ADD0         DTC02
|   C                     Z-ADD0         DTC03
|   C                     Z-ADD0         DTC04
|   C                     Z-ADD0         DTC05
|   C                     SETOF                     6061
| 02*C                     ELSE
| 03-C           RRN       IFNE 1
| 04-C           TC03      IFGT TEMP
|   C           TC03      ORLT DTC02
|   C                     SUB  1         RRN
|   C           RRN       CHAINSFLSR                53
|   C                     SETON                     6095
|   C                     UPDATSFLSR
|   C                     ADD  1         RRN
|   C                     SETOF                     60
|   C                     SETON                     61
| 04*C                     ELSE
|   C                     SETOF                     6061
| 04-C                     END
| 03-C                     END
|   C           TC02      ADD  1         TEMP    80
|   C                     Z-ADDTC02      DTC02
|   C                     Z-ADDTC03      DTC03
|   C                     Z-ADDTC04      DTC04
|   C                     Z-ADDTC05      DTC05
| 02-C                     END
| 05-C           RRN       IFEQ 20
|   C                     SETON                     53
| 05*C                     ELSE
|   C                     SETOF                     53
| 05-C                     END
|   C                     WRITESFLSR
|   C*                    SETOF                     6061
|   C  N40                READ TC0                      40
| 01-C                     END
|     *
06===C                     ENDSR
      *==============================================================*
      *          RTN220... EXFMT SFL                                 *
      *==============================================================*
07===C           RTN220    BEGSR
|     *: CHECK SFL DATA EXIST :
|    C                     SETON                     5051  *SFLDSP
|    C                     WRITEDSPC11
|    C                     EXFMTSFLCR
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|     *
07===C                     ENDSR
      *==============================================================*
      *          RTN230....SCREEN CHECK
      *==============================================================*
08===C           RTN230    BEGSR
|    C                     Z-ADD1         DRRN
|    C                     Z-ADD1         RRN
|    C                     SETOF                     42    *EMPTY SFL
|    C                     SETOF                     606162
|    C                     SETOF                     63
|    C           RRN       CHAINSFLSR                40
|     *********************
| 01-C           *IN40     DOWEQ'0'
|    ***********
| 02-C           DTC02     IFEQ 0
|   C           DTC03     ANDEQ0
|   C           DTC04     ANDEQ0
|   C           DTC05     ANDEQ0
|   C                     UPDATSFLSR
| 02*C                     ELSE
|   C                     SETON                     42
|    *
| 03-C           DTC02     IFEQ 0
|   C                     SETON                     609699
| 03*C                     ELSE
| 04-C           DTC02     IFLT DTC03
|   C                     SETON                     606195
|   C                     SETON                     99
| 04-C                     END
| 03-C                     END
|   C   99                GOTO END230
|    *
| 05-C           DTC04     IFEQ 0
|   C                     SETON                     629699
| 05-C                     END
|   C   99                GOTO END230
|    *
| 02-C                     END
|    ***
|   C                     ADD  1         RRN
|   C           RRN       CHAINSFLSR                40
|   C                     SETOF                     606162
|   C                     SETOF                     63
|    ***********
| 01-C                     END
|     *********************
| 06-C           *IN42     IFEQ '0'
|   C                     Z-ADD1         RRN
|   C           RRN       CHAINSFLSR                40
|   C                     SETON                     609399
| 06-C                     END
|     *
|    C           END230    TAG
| 07-C           *IN99     IFEQ '1'
|   C                     Z-ADDRRN       DRRN
|   C                     UPDATSFLSR
| 07-C                     END
08===C                     ENDSR
      *==============================================================*
      *          RTN240 :  PROCESS FILE
      *==============================================================*
09===C           RTN240    BEGSR
|    C                     Z-ADD0         RRN
|     *
| 01-C           RRN       DOWLT20
|   C                     ADD  1         RRN
|   C           RRN       CHAINSFLSR                40
|    *
| 02-C           DTC02     IFNE 0
|   C                     Z-ADDDTC02     TC02
|   C                     Z-ADDDTC03     TC03
|   C                     Z-ADDDTC04     TC04
|   C                     Z-ADDDTC05     TC05
|   C                     Z-ADD$A8YMD    TC97
|   C                     TIME           WTIME  120
|   C                     MOVELWTIME     TC98
|   C                     MOVELUSER      TC99
|   C                     WRITETC0
| 02-C                     END
|    *
| 01-C                     END
|     *
09===C           END240    ENDSR
