     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : PYA543                                     *
     H*    PROGRAM NAME :休假日期資料維護                          *
     H*    AUTHOR       : A1386 SHARON                               *
     H*    CREATE DATE  :                                            *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FPYT3PF  UF  E           K        DISK                      A
     FPYA543D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     E                    @A01        5  1               作業權利
     E                    @T1        31  2               日期
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I                                    B 378 3790#DRRN
     I            DS
     I                                        1  62 @T1
     I                                        1   2 DATE01
     I                                        3   4 DATE02
     I                                        5   6 DATE03
     I                                        7   8 DATE04
     I                                        9  10 DATE05
     I                                       11  12 DATE06
     I                                       13  14 DATE07
     I                                       15  16 DATE08
     I                                       17  18 DATE09
     I                                       19  20 DATE10
     I                                       21  22 DATE11
     I                                       23  24 DATE12
     I                                       25  26 DATE13
     I                                       27  28 DATE14
     I                                       29  30 DATE15
     I                                       31  32 DATE16
     I                                       33  34 DATE17
     I                                       35  36 DATE18
     I                                       37  38 DATE19
     I                                       39  40 DATE20
     I                                       41  42 DATE21
     I                                       43  44 DATE22
     I                                       45  46 DATE23
     I                                       47  48 DATE24
     I                                       49  50 DATE25
     I                                       51  52 DATE26
     I                                       53  54 DATE27
     I                                       55  56 DATE28
     I                                       57  58 DATE29
     I                                       59  60 DATE30
     I                                       61  62 DATE31
     I            DS
     I                                        1  31 DT303
     I                                        1   1 DT3301
     I                                        2   2 DT3302
     I                                        3   3 DT3303
     I                                        4   4 DT3304
     I                                        5   5 DT3305
     I                                        6   6 DT3306
     I                                        7   7 DT3307
     I                                        8   8 DT3308
     I                                        9   9 DT3309
     I                                       10  10 DT3310
     I                                       11  11 DT3311
     I                                       12  12 DT3312
     I                                       13  13 DT3313
     I                                       14  14 DT3314
     I                                       15  15 DT3315
     I                                       16  16 DT3316
     I                                       17  17 DT3317
     I                                       18  18 DT3318
     I                                       19  19 DT3319
     I                                       20  20 DT3320
     I                                       21  21 DT3321
     I                                       22  22 DT3322
     I                                       23  23 DT3323
     I                                       24  24 DT3324
     I                                       25  25 DT3325
     I                                       26  26 DT3326
     I                                       27  27 DT3327
     I                                       28  28 DT3328
     I                                       29  29 DT3329
     I                                       30  30 DT3330
     I                                       31  31 DT3331
     I*
     I            DS
     I                                        1  31 T303
     I                                        1   1 T3301
     I                                        2   2 T3302
     I                                        3   3 T3303
     I                                        4   4 T3304
     I                                        5   5 T3305
     I                                        6   6 T3306
     I                                        7   7 T3307
     I                                        8   8 T3308
     I                                        9   9 T3309
     I                                       10  10 T3310
     I                                       11  11 T3311
     I                                       12  12 T3312
     I                                       13  13 T3313
     I                                       14  14 T3314
     I                                       15  15 T3315
     I                                       16  16 T3316
     I                                       17  17 T3317
     I                                       18  18 T3318
     I                                       19  19 T3319
     I                                       20  20 T3320
     I                                       21  21 T3321
     I                                       22  22 T3322
     I                                       23  23 T3323
     I                                       24  24 T3324
     I                                       25  25 T3325
     I                                       26  26 T3326
     I                                       27  27 T3327
     I                                       28  28 T3328
     I                                       29  29 T3329
     I                                       30  30 T3330
     I                                       31  31 T3331
     I*LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      203 2080DDATE
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN $A8YMD    FDATE            .TRANS DATE USE
     C           *LIKE     DEFN CM004O    DFMT
     C           *LIKE     DEFN CM005O    DTYPE
     C           *LIKE     DEFN T302      WT302
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYT3     KLIST                           *HEAD FILE
     C                     KFLD           DT301
     C                     KFLD           WT302
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N99                EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
    C           SCID      CASEQ'SC02'    R2000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     MOVE 'SC01'    SCID    4
|    C* FUN AUT
|    C                     MOVE $ADD      @A01,1
|    C                     MOVE $UPD      @A01,2
|    C                     MOVE $DLT      @A01,4
|    C                     MOVE $INQ      @A01,5
|    C*
|    C* SC01 FIELD INITIALIZE *--------------------------------------*
|    C                     Z-ADD1         DOPT
|    C                     MOVEL*BLANK    DT301
|    C                     MOVEL*ZERO     DT302
|    C                     MOVEL*BLANK    DT303
|    C*--------------------------------------------------------------*
|    C*
|    C*公司別
|    C                     MOVEL$COR      DT301
| 01-C           $RMK03    IFNE 'Y'
|   C                     SETOF                     32
| 01*C                     ELSE
|   C                     SETON                     32
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E1000
| 01-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 03-C           *IN99     IFEQ '0'                        *SCR CHK OK
|   C                     EXSR R1C00                      *PRE-SC02
|   C                     MOVEL'SC02'    SCID
| 03-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1B00 .... 'SC01' SCREEN CHECK
     C*==============================================================*
03===C           R1B00     BEGSR
|    C*
|    C* CHK FUN AUT
| 01-C           @A01,DOPT IFNE 'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* DATA CHECK *--------------------------------------------------*
|    C*公司別
|    C                     MOVEL*BLANK    DT301N
| 02-C           DT301     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DT301     CM001I  2         公司代號
|    C           DT301N    PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C           DFMT      PARM           CM004O  1         日期格式
|    C           DTYPE     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 03-C           CM099O    IFEQ 'N'
|   C                     SETON                     6099
|   C                     MOVEL'US#0099' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 03-C                     END
|    C   99                GOTO E1B00
|    C*
| 04-C           CM099O    IFEQ *BLANK
|   C                     SETON                     6099
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 04-C                     END
|    C   99                GOTO E1B00
|    C*---------------------------------------------------------------
|    C*年月
| 08-C           DT302     IFEQ 0
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 08-C                     END
|    C   99                GOTO E1B00
|    C*驗證年月
|    C                     CALL 'P38'
|    C                     PARM DT302     P3801I  60
|    C                     PARM '1'       P3802I  1
|    C                     PARM '1'       P3803I  1
|    C           WT302     PARM           P3801O  60
|    C                     PARM           P3811O  1
|    C*
| 09-C           P3811O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 09-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*                    CALL 'P39'
|    C*                    PARM DT302     P3901I  60
|    C*                    PARM DFMT      P3902I  1
|    C*                    PARM DTYPE     P3903I  1
|    C*                    PARM '2'       P3904I  1
|    C*                    PARM '1'       P3905I  1
|    C*          WT302     PARM           P3911O  60
|    C*
|    C           KEYT3     CHAINT30                  40
|    C*
| 10-C           DOPT      IFEQ 1                          *ADD
|   C           *IN40     ANDEQ'0'
|   C                     MOVEL'UPT2020' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606163
|   C                     SETON                     99
| 10-C                     END
|    C   99                GOTO E1B00
|    C*
| 11-C           DOPT      IFNE 1                          *UPD,DEL,INQ
|   C           *IN40     ANDEQ'1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606163
|   C                     SETON                     99
| 11-C                     END
|    C   99                GOTO E1B00
|    C*
03===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....INIT 'SC02'
     C*==============================================================*
04===C           R1C00     BEGSR
|    C*
|    C                     SETOF                     313334*IN CONTROL
|    C                     SETOF                     35    *IN CONTROL
|    C* ADD
| 01-C           DOPT      IFEQ 1
|   C                     SETON                     31
|   C                     EXSR R1CA0                      *INIT HEAD
     C                     MOVEL*BLANK    DT303
| 01-C                     END
|    C* UPD
| 03-C           DOPT      IFEQ 2
|   C                     SETON                     31
|   C                     EXSR R1CA0                      *HEADING
     C                     MOVELT303      DT303
| 03-C                     END
|    C* DEL & INQ
| 04-C           DOPT      IFEQ 4
|   C           DOPT      OREQ 5
|   C                     EXSR R1CA0                      *HEADING
     C                     MOVELT303      DT303
| 04-C                     END
|    C*
|    C* RELEASE FILE (ADD & INQUIRY)++++++++++++++++++++++++++++++++++*
| 05-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 5                          *INQ
|   C           *LOVAL    SETLLT30                        *HEAD FILE
| 05-C                     END
|    C*
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R1CA0 ....SFL HEAD INIT : ADD (NO COPY)
     C*==============================================================*
05===C           R1CA0     BEGSR
     C*
     C           DT302     ADD  200000    TEMP    60
     C           TEMP      SUB  191100    P2201I
|    C*計算當月天數
|    C                     CALL 'P22'
|    C                     PARM           P2201I  40       年月
|    C                     PARM           P2211O  1        驗證結果
|    C                     PARM           P2212O  20       日數
|    C                     Z-ADDP2212O    DAY     20
|    C*
| 01-C           DAY       IFGT 28
|   C                     SETON                     33
| 01-C                     END
| 02-C           DAY       IFGT 29
|   C                     SETON                     34
| 02-C                     END
| 03-C           DAY       IFGT 30
|   C                     SETON                     35
| 03-C                     END
|    C*
|    C                     MOVEA*BLANKS   @T1
|    C*
| 04-C                     DO   DAY       X       20       本月日數
|   C*
|   C                     MOVE X         @T1,X
|   C*
| 04-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R1CB0 ....SFL HEAD INIT : U/D/I/A
     C*==============================================================*
06===C           R1CB0     BEGSR
|    C*
|    C*計算當月天數
|    C                     CALL 'P22'
|    C                     PARM DT302     P2201I  40       年月
|    C                     PARM           P2211O  1        驗證結果
|    C                     PARM           P2212O  20       日數
|    C                     Z-ADDP2212O    DAY     20
|    C*
| 01-C           DAY       IFGT 28
|   C                     SETON                     33
| 01-C                     END
| 02-C           DAY       IFGT 29
|   C                     SETON                     34
| 02-C                     END
| 03-C           DAY       IFGT 30
|   C                     SETON                     35
| 03-C                     END
|    C*
|    C                     MOVEA*BLANKS   @T1
|    C*
| 04-C                     DO   DAY       X       20       本月日數
|   C*
|   C                     MOVE X         @T1,X
|   C*
| 04-C                     END
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R2000 .... 'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
08===C           R2000     BEGSR
|    C*
|    C                     EXFMTDSPD2
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E2000
| 01-C                     END
|    C*
| 04-C           *IN12     IFEQ '1'                        *PREVIOUS
|   C* RELEAS FILE --------------------------------------------------*
|   C           *LOVAL    SETLLT30
|   C*---------------------------------------------------------------*
|   C                     MOVEL'SC01'    SCID
|   C                     GOTO E2000
| 04-C                     END
|    C*
| 02-C           *IN05     IFEQ '1'                        *PROMPT
|   C                     CALL 'PYA540'
| 02-C                     END
|    C*
| 07-C           *IN99     IFEQ '0'                        *CHK OK
|   C                     EXSR R2D00                      *FILE UPD
|   C                     MOVE 'SC01'    SCID
| 07-C                     END
|    C*
08===C           E2000     ENDSR
     C*==============================================================*
     C*          R2D00 ....FILE PROCESS
     C*==============================================================*
10===C           R2D00     BEGSR
|    C*
| 01-C           DOPT      CASEQ1         R2D10
|   C           DOPT      CASEQ2         R2D20
|   C           DOPT      CASEQ4         R2D30
     C                     END
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          R2D10 ....FILE PROCESS : ADD
     C*==============================================================*
11===C           R2D10     BEGSR
|    C*
|    C                     EXSR R2D12
|    C*
|    C                     WRITET30
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          R2D12 ....FILE PROCESS : ADD  (ADD NEW)
     C*==============================================================*
12===C           R2D12     BEGSR
|    C*
|    C                     MOVELDT301     T301
|    C                     Z-ADDWT302     T302
|    C                     MOVELDT303     T303
|    C                     Z-ADD$A8YMD    T397
|    C                     TIME           T398
|    C                     MOVEL$USER     T399
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          R2D20 ....FILE PROCESS : UPD
     C*==============================================================*
13===C           R2D20     BEGSR
|    C*
|    C                     EXSR R2D12
|    C                     UPDATT30
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          R2D30 ....FILE PROCESS
     C*==============================================================*
14===C           R2D30     BEGSR
|    C*
|    C                     DELETT30
|    C*
14===C                     ENDSR
