     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA6111                                    *
     H*    PROGRAM NAME :福委會獎金轉檔作業　　　　                *
     H*    AUTHOR       : A1274 EVA                                  *
     H*    CREATE DATE  : 90/02/21                                   *
     H*    UPDATE DATE  : 90/03/22 A1274                             *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FPYPBPF  IP  E           K        DISK
     FPYERPF  UF  E           K        DISK                      A
     I*================================================================
     I           UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I*
     I                                      501 502 DER01
     I                                      503 5060WPB03
     I                                      507 5120WPB05
     I                                      513 514 DPB04
     I            DS
     I                                        1   80WER03
     I                                        1   60PB05
     I                                        7   80PB05D
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C                     MOVEL'1'       WER04   1        福委會支出
     C           KEYER     KLIST
     C                     KFLD           DER01
     C                     KFLD           PB02
     C                     KFLD           WER03
     C                     KFLD           WER04
     C                     KFLD           DPB04
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*
     C                     EXSR R2000                      .DETAIL
     C*==============================================================*
     C*          R1000 ... INITIAL PROCESS
     C*==============================================================*
01===C           R1000     BEGSR
|    C*
|    C                     SETON                     10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
02===C           R2000     BEGSR
|    C*
|    C*-------------------------------------------------------------***
|    C*福委會收支檔PYERPF:
|    C*
|    C           KEYER     CHAINER0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVELDER01     ER01      P
|   C                     MOVELPB02      ER02      P
|   C                     Z-ADDWER03     ER03
|   C                     MOVELWER04     ER04
|   C                     Z-ADDPB06      ER05
|   C                     MOVELDPB04     ER06
|   C                     Z-ADDPB03      ER07
|   C                     Z-ADD$A8YMD    ER97
|   C                     TIME           WTIME  120
|   C                     MOVELWTIME     ER98
|   C                     MOVEL$USER     ER99
|   C                     WRITEER0
| 01*C                     ELSE
|   C                     MOVELDER01     ER01      P
|   C                     MOVELPB02      ER02      P
|   C                     Z-ADDWER03     ER03
|   C                     MOVELWER04     ER04
|   C                     ADD  PB06      ER05
|   C                     MOVELDPB04     ER06
|   C                     Z-ADDPB03      ER07
|   C                     Z-ADD$A8YMD    ER97
|   C                     TIME           WTIME  120
|   C                     MOVELWTIME     ER98
|   C                     MOVEL$USER     ER99
|   C                     UPDATER0
| 01-C                     END
|    C*-------------------------------------------------------------***
|    C*
02===C           E2000     ENDSR
     C*==============================================================*
