     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA6051                                    *
     H*    PROGRAM NAME :福委會收支轉檔作業　　　　                *
     H*    AUTHOR       :                                            *
     H*    CREATE DATE  : 88/10/27                                   *
     H*    UPDATE DATE  : 90/03/21 A1274 EVA                         *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FPYHDPF  IP  E           K        DISK
     FPYERPF  UF  E           K        DISK                      A
     I*================================================================
     I           UDS
     I                                      101 110 $USER
     I                                      210 2160DDATE
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I*
     I                                      501 502 DEM01
     I                                      503 5070DYM
     I**                                    503 5040DER03Y
     I**                                    505 5060DER03M
     I                                      511 5160WER03
     I                                      508 509 DER01
     I            DS
     I                                        1   80WYMD
     I                                        1   40WYY
     I                                        1   60WYM
     I                                        7   80WDD
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C                     MOVEL'2'       WER04   1        員工給福委會
     C                     MOVEL'B1'      WER06   2        收支項目
     C           KEYER     KLIST
     C                     KFLD           DER01
     C                     KFLD           HD02
     C                     KFLD           WYMD
     C                     KFLD           WER04
     C                     KFLD           WER06
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*
     C                     EXSR R2000                      .DETAIL
     C*==============================================================*
     C*          R1000 ... INITIAL PROCESS
     C*==============================================================*
01===C           R1000     BEGSR
|    C*
|    C                     SETON                     10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
02===C           R2000     BEGSR
|    C*
|    C*-------------------------------------------------------------***
|    C*收支日期YYYYMM05
|    C                     Z-ADD*ZERO     WYMD
|    C                     Z-ADDWER03     WYM
|    C                     Z-ADD5         WDD
|    C*-------------------------------------------------------------***
|    C*福委會收支檔PYERPF:
|    C*       YM --> FM   福利金'84'
|    C*       YH --> FH   福利金'56'
|    C*
|    C           KEYER     CHAINER0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     Z-ADDHD06      ER05
|   C                     MOVELWER06     ER06
|   C                     Z-ADDWYY       ER07
|   C                     Z-ADD$A8YMD    ER97
|   C                     TIME           WTIME  120
|   C                     MOVELWTIME     ER98
|   C                     MOVEL$USER     ER99
|   C                     UPDATER0
| 01*C                     ELSE
|   C                     MOVELDER01     ER01      P
|   C                     MOVELHD02      ER02      P
|   C                     Z-ADDWYMD      ER03
|   C                     MOVELWER04     ER04             員工給福委會
|   C                     Z-ADDHD06      ER05
|   C                     MOVELWER06     ER06
|   C                     Z-ADDWYY       ER07
|   C                     Z-ADD$A8YMD    ER97
|   C                     TIME           WTIME  120
|   C                     MOVELWTIME     ER98
|   C                     MOVEL$USER     ER99
|   C                     WRITEER0
| 01-C                     END
|    C*-------------------------------------------------------------***
|    C*
02===C           E2000     ENDSR
     C*==============================================================*
     C*說明：將薪資部份的福利金轉到福委會．為福委會收入
     C*       GIFT : 'B1'    <--- PT#YPF
     C*       ER04 = '2'
     C*       ER06 = 'B1'
     C*==============================================================*
