     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM ID   : PYA6071                                    *
     H*    PROGRAM NAME :福委會基本資料批次處理　　                *
     H*    AUTHOR       : A1274 EVA                                  *
     H*    CREATE DATE  : 90/02/14                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FPYEMPF  IP  E           K        DISK
     FPYPYPF  UF  E           K        DISK                      A
     FPYEMLF02O   E           K        DISK
     F            EM0                               KRENAMEEM2
     E*----------------------------------------------------------------
     I           UDS
     I                                      101 110 $USER
     I                                      152 161 $USERN
     I                                      201 2080$A8YMD
     I*
     I                                      501 502 DEM01
     I                                      503 504 DER01
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYPY1    KLIST
     C                     KFLD           DEM01
     C                     KFLD           EM02
     C           KEYPY2    KLIST
     C                     KFLD           DER01
     C                     KFLD           EM02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*
     C                     EXSR R2000                      .DETAIL
     C*==============================================================*
     C*          R1000 ... INITIAL PROCESS
     C*==============================================================*
01===C           R1000     BEGSR
|    C*
|    C                     SETON                     10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
02===C           R2000     BEGSR
|    C*
|    C*-------------------------------------------------------------***
|    C*人事主檔
|    C                     MOVELDER01     EM01
|    C                     Z-ADD$A8YMD    EM97
|    C                     TIME           WTIME  120
|    C                     MOVELWTIME     EM98
|    C                     MOVEL$USER     EM99
|    C                     WRITEEM2
|    C*-------------------------------------------------------------***
|    C*薪資主檔
|    C                     MOVEL*BLANK    DPY01   2
|    C                     MOVEL*BLANK    DPY02   8
|    C                     Z-ADD*ZERO     DPY03   70
|    C                     MOVEL*BLANK    DPY04   3
|    C                     MOVEL*BLANK    DPY05   4
|    C                     MOVEL*BLANK    DPY06  12
|    C                     Z-ADD*ZERO     DPY07   20
|    C                     Z-ADD*ZERO     DPY08   20
|    C                     MOVEL*BLANK    DPY09   1
|    C*
|    C           KEYPY1    CHAINPY0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELPY02      DPY02
|   C                     Z-ADDPY03      DPY03
|   C                     MOVELPY04      DPY04
|   C                     MOVELPY05      DPY05
|   C                     MOVELPY06      DPY06
|   C                     Z-ADDPY07      DPY07
|   C                     Z-ADDPY08      DPY08
|   C                     MOVELPY09      DPY09
| 01-C*********            END
|    C*
|    C*********  KEYPY2    CHAINPY0                  41
| 02-C*********  *IN41     IFEQ '0'
|   C                     MOVELDER01     PY01
|   C                     MOVELDPY02     PY02
|   C                     Z-ADDDPY03     PY03
|   C                     MOVELDPY04     PY04
|   C                     MOVELDPY05     PY05
|   C                     MOVELDPY06     PY06
|   C                     Z-ADDDPY07     PY07
|   C                     Z-ADDDPY08     PY08
|   C                     MOVELDPY09     PY09
|   C                     Z-ADD$A8YMD    PY97
|   C                     TIME           WTIME  120
|   C                     MOVELWTIME     PY98
|   C                     MOVEL$USER     PY99
|   C                     WRITEPY0
| 02-C                     END
|    C*-------------------------------------------------------------***
|    C*
02===C           E2000     ENDSR
     C*==============================================================*
