     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA607                                     *
     H*    PROGRAM NAME :福委會基本資料批次處理　　                *
     H*    AUTHOR       : A1274 EVA                                  *
     H*    CREATE DATE  : 90/02/14                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FSYCMPF  IF  E           K        DISK
     FPYEMPF  UF  E           K        DISK
     FPYPYPF  UF  E           K        DISK
     FPYA607D CF  E                    WORKSTN
     I*-------------------------------------------------------------**
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     ILDA        UDS
     I                                      101 110 $USER
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      211 2160DDATE
     I                                      201 2080$A8YMD
     I*
     I                                      501 502 DEM01
     I                                      503 504 DER01
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*SYCMPF
     C                     MOVEL*BLANK    WCM01   2
     C           KEYCM     KLIST
     C                     KFLD           WCM01
     C*PYEMPF
     C           KEYEM     KLIST
     C                     KFLD           DER01
     C*PYPYPF
     C           KEYPY     KLIST
     C                     KFLD           DER01
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INI. RTN.
     C*
  01-C           *IN03     DOWEQ'0'
    C                     EXSR R1000                      *MAIN
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL ROUTINE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     IN   LDA
|    C                     IN   PTDA01
|    C*-------------------------------------------------------------***
|    C*INIT. FIELDS
|    C                     MOVEL*BLANK    DEM01            公司
|    C                     MOVEL*BLANK    DEM01N
|    C                     MOVEL*BLANK    DER01            福委會
|    C                     MOVEL*BLANK    DER01N
|    C*-------------------------------------------------------------***
|    C                     MOVEL$COR      DEM01
| 01-C           $RMK03    IFNE 'Y'
|   C                     SETOF                     32
| 01*C                     ELSE
|   C                     SETON                     32
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 .... MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     SETON                     97
|    C                     EXFMTDSPC1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
|    C                     EXSR R1B00
|    C*
| 02-C           *IN13     IFEQ '1'
|   C           *IN99     ANDEQ'0'
|   C                     EXSR R1C00                      *PROCESS
| 02-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1B00 .... DATA CHECK
     C*==============================================================*
03===C           R1B00     BEGSR
|    C*------------------------------------------------------------***
|    C*公司別
| 01-C           DEM01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DEM01     CM001I  2         公司代號
|    C                     PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C                     PARM           CM004O  1         日期格式
|    C                     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 02-C           CM099O    IFEQ 'N'
|   C                     SETON                     6099
|   C                     MOVEL'US#0099' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
| 03-C           CM099O    IFEQ *BLANK
|   C                     SETON                     6099
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     MOVEL*BLANK    DEM01N
| 04-C           DEM01     IFNE *BLANK
|   C                     MOVELDEM01     WCM01
|   C           KEYCM     CHAINCM0                  40
| 05-C           *IN40     IFEQ '0'
|   C                     MOVELCM02      DEM01N
| 05-C                     END
| 04-C                     END
|    C*------------------------------------------------------------***
|    C*由公司帶出相對應的福委會資料
|    C                     MOVEL*BLANK    DER01N
|    C*
| 08-C           DER01     IFNE *BLANK
|   C                     MOVELDER01     WCM01
|   C           KEYCM     CHAINCM0                  40
| 09-C           *IN40     IFEQ '0'
|   C                     MOVELCM02      DER01N
| 09-C                     END
| 08-C                     END
|    C*------------------------------------------------------------***
|    C*
03===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 .... PROCESS
     C*==============================================================*
04===C           R1C00     BEGSR
|    C*
|    C                     SETON                     28
|    C                     WRITEDSPC1
|    C*------------------------------------------------------------***
|    C*刪除相關福委會的基本資料*PYEMPF & *PYPYPF
|    C           KEYEM     SETLLEM0
|    C           KEYEM     READEEM0                      46
| 01-C           *IN46     DOWEQ'0'
|   C                     DELETEM0
|   C           KEYEM     READEEM0                      46
| 01-C                     END
|    C*
|    C           KEYPY     SETLLPY0
|    C           KEYPY     READEPY0                      47
| 02-C           *IN47     DOWEQ'0'
|   C                     DELETPY0
|   C           KEYPY     READEPY0                      47
| 02-C                     END
|    C*------------------------------------------------------------***
|    C*
|    C                     OUT  LDA
|    C                     CALL 'PYA6071C'
|    C*
|    C                     MOVEL'UPT2142' ERRID
|    C                     MOVEL'PTMF'    ERRF
|    C                     SETON                     99
|    C                     SETOF                     28
|    C*
04===C                     ENDSR
