     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM NAME : PYA702                                     *
     H*    AUTHOR       : A1084   CHARLES                            *
     H*    CREATE DATE  : 80/08/20                                   *
     H****************************************************************
     FSYFAPF  UF  E           K        DISK
     FPYTDLF01UF  E           K        DISK
     FPYTDPF1 UF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FPYA702D CF  E                    WORKSTN
     F*---------------------------------------------------------------
     E                    @A01        4  2
     I*---------------------------------------------------------------
     I*
     I/COPY QDDSSRC,PYPMDS01
     I*
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     ILDA        UDS
     I                                      203 2080DDATE
     I                                      101 110 $USER
     I                                      201 2080$A8YMD
     I                                      139 139 $RMK01
     I*
     I                                      501 5020DTD01
     I                                      506 506 DOPT
     I                                      507 508 WTD11
     I                                      509 516 DTD17
     I*
     I                                      571 5740WTD01
     I                                      517 5240WFYM
     I                                      517 5220SYM
     I                                      517 5200DFY
     I                                      521 5220DFM
     I                                      523 5240DFD
     I*
     I                                      525 5320WTYM
     I                                      525 5300EYM
     I                                      525 5280DTY
     I                                      529 5300DTM
     I                                      531 5320DTD
     I                                      533 536 DTD02
     I*
     I                                      629 630 FBT01
     I                                      631 632 EBT01
     I            DS
     I                                        1   2 QTD11
     I                                        1   1 Q
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYTD     KLIST
     C                     KFLD           WTD01
     C                     KFLD           DTD02
     C           KEYTD1    KLIST
     C                     KFLD           WTD11   2
     C                     KFLD           WTD01
     C           KEYPM     KLIST
     C                     KFLD           PM01
     C                     KFLD           CM01
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INI. RTN.
     C*
  01-C           *IN03     DOWEQ'0'
    C                     EXSR RTN100                     *MAIN
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL ROUTINE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     IN   *NAMVAR
|    C*
|    C                     MOVEL'S'       DPY01            公司整合
|    C                     MOVEL*BLANK    DTD02
|    C                     MOVEL*BLANK    WTD11
|    C                     Z-ADD0         DTD01
|    C                     MOVEL'N'       DOPT
|    C                     MOVEL*BLANK    EBT01
|    C                     MOVEL*BLANK    FBT01
|    C                     MOVEL*BLANK    @A01
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100.... MAIN ROUTINE
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     SETON                     97
|    C                     EXFMTDSPC1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO END100
| 01-C                     END
|    C*
|    C                     EXSR RTN110                     *CHK SCREEN1
|    C*
| 02-C           DOPT      IFEQ 'Y'
|   C                     EXSR RTN130
| 02-C                     ENDIF
|    C*
|    C                     EXSR R1F00
|    C*
| 03-C           II        DO   2
|   C                     MOVEL@A01,II   WTD11
|   C*
|   C*
| 04-C           *IN99     IFEQ '0'
|   C           *IN13     ANDEQ'1'
|   C                     EXSR RTN120                     *PROCESS
| 04-C                     END
|   C*
|   C                     ADD  1         II
| 03-C                     ENDDO
|    C*
02===C           END100    ENDSR
     C*==============================================================*
     C*          RTN110....CHECK SCREEN1
     C*==============================================================*
03===C           RTN110    BEGSR
|    C*
| 01-C           DTD02     IFEQ *BLANK
|   C                     SETON                     609599
| 01*C                     ELSE
|   C           DTD02     CHAINFA0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     SETON                     609299
| 02-C                     END
| 01-C                     END
|    C   99                GOTO END110
|    C*
|    C*重新處理需有特殊受權
| 03-C           $RMK01    IFNE 'Y'
|   C           DOPT      ANDEQ'Y'
|   C                     SETON                     639499
| 03-C                     END
|    C   99                GOTO END110
|    C*
|    C*
|    C                     CALL 'P82'
|    C                     PARM DTD01     P8201I  40
|    C                     PARM '1'       P8202I  1
|    C                     PARM '1'       P8203I  1
|    C                     PARM '2'       P8204I  1
|    C                     PARM '1'       P8205I  1
|    C                     PARM           P8211O  40
|    C                     MOVELP8211O    WTD01   40
|    C*
| 04-C           DOPT      IFEQ 'N'
|   C           KEYTD     SETLLTD0
|   C           KEYTD     READETD0                      40
| 05-C           *IN40     IFEQ '0'
|   C                     SETON                     606162
|   C                     SETON                     9199
| 05-C                     END
| 04-C                     END
|    C   99                GOTO END110
|    C*
|    C           *LOVAL    SETLLTD0
|    C*
03===C           END110    ENDSR
     C*==============================================================*
     C*          RTN120.... PROCESS
     C*==============================================================*
04===C           RTN120    BEGSR
|    C*
|    C                     SETON                     96
|    C                     WRITEDSPC1
|    C*清除舊資料
| 01-C           DOPT      IFEQ 'Y'
|   C*
|   C           KEYTD1    SETLLTD1
|   C           KEYTD1    READETD1                      42
|   C*
| 02-C           *IN42     DOWEQ'0'
|   C                     DELETTD1
|   C           KEYTD1    READETD1                      42
| 02-C                     END
|   C*
| 01-C                     END
|    C*------------------------------------------------------------
|    C*寫入課稅資料中
|    C*
|    C*
|    C           WTD11     CHAINCM0                  40
|    C*
|    C  N40                MOVELCM04      DTD17
|    C   40                MOVEL*BLANK    DTD17
|    C*
|    C                     EXSR RTN210
|    C                     OUT  LDA
|    C*
|    C                     CALL 'PYA7021C'                 .薪資
|    C                     CALL 'PYA7022C'                 .獎金
|    C*
|   C           DTD02     CHAINFA0                  40
|    C                     Z-ADD*ZERO     FA04
|    C                     Z-ADD$A8YMD    FA97
|    C                     TIME           WTIME  120
|    C                     MOVELWTIME     FA98
|    C                     MOVEL$USER     FA99
|    C                     UPDATFA0
|    C*
|    C                     SETON                     93
|    C                     SETOF                     96
|    C*
04===C                     ENDSR
     C*==============================================================*
     C* RTN210.... GET應列入本年度之薪資月份
     C* EX. 12月薪水1月發，所以12月薪資應屬明年度申報
     C*==============================================================*
05===C           RTN210    BEGSR
|    C*
|    C                     MOVEL'01'      PM01
|    C           KEYPM     CHAINPM0                  40
|    C   40                Z-ADD*ZERO     PM203
|    C*
|    C                     Z-ADDWTD01     DFY
|    C                     Z-ADD01        DFM
|    C                     Z-ADD01        DFD
|    C                     Z-ADDWTD01     DTY
|    C                     Z-ADD12        DTM
|    C                     Z-ADD99        DTD
|    C*
|    C*                    SUB  PM203     DFM
|    C*          DFM       IFLE 0
|    C*                    ADD  12        DFM
|    C*                    SUB  1         DFY
|    C*                    END
|    C*
|    C*                    SUB  PM203     DTM
|    C*          DTM       IFLE 0
|    C*                    ADD  12        DTM
|    C*                    SUB  1         DTY
|    C*                    END
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R1F00 ....搬值給@A01
     C*==============================================================*
06===C           R1F00     BEGSR
|    C*
|    C                     Z-ADD1         II      10
|    C*
| 01-C           DPY01     IFEQ 'S'
|   C                     MOVEL'SC'      @A01,1
|   C                     MOVEL'S1'      @A01,2
| 01-C                     ENDIF
| 01*C*
| 01-C           DPY01     IFEQ 'R'
|   C                     MOVEL'RM'      @A01,1
|   C                     MOVEL'R1'      @A01,2
| 01-C                     ENDIF
| 01*C*
| 01-C           DPY01     IFEQ 'K'
|   C                     MOVEL'KN'      @A01,1
|   C                     MOVEL'K1'      @A01,2
| 01-C                     ENDIF
|    C*
|    C                     MOVEL@A01,1    FBT01
|    C                     MOVEL@A01,2    EBT01
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          RTN130....刪掉舊年度資料
     C*==============================================================*
07===C           RTN130    BEGSR
|    C*
|    C           KEYTD     SETLLTD0
|    C           KEYTD     READETD0                      42
|    C*
| 01-C           *IN42     DOWEQ'0'
     C                     MOVELTD11      QTD11
     C           Q         IFEQ DPY01
|   C                     DELETTD0
     C                     ENDIF
|   C           KEYTD     READETD0                      42
| 01-C                     END
|    C*
07===C                     ENDSR
