     H****************************************************************
     H*   ªx¤Ó¸ê°T¬ì§Þ¶}µoªÑ¥÷¦³­­¤½¥q¡Ðª©Åv©Ò¦³    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM NAME : PYA701                                     *
     H*    PROGRAM NAME :                                        *
     H*    AUTHOR       : A1413 CLOUD                                *
     H*    CREATE DATE  : 96/04/16                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :¤H¨ÆÁ~¸ê¨t²Î                              *
     H****************************************************************
     F*¤½¥q¼úª÷¸ê®ÆÀÉ
     FPYPBLF02UF  E           K        DISK
     F*PYPYPF  UF  E           K        DISK
     FPYBTLF03UF  E           K        DISK
     F*SYCMPF  IF  E           K        DISK
     FSYBNPF  IF  E           K        DISK
     FPYA709D CF  E                    WORKSTN      KINFDS DSPFDS
     F*---------------------------------------------------------------
     E                    @A01        4  2
     I*---------------------------------------------------------------
     I/COPY QDDSSRC,PYPMDS01
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     ILDA        UDS
     I                                      101 110 $USER
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      139 139 $RMK01
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      162 1620$EVR
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I*
     I                                      501 502 DBT01
     I                                      503 505 DBT061
     I                                      522 522 DBT03
     I*
     I                                      571 5760WBT04
     I                                      577 5780DBT05
     I                                      580 5830WPB03
     I                                      584 585 DPB04
     I*
     I                                      601 6040DPH03
     I                                      606 6110WPH03
     I                                      623 6280DBT045
     I                                      623 6240DYY
     I                                      625 6260DMM
     I                                      623 6260DYM
     I                                      627 6280DBT05S
     I*
     I                                      629 630 FBT01
     I                                      631 632 EBT01
     I                                      640 647 DPY02
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C                     MOVEL'2'       DFMT    1
     C                     MOVEL'2'       DTYPE   1
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYPB     KLIST
     C                     KFLD           DBT01
     C                     KFLD           WPB03
     C                     KFLD           DPB04
     C           KEYBT     KLIST
     C                     KFLD           DBT01            ¤½¥q½s¸¹
     C                     KFLD           DBT03            ©Ò±oÃþ§O
     C                     KFLD           WPH03            ­pÁ~¦~¤ë
     C                     KFLD           DPY02            ­û¤u½s¸¹
     C           KEYBN     KLIST
     C                     KFLD           DBT061
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010                     *INI. RTN.
     C*
  01-C           *IN03     DOWEQ'0'
    C                     EXSR RTN100                     *MAIN
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL ROUTINE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     SETON                     10
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C*
|    C                     MOVEL'S'       DPY01            ¤½¥q¾ã¦X
|    C                     MOVEL*BLANK    DBT01   2        ¤½¥q
|    C                     MOVEL'006'     DBT061           Âà¦s»È¦æ
|    C                     MOVEL'1'       DBT03            ©Ò±oÃþ§O
|    C*
|    C                     Z-ADD0         DBT045           ¦s¤J¤é´Á
|    C                     Z-ADD0         DPH03            ­pÁ~¦~¤ë
|    C                     Z-ADD0         DPB03   20       ­pÁ~¦~¤ë
|    C                     MOVEL*BLANK    DPY02            ­û¤u½s¸¹
|    C                     Z-ADD0         DBT05            ¦s¤J¤é´Á
|    C*
|    C                     Z-ADD1         $CPY
|    C                     Z-ADD1         $PRTID
|    C                     Z-ADD2         $EVR
|    C*
|    C                     MOVEA*BLANK    @A01
|    C                     MOVEL*BLANK    FBT01
|    C                     MOVEL*BLANK    EBT01
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100.... MAIN ROUTINE
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     EXFMTDSPC1
|    C*
|    C                     MOVEA*ALL'0'   *IN,60
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO END100
| 01-C                     END
|    C*
|    C                     EXSR R1F00
|    C*
| 02-C           II        DO   2
|   C                     MOVEL@A01,II   DBT01
|   C*
| 03-C           *IN04     IFEQ '1'
|   C                     EXSR R1E00
| 03-C                     END
|   C*
|   C                     EXSR RTN110                     *CHK SCREEN1
|   C*
| 04-C           *IN99     IFEQ '0'
|   C           *IN13     ANDEQ'1'
|   C                     EXSR RTN120                     *PROCESS
| 04-C                     END
|   C*
|   C                     ADD  1         II
| 02-C                     ENDDO
|    C*
02===C           END100    ENDSR
     C*==============================================================*
     C*          RTN110....CHECK SCREEN1
     C*==============================================================*
03===C           RTN110    BEGSR
|    C*
|    C*¤½¥q½s¸¹
| 01-C           DPY01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 01-C                     END
|    C*
|    C*          KEYCM     CHAINCM0                  41
|    C*          *IN41     IFEQ '1'
|    C*                    MOVEL'UPT2010' ERRID
|    C*                    MOVEL'PTMF'    ERRF
|    C*                    SETON                     6299
|    C*                    END
|    C*  99                GOTO END110
|    C*
|    C*Âà¦s»È¦æ
| 02-C           DBT061    IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 02-C                     END
|    C*
|    C           KEYBN     CHAINBN0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 03-C                     END
|    C   99                GOTO END110
|    C*
|    C*©Ò±oÃþ§O
| 04-C           DBT03     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 04-C                     END
|    C   99                GOTO END110
|    C*
|    C*¦s¤J¤é´Á
| 05-C           DBT045    IFEQ *ZERO
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 05*C                     ELSE
|   C                     Z-ADDDBT05S    DBT05            ¦s¤J¤é´Á
|   C*
|   C                     CALL 'P30'
|   C                     PARM DBT045    P3001I  80
|   C                     PARM '1'       P3002I  1
|   C                     PARM '1'       P3003I  1
|   C                     PARM           P3011O  1
| 06-C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 06-C                     END
| 05-C                     END
|    C   99                GOTO END110
|    C*
|    C                     CALL 'P39'
|    C                     PARM DYM       P3901I  60
|    C                     PARM '1'       P3902I  1
|    C                     PARM '1'       P3903I  1
|    C                     PARM '2'       P3904I  1
|    C                     PARM '1'       P3905I  1
|    C           WBT04     PARM           P3911O  60
|    C*
| 07-C           DBT03     IFEQ '4'
|   C*¼úª÷¦~«×
| 08-C           DPB03     IFEQ *ZERO
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6799
| 08-C                     END
|   C   99                GOTO END110
|   C*
| 07*C                     ELSE
|   C*­pÁ~¦~¤ë
| 09-C           DPH03     IFEQ *ZERO
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6699
| 09-C                     END
|   C   99                GOTO END110
|   C*
|   C                     CALL 'P39'
|   C                     PARM DPH03     P3901I  60
|   C                     PARM '1'       P3902I  1
|   C                     PARM '1'       P3903I  1
|   C                     PARM '2'       P3904I  1
|   C                     PARM '1'       P3905I  1
|   C           WPH03     PARM           P3911O  60
| 07-C                     END
|    C*
| 10-C           $RMK01    IFNE 'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6799
| 10-C                     END
|    C   99                GOTO END110
|    C*
|    C           KEYBT     CHAINBT0                  46
| 11-C  N46                SETON                     97
|    C*
03===C           END110    ENDSR
     C*==============================================================*
     C*          RTN120.... PROCESS
     C*==============================================================*
04===C           RTN120    BEGSR
|    C*
|    C                     SETON                     96
|    C                     WRITEDSPC1
|    C*²M°£Á~¸ê»È¦æÂà¦s¾ú¥vÀÉPYBTPF
|    C                     EXSR RTN130
|    C*
|    C                     OUT  LDA
|    C*¼g¤J¤J±bª÷ÃB
|    C                     CALL 'PYA7091C'
|    C*¼g¤J¦U®a»È¦æ®æ¦¡
| 01-C           II        IFEQ 2
| 02-C           DBT061    IFEQ '006'                      ¦X®w
|   C                     CALL 'PYA7096C'
| 02-C                     END
| 01-C                     END
|    C*
|    C*                    CALL 'PYR707AC'                 ¦C¦L³øªí
|    C*
|    C                     SETON                     95
|    C                     SETOF                     9697
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN130.... UPDATE PYPBPF PYPYPF
     C*==============================================================*
05===C           RTN130    BEGSR
|    C*
|    C*²M°£Á~¸ê»È¦æÂà¦s¾ú¥vÀÉPYBTPF
|    C           KEYBT     SETLLBT0
|    C           KEYBT     READEBT0                      40
| 01-C           *IN40     DOWEQ'0'
|   C                     DELETBT0
|   C           KEYBT     READEBT0                      40
| 01-C                     END
|    C*
|    C*¦s¦^µo©ñ¦~¤ë¡Bµo©ñ¤é´Á
| 02-C           DBT03     IFEQ '4'
|   C*
|   C           KEYPB     SETLLPB0
|   C           KEYPB     READEPB0                      42
| 03-C           *IN42     DOWEQ'0'
|   C                     Z-ADDWBT04     PB05
|   C                     Z-ADDDBT05     PB05D
|   C                     Z-ADD$A8YMD    PB97
|   C                     TIME           PB98
|   C                     MOVEL$USER     PB99
|   C                     UPDATPB0
|   C           KEYPB     READEPB0                      42
| 03-C                     END
|   C*
| 02-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R1E00 .... F4Äæ¦ì¬d¸ß
     C*==============================================================*
06===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*»È¦æ¥N½XDBT061
| 01-C           #LIN      IFEQ 6
|   C           #COL      ANDGE28
|   C           #COL      ANDLE30
|   C                     CALL 'PYI516'
|   C           DBT061    PARM DBT061    I516I1  7         »È¦æ¥N½X
|   C                     PARM           @RTNC   2          FUN KEY
| 01-C                     ENDIF
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R1F00 ....·h­Èµ¹@A01
     C*==============================================================*
07===C           R1F00     BEGSR
|    C*
|    C                     Z-ADD1         II      10
|    C*
| 01-C           DPY01     IFEQ 'S'
|   C                     MOVEL'SC'      @A01,1
|   C                     MOVEL'S1'      @A01,2
| 01-C                     ENDIF
|    C*
| 02-C           DPY01     IFEQ 'R'
|   C                     MOVEL'RM'      @A01,1
|   C                     MOVEL'R1'      @A01,2
| 02-C                     ENDIF
|    C*
| 03-C           DPY01     IFEQ 'K'
|   C                     MOVEL'KN'      @A01,1
|   C                     MOVEL'K1'      @A01,2
| 03-C                     ENDIF
|    C*
|    C                     MOVEL@A01,1    FBT01
|    C                     MOVEL@A01,2    EBT01
|    C*
07===C                     ENDSR
