     H****************************************************************
     H*   PROGRAM NAME : PYR1042                                     *
     H*   AUTHER       : A1084 CHARLES                               *
     H*   CREATE DATE  : 79/07/17                                    *
     H*   UPDATE DATE  :                                             *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR1041C                                    *
     H*   PURPOSE      :                                             *
     H*   INDICATORS   :                                             *
     H****************************************************************
     FPYBTPF  IP  E           K        DISK
     FPYB7PF  O   E           K        DISK                      A
     E*---------------------------------------------------------------
     I*
     I/COPY PYDDSSRC,PYB7DS01
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I*
     I                                      501 502 DBT01
     I                                      503 505 DBT061
     I                                      506 508 DBT062
     I                                      510 521 DBT09
     I                                      522 522 DBT03
     I                                      523 5260DBT04
     I                                      527 5280DBT05
     I                                      529 530 DPB041
     I                                      531 532 DPB042
     I                                      533 533 DOPT
     I                                      534 5350DPY07
     I                                      536 5450DM406
     I                                      546 5540TCNT
     I                                      555 5661TAMT
     I*
     I            DS
     I                                        1   70WTRD
     I                                        1   50WTRD1
     I                                        6   70WTRD2
     I            DS
     I                                        1   80BT045
     I                                        1   60BT04
     I                                        7   80BT05
     C*---------------------------------------------------------------
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C                     EXSR RTN020                     .MAIN
     C*==============================================================*
     C*                    INIT PROCESS
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     SETON                     10
|    C*HEAD RECORD
|    C                     MOVELBT09      B2101
|    C*                    MOVE BT045     B2102
|    C                     MOVE BT045     B2104
|    C                     MOVEL'A'       B2103
|    C*                    MOVEL*BLANK    B2104
|    C                     MOVEL*BLANK    B2105
|    C                     MOVELB2HR      B201
|    C                     WRITEB20
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*                    MAIN PROCESS
     C*==============================================================*
02===C           RTN020    BEGSR
|    C*
|    C                     MOVELBT07      B2201
|    C*                    Z-ADDBT08      B2202
|    C                     MOVE BT08      B2202
|    C                     MOVEL*BLANK    B2203
|    C                     MOVEL*BLANK    B2204
|    C                     MOVELB2DR      B201
|    C                     WRITEB20
|    C*
02===C                     ENDSR
