     H****************************************************************
     H*   ªx¤Ó¸ê°T¬ì§Þ¶}µoªÑ¥÷¦³­­¤½¥q¡Ðª©Åv©Ò¦³    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA7011                                    *
     H*    PROGRAM NAME :Á~¸ê´CÅéÂà¦s§@·~¡@¡@¡@                    *
     H*    AUTHOR       : A1084 CHARLES                              *
     H*    CREATE DATE  : 79/07/17                                   *
     H*    UPDATE DATE  : 89/03/15 A1274 EVA                         *
     H*    SYSTEM       :¤H¨ÆÁ~¸ê                                  *
     H****************************************************************
     FPYPYJF03IP  E           K        DISK
     FPYPBPF  IF  E           K        DISK
     FPYPHPF  IF  E           K        DISK
     FPYHDPF  IF  E           K        DISK
     F*PYBCPF  IF  E           K        DISK
     FPYBTPF  O   E           K        DISK                      A
     E*---------------------------------------------------------------
     I/COPY QDDSSRC,PYPMDS01
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I                                      201 2080$A8YMD
     I*
     I                                      501 502 DPY01
     I                                      503 505 DBT061
     I                                      522 522 DBT03
     I*
     I                                      571 5760WBT04
     I                                      577 5800WPB03
     I                                      581 582 DPB04
     I*
     I                                      601 6050DPH03
     I                                      606 6110WPH03
     I                                      623 6290DBT045
     I                                      623 6270DBT04
     I                                      628 6290DBT05
     I*
     I            DS
     I                                        1   60KPH03
     I                                        1   40KPH03Y
     I                                        5   60KPH03M
     C*---------------------------------------------------------------
     C           *LIKE     DEFN PH04      KPH04
     C*---------------------------------------------------------------
     C           KEYPH     KLIST
     C                     KFLD           PY01
     C                     KFLD           PY02
     C                     KFLD           WPH03
     C                     KFLD           KPH04
     C           KEYHD     KLIST
     C                     KFLD           PY01
     C                     KFLD           PY02
     C                     KFLD           WPH03
     C                     KFLD           KPH04
     C           KEYPB     KLIST
     C                     KFLD           PY01
     C                     KFLD           PY02
     C                     KFLD           WPB03
     C                     KFLD           DPB04
     C                     KFLD           WBT04
     C                     KFLD           DBT05
     C*          KEYBC     KLIST
     C*                    KFLD           PY01
     C*                    KFLD           BT02
     C*                    KFLD           BT03
     C*                    KFLD           BT04
     C*                    KFLD           BT05
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010                     .INIT
     C*
     C                     EXSR RTN020                     .MAIN
| 02-C                     SETOF                     41
| 01-C*          EM321     IFEQ 'F'                        .¥~Äy
     C*                    EXSR RTN02F
| 02-C*                    END
     C*==============================================================*
     C*          RTN010... INITIAL PROCESS
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADDWBT04     KPH03
|    C*
|    C                     MOVELDBT03     KPH04            .©Ò±oÃþ§O
|    C*
|    C                     SETON                     10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*                    MAIN PROCESS
     C*==============================================================*
02===C           RTN020    BEGSR
|    C*
|    C                     MOVELPY01      BT01
|    C                     MOVELPY02      BT02
|    C                     MOVELDBT03     BT03
|    C                     Z-ADDWBT04     BT04
|    C                     Z-ADDDBT05     BT05
|    C*
|    C*          KEYBC     CHAINBC0                  40
|    C* N40                GOTO END020                     ¤£Âà¦s
|    C*
|    C                     MOVELPY04      BT061
|    C                     MOVELPY05      BT062
|    C                     MOVELPY06      BT07
|    C                     Z-ADD*ZERO     BT08
     C*YKK USE ONLY
|    C                     MOVEL'14140482'BT09             .¤½¥q±b¸¹
|    C                     MOVEL'0281001' BT10             .¨ü°U§½¸¹
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
| 02-C           DBT03     IFEQ '1'
|   C                     EXSR RTN100                     ¤U´ÁÁ~
| 02-C                     END
|    C*
| 03-C           DBT03     IFEQ '2'
|   C                     EXSR RTN300                     ¤W´ÁÁ~
| 03-C                     END
|    C*
| 04-C           DBT03     IFEQ '4'
|   C                     EXSR RTN200                     .¼úª÷
| 04-C                     END
|    C*
| 05-C           BT08      IFGT *ZERO
|   C                     Z-ADD$A8YMD    BT97
|   C                     TIME           WTIME  120
|   C                     MOVELWTIME     BT98
|   C                     MOVEL$USER     BT99
|   C                     WRITEBT0
| 05-C                     END
|    C*
02===C           END020    ENDSR
     C*==============================================================*
     C*¥~Äy¥N¦©µ|´Ú      MAIN PROCESS
     C*==============================================================*
02===C           RTN02F    BEGSR
|    C*
|    C                     MOVELPY01      BT01
|    C                     MOVELPY02      BT02
|    C                     MOVELDBT03     BT03
|    C                     Z-ADDWBT04     BT04
|    C                     Z-ADDDBT05     BT05
|    C*
|    C*          KEYBC     CHAINBC0                  40
|    C* N40                GOTO END02F                     ¤£Âà¦s
|    C*
|    C                     MOVELPM318     KHD05   2
|    C           KEYHD     CHAINHD0                  42
|    C                     MOVELPY04      BT061
|    C                     MOVELPY05      BT062
|    C                     MOVELPY061     BT07
     C*YKK USE ONLY
|    C                     MOVEL'14140482'BT09             .¤½¥q±b¸¹
|    C                     MOVEL'0281001' BT10             .¨ü°U§½¸¹
|    C*
| 02-C           *IN42     IFEQ '0'
| 02-C           HD06      ANDNE0
|   C*
|    C                     Z-ADDHD06      BT08
|   C*
|   C                     Z-ADD$A8YMD    BT97
|   C                     TIME           WTIME  120
|   C                     MOVELWTIME     BT98
|   C                     MOVEL$USER     BT99
|   C                     WRITEBT0
| 05-C                     END
|    C*
02===C           END02F    ENDSR
     C*==============================================================*
     C*          RTN100... Á~¸ê©Ò±o
     C*==============================================================*
03===C           RTN100    BEGSR
|    C*
|    C           KEYPH     CHAINPH0                  40
|    C   40                GOTO END100
|    C*SHARON MOD
|    C*                    Z-ADDPH05      BT08
|    C*                    ADD  PH16      BT08
|    C                     Z-ADDPH16      BT08
|    C                     ADD  PH17      BT08
|    C                     SUB  PH18      BT08
|    C                     ADD  PH27      BT08
|    C                     SUB  PH28      BT08
|    C                     SUB  PH29      BT08
|    C*
03===C           END100    ENDSR
     C*==============================================================*
     C*          RTN200... ¼úª÷©Ò±o
     C*==============================================================*
04===C           RTN200    BEGSR
|    C*
|    C           KEYPB     CHAINPB0                  41
|    C   41                GOTO END200
|    C*
| 02-C           PB96      IFNE *ZERO
|   C                     ADD  PB06      BT08
|   C                     ADD  PB06F     BT08
|   C                     SUB  PB08      BT08
|   C*                    SUB  PB09      BT08
|   C*                    SUB  PB10      BT08
|   C                     SUB  PB11      BT08
| 02-C                     END
|    C*
04===C           END200    ENDSR
     C*==============================================================*
     C*          RTN300... Á~¸ê©Ò±o
     C*==============================================================*
03===C           RTN300    BEGSR
|    C*
|    C           KEYPH     CHAINPH0                  40
|    C   40                GOTO END300
|    C*SHARON MOD
|    C                     Z-ADDPH30      BT08
|    C*
03===C           END300    ENDSR
