     H****************************************************************
     H*   PROGRAM NAME : PYA7018上海轉存
     H****************************************************************
     FPYBTPF  IP  E           K        DISK
     FPYBCPF  IF  E           K        DISK
     FPYEMPF  IF  E           K        DISK
     FPYB9PF  O   E           K        DISK                      A
     E*---------------------------------------------------------------
     I           UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I*
     I                                      501 502 DBT01
     I                                      503 505 DBT061
     I                                      506 508 DBT062
     I                                      508 509 DBT621
     I                                      510 521 DBT09
     I                                      522 522 DBT03
     I                                      523 5280DBT045
     I                                      523 5260DBT04
     I                                      527 5280DBT05
     I                                      533 533 DOPT
     I                                      534 5350DPY07
     I                                      536 545 DM406
     I                                      546 5540TCNT
     I                                      555 5661TAMT
     IB90T        DS
     I                                        1  74 B90TT
     I            DS
     I                                        1   60BT045
     I                                        1   40BT04
     I                                        5   60BT05
     I            DS
     I                                        1   4 BT062
     I                                        3   4 BT0621
     I*XCODE      DS
     I              X'0D'                 C         X1
     I              X'25'                 C         X2
     I              X'3F'                 C         X3
     I/COPY PYDDSSRC,PYB9DS01
     C           KEYBC     KLIST
     C                     KFLD           BT01
     C                     KFLD           BT02
     C                     KFLD           BT03
     C                     KFLD           BT04
     C                     KFLD           BT05
     C           KEYEM     KLIST
     C                     KFLD           BT01
     C                     KFLD           BT02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010                     .INIZ
     C                     EXSR RTN020                     .MAIN
     CLR 10                EXSR RTN030                     LR
     C*==============================================================*
     C*                    INIZ PROCESS
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVEL*BLANK    B901
|    C                     Z-ADD0         B902
|    C                     Z-ADD0         B903
|    C                     MOVEL'  000000'B904
|    C                     MOVE '000000'  B904
|    C                     MOVELDBT621    B904
|    C                     Z-ADD0         B905
|    C                     MOVEL*BLANK    B906
|    C                     MOVEL*BLANK    B907
|    C                     MOVEL*BLANK    B908
|    C                     MOVEL*BLANK    B909
|    C                     WRITEB90
|    C                     MOVEL'COSMOS'  B901
|    C                     Z-ADD0         B902
|    C                     Z-ADD2         B903
|    C                     MOVEL*BLANK    B904
|    C                     Z-ADD0         B905
|    C                     MOVEL*BLANK    B906
|    C                     MOVEL'0000'    B907
|    C                     MOVEL'SA'      B908
|    C                     MOVEL*BLANK    B909
|    C                     SETON                     10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*                    MAIN PROCESS
     C*==============================================================*
02===C           RTN020    BEGSR
|    C*
|    C           KEYBC     CHAINBC0                  40
|    C  N40                GOTO END020                     不轉存
|    C                     Z-ADDBT045     B902
|    C                     MOVELBT0621    B904
|    C                     MOVE BT07      B904
|    C                     Z-ADDBT08      B905
|    C                     MOVEL*BLANK    B906
|    C           KEYEM     CHAINEM0                  40
|    C  N40                MOVELEM31      B906
|    C                     WRITEB90
|    C*
02===C           END020    ENDSR
     C*==============================================================*
     C*                    MAIN PROCESS
     C*==============================================================*
03===C           RTN030    BEGSR
|    C*
|    C                     MOVEL*BLANK    B902
|    C                     MOVEL*BLANK    B903
|    C                     MOVEL*BLANK    B904
|    C                     MOVEL*BLANK    B905
|    C                     MOVEL*BLANK    B906
|    C                     MOVEL*BLANK    B907
|    C                     MOVEL*BLANK    B908
|    C                     MOVEL*BLANK    B909
|    C                     MOVEL'END$. '  B901
|    C                     WRITEB90
|    C*
03===C                     ENDSR
     C*==============================================================*
