     H****************************************************************
     H*   ªx¤Ó¸ê°T¬ì§Þ¶}µoªÑ¥÷¦³­­¤½¥q¡Ðª©Åv©Ò¦³    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM NAME : PYA701                                     *
     H*    PROGRAM NAME :                                        *
     H*    AUTHOR       : A1413 CLOUD                                *
     H*    CREATE DATE  : 96/04/16                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :¤H¨ÆÁ~¸ê¨t²Î                              *
     H****************************************************************
     F*¤½¥q¼úª÷¸ê®ÆÀÉ
     FPYPBLF02UF  E           K        DISK
     F*PYPYPF  UF  E           K        DISK
     FPYBTPF  UF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FSYBNPF  IF  E           K        DISK
     FPYA701D CF  E                    WORKSTN
     I*---------------------------------------------------------------
     I/COPY QDDSSRC,PYPMDS01
     ILDA        UDS
     I                                      101 110 $USER
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      139 139 $RMK01
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      162 1620$EVR
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I*
     I                                      501 502 DPY01
     I                                      503 505 DBT061
     I                                      522 522 DBT03
     I*
     I                                      571 5760WBT04
     I                                      577 5800WPB03
     I                                      581 582 DPB04
     I*
     I                                      601 6040DPH03
     I                                      606 6110WPH03
     I                                      623 6280DBT045
     I                                      623 6240DYY
     I                                      625 6260DMM
     I                                      623 6260DYM
     I                                      627 6280DBT05
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C                     MOVEL'2'       DFMT    1
     C                     MOVEL'2'       DTYPE   1
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYPB     KLIST
     C                     KFLD           DPY01
     C                     KFLD           WPB03
     C                     KFLD           DPB04
     C           KEYBT     KLIST
     C                     KFLD           DPY01            ¤½¥q½s¸¹
     C                     KFLD           DBT03            ©Ò±oÃþ§O
     C                     KFLD           WBT04            ¦s¤J¤ë¥÷
     C                     KFLD           DBT05            ¦s¤J¤é´Á
     C                     KFLD           DBT061           Á`¦æ
     C           KEYCM     KLIST
     C                     KFLD           DPY01
     C           KEYBN     KLIST
     C                     KFLD           DBT061
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010                     *INI. RTN.
     C*
  01-C           *IN03     DOWEQ'0'
    C                     EXSR RTN100                     *MAIN
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL ROUTINE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     SETON                     10
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C*
     C                     MOVEL*BLANK    DPY01            ¤½¥q
|    C                     MOVEL*BLANK    DBT061           Âà¦s»È¦æ
|    C                     MOVEL'1'       DBT03            ©Ò±oÃþ§O
|    C*
|    C                     Z-ADD0         DBT045           ¦s¤J¤é´Á
|    C                     Z-ADD0         DPH03            ­pÁ~¦~¤ë
|    C                     Z-ADD0         DPB03            ¼úª÷¦~«×
|    C*
|    C                     Z-ADD1         $CPY
|    C                     Z-ADD1         $PRTID
|    C                     Z-ADD2         $EVR
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100.... MAIN ROUTINE
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     EXFMTDSPC1
|    C*
|    C                     MOVEA*ALL'0'   *IN,60
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO END100
| 01-C                     END
|    C*
|    C                     EXSR RTN110                     *CHK SCREEN1
|    C*
| 02-C           *IN99     IFEQ '0'
|   C           *IN13     ANDEQ'1'
|   C                     EXSR RTN120                     *PROCESS
| 02-C                     END
|    C*
02===C           END100    ENDSR
     C*==============================================================*
     C*          RTN110....CHECK SCREEN1
     C*==============================================================*
03===C           RTN110    BEGSR
|    C*
|    C*¤½¥q½s¸¹
| 01-C           DPY01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 01-C                     END
|    C*
|    C           KEYCM     CHAINCM0                  41
| 02-C           *IN41     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 02-C                     END
|    C   99                GOTO END110
|    C*
|    C*Âà¦s»È¦æ
| 03-C           DBT061    IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 03-C                     END
|    C*
|    C           KEYBN     CHAINBN0                  40
| 04-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 04-C                     END
|    C   99                GOTO END110
|    C*
|    C*©Ò±oÃþ§O
| 05-C           DBT03     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 05-C                     END
|    C   99                GOTO END110
|    C*
|    C*¦s¤J¤é´Á
| 06-C           DBT045    IFEQ *ZERO
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 06*C                     ELSE
|   C*
|   C                     CALL 'P30'
|   C                     PARM DBT045    P3001I  80
|   C                     PARM '1'       P3002I  1
|   C                     PARM '1'       P3003I  1
|   C                     PARM           P3011O  1
| 07-C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 07-C                     END
| 06-C                     END
|    C   99                GOTO END110
|    C*
|   C                     CALL 'P39'
|   C                     PARM DYM       P3901I  60
|   C                     PARM '1'       P3902I  1
|   C                     PARM '1'       P3903I  1
|   C                     PARM '2'       P3904I  1
|   C                     PARM '1'       P3905I  1
|   C           WBT04     PARM           P3911O  60
|    C*
| 08-C           DBT03     IFEQ '4'
|   C*¼úª÷¦~«×
| 09-C           DPB03     IFEQ *ZERO
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6799
| 09-C                     END
|   C   99                GOTO END110
|   C*
| 08*C                     ELSE
|   C*­pÁ~¦~¤ë
| 10-C           DPH03     IFEQ *ZERO
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6699
| 10-C                     END
|   C   99                GOTO END110
|   C*
|   C                     CALL 'P39'
|   C                     PARM DPH03     P3901I  60
|   C                     PARM '1'       P3902I  1
|   C                     PARM '1'       P3903I  1
|   C                     PARM '2'       P3904I  1
|   C                     PARM '1'       P3905I  1
|   C           WPH03     PARM           P3911O  60
| 08-C                     END
|    C*
| 11-C           $RMK01    IFNE 'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6799
| 11-C                     END
|    C   99                GOTO END110
|    C*
03===C           END110    ENDSR
     C*==============================================================*
     C*          RTN120.... PROCESS
     C*==============================================================*
04===C           RTN120    BEGSR
|    C*
|    C                     SETON                     96
|    C                     WRITEDSPC1
|    C*²M°£Á~¸ê»È¦æÂà¦s¾ú¥vÀÉPYBTPF
|    C                     EXSR RTN130
|    C*
|    C                     OUT  LDA
|    C*¼g¤J¤J±bª÷ÃB
|    C                     CALL 'PYA7011C'
|    C*¼g¤J¦U®a»È¦æ®æ¦¡
| 01-C           DBT061    IFEQ '006'                      ¦X®w
|   C                     CALL 'PYA7016C'
| 01-C                     END
|    C*
|    C*                    CALL 'PYR707AC'                 ¦C¦L³øªí
|    C*
|    C                     SETON                     95
|    C                     SETOF                     9697
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN130.... UPDATE PYPBPF PYPYPF
     C*==============================================================*
05===C           RTN130    BEGSR
|    C*
|    C*²M°£Á~¸ê»È¦æÂà¦s¾ú¥vÀÉPYBTPF
|    C           KEYBT     SETLLBT0
|    C           KEYBT     READEBT0                      40
| 01-C           *IN40     DOWEQ'0'
|   C                     DELETBT0
|   C           KEYBT     READEBT0                      40
| 01-C                     END
|    C*
|    C*¦s¦^µo©ñ¦~¤ë¡Bµo©ñ¤é´Á
| 02-C           DBT03     IFEQ '4'
|   C*
|   C           KEYPB     SETLLPB0
|   C           KEYPB     READEPB0                      42
| 03-C           *IN42     DOWEQ'0'
|   C                     Z-ADDWBT04     PB05
|   C                     Z-ADDDBT05     PB05D
|   C                     Z-ADD$A8YMD    PB97
|   C                     TIME           PB98
|   C                     MOVEL$USER     PB99
|   C                     UPDATPB0
|   C           KEYPB     READEPB0                      42
| 03-C                     END
|   C*
| 02-C                     END
|    C*
05===C                     ENDSR
