     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYR7023                                    *
     H*    PROGRAM NAME :所得扣繳媒體申報處理－人工轉入            *
     H*    AUTHOR       : A1274 EVA                                  *
     H*    CREATE DATE  : 89/03/22                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYTBPF  IP  E           K        DISK
     FPYTDLF04UF  E           K        DISK                      A
     FPYAAPF  UF  E           K        DISK                      A
     E*---------------------------------------------------------------
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      203 2080DDATE
     I                                      201 2080$A8YMD
     I*
     I                                      501 5020DTD01
     I                                      506 506 DOPT
     I                                      507 508 DTD11
     I                                      509 516 DTD17
     I*
     I                                      571 5740WTD01
     I*薪資處理起始年月
     I*                                     517 5220WFYM
     I*                                     517 5200DFY
     I*                                     521 5220DFM
     I*
     I*薪資處理截止年月
     I*                                     523 5280WTYM
     I*                                     523 5260DTY
     I*                                     527 5280DTM
     I*                                     529 532 DTD02
     I*
     I                                      601 608 DTD12F
     I                                      609 616 DTD12T
     I                                      617 624 WTD12F
     I                                      625 632 WTD12T
     I                                      633 6340DMM
     I*                                     635 635 DCITY
     I                                      636 636 DSEL
     I*薪資處理起始年月
     I                                      637 6420KFYM
     I                                      637 6400KFY
     I                                      641 6420KFM
     I*薪資處理截止年月
     I                                      643 6480KTYM
     I                                      643 6460KTY
     I                                      647 6480KTM
     I*
     I                                      649 651 DTD19
     I*
     IPYDA03      DS                            512
     I                                      302 303 PYD034
     I            DS
     I                                        1   80EM13
     I                                        1   60EM13YM
     I            DS
     I                                        1   60KYM
     I                                        1   40KYY
     I                                        5   60KMM
     I            DS
     I                                        1   1 EM321
     I                                        2   6 EM04
     I                                        2   2 EM041
     I                                        3   3 EM042
     I                                        4   4 EM043
     I                                        5   6 EM044
     I                                        1  10 TD99
     I            DS
     I                                        1  10 TB12
     I                                        1   8 WTB12
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C           *NAMVAR   DEFN           PYDA03
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           KEYTD     KLIST
     C                     KFLD           DTD11            .公司
     C                     KFLD           WTD01            .年度
     C                     KFLD           TB17             統一編號
     C                     KFLD           TB04             .格式代號
     C                     KFLD           TB05             .身份證號
     C           KEYAA     KLIST
     C                     KFLD           TB11
     C                     KFLD           WTB12
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100
     C*
     C*==============================================================*
     C*          RTN010... INIT PROCESS
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     IN   *NAMVAR
|    C*
|    C                     SETON                     10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... ＭＡＩＮ
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C           KEYTD     CHAINTD0                  42
|    C*
|    C                     Z-ADD$A8YMD    TD97
|    C                     TIME           WTIME  120
|    C                     MOVELWTIME     TD98
|    C*                    MOVEL$USER     TD99
|    C*
| 01-C           *IN42     IFEQ '0'
|   C                     ADD  TB07      TD07
|   C                     ADD  TB08      TD08
|   C                     UPDATTD0
|   C*
| 01*C                     ELSE
|   C                     Z-ADDTB01      TD01
|   C                     MOVELTB02      TD02      P
|   C                     Z-ADDTB03      TD03
|   C                     MOVELTB04      TD04      P
|   C                     MOVELTB05      TD05      P
|   C                     MOVELTB06      TD06      P
|   C                     Z-ADDTB07      TD07
|   C                     Z-ADDTB08      TD08
|   C                     MOVELTB09      TD09      P
|   C                     MOVELTB10      TD10      P
|   C                     MOVELTB11      TD11      P
|   C                     MOVELTB12      TD12      P
|   C                     MOVELTB13      TD13      P
|   C**                   MOVELTB14      TD14      P
|   C*HANK910117S
|   C                     CALL 'P65'
|   C                     PARM TB14      P6501I 80
|   C                     PARM 61        P6502I  30
|   C           TD14      PARM           P6501O 80
|   C                     PARM           P6502O 80
|   C*HANK910117E
|   C                     Z-ADDTB15      TD15
|   C                     MOVELTB16      TD16      P
|   C                     MOVELTB17      TD17      P
|   C                     Z-ADD1         TD18
|   C                     Z-ADDTB96      TD96
|   C*
| 02-C           TD07      IFNE *ZERO
|   C           TD08      ORNE *ZERO
|   C                     WRITETD0
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C*-------------------------------------------------------------***
|    C*寫入扣繳月份記錄檔
|    C           KEYAA     CHAINAA0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     Z-ADDTD16      AA03
|   C                     UPDATAA0
| 03*C                     ELSE
|   C                     MOVELTD11      AA01
|   C                     MOVELTD12      AA02
|   C                     Z-ADDTD16      AA03
|   C                     WRITEAA0
| 03-C                     END
|    C*
02===C           END100    ENDSR
