     H****************************************************************
     H*   PROGRAM NAME : PYA7021                                     *
     H*   AUTHER       : A1084 CHARLES                               *
     H*   CREATE DATE  : 79/07/17                                    *
     H*   UPDATE DATE  : 89/02/24 A1274 EVA                          *
     H*   UPDATE DATE  : 96/01/15 A1413 CLOUD                        *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H****************************************************************
     FPYPHJF02IP  E           K        DISK
     FPYTDLF04UF  E           K        DISK                      A
     FPYAAPF  UF  E           K        DISK                      A
     FPYPMPF  IF  E           K        DISK
     FPYHDPF  IF  E           K        DISK
     FPYH6PF  IF  E           K        DISK
     I*-------------------------------------------------------------***
     I/COPY QDDSSRC,PYPMDS01
     I*
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      203 2080DDATE
     I                                      201 2080$A8YMD
     I*
     I                                      501 5020DTD01
     I                                      506 506 DOPT
     I                                      507 508 DTD11
     I                                      509 516 DTD17
     I*
     I                                      571 5740WTD01
     I*薪資處理起始年月
     I                                      517 5220WFYM
     I                                      517 5200DFY
     I                                      521 5220DFM
     I*
     I*薪資處理截止年月
     I                                      523 5280WTYM
     I                                      523 5260DTY
     I                                      527 5280DTM
     I                                      529 532 DTD02
     I*
     I                                      601 608 DTD12F
     I                                      609 616 DTD12T
     I                                      617 624 WTD12F
     I                                      625 632 WTD12T
     I                                      633 6340DMM
     I*                                     635 635 DCITY
     I                                      636 636 DSEL
     I                                      649 651 DTD19
     I*
     IPYDA03      DS                            512
     I                                      302 303 PYD034
     I            DS
     I                                        1   80EM13
     I                                        1   60EM13YM
     I            DS
     I                                        1   80EM19
     I                                        1   60EM19YM
     I            DS
     I                                        1   60KYM
     I                                        1   40KYY
     I                                        5   60KMM
     I            DS
     I                                        1   1 EM321
     I                                        2   8 EM04
     I                                        2   2 EM041
     I                                        3   3 EM042
     I                                        4   4 EM043
     I                                        5   8 EM044
     I                                        1  10 TD99
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C           *NAMVAR   DEFN           PYDA03
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C                     MOVELPH02      KTD12  10 P
     C           KEYTD     KLIST
     C                     KFLD           DTD11            公司
     C                     KFLD           WTD01            年度
     C                     KFLD           WTD17   8        統一編號
     C                     KFLD           PYD034           格式代號
     C                     KFLD           EM31             身份證號
     C           KEYPM     KLIST
     C                     KFLD           PM01
     C                     KFLD           DTD11
     C           KEYHD     KLIST
     C                     KFLD           PH01             公司
     C                     KFLD           PH02             員工編號
     C                     KFLD           PH03             年月
     C                     KFLD           PH04             期別
     C                     KFLD           PM318            所得稅
     C           KEYH6     KLIST
     C                     KFLD           PH01             公司
     C                     KFLD           PH02             員工編號
     C                     KFLD           PH03             年月
     C*
     C                     MOVEL'57'      DHD05   2
     C           KEYHD1    KLIST
     C                     KFLD           PH01             公司
     C                     KFLD           PH02             員工編號
     C                     KFLD           PH03             年月
     C                     KFLD           PH04             期別
     C                     KFLD           DHD05            加班所得稅
     C           KEYAA     KLIST
     C                     KFLD           PH01             公司
     C                     KFLD           PH02             員工編號
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100
     C*==============================================================*
     C*          RTN010... INIT PROCESS
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     IN   *NAMVAR
|    C*
|    C                     MOVEL'01'      PM01
|    C           KEYPM     CHAINPM0                  40
|    C*
|    C                     SETON                     10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100...ＭＡＩＮ
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*本國員工（當年度所得＝去年12月薪資～今年11月薪資)
|    C*          EM321     IFEQ 'L'
|    C*          PH03      ANDEQWFYM
|    C*          PH04      ANDEQ'2'
|    C*                    GOTO TAG1
|    C*                    END
|    C*
|    C*          EM321     IFEQ 'L'
|    C*          PH03      ANDEQWTYM
|    C*          PH04      ANDEQ'1'
|    C*                    GOTO TAG1
|    C*                    END
|    C*
|    C                     MOVELDTD17     WTD17
|    C*
| 01-C                     SELEC
|   C           EM321     WHEQ 'F'                        國籍
|   C           EM39      ANDEQ*BLANK                     戶籍地址
|   C                     MOVEL'3'       TD06             .證號別
|   C*
|   C           EM321     WHEQ 'F'                        國籍
|   C           EM39      ANDNE*BLANK                     戶籍地址
|   C                     MOVEL'3'       TD06             .證號別
|   C                     OTHER
|   C                     MOVEL*BLANK    TD06             .證號別
| 01-C                     END
|    C*所得稅金額
|    C           KEYHD     CHAINHD0                  41
|    C   41                Z-ADD*ZERO     HD06
|    C*
|    C           KEYTD     CHAINTD0                  42
|    C*
|    C                     Z-ADD$A8YMD    TD97
|    C                     TIME           WTIME  120
|    C                     MOVELWTIME     TD98
|    C*                    MOVEL$USER     TD99
|    C*
|    C                     Z-ADD0         H605
| 02-C           PH04      IFEQ '1'
|   C           KEYH6     CHAINH60                  43
| 02-C                     ENDIF
|    C*
| 03-C           *IN42     IFEQ '0'
|   C                     ADD  PH17      TD07
|   C                     ADD  PH27      TD07
|   C                     SUB  PH28      TD07
|   C                     SUB  PH29      TD07
| 04-C           *IN43     IFEQ '0'
|   C                     SUB  H605      TD07             自提不計給付總額
|   C                     ADD  H605      TD20             勞退自提
| 04-C                     END
|   C                     ADD  HD06      TD08
|   C           KEYHD1    CHAINHD0                  47
|   C  N47                ADD  HD06      TD08
|   C                     UPDATTD0
|   C*
| 03*C                     ELSE
|   C                     Z-ADDWTD01     TD01
|   C                     MOVELDTD02     TD02      P
|   C                     Z-ADD*ZERO     TD03
|   C                     Z-ADD*ZERO     TD20
|   C                     MOVELPYD034    TD04      P
|   C                     MOVELEM31      TD05      P
|   C*
| 05-C                     SELEC
|   C           EM321     WHEQ 'F'                        國籍
|   C           EM39      ANDEQ*BLANK                     戶籍地址
|   C                     MOVEL'3'       TD06             .證號別
|   C*
|   C           EM321     WHEQ 'F'                        國籍
|   C           EM39      ANDNE*BLANK                     戶籍地址
|   C                     MOVEL'4'       TD06             .證號別
|   C                     OTHER
|   C                     MOVEL*BLANK    TD06             .證號別
| 05-C                     END
|   C*
|   C                     Z-ADDPH17      TD07
|   C                     ADD  PH27      TD07
|   C                     SUB  PH28      TD07
|   C                     SUB  PH29      TD07
| 06-C           *IN43     IFEQ '0'
|   C                     SUB  H605      TD07             自提不計給付總額
|   C                     ADD  H605      TD20             勞退自提
| 06-C                     END
|   C                     Z-ADDHD06      TD08
|   C           KEYHD1    CHAINHD0                  47
|   C  N47                ADD  HD06      TD08
|   C                     MOVEL*BLANK    TD09
|   C                     MOVEL*BLANK    TD10
|   C*
| 07-C           EM311     IFEQ '1'
|   C                     MOVEL'A'       TD10      P
| 07-C                     END
|   C*
|   C                     MOVELDTD11     TD11      P
|   C                     MOVELEM02      TD12      P
|   C                     MOVELEM03      TD13      P
|   C**HANK               MOVELEM39      TD14      P
|   C*HANK910117S
|   C                     CALL 'P65'
|   C                     PARM EM39      P6501I 80
|   C                     PARM 61        P6502I  30
|   C           TD14      PARM           P6501O 80
|   C                     PARM           P6502O 80
|   C*HANK910117E
|   C                     Z-ADDWFYM      TD15
|   C*
| 08-C           TD15      IFLT EM13YM
|   C                     Z-ADDEM13YM    TD15
| 08-C                     END
|   C*
|   C                     MOVELWTYM      TD16
|   C*
| 09-C           TD16      IFGT EM19YM
|   C           EM19YM    ANDNE*ZERO
|   C                     Z-ADDEM19YM    TD16
| 09-C                     END
|   C*
|   C                     MOVELWTD17     TD17
|   C                     MOVELDTD19     TD19      P
|   C*
|   C                     Z-ADD*ZERO     TD96
| 10-C           TD07      IFNE *ZERO
|   C           TD08      ORNE *ZERO
|   C*
|   C                     WRITETD0
|   C*
| 10-C                     END
| 03-C                     END
|    C*
|    C*--------------------------------------------------------------**
|    C*寫入扣繳月份記錄檔
|    C           KEYAA     CHAINAA0                  40
| 11-C           *IN40     IFEQ '0'
|   C                     Z-ADDTD16      AA03
|   C                     UPDATAA0
| 11*C                     ELSE
|   C                     MOVELPH01      AA01
|   C                     MOVELPH02      AA02
|   C                     Z-ADDTD16      AA03
|   C                     WRITEAA0
| 11-C                     END
|    C*
|    C           TAG1      TAG
|    C*
02===C           END100    ENDSR
