     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA7075                                    *
     H*    PROGRAM NAME :薪資媒體轉存作業－台北國際商銀            *
     H*    AUTHOR       : A1274 EVA                                  *
     H*    CREATE DATE  : 89/03/20                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYBTPF  IP  E           K        DISK
     FPYB11PF O   E           K        DISK                      A
     E*---------------------------------------------------------------
     I/COPY PYDDSSRC,PYB11DS01
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I*
     I                                      501 502 DBT01
     I                                      503 505 DBT061
     I                                      506 509 DBT062
     I                                      510 521 DBT09
     I                                      522 522 DBT03
     I                                      523 5260DBT04
     I                                      527 5280DBT05
     I                                      529 530 DPB041
     I                                      531 532 DPB042
     I                                      533 533 DOPT
     I                                      534 5350DPY07
     I                                      536 5450DM406
     I                                      546 5540TCNT
     I                                      555 5661TAMT
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C                     EXSR RTN020                     .MAIN
     CLR                   EXSR RTN030
     C*==============================================================*
     C*                    INIT PROCESS
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     SETON                     10
|    C*HEAD RECORD
|    C                     MOVEL*ALL'0'   B11101
|    C                     MOVE '0000000' B11101           公司帳號
|    C                     MOVEL'58003'   B11102           企業編號
|    C           BT04      SUB  191100    BYM
|    C                     Z-ADDBT05      BDD              轉存日期
|    C                     Z-ADDTCNT      B11104           轉存總筆數
|    C                     Z-ADDTAMT      B11105           轉存總金額
|    C                     MOVEL'C'       B11106           識別欄
|    C                     MOVEL*ALL'0'   B11107           備用
|    C*
|    C                     MOVEL*BLANK    B1101
|    C                     MOVELB11HR     B1101
|    C                     WRITEB110
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*                    MAIN PROCESS
     C*==============================================================*
02===C           RTN020    BEGSR
|    C*
|    C                     MOVEL'580'     B201A
|    C                     MOVELBT07      B201B            存入帳號
|    C                     MOVEL*ALL'0'   B202A            員工編號
|    C                     MOVEL*ALL'0'   B202B
|    C                     Z-ADDBT08      BMNY   132
|    C                     MOVE BMNY      B11203           存款金額
|    C                     MOVEL'C14'     B11204           識別欄
|    C                     MOVEL'58003'   B11205           企業編號
|    C                     MOVEL*ALL'0'   B11206           備用
|    C*
|    C                     MOVEL*ALL'0'   B1101
|    C                     MOVELB11DR     B1101
|    C                     WRITEB110
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*                    RTN030
     C*==============================================================*
03===C           RTN030    BEGSR
|    C*
03===C                     ENDSR
