     H****************************************************************
     H*   PROGRAM NAME : PYR1042                                     *
     H*   AUTHER       : A1084 CHARLES                               *
     H*   CREATE DATE  : 79/07/17                                    *
     H*   UPDATE DATE  :                                             *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR1041C                                    *
     H*   PURPOSE      :                                             *
     H*   INDICATORS   :                                             *
     H****************************************************************
     FPYPBPF  IP  E           K        DISK
     FPYTDPF  UF  E           K        DISK                      A
     FPYTDPF1 UF  E           K        DISK                      A
     FPYEMPF  IF  E           K        DISK
     E*---------------------------------------------------------------
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      187 1920DDATE
     I                                      201 2080$A8YMD
     I*
     I                                      501 5020DTD01
     I                                      506 506 DOPT
     I                                      507 508 WTD11
     I                                      509 516 DTD17
     I                                      533 536 DTD02
     I                                      571 5740WTD01
     I*
     IPYDA03      DS                            512
     I                                      302 303 PYD034
     I            DS
     I                                        1   80EM13
     I                                        1   60EM13YM
     I            DS
     I                                        1   60CHKYM
     I                                        1   40CHKYY
     I                                        5   60CHKMM
     I            DS
     I                                        1   1 EM321
     I                                        2   6 EM04
     I                                        2   2 EM041
     I                                        3   3 EM042
     I                                        4   4 EM043
     I                                        5   8 EM044
     I                                        1  10 TD99
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C           *NAMVAR   DEFN           PYDA03
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           KEYTD     KLIST
     C                     KFLD           WTD11
     C                     KFLD           WTD01
     C                     KFLD           PYD034
     C                     KFLD           EM31
     C           KEYEM     KLIST
     C                     KFLD           PB01
     C                     KFLD           PB02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100
     C*
     C*==============================================================*
     C*   RTN010... INIT PROCESS
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     IN   *NAMVAR
|    C*
|    C                     Z-ADDWTD01     CHKYY
|    C                     Z-ADD07        CHKMM
|    C*
|    C                     SETON                     10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*   RTN100... ＭＡＩＮ
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     MOVEL*BLANK    EM321
|    C           KEYEM     CHAINEM0                  40
| 01-C           EM321     IFEQ 'F'
|   C                     MOVEL'4'       TD06
| 01-C                     END
|    C*
| 02-C           EM13YM    IFGE CHKYM
|   C           EM321     ANDEQ'F'
|   C           KEYTD     CHAINTD1                  42
| 02*C                     ELSE
|   C           KEYTD     CHAINTD0                  42
| 02-C                     END
|    C*
|    C*          KEYTD     CHAINTD0                  42
|    C*
|    C                     Z-ADD$A8YMD    TD97
|    C                     TIME           WTIME  120
|    C                     MOVELWTIME     TD98
|    C*                    MOVEL$USER     TD99
|    C*
| 03-C           *IN42     IFEQ '0'
|   C                     ADD  PB06      TD07
|   C                     ADD  PB08      TD08
| 04-C           EM13YM    IFGE CHKYM
|   C           EM321     ANDEQ'F'
|   C                     UPDATTD1
| 04*C                     ELSE
|   C                     UPDATTD0
| 04-C                     END
|   C*                    UPDATTD0
|   C*
| 03*C                     ELSE
|   C                     Z-ADDWTD01     TD01
|   C                     MOVELDTD02     TD02
|   C                     Z-ADD*ZERO     TD03
|   C                     MOVELPYD034    TD04
|   C                     MOVELEM31      TD05
|   C                     MOVEL*BLANK    TD06
| 05-C           EM311     IFEQ '2'
|   C                     MOVEL'4'       TD06
| 05-C                     END
|   C                     Z-ADDPB06      TD07
|   C                     Z-ADDPB08      TD08
|   C                     MOVEL*BLANK    TD09
|   C*                    MOVEL*BLANK    TD091
|   C*                    MOVEL*BLANK    TD092
|   C*                    MOVEL*BLANK    TD093
|   C*                    MOVEL*BLANK    TD094
|   C                     MOVEL*BLANK    TD10
| 06-C           EM311     IFEQ '1'
|   C                     MOVEL'A'       TD10
| 06-C                     END
|   C                     MOVELWTD11     TD11
|   C                     MOVEL*BLANK    TD12
|   C                     MOVELEM02      TD12
|   C                     MOVELEM03      TD13
|   C                     MOVELEM39      TD14
|   C                     MOVELTD01      TD15
|   C                     MOVE '01'      TD15
|   C                     MOVELTD01      TD16
|   C                     MOVE '12'      TD16
|   C                     MOVELDTD17     TD17
|   C                     Z-ADD*ZERO     TD96
|   C*
| 07-C           TD07      IFNE *ZERO
|   C           TD08      ORNE *ZERO
|   C*
| 08-C           EM13YM    IFGE CHKYM
|   C           EM321     ANDEQ'F'
|   C                     WRITETD1
| 08*C                     ELSE
|   C                     WRITETD0
| 08-C                     END
|   C*
|   C*                    WRITETD0
| 07-C                     END
|   C*
| 03-C                     END
|    C*
02===C                     ENDSR
