     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA7041                                    *
     H*    PROGRAM NAME :所得稅扣繳申報核定　                      *
     H*    AUTHOR       : A1084 CHARLES                              *
     H*    CREATE DATE  : 81/03/18                                   *
     H*    UPDATE DATE  : 89/03/14 A1274 EVA                         *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYTDPF  UP  E           K        DISK
     E*---------------------------------------------------------------
     I           UDS
     I                                      101 110 $USER
     I                                      203 2080DDATE
     I                                      201 2080$A8YMD
     I*
     I                                      507 516 $TDEV
     I                                      517 5230DFA04F
     I                                      524 5300DFA04T
     I                                      531 5370DFA04N
     I*
     I                                      541 544 DTD02
     I                                      545 5480WTD01
     I                                      549 5540WTD16
     I                                      555 555 DSEL
     I                                      556 556 DOPT
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN100
     C*==============================================================*
     C*                    RTN100... ＭＡＩＮ
     C*==============================================================*
01===C           RTN100    BEGSR
|    C*
|    C                     ADD  1         DFA04N
|    C*          DFA04N    SUB  1         TD03
|    C                     Z-ADDDFA04N    TD03
|    C*
|    C                     Z-ADD$A8YMD    TD96
|    C                     Z-ADD$A8YMD    TD97
|    C                     TIME           WTIME  120
|    C                     MOVELWTIME     TD98
|    C*                    MOVEL$USER     TD99
|    C                     UPDATTD0
|    C*
|    C                     Z-ADDTD03      DFA04T
|    C*
01===C                     ENDSR
