     H****************************************************************
     H*   PROGRAM NAME : PYA7016合庫轉存
     H****************************************************************
     FPYBTPF  IP  E           K        DISK
     FPYBCPF  IF  E           K        DISK
     FPYPYPF  IF  E           K        DISK
     FPYEMPF  IF  E           K        DISK
     FPYG5PF  O   E                    DISK                      A
     E*---------------------------------------------------------------
     I           UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I*
     I                                      501 502 DBT01
     I                                      503 505 DBT061
     I                                      522 522 DBT03
     I                                      529 530 DPB041
     I*
     I                                      534 5350DPY07
     I                                      536 545 DM406
     I                                      546 5540TCNT
     I                                      555 5661TAMT
     I                                      567 567 DPY09
     I                                      571 5760WBT04
     I                                      577 5780DBT05
     I                                      580 5830WPB03
     I                                      584 585 DPB04
     I*
     I                                      601 6050DPH03
     I                                      606 6110WPH03
     I                                      621 621 DEM321
     I                                      623 6280DBT045
     I                                      623 6240DYY
     I                                      625 6260DMM
     I                                      623 6260DYM
     I                                      627 6280DBT05S
     I            DS
     I                                        1  14 BT07
     I                                        1   3 BT071
     I                                        4   9 BT072
     I*
     I              '            0411'    C         WCODE
     I/COPY QDDSSRC,PYB5DS01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYBC     KLIST
     C                     KFLD           BT01
     C                     KFLD           BT02
     C                     KFLD           BT03
     C                     KFLD           BT04
     C                     KFLD           BT05
     C           KEYPY     KLIST
     C                     KFLD           BT01             公司編號
     C                     KFLD           BT02             員工編號
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN020                     .MAIN
     C*==============================================================*
     C*                    MAIN PROCESS
     C*==============================================================*
01===C           RTN020    BEGSR
|    C*
|    C           KEYBC     CHAINBC0                  40
|    C  N40                GOTO END020                     不轉存
|    C*
|    C           KEYPY     CHAINPY0                  40
|    C   40                GOTO END020                     不轉存
|    C*
|    C           KEYPY     CHAINEM0                  40
|    C   40                GOTO END020                     不轉存
|    C*
|    C                     MOVEL'01'      B5101            轉帳類別
|    C                     MOVELPY05      B5102            轉帳單位代號
|    C                     MOVELBT071     B5103            存款類別
|    C                     MOVELBT072     B5104            存戶帳號
|    C                     Z-ADDBT08      B5105            轉帳金額
|    C                     MOVELEM31      B5106            身份證字號
|    C                     MOVEL*BLANK    B5107            員工代號
|    C                     MOVEL*BLANK    B5108            備用
|    C                     MOVELWCODE     B5109            固定常數
|    C                     MOVELB5R       B501
|    C                     WRITEB50
|    C*
01===C           END020    ENDSR
