     H****************************************************************
     H*   PROGRAM NAME : PYR1042                                     *
     H*   AUTHER       : A1084 CHARLES                               *
     H*   CREATE DATE  : 79/07/17                                    *
     H*   UPDATE DATE  : 89/10/19 A1274 EVA                          *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR1041C                                    *
     H****************************************************************
     FPYBTPF  IP  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYB3PF  O   E           K        DISK                      A
     E*---------------------------------------------------------------
     I*
     I/COPY PYDDSSRC,PYPMDS01
     I/COPY PYDDSSRC,PYB3DS01
     I*
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I           UDS
     I                                      101 110 $USER
     I                                      111 1160DDATE
     I*
     I                                      501 502 DBT01
     I                                      503 505 DBT061
     I                                      522 522 DBT03
     I                                      529 530 DPB041
     I*
     I                                      534 5350DPY07
     I                                      536 545 DM406
     I                                      546 5540TCNT
     I                                      555 5661TAMT
     I                                      567 567 DPY09
     I                                      571 5760WBT04
     I*
     I                                      601 6050DPH03
     I                                      606 6110WPH03
     I                                      621 621 DEM321
     I                                      623 6290DBT045
     I                                      623 6270DBT04
     I                                      628 6290DBT05
     I*
     I            DS
     I                                        1   70WTRD
     I                                        1   50WTRD1
     I                                        6   70WTRD2
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYPM     KLIST
     C                     KFLD           PM01
     C                     KFLD           BT01
     C*SYCMPF
     C           KEYCM     KLIST
     C                     KFLD           BT01
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C                     EXSR RTN020                     .MAIN
     C*==============================================================*
     C*                    INIT PROCESS
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVEL'01'      PM01
|    C           KEYPM     CHAINPM0                  40
|    C*
|    C                     SETON                     10
|    C*
|    C           KEYCM     CHAINCM0                  41
| 01-C           *IN41     IFEQ '0'
|   C*
|   C                     CALL 'P39'
|   C                     PARM BT04      P3901I  60
|   C                     PARM DFMT      P3902I  1
|   C                     PARM DTYPE     P3903I  1
|   C                     PARM '2'       P3904I  1
|   C                     PARM '1'       P3905I  1
|   C                     PARM           P3911O  60
|   C                     Z-ADDP3911O    WTRD1
|   C*
| 01-C                     END
|   C*
|    C*HEAD RECORD
|    C                     MOVEL'*'       B3101            識別碼
|    C                     MOVEL'3010060' B3102            轉帳組別
|    C                     Z-ADDBT05      WTRD2
|    C                     Z-ADDWTRD      B3103            轉帳日期
|    C                     Z-ADDTCNT      B3104            轉帳總筆數
|    C                     Z-ADDTAMT      B3105            轉帳總金額
|    C                     MOVEL*BLANK    B3106            備用
|    C                     MOVEL*BLANK    B301
|    C                     MOVELB3HR      B301
|    C                     WRITEB30
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*                    MAIN PROCESS
     C*==============================================================*
02===C           RTN020    BEGSR
|    C*
|    C                     MOVEL*BLANK    B3201            識別號
|    C                     MOVELBT07      B3202            帳號
|    C                     Z-ADDBT08      B3203            金額
|    C                     MOVEL*BLANK    B3204            備用
|    C                     MOVEL*BLANK    B301
|    C                     MOVELB3DR      B301
|    C                     WRITEB30
|    C*
02===C                     ENDSR
