     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA7041                                    *
     H*    PROGRAM NAME :所得稅扣繳申報核定　                      *
     H*    AUTHOR       : A1084 CHARLES                              *
     H*    CREATE DATE  : 81/03/18                                   *
     H*    UPDATE DATE  : 89/03/14 A1274 EVA                         *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYTDWK  UF  E           K        DISK
     E*---------------------------------------------------------------
     ILDA        UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I                                      201 2080$A8YMD
     I*
     I                                      507 516 $TDEV
     I                                      517 5230DFA04F
     I                                      524 5300DFA04T
     I                                      531 532 DFA04A
     I                                      531 5370DFA04N
     I*
     I                                      541 544 DTD02
     I                                      545 5480WTD01
     I*                                     549 5540WTD16
     I                                      555 555 DSEL
     I                                      556 556 DOPT
     I                                      557 564 DTD17
     I                                      565 572 DTD17E
     I                                      573 578 TD17N
     I                                      579 581 DTD19
     I                                      579 579 DTD191
     I                                      580 581 DTD192
     I                                      582 5880COUNT1
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C           *NAMVAR   DEFN *LDA      LDA
     C                     IN   LDA
     C                     Z-ADDCOUNT1    COUNT
     C           *LOVAL    SETLLTD0
     C                     READ TD0                      90
     C                     MOVE *BLANKS   TD11BK  2
  01-C           *IN90     DOWEQ'0'
  02-C           TD01      IFEQ WTD01
    C           TD17      ANDGEDTD17
    C           TD17      ANDLEDTD17E
    C           TD02      ANDEQDTD02
    C                     EXSR RTN100
  02-C                     END
    C                     READ TD0                      90
  01-C                     ENDDO
     C                     Z-ADDCOUNT     COUNT1
     C                     OUT  LDA
     C                     SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*                    RTN100
     C*==============================================================*
01===C           RTN100    BEGSR
|    C*
|    C                     MOVEL'0000'    TD02
|    C*公司別序號重編
|    C*
| 01-C           TD11      IFLT '00'
|   C           TD11      ORGT '99'
|   C                     MOVE '00'      TD11
| 01-C                     END
| 02-C           TD11      IFNE TD11BK
|   C                     Z-ADD0         DFA04N
|   C                     MOVELTD11      DFA04A
|   C                     MOVELTD11      TD11BK
| 02-C                     END
|    C*
|    C                     ADD  1         COUNT   70
|    C                     ADD  1         DFA04N
|    C*          DFA04N    SUB  1         TD03
|    C                     Z-ADDDFA04N    TD03
|    C*
| 03-C           TD11      IFNE TD11BK
|   C                     Z-ADDTD03      DFA04F
| 03-C                     END
|    C*
|    C                     Z-ADD$A8YMD    TD96
|    C                     Z-ADD$A8YMD    TD97
|    C                     TIME           WTIME  120
|    C                     MOVELWTIME     TD98
|    C*                    MOVEL$USER     TD99
|    C                     UPDATTD0
|    C*
|    C                     Z-ADDTD03      DFA04T
|    C*
01===C                     ENDSR
