     H****************************************************************
     H*   PROGRAM NAME : PYR3262                                     *
     H*   AUTHER       : A1490 TERESA                                *
     H*   CREATE DATE  : 96/05/08                                    *
     H*   UPDATE DATE  :                                             *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR3071C                                    *
     H****************************************************************
     FPYOSPF  IP  E           K        DISK
     FPYEMPF  IF  E           K        DISK
     F*PYPHPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYA802P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E*---------------------------------------------------------------
     ILDA        UDS
     I                                      125 1270$CPY
     I                                      201 2080PDATE
     I                                      203 2080DDATE
     I                                      209 2160$C8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 5060DPH96
     I                                      507 508 DOS01
     I                                      509 509 DOS04
     I                                      510 5150WOS03
     I*
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*
     C           KEYEM     KLIST
     C                     KFLD           OS01
     C                     KFLD           OS02
     C*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*PRINT FILE HEADING
     C  N10                EXSR RTN010                      HEADING
     C*
     C*HEADING
     C   39      OS01      CHAINSYCMPF               40
     C   39                WRITEPH1
     C   39                SETOF                     39
     C*
     C                     EXSR RTN200
     C                     EXSR RTN300
     C*
     CLR 10                EXSR RTN900                      PRINT END
     C*LR 10                WRITEPE9                         PRINT END
     C*
     C*                    SETON                     LR
     C*==============================================================*
     C*          RTN010... PRINT FILE HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*帶出PRINT FILE HEADING資料
|    C*
|    C           DOS01     CHAINSYCMPF               40
|    C                     Z-ADDDPH96     PPH96
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETON                     10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN200... WRITE TO PRTF
     C*==============================================================*
02===C           RTN200    BEGSR
|    C*
|    C                     Z-ADD0         TEMP
|    C                     Z-ADD0         POS07
|    C                     MOVELOS02      POS02
|    C           KEYEM     CHAINEM0                  40
|    C  N40                MOVELEM03      PEM03
|    C   40                MOVEL*BLANK    PEM03
|    C                     Z-ADDOS06      POS06
|    C           OS06      MULT 0.06      TEMP
|    C           OS06      SUB  TEMP      POS07
|    C*
|    C                     WRITEPD1
|    C*
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN300... PRINT FILE
     C*==============================================================*
03===C           RTN300    BEGSR
|    C*寫PT1
|    C                     ADD  POS06     PTO01
|    C                     ADD  TEMP      PTO02
|    C                     ADD  POS07     PTO03
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN900... PRINT ENDING
     C*==============================================================*
04===C           RTN900    BEGSR
|    C*
|    C                     WRITEPT1
|    C                     WRITEPE2
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          *INZSR    INITIAL
     C*==============================================================*
05===C           *INZSR    BEGSR
|    C*
|    C*
05===C                     ENDSR
