     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : PYA805                                     *
     H*    PROGRAM NAME :工讀生薪資資料建立                        *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 96/08/07                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYPTPF  UF  E           K        DISK                      A
     FPYENPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYA805D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     E                    @A01        5  1               作業權利
     E                    WFUN    5   5  6
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I                                    B 378 3790#DRRN
     I*LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      203 2080DDATE
     I                                      203 2060DYM
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      173 174 $COR
     I                                      201 2080$A8YMD
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*KEYPT CHAIN 工讀生薪資主檔
     C           KEYPT     KLIST
     C                     KFLD           DPT01
     C                     KFLD           WPT03   60
     C                     KFLD           WPT04   60
     C                     KFLD           DPT02
     C*
     C*KEYEN CHAIN 工讀生人事主檔
     C           KEYEN     KLIST
     C                     KFLD           DPT01
     C                     KFLD           DPT02
     C*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N99                EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
    C           SCID      CASEQ'SC02'    R2000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     MOVE 'SC01'    SCID    4
|    C* FUN AUT
|    C                     MOVE $ADD      @A01,1
|    C                     MOVE $UPD      @A01,2
|    C                     MOVE $DLT      @A01,4
|    C                     MOVE $INQ      @A01,5
|    C*
|    C* SC01 FIELD INITIALIZE *--------------------------------------*
|    C                     Z-ADD1         DOPT
|    C*
|    C                     MOVEL*BLANKS   DPT01
|    C                     MOVEL*BLANKS   DPT02
|    C                     MOVEL*BLANKS   DEN03
|    C                     Z-ADDDYM       DPT03
|    C                     Z-ADDDYM       DPT04
|    C*
|    C                     MOVEL$COR      DPT01
| 01-C           $RMK03    IFNE 'Y'
|   C                     SETOF                     32
| 01*C                     ELSE
|   C                     SETON                     32
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E1000
| 01-C                     END
|    C*
|    C           *IN04     IFEQ '1'                        *BROWSE
|    C                     EXSR R2E00
|    C                     GOTO E1000
|    C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 02-C           *IN99     IFEQ '0'                        *SCR CHK OK
|   C                     EXSR R1C00                      *PRE-SC02
|   C                     MOVEL'SC02'    SCID
| 02-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1A00 ....全頁查詢 (PF18 : CALL SUB-PROGRAM)
     C*==============================================================*
     C*          R1A00     BEGSR
     C*
     C* AUT CHECK
     C*                    CALL 'S#S01'
     C*                    PARM $USER     S0101I 10
     C*                    PARM 'PYI517'  S0102I 10
     C*                    PARM           S0101O  1
     C*          S0101O    IFEQ 'N'
     C*                    SETON                     99
     C*                    MOVEL'UPT2150' ERRID
     C*                    MOVEL'PTMF'    ERRF
     C*                    END
     C*  99                GOTO E1A00
     C*
     C* CALL SUB-PROGRAM
     C*                    CALL 'PYI517'
     C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     C*          DPT01     PARM DPT01     I517I1  2
     C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     C*                    PARM           @RTNC   2
     C* RETURN CODE CHECK
     C*          @RTNC     IFEQ '03'                       *PF3
     C*                    SETON                     03
     C*                    END
     C*
     C*          E1A00     ENDSR
     C*==============================================================*
     C*          R1B00 .... 'SC01' SCREEN CHECK
     C*==============================================================*
03===C           R1B00     BEGSR
|    C* CHK FUN AUT
| 01-C           @A01,DOPT IFNE 'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*公司檢核
| 02-C           DPT01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02*C                     ELSE
|   C           DPT01     CHAINCM0                  40
|   C   40                SETON                     6099
|   C   40                MOVEL'UPT2010' ERRID
|   C   40                MOVEL'PTMF'    ERRF
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* DATA CHECK *--------------------------------------------------*
|    C*員工身分証編號
| 03-C           DPT02     IFEQ *BLANK
|   C                     SETON                     6199
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C   99                GOTO E1B00
|    C*
|    C           KEYEN     CHAINEN0                  40
| 04-C           *IN40     IFEQ '1'
|   C                     SETON                     6199
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
     C                     MOVEL*BLANK    DEN03
     C                     ELSE
     C                     MOVELEN03      DEN03
| 04-C                     END
|    C   99                GOTO E1B00
|    C*
| 05-C           DPT03     IFEQ 0
|   C                     SETON                     6299
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 05-C                     END
|    C   99                GOTO E1B00
|    C*
     C                     Z-ADD0         WPT03   60
|    C*
     C                     CALL 'P38'
     C                     PARM DPT03     P3801I  60
     C                     PARM '1'       P3802I  1
     C                     PARM '1'       P3803I  1
     C           WPT03     PARM           P3801O  60
     C                     PARM           P3811O  1
     C           P3811O    IFEQ 'N'
     C                     SETON                     6299
     C                     MOVEL'UPT0040' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     ENDIF
|    C*
| 05-C           DPT04     IFEQ 0
|   C                     SETON                     6399
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 05-C                     END
|    C   99                GOTO E1B00
|    C*
     C                     Z-ADD0         WPT04   60
|    C*
     C                     CALL 'P38'
     C                     PARM DPT04     P3801I  60
     C                     PARM '1'       P3802I  1
     C                     PARM '1'       P3803I  1
     C           WPT04     PARM           P3801O  60
     C                     PARM           P3811O  1
     C           P3811O    IFEQ 'N'
     C                     SETON                     6399
     C                     MOVEL'UPT0040' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     ENDIF
     C*
     C           KEYPT     CHAINPT0                  40
|    C*
| 06-C           DOPT      IFEQ 1                          *ADD
|   C           *IN40     ANDEQ'0'
|   C                     SETON                     6199
|   C                     MOVEL'UPT2020' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     UNLCKPYPTPF
| 06-C                     END
|    C   99                GOTO E1B00
|    C*
| 07-C           DOPT      IFNE 1                          *UPD,DEL,INQ
|   C           *IN40     ANDEQ'1'
|   C                     SETON                     6199
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 07-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*
03===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....INIT 'SC02'
     C*==============================================================*
04===C           R1C00     BEGSR
|    C*作業 DFUN
|    C                     MOVELWFUN,DOPT DFUN
|    C*
| 01-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 2                          *UPD
|   C                     SETON                     31    *CAN INPUT
| 01*C                     ELSE                            *DEL, INQ
|   C                     SETOF                     31    *INP PROTECT
| 01-C                     END
|    C*
| 02-C           DOPT      IFEQ 1                          *ADD
|   C                     EXSR R1C10
| 02*C                     ELSE
|   C                     EXSR R1C20                      *U/D/I
| 02-C                     END
|    C*
|    C* RELEASE FILE (ADD & INQUIRY)----------------------------------*
| 03-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 5                          *INQ
|   C           *LOVAL    SETLLPT0
| 03-C                     END
|    C*---------------------------------------------------------------*
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R1C10 ....'SC02' FIELD INIT : ADD (NO COPY)
     C*==============================================================*
05===C           R1C10     BEGSR
|    C*
|    C*                    Z-ADD*ZERO     DPT04
|    C                     Z-ADD*ZERO     DPT05
|    C                     Z-ADD*ZERO     DPT06
|    C                     Z-ADD*ZERO     DPT07
|    C                     Z-ADD*ZERO     DPT08
|    C                     Z-ADD*ZERO     DPT09
|    C                     Z-ADD*ZERO     DPT10
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*  R1C20 ....'SC02' FIELD INIT : UPD, DEL, INQ, (ADD & COPY)
     C*==============================================================*
06===C           R1C20     BEGSR
|    C*
     C           KEYPT     CHAINPT0                  40
     C           *IN40     IFEQ '0'
     C*                    CALL 'P39'
     C*                    PARM PT04      P3901I  60
     C*                    PARM '2'       P3902I  1
     C*                    PARM '1'       P3903I  1
     C*                    PARM '1'       P3904I  1
     C*                    PARM '1'       P3905I  1
     C*                    PARM           P3911O  60
     C*
|    C*                    Z-ADDP3911O    DPT04
|    C                     Z-ADDPT05      DPT05
|    C                     Z-ADDPT06      DPT06
|    C                     Z-ADDPT07      DPT07
|    C                     Z-ADDPT08      DPT08
|    C                     Z-ADDPT09      DPT09
|    C                     Z-ADDPT10      DPT10
     C                     ELSE
     C                     EXSR R1C10
     C                     ENDIF
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R2000 .... 'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
07===C           R2000     BEGSR
|    C*
|    C                     EXFMTDSPD2
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E2000
| 01-C                     END
|    C*
| 02-C           *IN12     IFEQ '1'                        *PREVIOUS
|   C* RELEAS FILE --------------------------------------------------*
|   C           *LOVAL    SETLLPT0
|   C*---------------------------------------------------------------*
|   C                     MOVEL'SC01'    SCID
|   C                     GOTO E2000
| 02-C                     END
|    C*
| 03-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 2                          *UPD
|   C                     EXSR R2B00                      *SC02 CHK
| 03-C                     END
|    C*
| 04-C           *IN99     IFEQ '0'                        *CHK OK
|   C                     EXSR R2D00                      *FILE UPD
|   C                     MOVE 'SC01'    SCID
| 04-C                     END
|    C*
07===C           E2000     ENDSR
     C*==============================================================*
     C*          R2B00 ....'SC02' CHECK
     C*==============================================================*
08===C           R2B00     BEGSR
|    C*公司簡稱
| 01-C*          DPT04     IFEQ *ZERO
|   C*                    SETON                     6199
|   C*                    MOVEL'UPT0010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
| 01-C*                    END
|    C*  99                GOTO E2B00
     C*
     C*                    CALL 'P38'
     C*                    PARM DPT04     P3801I  60
     C*                    PARM '2'       P3802I  1
     C*                    PARM '1'       P3803I  1
     C*                    PARM           P3801O  60
     C*                    PARM           P3811O  1
     C*          P3811O    IFEQ 'N'
     C*                    SETON                     9962
|   C*                    MOVEL'UPT0040' ERRID
|   C*                    MOVEL'PTMF'    ERRF
| 01-C*                    END
|    C*  99                GOTO E2B00
|    C*
08===C           E2B00     ENDSR
     C*==============================================================*
     C*          R2D00 ....FILE PROCESS
     C*==============================================================*
09===C           R2D00     BEGSR
|    C*
| 01-C           DOPT      CASEQ1         R2D10
|   C           DOPT      CASEQ2         R2D20
|   C           DOPT      CASEQ4         R2D30
| 01-C                     END
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          R2D10 ....FILE PROCESS : ADD
     C*==============================================================*
10===C           R2D10     BEGSR
|    C*
     C           KEYPT     CHAINPT0                  40
|    C                     EXSR R2D11
|    C   40                WRITEPT0
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          R2D11 ....SCREEN FIELD TO FILE
     C*==============================================================*
11===C           R2D11     BEGSR
|    C*
     C                     MOVELDPT01     PT01
     C                     MOVELDPT02     PT02
     C                     Z-ADDWPT03     PT03
     C                     Z-ADDWPT04     PT04
     C*                    CALL 'P39'
     C*                    PARM DPT04     P3901I  60
     C*                    PARM '1'       P3902I  1
     C*                    PARM '1'       P3903I  1
     C*                    PARM '2'       P3904I  1
     C*                    PARM '1'       P3905I  1
     C*                    PARM           P3911O  60
     C*
|    C*                    Z-ADDP3911O    PT04
|    C                     Z-ADDDPT05     PT05
|    C                     Z-ADDDPT06     PT06
|    C                     Z-ADDDPT07     PT07
|    C                     Z-ADDDPT08     PT08
|    C                     Z-ADDDPT09     PT09
|    C                     Z-ADDDPT10     PT10
|    C                     Z-ADD$A8YMD    PT97
|    C                     TIME           PT98
|    C                     MOVEL$USER     PT99
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          R2D20 ....FILE PROCESS : UPD
     C*==============================================================*
12===C           R2D20     BEGSR
|    C*
     C           KEYPT     CHAINPT0                  40
|    C                     EXSR R2D11
|    C   40                WRITEPT0
|    C  N40                UPDATPT0
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          R2D30 ....FILE PROCESS
     C*==============================================================*
13===C           R2D30     BEGSR
|    C*
     C           KEYPT     CHAINPT0                  40
|    C  N40                DELETPT0
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          R2E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
15===C           R2E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*--------------------------------------------------------------**
|    C*戶籍地址郵遞區號
| 01-C           #FLD      IFEQ 'DPT02'
|   C                     CALL 'TRW002'
|   C                     PARM DPT01     P120I1  2
|   C           DPT02     PARM DPT02     P120O1 10
|   C           DPT03     PARM DPT03     P130O1  60
|   C           DPT04     PARM DPT04     P140O1  60
|   C           DEN03     PARM           P150O1 12
     C*                    CALL 'P39'
     C*                    PARM
| 01-C                     END
|    C*
15===C           E2E00     ENDSR
**
新增修改      刪除查詢
