     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA9084                                    *
     H*    PROGRAM NAME :健保調整暨薪資明細報表列印                *
     H*    AUTHOR       : A1445 HONDA                                *
     H*    CREATE DATE  : 2005/03/18                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     H****************************************************************
     FPYLOLF02IF  E           K        DISK
     FPYA908WFUF  E           K        DISK
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*
     I*LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*程式使用
     I                                      501 502 DLP01
     I                                      503 503 DELYN
     I                                      511 516 LP03M
     I                                      511 5160DLP03M
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYLO     KLIST                           調整試算檔
     C                     KFLD           LO01             公司
     C                     KFLD           LO03    60       年月
     C           KEYWF     KLIST                           列印工作檔
     C                     KFLD           LO03    60       年月
     C                     KFLD           LO01             公司
     C                     KFLD           LO02             員工編號
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R0100                      *INIT VALUE
     C* DELYN等於Y時清除LOPF中非健保調低的所有檔案
  01-C           DELYN     IFEQ 'Y'
    C*
    C                     MOVELDLP01     LO01
    C                     Z-ADDDLP03M    LO03
    C           KEYLO     SETLLLO0
    C           KEYLO     READELO0                      44            ?
  02-C           *IN44     DOWEQ*OFF
  03-C           LO14      IFNE 'Y'
    C                     EXSR DELF                       *DELETE LPPF
  03-C                     END
    C           KEYLO     READELO0                      44            ?
  02-C                     ENDDO
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     SETON                     10
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          DELF   ...DELETE LO14 = 'Y'  DELETE QTEMP/PYLPPF
     C*===============================================================*
02===C           DELF      BEGSR
|    C*
|    C           KEYWF     SETLLWF0                                    ?
|    C           KEYWF     READEWF0                      49            ?
| 01-C           *IN49     DOWEQ*OFF
|   C                     DELETWF0                        *DELETE WF
|   C           KEYWF     READEWF0                      49            ?
| 01-C                     ENDDO
|    C*
02===C                     ENDSR
     C*===============================================================*
