     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA907                                     *
     H*    PROGRAM NAME :勞保健保勞退三合一批次調薪檔製作          *
     H*    AUTHOR       : A1445 HONDA                                *
     H*    CREATE DATE  : 95/03/16                                   *
     H*    UPDATE DATE  : 95/05/16                                   *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FPYB1PF  UF  E           K        DISK                      A
     FPYB2PF  UF  E           K        DISK                      A
     FPYB3PF  UF  E           K        DISK                      A
     FPYB4PF  UF  E           K        DISK                      A
     FPYB5PF  UF  E           K        DISK                      A
     FPYB6PF  UF  E           K        DISK                      A
     FPYB7PF  UF  E           K        DISK                      A
     FPYB8PF  UF  E           K        DISK                      A
     FSYCMPF  IF  E           K        DISK
     FPYEMPF  IF  E           K        DISK
     FPYLOLF02IF  E           K        DISK
     FPYA907D CF  E                    WORKSTN
     E*---------------------------------------------------------------
     ILDA        UDS
     I                                      101 110 $USER
     I                                      203 2080DDATE
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      201 2040A8YEAR
     I****************************************************************
     I* . UNO           1    8 A   8    勞保保險證號
     I* . UNOCHK        9    9 A   1    勞保保險證號檢查
     I* . FORN         10   10 A   1    外籍
     I* . NAME         11   22 O  12    姓名
     I* . IDN          23   32 A  10    身份證號
     I* . YEMARK       33   33 A   1    民前／民國註記
     I* . BRDTE        34   40 A   7    出生日期
     I* . WMA          41   45 S   5 0  勞保調後投保薪資
     I* . PWAGE        46   51 S   6 0  勞退調後月提繳工
     I* . SPTYP        52   52 A   1    特殊身分別
     I****************************************************************
     I*----------------------------------------------------------
     I*勞保勞退二合一調整 DS  B3PF B4PF B7PF B8PF
     I*----------------------------------------------------------
     I            DS
     I                                        1  52 B3478R
     I                                        1   8 UNO
     I                                        9   9 UNOCHK
     I                                       10  10 FORN
     I                                       11  22 NAME
     I                                       23  32 IDN
     I                                       33  33 YEMARK
     I                                       34  40 BRDTE
     I                                       41  450WMA
     I                                       46  510PWAGE
     I                                       52  52 SPTYP
     I****************************************************************
     I* FIELD DESC.
     I* . BB001          1   9 X   9    投保單位代號
     I* . BB002         10  10 X   1    異動別
     I* . BB003         11  20 X  10    被保險人身分證字號
     I* . BB004         21  21 X   1    空白
     I* . BB005         22  31 X  10    眷屬身分證字號
     I* . BB006         32  32 X   1    空白
     I* . BB007         33  33 X   1    稱謂代號
     I* . BB008         34  34 X   1    保險對象別
     I* . BB009         35  35 X   1    民國前註記
     I* . BB010         36  42 X   7    保險對象出生日期
     I* . BB011         43  43 X   1    身分別
     I* . BB012         44  44 X   1    地區人口
     I* . BB013         45  45 X   1    退保／停保註記
     I* . BB014         46  46 X   1    轉出註記
     I* . BB015         47  47 X   1    眷屬續保註記
     I* . BB016         48  48 X   1    停退續加保原因
     I* . BB017         49  54 X   6    投保金額
     I* . BB018         55  61 X   7    空白
     I* . BB019         62  68 X   7    資格取得日期
     I* . BB020         69  78 X  10    更改後身分證字號
     I* . BB021         79  79 X   1    民國前註記
     I* . BB022         80  86 X   7    更改後出生日期
     I* . BB023         87  87 X   1    更改後性別
     I* . BB024         88  88 X   1    更改後稱謂代號
     I* . BB025         89  94 X   6    調整後投保金額
     I* . BB026         95  96 X   2    所屬縣市代碼
     I* . BB027         97  97 X   1    來源別
     I* . BB028         98 109 X  12    空白
     I* . BB029        110 133 X  24    保險對象姓名
     I****************************************************************
     I*----------------------------------------------------------
     I*健保調整 DS
     I*----------------------------------------------------------
     I            DS
     I                                        1 133 B1256R
     I                                        1   9 BB001
     I                                       10  10 BB002
     I                                       11  20 BB003
     I                                       21  21 BB004
     I                                       22  31 BB005
     I                                       32  32 BB006
     I                                       33  33 BB007
     I                                       34  34 BB008
     I                                       35  35 BB009
     I                                       36  420BB010
     I                                       43  43 BB011
     I                                       44  44 BB012
     I                                       45  45 BB013
     I                                       46  46 BB014
     I                                       47  47 BB015
     I                                       48  48 BB016
     I                                       49  540BB017
     I                                       55  61 BB018
     I                                       62  680BB019
     I                                       69  78 BB020
     I                                       79  79 BB021
     I                                       80  860BB022
     I                                       87  87 BB023
     I                                       88  88 BB024
     I                                       89  940BB025
     I                                       95  96 BB026
     I                                       97  97 BB027
     I                                       98 109 BB028
     I                                      110 133 BB029
     I*----------------------------------------------------------
     I           IDS
     I                                        1   70BB010S
     I                                        1   7 BB010C
     I           IDS
     I                                        1   50BB019Y
     I                                        6   70BB019D
     I                                        1   7 BB019C
     I           IDS
     I                                        1   40DSDYM
     I                                        1   20DSDYY
     I                                        3   40DSDMM
     I           IDS
     I                                        1   70BRDTES
     I                                        1   7 BRDTEC
     I*----------------------------------------------------------
     I*UNOC  國泰的保險證號
     I*----------------------------------------------------------
     I              '05272301'            C         UNOC
     I*HUNOC 健保保險證號
     I*----------------------------------------------------------
     I              '121381842'           C         HUNOC
     I*----------------------------------------------------------
     C*==============================================================*
     C*                    PARM
     C*==============================================================*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYLO     KLIST                           調整試算檔
     C                     KFLD           DLO01            公司
     C                     KFLD           LO03M   60       年月
     C           KEYEM     KLIST                           員工資料檔
     C                     KFLD           LO01             公司
     C                     KFLD           LO02             員編
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INI. RTN.
     C*
     C                     MOVEL*BLANK    @OVR    1
     C*
  01-C           *IN03     DOUEQ*ON
    C           @OVR      OREQ 'Y'
    C                     EXSR RTN100                     *MAIN
  01-C                     ENDDO
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL ROUTINE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C*<<初始值設定>>
|    C*                    MOVEL$COR      DLO01
|    C                     Z-ADD*ZERO     DLO03
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100.... MAIN ROUTINE
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*<<秀F13執行MSG>>
|    C                     SETON                     9732
|    C                     EXFMTDSPC1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*<<F3終止程式>>
| 01-C           *IN03     IFEQ *ON
|   C                     GOTO END100
| 01-C                     ENDIF
|    C*
|    C                     EXSR RTN110                     *CHK SCR
|    C*
| 02-C           *IN99     IFEQ *OFF
|   C           *IN13     ANDEQ*ON
|   C* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
|   C*內外勤*INDICATOR設定 *IN23   *ON 內勤
|   C*
|   C*                         *IN23   *OFF外勤
| 03-C           DLO01     IFEQ '01'
|   C                     SETON                     23
| 03*C                     ELSE
|   C                     SETOF                     23
| 03-C                     END
|   C* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
|   C                     SETON                     96
|   C                     WRITEDSPC1
|   C                     MOVEL'Y'       @OVR
|   C                     OUT  LDA
|   C* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
|   C* CLEAR PYB1PF至PYB4PF或PYB5PF至PYB8PF
|   C                     EXSR RTNCLR
|   C* RTN   PYLOPF
|   C                     EXSR RTNLO
|   C* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
| 02-C                     ENDIF
|    C*
02===C           END100    ENDSR
     C*==============================================================*
     C*          RTN110....CHECK SCREEN
     C*==============================================================*
03===C           RTN110    BEGSR
|    C*
|    C*<< CHACK DLO01公司NOT *BLANK >>
| 01-C           DLO01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 01-C                     ENDIF
|    C   99                GOTO END110
|    C*
|    C*<< CHACK DLO01需存在公司檔>>
|    C           DLO01     CHAINCM0                  40
|    C*
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02*C                     ELSE
|   C                     MOVELCM03      DCM03
| 02-C                     END
|    C   99                GOTO END110
|    C*<< CHACK DLO0G年月  NOT *BLANK >>
| 03-C           DLO03     IFEQ *ZERO
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 03-C                     ENDIF
|    C   99                GOTO END110
|    C*
|    C                     Z-ADDDLO03     DSDYM
|    C*
|    C* 檢查發薪年月格式 中國年月5Y 0
| 04-C           DSDYY     IFLT 1
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 04-C                     END
|    C   99                GOTO END110
|    C*
| 05-C           DSDMM     IFGT 12
|   C           DSDMM     ORLT 1
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 05-C                     END
|    C   99                GOTO END110
|    C*
|    C           200000    ADD  DLO03     LO03M   60
|    C*
|    C           KEYLO     CHAINPYLOLF02             40
| 06-C           *IN40     IFEQ *ON
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     616099
| 06-C                     END
|    C   99                GOTO END110
|    C*
03===C           END110    ENDSR
     C*==============================================================*
     C*          RTNCLR... CLEAR PYB1PF至PYB4PF或PYB5PF至PYB8PF
     C*==============================================================*
04===C           RTNCLR    BEGSR
|    C*
|    C*清除該公司資料內勤
| 01-C           DLO01     IFEQ '01'
|   C*
|   C                     READ PYB1PF                   46
| 02-C           *IN46     DOWEQ*OFF
|   C                     DELETPYB1PF
|   C                     READ PYB1PF                   46
| 02-C                     ENDDO
|   C*
|   C                     READ PYB2PF                   46
| 03-C           *IN46     DOWEQ*OFF
|   C                     DELETPYB2PF
|   C                     READ PYB2PF                   46
| 03-C                     ENDDO
|   C*
|   C                     READ PYB3PF                   46
| 04-C           *IN46     DOWEQ*OFF
|   C                     DELETPYB3PF
|   C                     READ PYB3PF                   46
| 04-C                     ENDDO
|   C*
|   C                     READ PYB4PF                   46
| 05-C           *IN46     DOWEQ*OFF
|   C                     DELETPYB4PF
|   C                     READ PYB4PF                   46
| 05-C                     ENDDO
|   C*
| 01-C                     END
|    C*
|    C*清除該公司資料外勤
| 06-C           DLO01     IFEQ '02'
|   C*
|   C                     READ PYB5PF                   46
| 07-C           *IN46     DOWEQ*OFF
|   C                     DELETPYB5PF
|   C                     READ PYB5PF                   46
| 07-C                     ENDDO
|   C*
|   C                     READ PYB6PF                   46
| 08-C           *IN46     DOWEQ*OFF
|   C                     DELETPYB6PF
|   C                     READ PYB6PF                   46
| 08-C                     ENDDO
|   C*
|   C                     READ PYB7PF                   46
| 09-C           *IN46     DOWEQ*OFF
|   C                     DELETPYB7PF
|   C                     READ PYB7PF                   46
| 09-C                     ENDDO
|   C*
|   C                     READ PYB8PF                   46
| 10-C           *IN46     DOWEQ*OFF
|   C                     DELETPYB8PF
|   C                     READ PYB8PF                   46
| 10-C                     ENDDO
|   C*
| 06-C                     END
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTNLO ....WRITE ==> PYLOPF => PYLQPF
     C*==============================================================*
05===C           RTNLO     BEGSR
|    C*
|    C           KEYLO     SETLLPYLOLF02
|    C           KEYLO     READEPYLOLF02                 44
|    C*
| 01-C           *IN44     DOWEQ*OFF
|   C*是否變更
| 02-C           LO13      IFEQ 'Y'                        *IF  LO13 CH
|   C* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
| 03-C           LO08      IFNE LO07
|   C           LO12      ORNE LO11
|   C*
| 04-C                     SELEC
|   C*勞保或勞退調升
|   C           LO08      WHGT LO07
|   C           LO12      ORGT LO11
|   C                     MOVE 'ADD'     WTYPE   3
|   C*勞保或勞退調降
|   C           LO08      WHLT LO07
|   C           LO12      ORLT LO11
|   C                     MOVE 'SUB'     WTYPE
|   C*
| 04-C                     ENDSL
|   C*
|   C                     EXSR WB3478
|   C*
| 03-C                     END
|   C* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
|   C*
|   C* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
| 05-C           LO09      IFNE LO10
|   C*
| 06-C                     SELEC
|   C*健保調升
|   C           LO10      WHGT LO09
|   C                     MOVE 'ADD'     WTYPE
|   C*健保調降
|   C           LO10      WHLT LO09
|   C                     MOVE 'SUB'     WTYPE
|   C*
| 06-C                     ENDSL
|   C*
|   C                     EXSR WB1256
|   C*
| 05-C                     END
|   C* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
| 02-C                     END                             *END LO13 CH
|   C*
|   C           KEYLO     READEPYLOLF02                 44
| 01-C                     ENDDO
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          WB1256 ..健保調整
     C*==============================================================*
06===C           WB1256    BEGSR
|    C*
|    C                     MOVELHUNOC     BB001            投保單位號
|    C                     MOVEL'S'       BB002            異動別
|    C*                    Z-ADD*ZERO     BB010S           出生日期
|    C*讀員工檔PYEMPF
|    C           KEYEM     CHAINPYEMPF               40
| 01-C           *IN40     IFEQ *OFF
|   C                     MOVELEM03      BB029            姓名
|   C                     MOVELEM31      BB003            身份證號
|   C*          EM33      SUB  19110000  BB010S
|   C*                    MOVE BB010C    BB010            出生日期
| 01-C                     END
|    C                     Z-ADDLO09      BB017            原投保金額
|    C           LO03      SUB  191100    BB019Y           生效年月
|    C                     Z-ADD1         BB019D           生效日
|    C                     MOVE BB019C    BB019            生效年月日
|    C                     Z-ADDLO10      BB025            健保調後$$
|    C                     MOVE '2'       BB027            來源別
|    C*
|    C*  *IN23  *ON內勤B1PF B2PF
| 02-C           *IN23     IFEQ *ON
|   C*內勤健保調整
| 03-C                     SELEC
|   C           WTYPE     WHEQ 'ADD'
|   C                     MOVELB1256R    B101
|   C                     WRITEB10
|   C                     CLEARB10
|   C           WTYPE     WHEQ 'SUB'
|   C                     MOVELB1256R    B201
|   C                     WRITEB20
|   C                     CLEARB20
|   C*
| 03-C                     ENDSL
|   C*
| 02*C                     ELSE
|   C*  *IN23 *OFF外勤B5PF B6PF
|   C*外勤健保調整
| 04-C                     SELEC
|   C           WTYPE     WHEQ 'ADD'
|   C                     MOVELB1256R    B501
|   C                     WRITEB50
|   C                     CLEARB50
|   C           WTYPE     WHEQ 'SUB'
|   C                     MOVELB1256R    B601
|   C                     WRITEB60
|   C                     CLEARB60
|   C*
| 04-C                     ENDSL
|   C*
| 02-C                     END
|    C*清健保DS
|    C                     CLEARB1256R
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          WB3478 ..勞保勞退二合一調整
     C*==============================================================*
07===C           WB3478    BEGSR
|    C*
|    C                     MOVELUNOC      UNO              勞保證號
|    C                     MOVEL'K'       UNOCHK           勞保證檢查
|    C*                    MOVELHUNOC     HUNO             健保證號
|    C*                    MOVEL'1'       BRCH             健保分局別
|    C                     Z-ADD*ZERO     BRDTES           出生日期
|    C*讀員工檔PYEMPF
|    C           KEYEM     CHAINPYEMPF               40
| 01-C           *IN40     IFEQ *OFF
| 02-C           EM321     IFEQ 'L'
|   C                     MOVEL*BLANK    FORN             外籍
| 02*C                     ELSE
|   C                     MOVEL'Y'       FORN             外籍
| 02-C                     END
|   C                     MOVELEM03      NAME             姓名
|   C                     MOVELEM31      IDN              身份證號
|   C                     MOVEL*BLANK    YEMARK           民國前註記
|   C           EM33      SUB  19110000  BRDTES
|   C                     MOVE BRDTEC    BRDTE            出生日期
| 01-C                     END
|    C                     Z-ADDLO08      WMA              $勞保調後
|    C                     Z-ADDLO12      PWAGE            $勞退調後
|    C*                    Z-ADDLO09      HMB              $健保調前
|    C*                    Z-ADDLO10      HMA              $健保調後
|    C                     MOVEL*BLANK    SPTYP            特殊身份別
|    C*
|    C*  *IN23  *ON內勤B3PF B4PF
| 03-C           *IN23     IFEQ *ON
|   C*內勤勞保勞退調整
| 04-C                     SELEC
|   C           WTYPE     WHEQ 'ADD'
|   C                     MOVELB3478R    B301
|   C                     WRITEB30
|   C                     CLEARB30
|   C           WTYPE     WHEQ 'SUB'
|   C                     MOVELB3478R    B401
|   C                     WRITEB40
|   C                     CLEARB40
|   C*
| 04-C                     ENDSL
|   C*
| 03*C                     ELSE
|   C*  *IN23 *OFF外勤B7PF B8PF
|   C*外勤勞保勞退調整
| 05-C                     SELEC
|   C           WTYPE     WHEQ 'ADD'
|   C                     MOVELB3478R    B701
|   C                     WRITEB70
|   C                     CLEARB70
|   C           WTYPE     WHEQ 'SUB'
|   C                     MOVELB3478R    B801
|   C                     WRITEB80
|   C                     CLEARB80
|   C*
| 05-C                     ENDSL
|   C*
| 03-C                     END
|    C*清勞保勞退DS
|    C                     CLEARB3478R
|    C*
07===C                     ENDSR
     C*==============================================================*
