     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA9043                                    *
     H*    PROGRAM NAME :勞健保及勞退保額調整報表                  *
     H*    AUTHOR       : A1445 HONDA                                *
     H*    CREATE DATE  : 94/12/01                                   *
     H*    UPDATE DATE  : 94/12/29                                   *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYA904WFIPE E                    DISK
     FPYDPPF  IF  E           K        DISK
     FPYA904P O   E             39     PRINTER
     E*---------------------------------------------------------------
     I*<LEVEL BREAK> L1 LO02員工編號 L2 LO05部門代碼長度7
     IWF0
     I                                              LO02  L1
     I                                              LO05  L2
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*程式使用
     I                                      549 554 LDADYM
     I                                      549 5540PDATE
     I* USER DEFINE
     I            DS
     I                                        1   7 LO05
     I                                        1   1 DP41
     I                                        2   2 DP42
     I                                        3   3 DP43
     I                                        4   7 DP44
     C*==============================================================*
     C*                    KEY  LIST
     C*==============================================================*
     C*
     C           KDP       KLIST                           部門資料檔
     C                     KFLD           DP41
     C                     KFLD           DP42
     C                     KFLD           DP43
     C                     KFLD           DP44
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
  01-C           *IN39     IFEQ '1'
    C* 取部門中文DP02
     C           KDP       CHAINPYDPPF               40
    C*
     C           *IN40     IFEQ *OFF
     C           LO01      IFEQ '02'
     C                     MOVEL*BLANK    DP02
     C                     MOVEL'外勤'  DP02
     C                     END
     C                     ELSE
     C                     END
    C                     WRITEPH1
    C                     SETOF                     39
  01-C                     END
     C*
     C                     EXSR RTN100                     *WRITE PD1
     C*
     CL1 10                EXSR RTN810                     *L1  BREAK
     CL2 10                EXSR RTN820                     *L2  BREAK
     CLR 10                EXSR RTN890                     *EOF BREAK
     CLRN10                EXSR RTN899                     *NO DATA
     C*==============================================================*
     C*          RTN010... INITIAL
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C*
     C* 搬年月給DS欄位DYEAR DMONTH
     C                     Z-ADDPDATE     @DAT
|    C*----------------------------------------------------------------
|    C                     CLEARPE1
|    C                     CLEARPE2
     C                     Z-ADD*ZERO     CCOUNT
     C                     Z-ADD*ZERO     CMLO07
     C                     Z-ADD*ZERO     CMLO08
     C                     Z-ADD*ZERO     CMLO09
     C                     Z-ADD*ZERO     CMLO10
     C                     Z-ADD*ZERO     CMLO11
     C                     Z-ADD*ZERO     CMLO12
|    C*----------------------------------------------------------------
     C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
     C*
     C*----------------------------------------------------------------
     C*
     C*
02===C           ETN100    ENDSR
     C*==============================================================*
     C*          RTN810... LEVEL BREAK 1 員工不同時
     C*==============================================================*
03===C           RTN810    BEGSR
|    C*
     C*--------------------------------------------------------------
|   C*加到小計
|   C                     ADD  LO07      DPLO07
|   C                     ADD  LO08      DPLO08
|   C                     ADD  LO09      DPLO09
|   C                     ADD  LO10      DPLO10
|   C                     ADD  LO11      DPLO11
|   C                     ADD  LO12      DPLO12
|    C*人數
     C                     ADD  1         DCOUNT
     C*--------------------------------------------------------------
|   C*加到公司總計
|   C                     ADD  LO07      CMLO07
|   C                     ADD  LO08      CMLO08
|   C                     ADD  LO09      CMLO09
|   C                     ADD  LO10      CMLO10
|   C                     ADD  LO11      CMLO11
|   C                     ADD  LO12      CMLO12
|    C*人數
     C                     ADD  1         CCOUNT
     C*--------------------------------------------------------------
|   C*該筆資料印出
|   C*
|   C                     Z-ADDEM33      EM33P
|   C                     WRITEPD1                        列印明細
|   C*印出後將下一個員工各項欄位歸零
     C                     CLEARPD1
|    C*
|   C*
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN820... LEVEL BREAK 2部門代碼不同時
     C*==============================================================*
03===C           RTN820    BEGSR
|    C*---------------------------------------------------------------
     C*內勤時印小計
|    C*---------------------------------------------------------------
     C           LO01      IFEQ '01'
     C                     WRITEPE1
     C                     CLEARPE1
     C                     END
|    C*---------------------------------------------------------------
|    C* 部門代碼不同時要換頁
|   C*SETON *IN39
     C                     SETON                     39
|    C*---------------------------------------------------------------
|    C*---------------------------------------------------------------
|    C* 外勤時不換頁SET  OFF
|   C*SETOF *IN39
     C           LO01      IFEQ '02'
     C                     SETOF                     39
     C                     END
|    C*---------------------------------------------------------------
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK LR
     C*==============================================================*
04===C           RTN890    BEGSR
|    C*
     C           LO01      IFEQ '02'
     C                     WRITEPE1
     C                     END
|    C*
     C                     WRITEPH2
     C                     WRITEPE2
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
05===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFEQ '2'
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE1
| 01*C                     ELSE
|   C                     MOVEL'N'       $DATA
| 01-C                     END
|    C*
05===C                     ENDSR
