     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA9081                                    *
     H*    PROGRAM NAME :健保調整暨薪資明細報表列印                *
     H*    AUTHOR       : A1445 HONDA                                *
     H*    CREATE DATE  : 2005/03/18                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     H****************************************************************
     FPYLOLF02IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYA908D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      111 1160DDATE
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*程式使用
     I                                      501 502 DLP01
     I                                      503 503 DELYN
     I                                      511 516 LP03M
     I                                      511 5160DLP03M
     I            DS
     I                                        1   50DSDYM
     I                                        1   30DSDYY
     I                                        4   50DSDMM
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN10     PARM *IN10     IN10    1
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYLO     KLIST                           調整試算檔
     C                     KFLD           DLP01            公司
     C                     KFLD           DLP03M  60       年月
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   10                EXSR R0200                      *INIT MSG.
     C  N10                EXSR R0100                      *INIT VALUE
     C*
     C                     MOVEL*BLANK    @PRT    1        *PRINT
  01-C           *IN03     DOUEQ'1'
    C           @PRT      OREQ 'Y'
    C                     EXSR R1000                      *SCRN
  01-C                     END
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     SETON                     1027
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C*---------------------------------------------------------------
|    C                     MOVEL'N'       DELYN
|    C                     MOVEL*BLANK    DLP01
|    C                     Z-ADD*ZERO     DLP03
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* CHK AUT
|    C                     SETON                     32
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ....INITIAL VALUE
     C*==============================================================*
02===C           R0200     BEGSR
|    C*
|    C                     IN   LDA
|    C                     SETON                     2799  報表格式  SSAGE
|    C*
| 01-C           $PENV     IFNE '2'                        NOT-BATCH
|   C           $DATA     ANDEQ'N'                        NO-DATA
|   C                     MOVEL'UPT2050' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     GOTO E0200
| 01-C                     END
|    C*
| 02-C           $PENV     IFEQ '0'                        INQUIRY
|   C                     MOVEL'UPT2142' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|    C*
| 03-C           $PENV     IFEQ '1'                        ON-LINE
|   C                     MOVEL'UPT2140' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C*
| 04-C           $PENV     IFEQ '2'                        BATCH
|   C                     MOVEL'UPT2110' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 04-C                     END
|    C*
02===C           E0200     ENDSR
     C*===============================================================*
     C*          R1000  ...SCREEN MAIN PROCESS
     C*===============================================================*
03===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*                    Z-ADD*ZERO     #LIN
|    C*                    Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
|    C                     EXSR R1B00                      .CHECK      ?
|    C*
| 02-C           *IN99     IFEQ *ZERO
|   C                     SETOF                     27
|   C                     SETON                     28    .執行中
|   C                     WRITEDSPD1
|   C                     SETOF                     28
|   C*
|   C                     MOVEL'Y'       @PRT
|   C                     OUT  LDA
| 02-C                     END
|    C*
03===C           E1000     ENDSR
     C*===============================================================*
     C*          R1B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
04===C           R1B00     BEGSR
|    C*
|    C*----------------------------------------------------------------
|    C*  公司不得為空白
| 01-C           DLP01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO E1B00
|    C*<< CHACK DLP01需存在公司檔>>
|    C           DLP01     CHAINCM0                  40
|    C*
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02*C                     ELSE
|   C                     MOVELCM03      DCM03
| 02-C                     END
|    C   99                GOTO E1B00
|    C*----------------------------------------------------------------
|    C*  年月不得為空白
| 03-C           DLP03     IFEQ *ZERO
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 03-C                     END
|    C   99                GOTO E1B00
|    C* 搬  年月至DS作切割年月比對用
|    C                     Z-ADDDLP03     DSDYM
|    C*----------------------------------------------------------------
|    C* 檢查年月格式 中國年月5Y 0
|    C*----------------------------------------------------------------
|    C*
| 04-C           DSDYY     IFLT 1
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 04-C                     ENDIF
|    C   99                GOTO E1B00
|    C*
| 05-C           DSDMM     IFGT 12
|   C           DSDMM     ORLT 1
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 05-C                     ENDIF
|    C   99                GOTO E1B00
|    C* 轉中國年月為西元年月並搬   年月至LDA
|    C           200000    ADD  DLP03     DLP03M
|    C*
|    C           KEYLO     CHAINPYLOLF02             40
| 06-C           *IN40     IFEQ *ON
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     616099
| 06-C                     END
|    C   99                GOTO E1B00
|    C*----------------------------------------------------------------
|    C*  列印選項不得空白
| 07-C           DELYN     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 07-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C* CHK FUN AUT
|    C*          $PENV     IFNE '2'
|    C*          $INQ      ANDNE'Y'
|    C*                    MOVEL'UPT2150' ERRID
|    C*                    MOVEL'PTMF'    ERRF
|    C*                    SETON                     99
|    C*                    END
|    C*  99                GOTO E1B00
|    C*
04===C           E1B00     ENDSR
