     H****************************************************************
     H*   ªx¤Ó¸ê°T¬ì§Þ¶}µoªÑ¥÷¦³­­¤½¥q¡Ðª©Åv©Ò¦³    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA902                                     *
     H*    PROGRAM NAME :³Ò°·«O¤Î³Ò°h«OÃB½Õ¾ã¸ê®Æ²£¥Í              *
     H*    AUTHOR       : A1445                                      *
     H*    CREATE DATE  : 94/12/09                                   *
     H*    UPDATE DATE  : 95/03/23                                   *
     H*    SYSTEM       :¤H¨ÆÁ~¸ê¨t²Î                              *
     H****************************************************************
     FPYLOPF  IF  E           K        DISK                      A
     F*<<PYLOPFªºLFÀÉ>>
     FPYLOLF02UF  E           K        DISK
     F            LO0                               KRENAMELO1
     FPYLPLF01UF  E           K        DISK                      A
     F*PYTRPF  IF  E           K        DISK
     FPYHDPF  IF  E           K        DISK
     FPYPDPF  IF  E           K        DISK
     FPYPYPF  IF  E           K        DISK
     FPYPHPF  IF  E           K        DISK
     FPYE1PF  IF  E           K        DISK
     FPYH4PF  IF  E           K        DISK
     FPYH8PF  IF  E           K        DISK
     FPYL1LF01IF  E           K        DISK
     FPYE3LF01IF  E           K        DISK
     FPYH7LF01IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     F*PYENPF  IF  E           K        DISK
     FPYEMPF  IF  E           K        DISK
     F*AZCMS8A9IF  E           K        DISK
     F*BZCMS8A9IF  E           K        DISK
     FPYA902D CF  E                    WORKSTN
     E*---------------------------------------------------------------
     E                    RA         99  2               Á~¸ê¶µ¥Ø
     E*---------------------------------------------------------------
     I           UDS
     I                                      101 110 $USER
     I                                      203 2080DDATE
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I           IDS
     I                                        1   80CALYMD
     I                                        1   60CALYM
     I                                        7   80CAL01D
     I           IDS
     I                                        1   80MIDYMD
     I                                        1   60MIDYM
     I                                        7   80MID01D
     I           IDS
     I                                        1   80ENDYMD
     I                                        1   60ENDYM
     I                                        7   80END01D
     I           IDS
     I                                        1   80DSDATE
     I                                        1   60DSYM
     I           IDS
     I                                        1   50DSDYM
     I                                        1   30DSDYY
     I                                        4   50DSDMM
     I           IDS
     I                                        1   7 EMDP
     I                                        1   1 EM041
     I                                        2   2 EM042
     I                                        3   3 EM043
     I                                        4   7 EM044
     I           IDS
     I                                        1   80WEM13
     I                                        1   60WEMYM
     I                                        7   80WEMDD
     I           IDS
     I                                        1  21 AMTN
     I                                        1   70LO08
     I                                        8  140LO10
     I                                       15  210LO12
     I           IDS
     I                                        1  21 AMTO
     I                                        1   70LO07
     I                                        8  140LO09
     I                                       15  210LO11
     I           IDS
     I                                        1   60FCYM1
     I                                        1   40YM1YY
     I                                        5   60YM1MM
     I           IDS
     I                                        1   60FCYM2
     I                                        1   40YM2YY
     I                                        5   60YM2MM
     I           IDS
     I                                        1   60FCYM3
     I                                        1   40YM3YY
     I                                        5   60YM3MM
     I           IDS
     I                                        1   60ABYM
     I                                        1   40ABYY
     I                                        5   60ABMM
     I           IDS
     I                                        1   60DSFCYM
     I                                        1   40DSFCY
     I                                        5   60DSFCM
     I           IDS
     I                                        1   70FCYM
     I                                        1   30FCY
     I                                        4   50FCM
     I                                        6   70FCD
     I*----------------------------------------------------------
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYDEL    KLIST
     C                     KFLD           DLO01
     C                     KFLD           DLOYM
     C           KEYDLP    KLIST
     C                     KFLD           DLO01
     C                     KFLD           DLOYM
     C           KEYTR     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C*          KEYEN     KLIST
     C*                    KFLD           EN01
     C*                    KFLD           EN02
     C           KEYLO     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           DLOYM   60
     C           KEYE1     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C           KEYH4     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C*À£ÀÉ­pºâ¤ë¨úÁ~¸ê¤@
     C           KEYPH1    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           PH1YM   60
     C*À£ÀÉ­pºâ¤ë¨úÁ~¸ê¤G
     C           KEYPH2    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           PH2YM   60
     C*À£ÀÉ­pºâ¤ë¨úÁ~¸ê¤T
     C           KEYPH3    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           PH3YM   60
     C*À£ÀÉ­pºâ¨ú©³Á~
     C           KEYPY     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C*--------------------------------------------------------------
     C           KEY#Y     KLIST
     C                     KFLD           YCODE  10
     C                     KFLD           YNUMB  10
     C                     MOVEL*BLANK    YCODE            ¥N½XÄæ¦ì
     C                     MOVEL'PYA902'  YCODE
     C*--------------------------------------------------------------
     C*          KEYAZ     KLIST
     C*                    KFLD           EM02   10
     C*                    KFLD           FCYM    70
     C*--------------------------------------------------------------
     C*          KEYBZ     KLIST
     C*                    KFLD           EM02   10
     C*                    KFLD           FCYM    70
     C*--------------------------------------------------------------
     C           KEYHD     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           PH03
     C                     KFLD           KHD04
     C                     KFLD           RA,X
     C                     MOVE '1'       KHD04   1
     C*--------------------------------------------------------------
     C           KEYPD     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           RA,X
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INI. RTN.
     C*
  01-C           *IN03     DOUEQ*ON
    C                     EXSR R1000                      *MAIN
  01-C                     ENDDO
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL ROUTINE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*<<ªì©l­È³]©w>>
|    C                     MOVE '1'       KHD04
|    C*§ó·s¦~¤ë³]ªì­È µe­±¦~¤ë
|    C                     Z-ADD$A8YMD    DSDATE
|    C                     Z-ADDDSYM      DLO03
|    C                     ADD  1         DLO03
|    C*
|    C*                    MOVEL*BLANK    DCM03
|    C*          DLO01     CHAINCM0                  40
|    C*
|    C* N40                MOVELCM03      DCM03
|    C*RELEASE FILE
|    C           *LOVAL    SETLLLO0
|    C           *LOVAL    SETLLLP0
|    C                     CLEARLO0
|    C                     CLEARLP0
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 .... MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*<<¨qF13°õ¦æMSG>>
|    C                     SETON                     9732
|    C                     EXFMTDSPC1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ *ON
|   C                     GOTO E1000
| 01-C                     END
|    C*
|    C                     EXSR R1B00                      *CHK SCREEN1
|    C*
|    C*«ö¤UF13®É °õ¦æTRNF
| 02-C           *IN99     IFEQ *OFF
|   C           *IN98     ANDEQ*OFF
|   C           *IN13     ANDEQ*ON
|   C                     SETON                     96
|   C                     WRITEDSPC1
|   C*
|   C                     EXSR DLTF                       CLEAR FILE
|   C*
|   C                     EXSR RARY                       ¶µ¥Ø=>ARY
|   C*
|   C                     EXSR TRNF                       ¤u§@ÀÉ«ØÀÉ
|   C*
|   C*****                EXSR DLTLP                      ¬å¥¼ÅÜ°Ê
|   C*
| 02-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1B00 ....CHECK SCREEN
     C*==============================================================*
03===C           R1B00     BEGSR
|    C*<< CHACK ¤½¥q§ONOT *BLANK >>
| 01-C           DLO01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*<< CHACK ¤½¥q >
|    C           DLO01     CHAINSYCMPF               40
| 02-C           *IN40     IFEQ *ON
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*<<CHECK ­pºâ¦~¤ë1 NOT *BLANK >>
| 03-C           DLO031    IFEQ *ZERO
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 03-C                     END
|    C   99                GOTO E1B00
|    C*
|    C           DLO031    ADD  200000    WDYM    60
|    C                     EXSR CHKDYM
| 04-C           *IN99     IFEQ 'ON'
|   C                     SETON                     61
|   C                     GOTO E1B00
| 04-C                     END
|    C*
|    C*<<CHECK ­pºâ¦~¤ë2 NOT *BLANK >>
| 05-C           DLO032    IFEQ *ZERO
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 05-C                     END
|    C   99                GOTO E1B00
|    C*
|    C           DLO032    ADD  200000    WDYM    60
|    C                     EXSR CHKDYM
| 06-C           *IN99     IFEQ 'ON'
|   C                     SETON                     62
|   C                     GOTO E1B00
| 06-C                     END
|    C*
| 07-C           DLO031    IFGE DLO032
|   C                     MOVEL'UPT1011' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6162
|   C                     SETON                     99
| 07-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*<<CHECK ­pºâ¦~¤ë3 NOT *BLANK >>
| 08-C           DLO033    IFEQ *ZERO
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 08-C                     END
|    C   99                GOTO E1B00
|    C*
|    C           DLO032    ADD  200000    WDYM    60
|    C                     EXSR CHKDYM
| 09-C           *IN99     IFEQ 'ON'
|   C                     SETON                     63
|   C                     GOTO E1B00
| 09-C                     END
|    C*
| 10-C           DLO032    IFGE DLO033
|   C                     MOVEL'UPT1011' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6263
|   C                     SETON                     99
| 10-C                     END
|    C   99                GOTO E1B00
|    C*
| 11-C           DLO031    IFGE DLO032
|   C           DLO031    ORGE DLO033
|   C                     MOVEL'UPT1011' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     616263
|   C                     SETON                     99
| 11-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*<<CHECK ¥Í®Ä¦~¤ë    NOT *BLANK >>
| 12-C           DLO03     IFEQ *ZERO
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 12-C                     END
|    C   99                GOTO E1B00
|    C*
|    C           DLO03     ADD  200000    WDYM
|    C                     EXSR CHKDYM
| 13-C           *IN99     IFEQ 'ON'
|   C                     SETON                     64
|   C                     GOTO E1B00
| 13-C                     END
|    C*
| 14-C           DLO03     IFLE DLO033
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     646399
| 14-C                     END
|    C   99                GOTO E1B00
|    C*
|    C           DLO03     ADD  200000    DLOYM
|    C*
03===C           E1B00     ENDSR
     C*==============================================================*
     C*          CHKDYM.... ÀË¬d¦~¤ë
     C*==============================================================*
04===C           CHKDYM    BEGSR
|    C*
|    C* ·h  ¦~¤ë¦ÜDS§@¤Á³Î¦~¤ë¤ñ¹ï¥Î
|    C                     Z-ADDWDYM      DSDYM
|    C* ÀË¬dµoÁ~¦~¤ë®æ¦¡ ¤¤°ê¦~¤ë5Y 0
| 01-C           DSDYY     IFLT 1
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                       99
| 01-C                     END
|    C   99                GOTO ENDCHK
|    C*
| 02-C           DSDMM     IFGT 12
|   C           DSDMM     ORLT 1
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                       99
| 02-C                     END
|    C   99                GOTO ENDCHK
|    C*
04===C           ENDCHK    ENDSR
     C*==============================================================*
     C*          DLTF  .... ²MÀÉ
     C*==============================================================*
05===C           DLTF      BEGSR
|    C* CLEAR PYLOPF
|    C           KEYDEL    SETLLLO1
|    C           KEYDEL    READELO1                      44
|    C*
| 01-C           *IN44     DOWEQ*OFF
|   C*
|   C                     DELETLO1
|   C*
|   C           KEYDEL    READELO1                      44
| 01-C                     ENDDO
|    C* CLEAR PYLPPF
|    C           KEYDLP    SETLLLP0
|    C           KEYDLP    READELP0                      44
|    C*
| 02-C           *IN44     DOWEQ*OFF
|   C*
|   C                     DELETLP0
|   C*
|   C           KEYDLP    READELP0                      44
| 02-C                     ENDDO
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          TRNF  ....«Ø¥ß¤T­Ó¤ëÀ£ÀÉ¤u§@ÀÉ
     C*==============================================================*
06===C           TRNF      BEGSR
|    C*
|    C*µe­±­pºâ¤ë°_+ CAL01D'01' = ­pºâ°_¤ëªº1¤é===>CALYMD 8 S 0
|    C           200000    ADD  DLO031    CALYM
|    C                     Z-ADD1         CAL01D
|    C*µe­±­pºâ¤ë²Ä¤G¤ëD01D'01' ­pºâ1¤é=>MIDYMD 8 S 0
|    C           200000    ADD  DLO032    MIDYM
|    C                     Z-ADD1         MID01D
|    C*µe­±­pºâ¤ë¨´+ END01D'01' ­pºâ¨´¤ë¦¸¤ë1¤é=>ENDYMD 8 S 0
|    C           200000    ADD  DLO033    ENDYM
|    C                     ADD  1         ENDYM
|    C                     Z-ADD1         END01D
|    C*
|    C           DLO01     SETLLEM0
|    C           DLO01     READEEM0                      44
|    C*
| 01-C           *IN44     DOWEQ*OFF
|   C*---------------------------------------------------------------
|   C*ÅªPYTRPF½Õ°Ê¬ö¿ýÀÉ
|   C*---------------------------------------------------------------
|   C*                    MOVEL*BLANK    TR03             ½Õ°ÊÃþ§O
|   C*          KEYTR     CHAINPYTRPF               40
|   C*---------------------------------------------------------------
|   C*¨ìÂ¾¤éEM13¦­©ó¨´¤ë¦¸¤ë1¤é¤~¶i¦æÀ£ÀÉ¡A§_«h¸Ó­û¤u¸õ¹L¤£­pºâ
|   C*Â÷Â¾½X¤£¬OYÂ÷Â¾¤é´Á¬°0 ¤Î ½Õ°ÊÃþ§O¤p©ó '59'¤~­pºâ
| 02-C           EM13      IFLE ENDYMD                      *IF EM13
|   C           EM11      ANDNE'Y'
|   C           EM19      ANDEQ*ZERO
|   C*          TR03      ANDGE'  '
|   C*          TR03      ANDLE'58'
|   C*---------------------------------------------------------------
|   C*
|   C                     MOVELDLO01     LO01             ¤½¥q½s¸¹
|   C                     Z-ADDDLOYM     LO03             §ó·s¦~¤ë
|   C*
|   C                     SETON                     42
|   C*--------------------------------------------------------------
|   C*¤º¥~¶Ô¤£¦P
|   C*--------------------------------------------------------------
|   C*¤º¶Ô   ¤½¥q½s¸¹¬° '01'
|   C*ÀË¬d¬O§_»Ý­n­pºâ¦þª÷¡A¨Ì¨ä¯ÅÂ¾EM05 ¦p 0900 °ª¯ÅÀç·~­û¡K
|   C*»Ý­n®ÉSETOF *IN42
|   C*--------------------------------------------------------------
| 03-C*          DLO01     IFEQ '01'
|   C*                    MOVELDLO01     EN01             ¤½¥q
|   C*                    MOVELEM05      EN02             ¯ÅÂ¾
|    C*                    MOVEL*BLANK    EN04             Ãþ§O
|   C*          KEYEN     CHAINPYENPF               50
| EN C*          EN04      IFEQ '68'
|    C*          EN04      OREQ '69'
|    C*                    SETOF                     42
| EN C*                    ELSE
|    C*                    SETON                     42
| EN C*                    END
| 03 C*                    END
|   C*--------------------------------------------------------------
|   C*¥~¶Ô
|   C*¤ð¶·§PÂ_¯ÅÂ¾ ¤½¥q½s¸¹¬O'02' ®É¡A§Y»Ý­n­pºâ¦þª÷
|   C*»Ý­n®ÉSETOF *IN42
|   C*--------------------------------------------------------------
| 04-C           DLO01     IFEQ '02'
|   C                     SETOF                     42
| 04-C                     END
|   C*--------------------------------------------------------------
|   C                     MOVELEM02      LO02             ­û¤u½s¸¹
|   C                     MOVELEM03      LO04             ­û¤u©m¦W
|   C                     MOVELEMDP      LO05             ³¡ªù¥N¸¹
|   C                     Z-ADDEM13      LO06             ¨ìÂ¾¤é´Á
|   C*--------------------------------------------------------------
|   C*ÂÂª÷ÃB
|   C                     Z-ADDEM23      LO07             ÂÂ³Ò«O
|   C           KEYE1     SETGTE10
|   C           KEYE1     REDPEE10                      45
|   C*
| 05-C           *IN45     IFEQ *OFF
|   C                     Z-ADDE105      LO09             ÂÂ°·«O
| 05*C                     ELSE
|   C                     Z-ADD*ZERO     LO09             ÂÂ°·«O
| 05-C                     END
|   C*
|   C           KEYH4     CHAINPYH4PF               40
|   C  N40                Z-ADDH409      LO11             ÂÂ³Ò°h
|   C   40                Z-ADD*ZERO     LO11             ÂÂ³Ò°h
|   C*--------------------------------------------------------------
|   C*·sª÷ÃB
| 02-C           EM13      IFLE CALYMD                      *IF EM13
|   C                     EXSR CALNEW                     ­pºâ·sª÷ÃB
| 02-C                     ELSE
| 02-C                     EXSR ROOKIE                     ·s¤H
| 02-C                     END
|   C*--------------------------------------------------------------
|   C*·sÂÂª÷ÃB¤£¦P®É ÅÜ°Ê§OLO13 ³]Y ¬Û¦P®É³]N
| 06-C           AMTN      IFEQ AMTO
|   C                     MOVE 'N'       LO13             ¬O§_ÅÜ°Ê
|   C                     MOVE 'N'       LO14             ¬O§_½Õ§C
| 06*C                     ELSE
|   C                     MOVE 'Y'       LO13
| 07-C           LO10      IFLT LO09
|   C                     MOVE 'Y'       LO14
| 07*C                     ELSE
|   C                     MOVE 'N'       LO14
| 07-C                     END
| 06-C                     END
|   C*¥­§¡Á~
|   C*--------------------------------------------------------------
|   C                     Z-ADDSALV      LO15             ¥­§¡Á~
|   C*--------------------------------------------------------------
|   C                     Z-ADD$A8YMD    LO97             §ó·s¤é´Á
|   C                     TIME           LO98             §ó·s®É¶¡
|   C                     MOVEL$USER     LO99             ¨Ï¥ÎªÌ
|   C                     WRITELO0                        *WRITE
|   C                     CLEARLO0
|   C*
|   C*---------------------------------------------------------------
|   C*¨ìÂ¾¤éEM13¤j©ó­pºâ¤ëªº1¤é¤~¶i¦æÀ£ÀÉ¡A§_«h¸Ó­û¤u¸õ¹L¤£­pºâ
|   C*Â÷Â¾½X¤£¬OYÂ÷Â¾¤é´Á¬°0
| 02-C                     END                              *END EM13
|   C*---------------------------------------------------------------
|   C           DLO01     READEEM0                      44
| 01-C                     ENDDO
|    C*
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          CALNEW.... ­pºâ·sª÷ÃB(³Ò«O °·«O ³Ò°h)
     C*==============================================================*
07===C           CALNEW    BEGSR
|    C*
|    C*--------------------------------------------------------------
|    C*­pºâ¥­§¡Á~SALAVG
|    C                     EXSR CALAVG                     ­pºâ¥­§¡Á~
|    C                     Z-ADDSALAVG    SALV    70H
|    C                     Z-ADDSALV      SAL7    70
|    C                     Z-ADDSALV      SAL6    60
|    C*--------------------------------------------------------------
|    C*·s³Ò«O¨úª÷ÃB L102
|    C           SAL7      SETLLL10
|    C                     READ L10                      46
| 01-C           *IN46     IFEQ *OFF
|   C                     Z-ADDL102      LO08             ·s³Ò«O
| 01*C                     ELSE
|   C           *HIVAL    SETLLL10
|   C                     READPL10                      47
|   C  N47                Z-ADDL102      LO08             ·s³Ò«O
| 01-C                     END
|    C*
|    C*·s°·«O
|    C*·s°·«O¨úª÷ÃB E302
|    C           SAL7      SETLLE30
|    C                     READ E30                      46
| 02-C           *IN46     IFEQ *OFF
|   C                     Z-ADDE302      LO10             ·s°·«O
| 02*C                     ELSE
|   C           *HIVAL    SETLLE30
|   C                     READPE30                      47
|   C  N47                Z-ADDE302      LO10             ·s°·«O
| 02-C                     END
|    C*
|    C*·s³Ò°h
|    C*·s³Ò°h¨úª÷ÃB H704
|    C           SAL6      SETLLH70
|    C                     READ H70                      46
| 03-C           *IN46     IFEQ *OFF
|   C                     Z-ADDH704      LO12             ·s³Ò°h
| 03*C                     ELSE
|   C           *HIVAL    SETLLH70
|   C                     READPH70                      47
|   C  N47                Z-ADDH704      LO12             ·s³Ò°h
| 03-C                     END
|    C*
|    C*---------------------------------------------------------------
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          RARY  .... ³]©wARRAY ¼È¦sÁ~¶µ¥Ø
     C*==============================================================*
08===C           RARY      BEGSR
|    C*
|    C                     MOVEL*BLANK    RA
|    C                     Z-ADD0         C       20
|    C* C¬°PYH8PFªº¶µ¥ØÁ`¼Æ
|    C           DLO01     SETLLH80
|    C           DLO01     READEH80                      44
| 01-C           *IN44     DOWEQ*OFF
|   C           C         ANDLE99
|   C*
|   C                     ADD  1         C
|   C                     MOVELH802      RA,C
|   C*
|   C           DLO01     READEH80                      44
| 01-C                     ENDDO
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          CALAVG.... ­pºâ°_¨´¤ë¥÷ ¤§ ¥­§¡Á~¸ê
     C*==============================================================*
09===C           CALAVG    BEGSR
|    C*
|    C*À£ÀÉ¤T­Ó¤ë(Âà¦è¤¸) PH1YM   PH2YM   PH3YM
|    C*
|    C           DLO031    ADD  200000    PH1YM   60
|    C           DLO032    ADD  200000    PH2YM   60
|    C           DLO033    ADD  200000    PH3YM   60
|    C*
|    C*¨ìÂ¾¤é·h¨ì¢Ò¢á
|    C                     Z-ADDEM13      WEM13            ¨ìÂ¾¤é
|    C*
|    C*---------------------------------------------------------------
| 01-C           *IN42     IFEQ *OFF                        *IF *IN42
|   C*¦þª÷¤ë¥÷³]©w
|   C*¦þª÷¤ë¬°µoÁ~¤ë ´î1    STRYM - 1 => YM1MM
|   C*¦þª÷¤ë¤@³]©w ­Y¬°0¤ë®É¡AADD 12 Âà¦¨ ¤Q¤G¤ë
|   C           PH1YM     SUB  1         FCYM1   60       ¦þª÷¤ë¤@
| 02-C           YM1MM     IFEQ 0
|   C                     ADD  12        YM1MM
|   C                     SUB  1         YM1YY
| 02-C                     END
|   C*
|   C*¦þª÷¤ë¤G³]©w ­Y¬°0¤ë®É¡AADD 12 Âà¦¨ ¤Q¤G¤ë
|   C           PH2YM     SUB  1         FCYM2   60       ¦þª÷¤ë¤G
| 03-C           YM2MM     IFEQ 0
|   C                     ADD  12        YM2MM
|   C                     SUB  1         YM2YY
| 03-C                     END
|   C*
|   C*¦þª÷¤ë¤T³]©w ­Y¬°0¤ë®É¡AADD 12 Âà¦¨ ¤Q¤G¤ë
|   C           PH3YM     SUB  1         FCYM3   60       ¦þª÷¤ë¤T
| 04-C           YM3MM     IFEQ 0
|   C                     ADD  12        YM3MM
|   C                     SUB  1         YM3YY
| 04-C                     END
|   C*
| 01-C                     END                              *END *IN42
|    C*---------------------------------------------------------------
|    C                     Z-ADD0         PAY     20
|    C                     Z-ADD0         SALARY  70
|    C                     Z-ADD0         SALAVG  92
|    C*­pºâ¥­§¡Á~¤@
|    C*---------------------------------------------------------------
|    C*¨ú©³Á~PH05
|    C*          KEYPH1= EM01 + EM02 + PH1YM (­pºâ¤ë¤@)
|    C           KEYPH1    CHAINPYPHPF               49
| 05-C           *IN49     IFEQ *OFF
|   C*
|   C                     ADD  1         PAY
|   C                     ADD  PH05      SALARY
|   C  N49                Z-ADDPH05      LP05             ©³Á~
|   C*¨ú«D©³Á~ PYHDPF
|   C                     EXSR CALHDF                     PYHD => HD06
|   C*----------------------------------------------------------------
|   C* *IN42 *OFF®É§ì¦þª÷
| 06-C           *IN42     IFEQ *OFF
|   C                     Z-ADDPH03      CALFCM  60       µoÁ~¤ë
|   C                     EXSR CALBZ                      BZCMSPF
| 06-C                     END
|   C*----------------------------------------------------------------
|   C                     EXSR MAKELP                     ¼g¨ìPYLPPF
|   C                     CLEARLP0
| 05-C                     END                             *END­pºâ¤@
|    C*----------------------------------------------------------------
|    C*
|    C*­pºâ¥­§¡Á~¤G
|    C*---------------------------------------------------------------
|    C*¨ú©³Á~PH05
|    C*          KEYPH2= EM01 + EM02 + PH2YM (­pºâ¤ë¤T)
|    C           KEYPH2    CHAINPYPHPF               49
| 07-C           *IN49     IFEQ *OFF
|   C*
|   C                     ADD  1         PAY
|   C                     ADD  PH05      SALARY
|   C  N49                Z-ADDPH05      LP05             ©³Á~
|   C*¨ú«D©³Á~ PYHDPF
|   C                     EXSR CALHDF                     PYHD => HD06
|   C*----------------------------------------------------------------
|   C* *IN42 *OFF®É§ì¦þª÷
| 08-C           *IN42     IFEQ *OFF
|   C                     Z-ADDPH03      CALFCM  60       µoÁ~¤ë
|   C                     EXSR CALBZ                      BZCMSPF
| 08-C                     END
|   C*----------------------------------------------------------------
|   C                     EXSR MAKELP                     ¼g¨ìPYLPPF
|   C                     CLEARLP0
| 07-C                     END                             *END­pºâ¤G
|    C*----------------------------------------------------------------
|    C*
|    C*­pºâ¥­§¡Á~¤T
|    C*---------------------------------------------------------------
|    C*¨ú©³Á~PH05
|    C*          KEYPH3= EM01 + EM02 + PH3YM (­pºâ¤ë¤T)
|    C           KEYPH3    CHAINPYPHPF               49
| 09-C           *IN49     IFEQ *OFF
|   C*
|   C                     ADD  1         PAY
|   C                     ADD  PH05      SALARY
|   C  N49                Z-ADDPH05      LP05             ©³Á~
|   C*¨ú«D©³Á~ PYHDPF
|   C                     EXSR CALHDF                     PYHD => HD06
|   C*----------------------------------------------------------------
|   C* *IN42 *OFF®É§ì¦þª÷
| 10-C           *IN42     IFEQ *OFF
|   C                     Z-ADDPH03      CALFCM  60       µoÁ~¤ë
|   C                     EXSR CALAZ                      AZCMSPF
| 10-C                     END
|   C*----------------------------------------------------------------
|   C                     EXSR MAKELP                     ¼g¨ìPYLPPF
|   C                     CLEARLP0
| 09-C                     END                             *END­pºâ¤T
|    C*----------------------------------------------------------------
|    C*
|    C*
| 11-C           PAY       IFNE *ZERO
|   C           SALARY    DIV  3         SALAVG
| 11*C                     ELSE
|   C                     Z-ADD*ZERO     SALAVG
| 11-C                     END
|    C*
09===C           ECALAV    ENDSR
     C*==============================================================*
     C*          CALHDF.... ²Ö­p«D©³Á~PYHDPF¤§ª÷ÃB HD06
     C*==============================================================*
10===C           CALHDF    BEGSR
|    C*
|    C                     Z-ADD1         X       20
|    C*
|    C*¨úª÷ÃBHD06
|    C* KEYHD = EM01 + EM02 + PH03 + KHD04 + RA,X
| 01-C           X         DOWLEC
|   C*
|   C           KEYHD     CHAINHD0                  40
| 02-C           *IN40     IFEQ *OFF
|   C*
|   C                     ADD  HD06      SALARY
|   C*
|   C           HD01      IFEQ '01'                        IF HD01
|   C*Â¾°È¥[µ¹
| 03-C           HD05      IFEQ '12'
|   C                     ADD  HD06      LP06             Â¾°È¥[µ¹
| 03*C                     ELSE
|   C                     ADD  HD06      LP07             ¨ä¥L¬z¶K
| 03-C                     END
|   C*¥~¶Ô
|   C                     ELSE                             ELSE HD01
|   C           HD01      IFEQ '02'                        ELSE IF
|   C*³d¥ô¬z¶K
| 03-C           HD05      IFEQ '83'
|   C                     ADD  HD06      LP05             Â¾°È¥[µ¹
| 03*C                     ELSE
|   C*ÄvÁÉ¼úª÷
| 03-C           HD05      IFEQ '82'
|   C                     ADD  HD06      LP06             Â¾°È¥[µ¹
| 03*C                     ELSE
|   C                     ADD  HD06      LP07             ¨ä¥L¬z¶K
| 03-C                     END
|   C*
| 03-C                     END
|   C*
| 03-C                     END                              ELSEIFEND
|   C*
| 02-C                     END                              END HD01
|   C*
| 02-C                     END
|   C*
|   C                     ADD  1         X
| 01-C                     ENDDO
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          CALAZ .... ­pºâ·í¤ë¦þª÷ AZCMS8A9 (¦þª÷¶Ç»¼ÀÉ)
     C*==============================================================*
11===C           CALAZ     BEGSR
|    C*
|    C*---------------------------------------------------------------
|    C*
|    C*¦þª÷¤ë¬°µoÁ~¤ë ´î1  CALFCM - 1 => ABYM
|    C*¦þª÷¤ë  ³]©w ­Y¬°0¤ë®É¡AADD 12 Âà¦¨ ¤Q¤G¤ë
|    C           CALFCM    SUB  1         ABYM    60       ¦þª÷¤ë°_
| 01-C           ABMM      IFEQ 0
|   C                     ADD  12        ABMM
|   C                     SUB  1         ABYY
| 01-C                     END
|    C*
|    C*---------------------------------------------------------------
|    C*Âà¦¨7½Xªº¦~¤ë ¦p200506=> 0940600 (¥Á°ê¦~&¤é´Á 00 )
|    C                     Z-ADDABYM      DSFCYM
|    C                     Z-ADD*ZERO     FCYM
|    C           DSFCY     SUB  1911      FCY
|    C                     Z-ADDDSFCM     FCM
|    C                     Z-ADD*ZERO     FCD
|    C*
|    C*---------------------------------------------------------------
|    C                     Z-ADDABYM      DSFCYM
|    C*
|    C*          KEYAZ     SETLLCOMA
|    C*          KEYAZ     READECOMA                     49
|    C*
| 02-C*          *IN49     DOWEQ*OFF
|   C*
| 03-C*          DLO01     IFEQ '01'
|   C*          COMA7     ANDEQ'I'
|   C*                    ADD  COMA18    SALARY
|   C*                    ADD  COMA18    LP07             ¨ä¥L¬z¶KLP
|   C*
| 03*C*                    ELSE
|   C*
| 04-C*          DLO01     IFEQ '02'
|   C*          COMA7     ANDEQ'O'
|   C*                    ADD  COMA18    SALARY
|   C*                    ADD  COMA18    LP07             ¨ä¥L¬z¶KLP
| 04-C*                    END
|   C*
| 03-C*                    END
|   C*
|   C*          KEYAZ     READECOMA                     49
| 02-C*                    ENDDO
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          CALBZ .... ­pºâ¾ú¥v¤ë¦þª÷ BZCMS8A9 (¦þª÷¶Ç»¼ÀÉ)
     C*==============================================================*
12===C           CALBZ     BEGSR
|    C*
|    C*---------------------------------------------------------------
|    C*
|    C*¦þª÷¤ë¬°µoÁ~¤ë ´î1  CALFCM  - 1 => ABYM
|    C*¦þª÷¤ë  ³]©w ­Y¬°0¤ë®É¡AADD 12 Âà¦¨ ¤Q¤G¤ë
|    C           CALFCM    SUB  1         ABYM    60       ¦þª÷¤ë°_
| 01-C           ABMM      IFEQ 0
|   C                     ADD  12        ABMM
|   C                     SUB  1         ABYY
| 01-C                     END
|    C*
|    C*---------------------------------------------------------------
|    C*Âà¦¨7½Xªº¦~¤ë ¦p200506=> 0940600 (¥Á°ê¦~&¤é´Á 00 )
|    C                     Z-ADDABYM      DSFCYM
|    C                     Z-ADD*ZERO     FCYM
|    C           DSFCY     SUB  1911      FCY
|    C                     Z-ADDDSFCM     FCM
|    C                     Z-ADD*ZERO     FCD
|    C*
|    C*---------------------------------------------------------------
|    C*---------------------------------------------------------------
|    C*          KEYBZ     SETLLKOM
|    C*          KEYBZ     READEKOM                      49
|    C*
| 02-C*          *IN49     DOWEQ*OFF
|   C*
| 03-C*          DLO01     IFEQ '01'
|   C*          COMA7     ANDEQ'I'
|   C*                    ADD  COMA18    SALARY
|   C*                    ADD  COMA18    LP07             ¨ä¥L¬z¶KLP
|   C*
| 03*C*                    ELSE
|   C*
| 04-C*          DLO01     IFEQ '02'
|   C*          COMA7     ANDEQ'O'
|   C*                    ADD  COMA18    SALARY
|   C*                    ADD  COMA18    LP07             ¨ä¥L¬z¶KLP
| 04-C*                    END
|   C*
| 03-C*                    END
|   C*
|   C*          KEYBZ     READEKOM                      49
| 02-C*                    ENDDO
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          MAKELP.... ¼g¸ê®Æ¨ìPYLPPF ³Ò°h°·«O¸Õºâ©ú²ÓÀÉ
     C*==============================================================*
13===C           MAKELP    BEGSR
|    C*
|    C                     MOVELPH01      LP01
|    C                     MOVELPH02      LP02
|    C                     Z-ADDDLOYM     LP03
|    C                     Z-ADDPH03      LP04
|    C                     Z-ADD$A8YMD    LP97
|    C                     TIME           LP98
|    C                     MOVEL$USER     LP99
|    C                     WRITELP0
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          ROOKIE.... ·s¤H­pºâÁ~¸ê
     C*==============================================================*
13===C           ROOKIE    BEGSR
|    C*
|    C                     Z-ADD0         SALARY  70
|    C                     Z-ADD0         SALAVG  92
|    C*--------------------------------------------------------------
|    C*­pºâ¥­§¡Á~SALAVG
|    C*
|    C*¨ìÂ¾¤é·h¨ì¢Ò¢á
|    C                     Z-ADDEM13      WEM13            ¨ìÂ¾¤é
|    C*
|    C*---------------------------------------------------------------
|    C*¨ú©³Á~PY03
|    C*          KEYPY = EM01 + EM02
|    C           KEYPY     CHAINPYPYPF               49
| 09-C           *IN49     IFEQ *OFF
|   C                     ADD  PY03      SALARY
| 09-C                     END
|   C*¨ú«D©³Á~ PYPDPF
|   C                     EXSR CALPDF                     PYPD => PD04
|   C*----------------------------------------------------------------
|   C* *IN42 *OFF®É§ì¦þª÷
| 08-C*          *IN42     IFEQ *OFF
|   C*                    Z-ADDPH03      CALFCM  60       µoÁ~¤ë
|   C*                    EXSR CALBZ                      BZCMSPF
| 08-C*                    END
|   C*----------------------------------------------------------------
|   C                     CLEARLP0
|    C*----------------------------------------------------------------
|    C                     Z-ADDSALARY    SALV    70H
|    C                     Z-ADDSALV      SAL7    70
|    C                     Z-ADDSALV      SAL6    60
|    C*--------------------------------------------------------------
|    C*·s³Ò«O¨úª÷ÃB L102
|    C           SAL7      SETLLL10
|    C                     READ L10                      46
| 01-C           *IN46     IFEQ *OFF
|   C                     Z-ADDL102      LO08             ·s³Ò«O
|   C                     Z-ADDL102      LO07             ·s³Ò«O
| 01*C                     ELSE
|   C           *HIVAL    SETLLL10
|   C                     READPL10                      47
|   C  N47                Z-ADDL102      LO08             ·s³Ò«O
|   C  N47                Z-ADDL102      LO07             ·s³Ò«O
| 01-C                     END
|    C*
|    C*·s°·«O
|    C*·s°·«O¨úª÷ÃB E302
|    C           SAL7      SETLLE30
|    C                     READ E30                      46
| 02-C           *IN46     IFEQ *OFF
|   C                     Z-ADDE302      LO10             ·s°·«O
|   C                     Z-ADDE302      LO09             ·s°·«O
| 02*C                     ELSE
|   C           *HIVAL    SETLLE30
|   C                     READPE30                      47
|   C  N47                Z-ADDE302      LO10             ·s°·«O
|   C  N47                Z-ADDE302      LO09             ·s°·«O
| 02-C                     END
|    C*
|    C*·s³Ò°h
|    C*·s³Ò°h¨úª÷ÃB H704
|    C           SAL6      SETLLH70
|    C                     READ H70                      46
| 03-C           *IN46     IFEQ *OFF
|   C                     Z-ADDH704      LO12             ·s³Ò°h
|   C                     Z-ADDH704      LO11             ·s³Ò°h
| 03*C                     ELSE
|   C           *HIVAL    SETLLH70
|   C                     READPH70                      47
|   C  N47                Z-ADDH704      LO12             ·s³Ò°h
|   C  N47                Z-ADDH704      LO11             ·s³Ò°h
| 03-C                     END
|    C*----------------------------------------------------------------
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          CALPDF.... ²Ö­p«D©³Á~PYPDPF¤§ª÷ÃB PD04
     C*==============================================================*
10===C           CALPDF    BEGSR
|    C*
|    C                     Z-ADD1         X       20
|    C*
|    C*¨úª÷ÃBHD06
|    C* KEYPD = EM01 + EM02 + PH03 +  RA,X
| 01-C           X         DOWLEC
|   C*
|   C           KEYPD     CHAINPD0                  40
| 02-C           *IN40     IFEQ *OFF
|   C*
|   C                     ADD  PD04      SALARY
|   C*Â¾°È¥[µ¹
| 03-C           PD03      IFEQ '12'
|   C                     ADD  PD04      LP06             Â¾°È¥[µ¹
| 03*C                     ELSE
|   C                     ADD  PD04      LP07             ¨ä¥L¬z¶K
| 03-C                     END
|   C*
| 02-C                     END
|   C*
|   C                     ADD  1         X
| 01-C                     ENDDO
|    C*
10===C                     ENDSR
     C*==============================================================*
