     H****************************************************************
     H*   SOURCE NAME  : PYC03                                       *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PURPOSE      :月份所屬年度                               *
     H*--------------------------------------------------------------*
     H*  計算基準年月所屬年度                                      *
     H*                                                              *
     H*  基準年月= #C03I1 (年月, 9(6) )                          *
     H*  年度　  = #C03O1 (年, 9(4) )                            *
     H*  年度起日= #C03O2 (日期, 9(8) )                          *
     H*  年度止日= #C03O3 (日期, 9(8) )                          *
     H*--------------------------------------------------------------*
     H*   EXSR #C0300                                                *
     H****************************************************************
01===C           #C0300    BEGSR
|    C*
|    C                     MOVEL#C03I1    #C03O1  40
|    C                     MOVE #C03I1    #C03M   20
| 01-C           #C03M     IFGT PM103
|   C                     ADD  1         #C03O1
| 01-C                     END
|    C*
|    C*本年度起日期
|    C           #C03O1    SUB  1         #C03WY
|    C           PM103     ADD  1         #C03WM
| 02-C           #C03WM    IFGT 12
|   C                     ADD  1         #C03WY
|   C                     SUB  12        #C03WM
| 02-C                     END
|    C                     Z-ADD01        #C03WD
|    C                     Z-ADD#C03DT    #C03O2  80
|    C*本年度迄日期
|    C                     Z-ADD#C03O1    #C03WY
|    C                     Z-ADDPM103     #C03WM
|    C*
|    C                     CALL 'P34'
|    C                     PARM #C03DM    P3401I  60
|    C                     PARM DFMT      P3403I  1
|    C                     PARM DTYPE     P3404I  1
|    C                     PARM           P3411O  1
|    C                     PARM           P3412O  20
|    C                     Z-ADDP3412O    #C03WD
|    C*
|    C                     Z-ADD#C03DT    #C03O3  80
|    C*
01===C                     ENDSR
