     H****************************************************************
     H*   SOURCE NAME  : PYC01                                       *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PURPOSE      :年資計算                                   *
     H*--------------------------------------------------------------*
     H*  年資= (到職日-系統日) + 特加年資 -留職停薪累計    *
     H*        - (目前留職者到系統日間)                            *
     H*  年資= #C01Y1 (年, 9(5,1) )                              *
     H*--------------------------------------------------------------*
     H*   EXSR #C0100                                                *
     H****************************************************************
01===C           #C0100    BEGSR
|    C*
|    C*計算到職日－系統日間月日數
|    C           EM13      SUB  19110000  P2101I  60
|    C                     Z-ADDDDATE     P2102I  60
|    C                     CALL 'P21'
|    C                     PARM           P2101I
|    C                     PARM           P2102I
|    C                     PARM           P2111O  70
|    C                     PARM           P2112O  20
|    C*
|    C                     Z-ADDP2111O    #C01M1  70        月
|    C                     Z-ADDP2112O    #C01D1  50        日
|    C*特加年資
|    C                     ADD  EM27      #C01M1
|    C*留職停薪累計
|    C                     SUB  EM261     #C01D1           留職停薪
|    C*目前留職停薪
| 01-C           EM11      IFEQ 'R'
|   C           EM17      ANDLT$A8YMD
|   C           EM17      SUB  19110000  P2101I
|   C                     Z-ADDDDATE     P2102I
|   C                     CALL 'P21'
|   C                     PARM           P2101I
|   C                     PARM           P2102I
|   C                     PARM           P2111O
|   C                     PARM           P2112O
|   C*
|   C                     SUB  P2111O    #C01M1
|   C                     SUB  P2112O    #C01D1
| 01-C                     END
|    C*計算月轉成年
|    C           #C01M1    DIV  12        #C01Y1  51H
|    C*計算日轉成年
|    C           #C01D1    DIV  365       #C01W1  51H
|    C                     ADD  #C01W1    #C01Y1
|    C*
01===C                     ENDSR
