     H****************************************************************
     H*   SOURCE NAME  : PYC08                                       *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PURPOSE      :留職天數                                   *
     H*--------------------------------------------------------------*
     H*  計算日期範圍留職天數                                      *
     H*--------------------------------------------------------------*
     H*  年起日= #C08I2 (YMD, 9(6))                                *
     H*  年迄日= #C08I3 (YMD, 9(6))                                *
     H*  留職日數= #C08D1 (日, 9(3) )                            *
     H*--------------------------------------------------------------*
     H*   EXSR #C0800                                                *
     H****************************************************************
     C           KEYTX7    KLIST                           *PYTXPF
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           KTX031  1
     C*--------------------------------------------------------------*
01===C           #C0800    BEGSR
|    C*
|    C                     Z-ADD*ZERO     #C08D1  30
|    C*
|    C                     EXSR #C0802
|    C*
01===C                     ENDSR
     C*===============================================================
     C* #C0802 :日數計算
     C*===============================================================
02===C           #C0802    BEGSR
|    C*
|    C*NEXT DATE OF #C08I3
|    C                     Z-ADD#C08I3    P6201I  60
|    C                     Z-ADD1         P6202I  40
|    C                     CALL 'P62'
|    C                     PARM           P6201I
|    C                     PARM           P6202I
|    C                     PARM           P6211O  60
|    C*
|    C*已復職之留職停薪
|    C                     MOVEL'D'       KTX031
|    C           KEYTX7    SETLLTX0
|    C           KEYTX7    READETX0                      40
|    C*
| 01-C           *IN40     DOWEQ'0'
| 02-C           TX032     IFEQ '2'                        .留職復職
|   C           TX06      ANDLTP6211O                     .留職日<本年止
|   C           TX04      ANDGT#C08I2                     .復職日>本年起
|   C*
|   C                     Z-ADDTX06      P2001I           .留職日
|   C                     Z-ADDTX04      P2002I           .復職日
| 03-C           TX06      IFLT #C08I2
|   C                     Z-ADD#C08I2    P2001I
| 03-C                     END
| 04-C           TX04      IFGT P6211O
|   C                     Z-ADDP6211O    P2002I
| 04-C                     END
|   C*
|   C                     CALL 'P20'
|   C                     PARM           P2001I  60
|   C                     PARM           P2002I  60
|   C                     PARM           P2011O  90       .日數
|   C*
|   C                     ADD  P2011O    #C08D1
| 02-C                     END
|   C*
|   C           KEYTX7    READETX0                      40
| 01-C                     END
|    C*----------------------------------------------------------
|    C*目前留職
| 05-C           EM11      IFEQ 'R'
|   C           EM17      ANDLTP6211O
|   C                     Z-ADDEM17      P2001I
| 06-C           EM17      IFLT #C08I2
|   C                     Z-ADD#C08I2    P2001I
| 06-C                     END
|   C                     Z-ADDP6211O    P2002I
|   C                     CALL 'P20'
|   C                     PARM           P2001I
|   C                     PARM           P2002I
|   C                     PARM           P2011O
|   C*
|   C                     ADD  P2011O    #C08D1
| 05-C                     END
|    C*
02===C                     ENDSR
