     H****************************************************************
     H*   SOURCE NAME  : PYC07                                       *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PURPOSE      :長病天數                                   *
     H*--------------------------------------------------------------*
     H*  計算日期範圍長病天數                                      *
     H*--------------------------------------------------------------*
     H*  年起日= #C07I2 (YMD, 9(6))                                *
     H*  年迄日= #C07I3 (YMD, 9(6))                                *
     H*  在職月數= #C07D1 (日, 9(3) )                            *
     H*--------------------------------------------------------------*
     H*   EXSR #C0700                                                *
     H****************************************************************
     C           KEYTX7    KLIST                           *PYTXPF
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           KTX031  1
     C*--------------------------------------------------------------*
01===C           #C0700    BEGSR
|    C*
|    C                     Z-ADD*ZERO     #C07D1  30
|    C*
|    C                     EXSR #C0702
|    C*
01===C                     ENDSR
     C*===============================================================
     C* #C0702 :日數計算
     C*===============================================================
02===C           #C0702    BEGSR
|    C*
|    C*NEXT DATE OF #C07I3
|    C                     Z-ADD#C07I3    P6201I  60
|    C                     Z-ADD1         P6202I  40
|    C                     CALL 'P62'
|    C                     PARM           P6201I
|    C                     PARM           P6202I
|    C                     PARM           P6211O  60
|    C*
|    C*已復職之長期病假
|    C                     MOVEL'D'       KTX031
|    C           KEYTX7    SETLLTX0
|    C           KEYTX7    READETX0                      40
|    C*
| 01-C           *IN40     DOWEQ'0'
| 02-C           TX032     IFEQ '6'                        .長病復職
|   C           TX06      ANDLTP6211O                     .留職日<本年止
|   C           TX04      ANDGT#C05I2                     .復職日>本年起
|   C*
|   C                     Z-ADDTX06      P2001I           .留職日
|   C                     Z-ADDTX04      P2002I           .復職日
| 03-C           TX06      IFLT #C05I2
|   C                     Z-ADD#C05I2    P2001I
| 03-C                     END
| 04-C           TX04      IFGT P6211O
|   C                     Z-ADDP6211O    P2002I
| 04-C                     END
|   C*
|   C                     CALL 'P20'
|   C                     PARM           P2001I  60
|   C                     PARM           P2002I  60
|   C                     PARM           P2011O  90       .日數
|   C*
|   C                     ADD  P2011O    #C07D1
| 02-C                     END
|   C*
|   C           KEYTX7    READETX0                      40
| 01-C                     END
|    C*----------------------------------------------------------
|    C*目前留職
| 05-C           EM11      IFEQ 'S'
|   C           EM951     ANDLTP6211O
|   C                     Z-ADDEM951     P2001I
| 06-C           EM951     IFLT #C05I2
|   C                     Z-ADD#C05I2    P2001I
| 06-C                     END
|   C                     Z-ADDP6211O    P2002I
|   C                     CALL 'P20'
|   C                     PARM           P2001I
|   C                     PARM           P2002I
|   C                     PARM           P2011O
|   C*
|   C                     ADD  P2011O    #C07D1
| 05-C                     END
|    C*
02===C                     ENDSR
