     FPYPHPF  UF  E           K        DISK
     FPYHDPF  UF  E           K        DISK
     C*
     C                     READ PH0                      46
  01-C           *IN46     DOWEQ'0'
  02-C           PH03      IFEQ 199902
    C                     DELETPH0
  02-C                     END
    C                     READ PH0                      46
  01-C                     END
     C*
     C                     READ HD0                      46
  03-C           *IN46     DOWEQ'0'
  04-C           HD03      IFEQ 199902
    C                     DELETHD0
  04-C                     END
    C                     READ HD0                      46
  03-C                     END
     C                     SETON                     LR
     C*
