     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : PYH1042                                    *
     H*    PROGRAM NAME :勞退新制員工申報明細表                    *
     H*    AUTHOR       : JIMMY WANG                                 *
     H*    CREATE DATE  : 94/04/14                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     H****************************************************************
     FPYH9PF  IF  E           K        DISK
     FPYEMPF  IF  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYH104P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    MSG     1   3 10
     I           UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      203 2080DDATE
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DH501
     I                                      550 556 DEM04F
     I                                      557 563 DEM04T
     I                                      513 513 DOPT
     I                                      514 5210DH502F
     I                                      522 5290DH502T
     I                                      530 5350DSYYMM
     I                                      601 6040DYM
     I            DS
     I                                        1   7 EM04
     I                                        1   1 EM041
     I                                        2   2 EM042
     I                                        3   3 EM043
     I                                        4   7 EM044
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN $A8YMD    FDATE            .TRANS DATE USE
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           KEY       KLIST
     C                     KFLD           H901
     C                     KFLD           H902
     C           KEYDP     KLIST
     C                     KFLD           DP011
     C                     KFLD           DP012
     C                     KFLD           DP013
     C                     KFLD           DP014
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C                     MOVEL'N'       @FLAG   1
     C                     EXSR M01
     C                     READ H90                      41
     C           *IN41     DOWEQ*OFF
     C                     MOVEL'Y'       @FLAG
     C                     EXSR M02
     C*
     C                     EXSR M03
     C           EM04      IFLT DEM04F
     C           EM04      ORGT DEM04T
     C                     GOTO NEXT
     C                     END
     C                     EXSR M04
     C*帶部門中文
     C                     MOVE EM041     DP011
     C                     MOVE EM042     DP012
     C                     MOVE EM043     DP013
     C                     MOVE EM044     DP014
     C           KEYDP     CHAINPYDPPF               40
     C*
     C                     Z-ADDEM33      EM33X
     C*
     C                     WRITEPD1
     C           NEXT      TAG
     C                     READ H90                      41
     C                     END
     C*
     C           @FLAG     IFEQ 'Y'
     C                     WRITEPT1
     C                     ELSE
     C                     WRITEPE9
     C                     ENDIF
     C*
     C                     SETON                     LR
     C*==============================================================*
     C           M01       BEGSR
     C*
     C                     EXSR M011
     C                     WRITEPH1
     C*
     C                     ENDSR
     C*==============================================================*
01===C           M011      BEGSR
|    C*
|    C*GET 表頭公司別
|    C           DOPT      IFEQ '1'
|    C                     MOVELMSG,1     MSG1
|    C                     ELSE
|    C                     MOVELMSG,2     MSG1
|    C                     END
|    C                     Z-ADDDYM       DYMX
|    C*
01===C                     ENDSR
     C*==============================================================*
     C           M02       BEGSR
     C*
     C           *IN39     IFEQ *ON
     C                     EXSR M01
     C                     MOVE *OFF      *IN39
     C                     ENDIF
     C*
     C                     ENDSR
     C*==============================================================*
01===C           M03       BEGSR
|    C*
|    C           KEY       CHAINEM0                  20
|    C           *IN20     IFEQ *ON
|    C                     MOVEL*BLANK    EM02
|    C                     MOVEL*BLANK    EM03
|    C                     ENDIF
|    C*
01===C                     ENDSR
     C*==============================================================*
01===C           M04       BEGSR
|    C*
     C           DOPT      IFEQ '1'
|    C                     MOVELH905      H87
|    C                     MOVELH907      H57
|    C                     ENDIF
|    C*
     C           DOPT      IFEQ '2'
|    C                     MOVELH904      H87
|    C                     MOVELH906      H57
|    C                     ENDIF
|    C*
|    C                     ADD  1         @CP     90       .人數
|    C                     ADD  H87       @H4     90       .調整前
|    C                     ADD  H57       @H5     90       .調整後
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R8999
     C*==============================================================*
07===C           R8999     BEGSR
|    C*
07===C                     ENDSR
** MSG
 企業提撥
 員工提繳
