     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM ID   : PYA132                                     *
     H*    PROGRAM NAME :勞／健保調整調整作業                      *
     H*    AUTHOR       : A1274 EVA                                  *
     H*    CREATE DATE  : 90/03/26                                   *
     H*    UPDATE DATE  : 92/12/30 ALLEN                             *
     H*    SYSTEM       :員工保險維護子系統                        *
     F****************************************************************
     FPYH131WFUF  E           K        DISK                      A
     FSYCMPF  IF  E           K        DISK
     FPYEMPF  IF  E           K        DISK
     FPYH132D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     E                    @A01        5  1               作業權利
     E                    WFUN    5   5  6
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I            DS
     I                                        1   6 DRC101
     I                                        1   2 RC1011
     I                                        3   5 RC1012
     I                                        6   6 RC1013
     I*LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      201 2080$A8YMD
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      211 2160DDATE
     I            DS
     I                                        1   2 TX03
     I                                        1   1 TX031
     I                                        2   2 TX032
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYW13    KLIST
     C                     KFLD           DW1301           *公司編號
     C                     KFLD           KW1303           *調整年月
     C                     KFLD           DW1302           *員工編號
     C           KEYW3     KLIST
     C                     KFLD           DW1301           *公司編號
     C                     KFLD           KW1303           *調整年月
     C           KEYCM     KLIST
     C                     KFLD           DW1301           公司
     C           KEYEM     KLIST
     C                     KFLD           DW1301           公司
     C                     KFLD           DW1302           員工
     C           KEYE1     KLIST
     C                     KFLD           DW1301           公司
     C                     KFLD           DW1302           員工
     C           KEYE1S    KLIST
     C                     KFLD           DW1301           *公司編號
     C                     KFLD           DW1302           *員工編號
     C                     KFLD           WYMD             *生效日期
     C           KEYTX     KLIST
     C                     KFLD           DW1301           公司
     C                     KFLD           DW1302           員工
     C           KEYTXS    KLIST
     C                     KFLD           DW1301           *公司編號
     C                     KFLD           DW1302           *員工編號
     C                     KFLD           WYMD    80       *生效日期
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N99                EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
    C           SCID      CASEQ'SC02'    R2000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*TRANS DATE
|    C                     IN   PTDA01
|    C*
|    C                     MOVE 'SC01'    SCID    4
|    C* FUN AUT
|    C                     MOVE $ADD      @A01,1
|    C                     MOVE $UPD      @A01,2
|    C                     MOVE $DLT      @A01,4
|    C                     MOVE $INQ      @A01,5
|    C*
|    C* SC01 FIELD INITIALIZE *--------------------------------------*
|    C                     Z-ADD1         DOPT
|    C*
|    C                     MOVEL*BLANK    DRC101
|    C*------------------------------------------------------------****
|    C*公司別
|    C                     MOVEL$COR      DW1301
| 01-C           $RMK03    IFNE 'Y'
|   C                     SETOF                     32
| 01*C                     ELSE
|   C                     SETON                     32
| 01-C                     END
|    C*
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'                        *PROMPT
|   C                     EXSR R1E00
|   C                     GOTO E1000
| 02-C                     END
|    C*
| 03-C           *IN18     IFEQ '1'                        *BROWSE
|   C                     EXSR R1A00
|   C                     GOTO E1000
| 03-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 04-C           *IN99     IFEQ '0'                        *SCR CHK OK
|   C                     EXSR R1C00                      *PRE-SC02
|   C                     MOVEL'SC02'    SCID
| 04-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1A00 ....全頁查詢 (PF18 : CALL SUB-PROGRAM)
     C*==============================================================*
03===C           R1A00     BEGSR
|    C*
|    C* AUT CHECK
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM 'MTS004'  S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     99
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C   99                GOTO E1A00
|    C*
|    C* CALL SUB-PROGRAM
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C                     CALL 'P39'
|    C                     PARM DW1303    P3901I  60
|    C                     PARM '2'       P3902I  1
|    C                     PARM '2'       P3903I  1
|    C                     PARM '2'       P3904I  1
|    C                     PARM '1'       P3905I  1
|    C           KW1303    PARM           P3911O  60
|    C*
|    C                     CALL 'PYHI132'
|    C                     PARM DW1301    P101I1  2        *公司別
|    C           DW1302    PARM DW1302    P101I2  8        *員工　
|    C                     PARM DW1303    P101I3  60       *調整年月
|    C                     PARM           @RTNC   2          FUN KEY
|    C* RETURN CODE CHECK
| 02-C           @RTNC     IFEQ '03'                       *PF3
|   C                     SETON                     03
| 02-C                     END
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
03===C           E1A00     ENDSR
     C*==============================================================*
     C*          R1E00 ....'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
04===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*員工編號DW1302
| 01-C           #LIN      IFEQ 5
|   C           #COL      ANDGE13
|   C           #COL      ANDLE17
|   C                     CALL 'PYI101'
|   C                     PARM DW1301    P101I1  2         公司別
|   C           DW1302    PARM DW1302    P101I2  8         員工　
|   C                     PARM           @RTNC   2          FUN KEY
| 01-C                     END
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R1B00 .... 'SC01' SCREEN CHECK
     C*==============================================================*
05===C           R1B00     BEGSR
|    C*
|    C* CHK FUN AUT
| 01-C           @A01,DOPT IFNE 'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* DATA CHECK *--------------------------------------------------*
|    C*公司別
| 02-C           DW1301    IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
     C           DOPT      IFEQ 2
| 02-C           W1320     ANDEQ'*'
|   C                     MOVEL'UPT3005' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C   99                GOTO E1B00
     C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DW1301    CM001I  2         公司代號
|    C                     PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C                     PARM           CM004O  1         日期格式
|    C                     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C                     MOVE CM004O    DFMT    1
|    C                     MOVE CM005O    DTYPE   1
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 03-C           CM099O    IFEQ 'N'
|   C                     SETON                     6099
|   C                     MOVEL'US#0099' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 03-C                     END
|    C   99                GOTO E1B00
|    C*
| 04-C           CM099O    IFEQ *BLANK
|   C                     SETON                     6099
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 04-C                     END
|    C   99                GOTO E1B00
|    C           KEYCM     CHAINCM0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    CM02             公司名稱
| 05-C                     END
|    C*只能維護講師同仁資料
|    C           KEYEM     CHAINEM0                  40
| 06-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    EM03      P      講師姓名
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 06-C                     END
|    C   99                GOTO E1B00
|    C*UPY0004--->此員工已離職
| 07-C           EM11      IFEQ 'Y'
|   C           EM11      OREQ '*'
|   C                     MOVEL'UPY0004' ERRID
|   C                     MOVEL'CEMF'    ERRF
|   C                     SETON                     606199
| 07-C                     END
|    C*-------------------------------------------------------------***
|    C*調整年月
|    C                     Z-ADDDW1303    FDATE   80
|    C                     CALL 'P38'
|    C                     PARM FDATE     P3801I  60
|    C                     PARM CM004O    P3802I  1        .YYYYMM
|    C                     PARM CM005O    P3803I  1
|    C                     PARM           P3801O  60
|    C                     PARM           P3811O  1        .'Y':OK
|    C*                                                    .'N':ERROR
| 08-C           P3811O    IFNE 'Y'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 08-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'P39'
|    C                     PARM FDATE     P3901I  60
|    C                     PARM CM004O    P3902I  1
|    C                     PARM CM005O    P3903I  1
|    C                     PARM '2'       P3904I  1
|    C                     PARM '1'       P3905I  1
|    C                     PARM           P3911O  60
|    C                     Z-ADDP3911O    KW1303  60       *
|    C*取得生效日期W1310
|    C           KEYW3     SETLLW13R
|    C           KEYW3     READEW13R                     46
| 09-C           *IN46     DOWEQ'0'
|   C           KW1310    ANDEQ0
| 10-C           W1310     IFNE 0
|   C                     Z-ADDW1310     KW1310  80       *生效日期
| 10-C                     END
|   C           KEYW3     READEW13R                     46
| 09-C                     END
|    C*
| 02-C           W1320     IFEQ '*'
|   C                     MOVEL'UPT3005' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C           KEYW13    CHAINW13R                 40
| 11-C           DOPT      IFEQ 1                          *ADD
|   C           *IN40     ANDEQ'0'
|   C                     MOVEL'UPT2020' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6061
|   C                     SETON                     6299
| 11-C                     END
|    C   99                GOTO E1B00
|    C*
| 12-C           DOPT      IFNE 1                          *UPD.DEL.INQ
|   C           *IN40     ANDEQ'1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6061
|   C                     SETON                     6299
| 12-C                     END
|    C   99                GOTO E1B00
|    C*----------------------------------------------------------------
|    C*----------------------------------------------------------------
|    C*
05===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....INIT 'SC02'
     C*==============================================================*
06===C           R1C00     BEGSR
|    C*
|    C                     MOVE DOPT      WNUM    10
|    C                     MOVE WFUN,WNUM DFUN
|    C*
| 01-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 2                          *UPD
|   C                     SETON                     31    *CAN INPUT
| 01*C                     ELSE                            *DEL, INQ
|   C                     SETOF                     31    *INP PROTECT
| 01-C                     END
|    C*
| 02-C           DOPT      IFEQ 1                          *ADD
|   C                     EXSR R1C10                      *NO COPY
| 02*C                     ELSE                            *U/D/I
|   C                     EXSR R1C20                      *COPY
| 02-C                     END
|    C*
|    C* RELEASE FILE (ADD & INQUIRY)----------------------------------*
| 03-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 5                          *INQ
|   C           *LOVAL    SETLLW13R
| 03-C                     END
|    C*---------------------------------------------------------------*
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R1C10 ....'SC02' FIELD INIT : ADD (NO COPY)
     C*==============================================================*
07===C           R1C10     BEGSR
|    C*
|    C                     Z-ADD0         DW1304
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*  R1C20 ....'SC02' FIELD INIT : UPD, DEL, INQ, (ADD & COPY)
     C*==============================================================*
08===C           R1C20     BEGSR
|    C*
|    C                     Z-ADDW1304     DW1304
|    C                     Z-ADDW1308     DW1308
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          R2000 .... 'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
09===C           R2000     BEGSR
|    C*
|    C                     EXFMTDSPD2
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E2000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'                        *END
| 03-C           DOPT      IFEQ 1
|   C           DOPT      OREQ 2
|   C                     EXSR R2E00
| 03-C                     END
|   C                     GOTO E2000
| 02-C                     END
|    C*
| 04-C           *IN05     IFEQ '1'                        *END
|   C                     GOTO E2000
| 04-C                     END
|    C*
| 05-C           *IN12     IFEQ '1'                        *PREVIOUS
|   C* RELEAS FILE --------------------------------------------------*
|   C           *LOVAL    SETLLW13R
|   C*---------------------------------------------------------------*
|   C                     MOVEL'SC01'    SCID
|   C                     GOTO E2000
| 05-C                     END
|    C*
| 06-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 2                          *UPD
|   C                     EXSR R2B00                      *SC02 CHK
| 06-C                     END
|    C*
| 07-C           *IN99     IFEQ '0'                        *CHK OK
|   C                     EXSR R2D00                      *FILE UPD
|   C                     MOVE 'SC01'    SCID
| 07-C                     END
|    C*
09===C           E2000     ENDSR
     C*==============================================================*
     C*          R2B00 ....'SC02' CHECK
     C*==============================================================*
10===C           R2B00     BEGSR
|    C*　　　　
|    C*
10===C           E2B00     ENDSR
     C*==============================================================*
     C*          R2D00 ....FILE PROCESS
     C*==============================================================*
11===C           R2D00     BEGSR
|    C*
| 01-C           DOPT      CASEQ1         R2D10
|   C           DOPT      CASEQ2         R2D20
|   C           DOPT      CASEQ4         R2D30
| 01-C                     END
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          R2D10 ....FILE PROCESS : ADD
     C*==============================================================*
12===C           R2D10     BEGSR
|    C*
|    C                     EXSR R2D11
|    C                     WRITEW13R
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          R2D11 ....SCREEN FIELD TO FILE
     C*==============================================================*
13===C           R2D11     BEGSR
|    C*
|    C                     MOVELDW1301    W1301            *公司編號
|    C                     MOVELDW1302    W1302            *員工編號
|    C                     MOVELKW1303    W1303   60       *調整年月
|    C                     Z-ADDDW1304    W1304            *平均收入
|    C                     Z-ADDDW1308    W1308            *健保投保金額
|    C*
|    C                     Z-ADDKW1310    W1310            *生效日期
|    C                     MOVEL*BLANK    W1320            *確認
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          R2D20 ....FILE PROCESS : UPD
     C*==============================================================*
14===C           R2D20     BEGSR
|    C*
|    C                     Z-ADDDW1304    W1304            *平均收入
|    C                     Z-ADDDW1308    W1308            *健保投保金額
|    C                     UPDATW13R
|    C*
14===C                     ENDSR
     C*==============================================================*
     C*          R2D30 ....FILE PROCESS :DEL
     C*==============================================================*
15===C           R2D30     BEGSR
|    C*
|    C                     DELETW13R
|    C*
15===C                     ENDSR
     C*==============================================================*
     C*          R2E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
16===C           R2E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*　　
|    C*　　    #COL      ANDGE13
|    C*　　    #COL      ANDLE14
|    C*　　              CALL 'TRW001'
|    C*　　              PARM 'RED03'   P101I1 10        *代碼欄位
|    C*　　    DRC102    PARM DRC102    P101I2 10        *代碼內容
|    C*　　    RC102N    PARM           P101I3 32        *代碼說明
|    C*　　              PARM           @RTNC   2          FUN KEY
|    C*　　              END
|    C* RETURN CODE CHECK
|    C*          @RTNC     IFEQ '03'                       *PF3
|    C*                    SETON                     03
|    C*                    END
|    C*
16===C                     ENDSR
     C*==============================================================*
**
新增修改      刪除查詢
