     H****************************************************************
     H*   ªx¤Ó¸ê°T¬ì§Þ¶}µoªÑ¥÷¦³­­¤½¥q¡Ðª©Åv©Ò¦³    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM NAME : PYH126                                     *
     H*    PROGRAM NAME :°·«O¶O¸Õºâ§@·~+°·«O©î¤À¦U²²ÄÝª÷ÃB       *
     H*    AUTHER       : A1491 EASON                                *
     H*    CREATE DATE  : 97/03/31                                   *
     H*    SYSTEM       :³Ò°h·s¨î§@·~                              *
     H****************************************************************
      *°·«O­û¤u¥DÀÉ
     FPYE8PF  IF  E           K        DISK
      *²²ÄÝ¸ê®ÆÀÉ
     FPYE5LF02IF  E           K        DISK
      *²²ÄÝ¸ê®ÆÀÉLF04
     FPYE5LF01IF  E           K        DISK
     F            E50                               KRENAMEE5X
      *°·«O°Ñ¼ÆÀÉ
     FPYE4PF  IF  E           K        DISK
      *¤H¨Æ¥DÀÉ
     FPYEMPF  IF  E           K        DISK
      *°·«O¸É§UÀÉ
     FPYE9PF  IF  E           K        DISK
      *©î¤À°·«OÀÉ--> ¬ö¿ý¦U²²ÄÝ°·«Oª÷ÃB
     FPYTIPF  UF  E           K        DISK                      A
      *¤½¥q­t¾á¦¨¥»¥DÀÉ-¸ÕºâÀÉ
     FPYDWPF  UF  E           K        DISK                      A
     E*---------------------------------------------------------------
     E* DESCENDING
     E                    E2         10  5 0DE21    10   °·«O²²ÄÝ
     E* RT1 ²²ÄÝ¢×¢Ò
     E                    RT1         3 10
     E*---------------------------------------------------------------
     E* RT6 ²²ÄÝ¢×¢Ò
     E                    RT6         5 10
     E*---------------------------------------------------------------
     ILDA        UDS
     I                                      101 110 $USER
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      211 2160DDATE
      *¥Î¨Ó¦s©ñ·í¤ë³Ì«á¤@¤Ñ
     I            DS
     I                                        1   80SYM
     I                                        1   60DE803
     I                                        7   80DYM
     C*==============================================================*
     C*                    *ENTRY PLIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           DE801     PARM           P1011I  2         ¤½¥q½s¸¹
     C           DE802     PARM           P1012I  8         ­û¤u½s¸¹
     C           DE803     PARM           P1013I  60        Á~¸ê¤ë¥÷
     C           DE804     PARM           P1014O  60        °·«Oª÷ÃB
     C*                    PARM           @RTNC   2          FUN KEY
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN P1011I    DE801
     C           *LIKE     DEFN P1012I    DE802
     C*==============================================================*
     C*                    KEY  LIST
     C*==============================================================*
     C*PYE8PF
     C           KEYE8     KLIST
     C                     KFLD           DE801            .¤½¥q§O
     C                     KFLD           DE802            .­û¤u½s¸¹
     C                     KFLD           SYM              .¥Í®Ä¤é´Á
     C*PYEMPF
     C           KEYEM     KLIST
     C                     KFLD           DE801            .¤½¥q§O
     C                     KFLD           DE802            .­û¤u½s¸¹
     C*PYDWPF
     C           KEYDW     KLIST
     C                     KFLD           DE801
     C                     KFLD           DE803
     C                     KFLD           DE802
     C*PYE5LF01
     C           KEYE2     KLIST
     C                     KFLD           DE801
     C                     KFLD           DE802
     C                     KFLD           TEMP   10
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010                     .INIT.
     C*°·«O­pºâ
     C                     EXSR RTN100
     C*°·«O©î¤À
     C                     EXSR RTN200
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010... INITIAL PROCESS
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     SETON                     10
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   *NAMVAR
|    C*
|    C                     Z-ADD*ZERO     DE804   60       °·«Oª÷ÃB
|    C                     Z-ADD*ZERO     DYM              ·í¤ë³Ì«á¤Ñ
|     *¤½¥q­t¾á
|    C                     MOVELDE801     DW01             ¤½¥q
|    C                     MOVELDE802     DW02             ­û¤u
|    C                     Z-ADDDE803     DW03             §ë«O¦~¤ë
|    C*·í¤ë³Ì«á¤@¤Ñ¤Ñ¼Æ
|    C                     CALL 'P34'
|    C                     PARM DE803     P3401I  60
|    C                     PARM '2'       P3403I  1
|    C                     PARM '1'       P3404I  1
|    C                     PARM           P3411O  1
|    C                     PARM           P3412O  20
|    C                     Z-ADDP3412O    DYM
|    C*°·«O°Ñ¼ÆÀÉ
|    C                     READ E40                      40
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100 °·«Oª÷ÃB­pºâ
     C*==============================================================*
02===C           RTN100    BEGSR
|     *
|    C*µL­û¤u¸ê®Æ
|    C           KEYEM     CHAINEM0                  40
|    C   40                GOTO ETN100
|    C*µL§ë«O
|    C           KEYE8     SETGTE80
|    C           KEYEM     REDPEE80                      40
|    C   40                GOTO ETN100
|     *Â÷Â¾¡A·í¤ë¤£­p
| 01-C           EM19      IFNE *ZERO
|   C           EM19      ANDLTSYM
|   C                     GOTO ETN100
| 01-C                     END
|     *°±«O¡A·í¤ë¤£­p
| 02-C           E804      IFEQ '3'                        °±«O
|   C           E803      ANDLTSYM
|   C                     GOTO ETN100
| 02-C                     END
|     *°·«O¶O¡×§ë«Oª÷ÃB(E805)X¶O²v(E401) X­û¤u­t¾á²v(E402)
|    C           E805      MULT E401      TP24    94H
|    C           TP24      MULT E402      TP25    70H
|    C                     Z-ADDTP25      PW24    70H
|     *¥ý­pºâ¤@­Ó¤H°ò¥»«OÃB
|    C                     Z-ADD1         PW26    10       §ë«O¤H¼Æ
|    C                     Z-ADD0         PWAMT   70       ¸É§U²Ö¿n
|    C                     Z-ADD0         TPANT   70       ¸É§Uª÷ÃB
|    C                     Z-ADDE805      DW04
|     *°Oºâ¤½¥q°·«O
|    C                     EXSR RTN150
|     *
|    C* ­pºâ°·«O¸É§U´Ú¡Ð­û¤u²²ÄÝ
|    C                     Z-ADD0         II      20       °·«OINDEX
|    C                     Z-ADD1         D       10       °·«OINDEX
|    C                     CLEARRT6
|     *
|    C           KEYE8     SETGTE50
|    C           KEYEM     REDPEE50                      46
| 03-C           *IN46     DOWEQ'0'
|   C*
|   C           E507      LOKUPRT6                      11
| 04-C           *IN11     IFNE '1'
|   C*²²ÄÝ°h«O¤£­pºâ
| 05-C           E505      IFNE 'Y'                        ²²ÄÝ°h«O
|   C           E513      IFNE '3'                        ²²ÄÝ°h«O
|   C*­pºâ³æ¤@²²ÄÝ«O¶O
|   C                     Z-ADD0         TPANT   70
| 06-C           E511      IFNE *BLANK
|   C           E511      CHAINE90                  40
| 07-C           *IN40     IFEQ '0'
|   C           TP25      MULT E902      TPANT
|   C           TPANT     ADD  E903      TPANT
| 07-C                     ENDIF
| 06-C                     ENDIF
|    *°µ²Ö¥[
|   C                     ADD  1         II
|    *
| 08-C           TPANT     IFGE TP25
|   C                     Z-ADDTP25      E2,II
|   C                     MOVELE507      E21,II
| 08*C                     ELSE
|   C                     Z-ADDTPANT     E2,II
|   C                     MOVELE507      E21,II
| 08-C                     ENDIF
|   C*
| 09-C           PW26      IFLT 4
|   C                     ADD  1         PW26
| 09-C                     ENDIF
|   C*
| 05-C                     END
| 05-C                     END
|   C*
|   C                     MOVELE507      RT6,D
|   C                     ADD  1         D
|   C*
| 04-C                     ENDIF
|   C*
|   C           KEYEM     REDPEE50                      46
| 03-C                     ENDDO
|    C*¨úª÷ÃB³Ì°ªªº«e3¤H¡A²Ö¥[¥X©Ò­n¸É§Uªº°·«O¶O
|    C                     SORTAE2
|    C                     Z-ADD1         II
| 10-C           1         DO   3         II
| 11-C           E2,II     IFGT 0
|   C                     ADD  E2,II     PWAMT
| 11-C                     ENDIF
| 10-C                     ENDDO
|    C*­pºâ°·«O¸É§U´Ú¡Ð­û¤u
|    C                     Z-ADD0         TPANT
|    C*­pºâ¥D­n­û¤u«O¶O
|    C                     Z-ADD0         TPANT   70
| 12-C           E808      IFNE *BLANK
|   C           E808      CHAINE90                  40
| 13-C           *IN40     IFEQ '0'
|   C           TP25      MULT E902      TPANT
|   C           TPANT     ADD  E903      TPANT
| 13-C                     ENDIF
| 12-C                     ENDIF
|    C*­û¤u«O¶O
|    C           TP25      SUB  TPANT     QQ      70
| 14-C           QQ        IFLT 0
|   C                     Z-ADD0         QQ
| 14-C                     END
|    C*²Ö¥[¨ì¸É§U«O¶O¸Ì
| 15-C           TPANT     IFGE TP25
|   C                     ADD  TP25      PWAMT
| 15*C                     ELSE
|   C                     ADD  TPANT     PWAMT
| 15-C                     ENDIF
|    C*­pºâ­û¤uÀ³­t¾á°·«O¶O¡A(Á`¤H¼Æ * ³æ¤@«O¶O) - ¸É§U«O¶O
|    C           TP25      MULT PW26      PW24
|    C                     SUB  PWAMT     PW24
|    C                     Z-ADDPW24      P1014O
|    C*
02===C           ETN100    ENDSR
     C*==============================================================*
     C*          RTN150 ¤½¥q­t¾á°·«O
     C*==============================================================*
03===C           RTN150    BEGSR
|     *
|     *¤½¥q­t¾á°·«O¡×§ë«Oª÷ÃB(E105)X¶O²v(E401) X¤½¥q­t¾á²v(E403)
|     *¦]¤½¥q­t¾á¤£ºÞ²²ÄÝ¤Î¸É§U³¡¥÷¡A¥i¥ý­pºâ
|    C                     Z-ADD0         TP27    94H
|    C                     Z-ADD0         TP28    94H
|    C           KEYDW     CHAINDW0                  40
|    C           TP24      MULT E403      TP27
|    C           TP27      MULT E404      TP28
|    C                     Z-ADDTP28      DW05      H      °·«O­t¾á
| 01-C           DW05      IFGT 0
|   C  N40                UPDATDW0
|   C   40                WRITEDW0
| 01-C                     ENDIF
|     *
03===C                     ENDSR
     C*==============================================================*
     C*          RTN200 °·«Oª÷ÃB©î¤À
     C*==============================================================*
04===C           RTN200    BEGSR
|     *
|    C*¼g¨ì©î¤À°·«OÀÉ
|    C                     MOVELDE801     TI01
|    C                     Z-ADDDE803     TI02
|    C                     MOVELDE802     TI03
|    C                     Z-ADDPW24      TI04
|    C                     Z-ADDE805      TI05
|    C                     MOVELE808      TI06
|    C                     Z-ADDE806      TI07
|    C                     Z-ADDQQ        TI08
|    C                     Z-ADD0         TI09
|     *­pºâ²²ÄÝ­Ó§O«O¶O
|    C                     Z-ADD1         II
| 01-C           1         DO   3         II
|   C                     Z-ADD0         TT      70
|   C           TP25      SUB  E2,II     TT
| 02-C           TT        IFNE 0
|    *
|    *¥ý¼g²Ä¤@­Ó²²ÄÝ¸ê®Æ
| 03-C                     SELEC
|   C           TI111     WHEQ *BLANK
|   C           E21,II    ANDNE*BLANK
|   C                     Z-ADDTT        TI115
|   C                     MOVELE21,II    TI111
|   C                     MOVELTI111     TEMP
|   C           KEYE2     CHAINE5X                  40
| 04-C           *IN40     IFEQ '0'
|   C                     MOVELE506      TI112            ²²ÄÝ©m¦W
|   C                     MOVELE509      TI113            ²²ÄÝºÙ¿×
|   C                     MOVELE511      TI114            ¸É§U½X
| 04*C                     ELSE
|   C                     MOVEL*BLANK    TI112            ²²ÄÝ©m¦W
|   C                     MOVEL*BLANK    TI113            ²²ÄÝºÙ¿×
|   C                     MOVEL*BLANK    TI114            ¸É§U½X
| 04-C                     ENDIF
|   C           TI121     WHEQ *BLANK
|   C           E21,II    ANDNE*BLANK
|   C                     Z-ADDTT        TI125
|   C                     MOVELE21,II    TI121
|   C                     MOVELTI121     TEMP
|   C           KEYE2     CHAINE5X                  40
| 05-C           *IN40     IFEQ '0'
|   C                     MOVELE506      TI122            ²²ÄÝ©m¦W
|   C                     MOVELE509      TI123            ²²ÄÝºÙ¿×
|   C                     MOVELE511      TI124            ¸É§U½X
| 05*C                     ELSE
|   C                     MOVEL*BLANK    TI122            ²²ÄÝ©m¦W
|   C                     MOVEL*BLANK    TI123            ²²ÄÝºÙ¿×
|   C                     MOVEL*BLANK    TI124            ¸É§U½X
| 05-C                     ENDIF
|   C           TI131     WHEQ *BLANK
|   C           E21,II    ANDNE*BLANK
|   C                     Z-ADDTT        TI135
|   C                     MOVELE21,II    TI131
|   C                     MOVELTI131     TEMP
|   C           KEYE2     CHAINE5X                  40
| 06-C           *IN40     IFEQ '0'
|   C                     MOVELE506      TI132            ²²ÄÝ©m¦W
|   C                     MOVELE509      TI133            ²²ÄÝºÙ¿×
|   C                     MOVELE511      TI134            ¸É§U½X
| 06*C                     ELSE
|   C                     MOVEL*BLANK    TI132            ²²ÄÝ©m¦W
|   C                     MOVEL*BLANK    TI133            ²²ÄÝºÙ¿×
|   C                     MOVEL*BLANK    TI134            ¸É§U½X
| 06-C                     ENDIF
| 03-C                     ENDSL
| 02-C                     ENDIF
|   C*                    ADD  1         II
| 01-C                     ENDDO
|     *
|    C                     Z-ADD$A8YMD    TI97             §ó·s¤é´Á
|    C                     TIME           TI98             §ó·s®É¶¡
|    C                     MOVEL$USER     TI99             ¨Ï¥ÎªÌ¥N¸¹
|     *
|    C           KEYDW     CHAINTI0                  40
|    C   40                WRITETI0
|     *
|    C                     CLEARE2
|    C                     CLEARTI0
|     *
04===C                     ENDSR
