     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYH1112                                    *
     H*    PROGRAM NAME :員工退休金累積金額明細表                  *
     H*    AUTHOR       : A1415 REENE                                *
     H*    CREATE DATE  : 2005/03/09                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYH4JF01IP  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYH111P O   E             39     PRINTER
     E*---------------------------------------------------------------
     I*
     IJJREC
     I                                              EM041 L1
     I                                              EM042 L1
     I                                              EM043 L1
     I                                              EM044 L1
     I           UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      203 2080DDATE
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DH401
     I                                      540 546 DEM04F
     I                                      547 553 DEM04T
     I                                      513 520 DH402F
     I                                      521 528 DH402T
     I            DS
     I                                        1   7 EM04
     I                                        1   1 EM041
     I                                        2   2 EM042
     I                                        3   3 EM043
     I                                        4   7 EM044
     I            DS
     I                                        1   52DAYS
     I                                        1   30DAYY
     I                                        4   50DAYM
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN $A8YMD    DTYPE
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*
     C*
     C           *IN39     IFEQ '1'
     C                     WRITEPH1
     C                     SETOF                     39
     C                     ENDIF
     C*
     C*
|    C                     ADD  1         PNUM    30
|    C                     ADD  1         SNUM    40
     C*
     C                     EXSR R1C00                      .計算年資
     C*
     C                     EXSR R2000                      .DETAIL
     C*
     C*
     CL1 10                EXSR R8100
     C*
     CLR 10                EXSR R8900
     C*
     CLRN10                EXSR R8999
     C*
     C*
     C*==============================================================*
     C*          R1000 ... INITIAL GET HEADING
     C*==============================================================*
01===C           R1000     BEGSR
|    C*
|    C                     SETON                     1039
|    C*
|    C           DH401     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C*
|    C*
01===C                     ENDSR
     C*===============================================================*
     C*          R1C00  ... 計算年資
     C*===============================================================*
04===C           R1C00     BEGSR
     C*
     C                     Z-ADD0         DAY1    50
     C                     Z-ADD0         DAYS
     C*
     C           H406      IFLE $A8YMD
     C*
|    C                     CALL 'P32'
|    C                     PARM H406      P3301I  80
|    C                     PARM $A8YMD    P3302I  80
|    C                     PARM '2'       P3303I  1
|    C                     PARM '1'       P3304I  1
|    C                     PARM           P3311O  90
|    C           P3311O    ADD  1         DAY1    50       *年資天數
     C*
     C           DAY1      DIV  365       DAYY
     C                     MVR            DAYM
     C*
     C                     ELSE
     C                     Z-ADD0         DAYS
     C                     END
     C*
04===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
02===C           R2000     BEGSR
|    C*
|    C                     Z-ADDEM13      EM13X
|    C                     WRITEPD1
|    C*
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          R8100 ... LEVEL BREAK 1
     C*==============================================================*
05===C           R8100     BEGSR
|    C*
     C                     SETON                     39
|    C                     WRITEPT1
     C                     Z-ADD0         PNUM
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR -- HAS DATA
     C*==============================================================*
06===C           R8900     BEGSR
|    C*
|    C                     WRITEPT2
     C                     Z-ADD0         SNUM
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR -- NO DATA
     C*==============================================================*
07===C           R8999     BEGSR
|    C*
|    C                     EXSR R1000
|    C*
|    C                     WRITEPH1
|    C*
|    C                     WRITEPE9
|    C*
07===C                     ENDSR
