     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : PYH1032                                    *
     H*    PROGRAM NAME :勞退新制員工資料提撥明細表                *
     H*    AUTHOR       : A1415                                      *
     H*    CREATE DATE  : 94/03/01                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     H****************************************************************
     FPYH6JF01IP  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYH118P O   E             39     PRINTER
     E*---------------------------------------------------------------
     IJJREC
     I                                              EM041 L1
     I                                              EM042 L1
     I                                              EM043 L1
     I                                              EM044 L1
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      187 1920DDATE
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DH601
     I                                      550 556 DEM04F
     I                                      557 563 DEM04T
     I                                      513 513 DPT
     I                                      514 5210DH602F
     I                                      522 5290DH602T
     I                                      530 5350DYM
     I                                      541 541 DFMT
     I                                      542 542 DTYPE
     I*                                     543 548 DEM19
     I            DS
     I                                        1   7 EM04
     I                                        1   1 EM041
     I                                        2   2 EM042
     I                                        3   3 EM043
     I                                        4   7 EM044
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN $A8YMD    FDATE            .TRANS DATE USE
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*
     C           *IN39     IFEQ '1'
     C                     WRITEPH1
     C                     SETOF                     39
     C                     ENDIF
     C*
     C*
     C                     ADD  1         @H602   90       .人數
     C                     ADD  H606      @H606   90       .企提金額
     C                     ADD  H605      @H605   90       .自提金額
     C                     ADD  1         @@H602  90       .合計
     C                     ADD  H606      @@H606  90       .合計
     C                     ADD  H605      @@H605  90       .合計
     C*
     C                     EXSR R2000                      .DETAIL
     C*
     C           NEXT      TAG
     C*
     CL1 10                EXSR R8100
     C*
     CLR 10                EXSR R8900
     C*
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R1000 ... INITIAL PROCESS
     C*==============================================================*
01===C           R1000     BEGSR
|    C*
|    C                     SETON                     1039
|    C*GET表頭公司別
|    C           DH601     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C           DYM       SUB  191100    DYMX
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
02===C           R2000     BEGSR
     C*
     C           EM19      SUB  19110000  EM19X
     C                     WRITEPD1
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          R8100 ... LEVEL BREAK 1
     C*==============================================================*
05===C           R8100     BEGSR
|    C*
     C                     SETON                     39
|    C                     WRITEPT1
     C                     Z-ADD0         @H602
     C                     Z-ADD0         @H606
     C                     Z-ADD0         @H605
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR -- HAS DATA
     C*==============================================================*
06===C           R8900     BEGSR
|    C*
|    C                     WRITEPT2
|    C                     WRITEPE2
     C                     Z-ADD0         @@H602
     C                     Z-ADD0         @@H606
     C                     Z-ADD0         @@H605
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR -- NO DATA
     C*==============================================================*
07===C           R8999     BEGSR
|    C*
|    C                     EXSR R1000
|    C*
|    C                     WRITEPH1
|    C*
|    C                     WRITEPE9
|    C*
07===C                     ENDSR
