     H****************************************************************
     FPYH4PF  IP  E           K        DISK
     FPYH5PF  UF  E           K        DISK                      A
     I*================================================================
     I           UDS
     I                                      101 110 $USER
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      201 2060$A8YM
     I                                      201 2040$A8Y
     I                                      211 2160DDATE
     I                                      201 2040DSYY
     I*
     I                                      501 502 DEM01
     I                                      503 5050DYY
     I                                      506 5090WYY
     I*
     I                                      600 6050DEYYMM
     I                                      606 606 DETYPE
     I            DS
     I                                        1   80DXDATE
     I                                        1   40DXYY
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYH5     KLIST
     C                     KFLD           H501             公司編號
     C                     KFLD           H502             員工編號
     C                     KFLD           H503             異動日期
     C*                    KFLD           H504             異動別
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*產生退休金提撥異動檔
     C           H408      IFNE 0
     C                     CLEARH50
     C                     MOVE H401      H501
     C                     MOVE H402      H502
     C                     Z-ADD20050701  H503
     C                     MOVE '1'       H504
     C           KEYH5     CHAINPYH5PF               40
     C                     Z-ADDH407      H505
     C                     Z-ADDH408      H507
     C                     Z-ADDH409      H506
     C                     Z-ADD$A8YMD    H597
     C                     TIME           H598
     C                     MOVEL$USER     H599
     C   40                WRITEH50
     C  N40                UPDATH50
     C                     END
