     FPYH309D CF  E                    WORKSTN
     FSYCMPF  IF  E           K        DISK
     ILDA        UDS
     I                                      111 1160DDATE
      *
     I                                      501 502 COMP
     I                                      522 5250DYYMM
     I                                      511 5160YYMM6
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN96     PARM *IN96     IN96    1
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     SETON                     27
     C  N96                EXSR RTN100                     *INIT VALUE
     C           *IN99     DOUEQ'0'
     C                     EXSR RTN200                     .GET KEY-IN
     C                     EXSR RTN400                     .CHECK RIGHT?
     C                     END
     C*
     C           191100    ADD  DYYMM     YYMM6
     C*
     C           *NAMVAR   DEFN *LDA      LDA
     C                     OUT  *NAMVAR
      *
      *
     C                     RETRN
      *==============================================================*
      *          RTN100....INITIAL VALUE
      *==============================================================*
     CSR         RTN100    BEGSR
     C                     MOVE *BLANK    COMP
     C                     Z-ADD0         DYYMM
     C                     MOVEL'0'       $PENV
     C                     ENDSR
      *==============================================================*
      *          RTN200....CHECK SCREEN FIELDS
      *==============================================================*
     CSR         RTN200    BEGSR
      *
     C                     EXFMTDSPD1
     C                     MOVEA*ALL'0'   *IN,60
     C                     SETOF                     96    .INIT INDIC
      *
     C   03                SETON                     LR
     C   03                RETRN
      *
     C                     ENDSR
      *===============================================================*
      *          RTN400....CHECK DATA FROM SCREEN KEY-IN
      *===============================================================*
     CSR         RTN400    BEGSR
     C           COMP      IFEQ *BLANK
     C                     SETON                     619899
     C                     ELSE
     C           COMP      CHAINCM0                  40
     C           *IN40     IFEQ '1'
     C                     SETON                     619499
     C                     END
     C                     END
     C   99                GOTO END400
     C           DYYMM     MULT 100       WYMD    60
     C                     ADD  1         WYMD
     C                     CALL 'P04'
     C                     PARM           WYMD    60
     C                     PARM           WCHK    1
     C           WCHK      IFEQ 'N'
     C                     SETON                     629599
     C                     END
     C   99                GOTO END400
      *
     CSR         END400    ENDSR
