      ****************************************************************
     FPYH4JF01IP  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYH306P O   E             39     PRINTER
     I*---------------------------------------------------------------
     I*DA        UDS
     I*                                     111 1160DDATE
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C           H401      CHAINCM0                  40
     C   40                MOVE *BLANK    CM03
     C*
     C  N10                WRITEPH1
     C                     SETON                     10
     C*
     C                     EXSR RTN100
     C*
     CLR                   WRITEPT1
      *==============================================================*
      *          RTN100... CALCULATE DETAIL
      *==============================================================*
     C           RTN100    BEGSR
     C*
     C           EM03      IFNE *BLANK
     C                     MOVELEM03      NAME
     C                     ELSE
     C                     MOVEL'XXXX'    NAME
     C                     END
     C*
     C*
     C                     MOVELH402      X402    5
     C*
     C                     WRITEPD1                    39
     C      39             WRITEPH1
      *
     C                     ADD  1         SUM1    60        ¤H¼Æ²Ö­p
     C*
     C                     ENDSR
