     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : PYR1132                                    *
     H*    PROGRAM NAME :離職人數統計表                            *
     H*    AUTHOR       : A1226 PETER                                *
     H*    CREATE DATE  : 1997/01/14                                 *
     H*    UPDATE DATE  : 2000/08/19 A1274                           *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYEMPF  IP  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR113P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    W1      4   4  6
     E                    W2      6   6  6
     E*---------------------------------------------------------------
     IEM0
     I                                              EM041 L1
     I                                              EM042 L1
     I                                              EM043 L1
     I                                              EM044 L1
     I*
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I*
     I           UDS
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DEM01
     I                                      503 509 DEM041
     I                                      510 516 DEM042
     I                                      517 5240DYMD
     I                                      517 5220WYM
     I                                      523 5240DD
     I                                      525 5280DYM
     I*
     I            DS
     I                                        1   80EM19
     I                                        1   60EM19YM
     I*
     I            DS
     I                                        1   80EM13
     I                                        1   60EM13YM
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    KEY
     C*==============================================================*
     C           KEYDP     KLIST
     C                     KFLD           DP011
     C                     KFLD           DP012
     C                     KFLD           DP013
     C                     KFLD           DP014
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
  01-C           *INL1     IFEQ '1'
    C                     MOVELEM041     DP011
    C                     MOVELEM042     DP012
    C                     MOVELEM043     DP013
    C                     MOVEL*BLANK    DP014
    C           KEYDP     CHAINDP0                  40
    C   40                MOVEL*BLANK    DP02
    C*                    MOVELDP02      PDP02H
    C*                    SETON                     39
  01-C                     END
     C*DATA SELECT
     C                     EXSR RTN200
     C*
     CL1 10                EXSR RTN810
     CLR 10                EXSR RTN890
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVEL*BLANK    DFMT
|    C                     MOVEL*BLANK    DTYPE
|    C           DEM01     CHAINCM0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELCM14      DFMT
|   C                     MOVELCM15      DTYPE
| 01*C                     ELSE
|   C                     MOVEL*BLANK    CM03
| 01-C                     END
|    C*
|    C                     SETON                     3910
|    C                     SETOF                     31
|    C                     Z-ADD1         DD
|    C                     Z-ADD*ZERO     PT11
|    C                     Z-ADD*ZERO     PT12
|    C                     Z-ADD*ZERO     PT13
|    C                     Z-ADD*ZERO     PT21
|    C                     Z-ADD*ZERO     PT22
|    C                     Z-ADD*ZERO     PT23
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN200... DETAIL
     C*==============================================================*
02===C           RTN200    BEGSR
|    C*
|    C                     MOVELEM041     DP011
|    C                     MOVELEM042     DP012
|    C                     MOVELEM043     DP013
|    C                     MOVELEM044     DP014
|    C*到職日期
|    C                     Z-ADD*ZERO     PEM13
| 01-C           EM13      IFNE *ZERO
|   C*                    CALL 'P31'
|   C*                    PARM EM13      P3101I  80
|   C*                    PARM '2'       P3102I  1
|   C*                    PARM '1'       P3103I  1
|   C*                    PARM DFMT      P3104I  1
|   C*                    PARM DTYPE     P3105I  1
|   C*                    PARM           P3111O  80
|   C                     Z-ADDEM13      PEM13
| 01-C                     END
|    C*
|    C           KEYDP     CHAINDP0                  40
|    C           KEYDP     CHAINDP0                  40
|    C   40                MOVEL*BLANK    DP02
|    C*
| 02-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 02-C                     END
|    C*
| 03-C           EM19      IFLT DYMD
|   C           EM19      ANDNE*ZERO
|   C                     GOTO END200
| 03-C                     END
|    C*
|    C*離職
| 04-C           EM19YM    IFEQ WYM
|   C*
|   C                     CALL 'P32'
|   C                     PARM EM13      P3201I  80
|   C                     PARM EM19      P3202I  80
|   C                     PARM '2'       P3203I  1
|   C                     PARM '1'       P3204I  1
|   C                     PARM           P3211O  90
|   C           P3211O    DIV  365       EM13N     H
|   C*
|   C                     MOVE *BLANK    EM110N
| 05-C           EM110     IFNE ' '
|   C                     MOVELEM110     X       10
     C           X         IFGE 1
     C           X         ANDLE4
|   C                     MOVELW1,X      EM110N
| 05-C                     END
| 05-C                     END
|   C*
|   C                     MOVE *BLANK    EM111N
| 06-C           EM111     IFNE ' '
|   C                     MOVELEM111     Y       10
     C           Y         IFGE 1
     C           Y         ANDLE6
|   C                     MOVELW2,Y      EM111N
| 06-C                     END
| 06-C                     END
|   C*
|   C                     WRITEPD1
|   C*
|   C                     ADD  1         PT11
|   C                     SETON                     3130
|   C*
| 04-C                     END
|    C                     ADD  1         PT12
|    C*
02===C           END200    ENDSR
     C*==============================================================*
     C*          RTN810... LEVEL BREAK 1
     C*==============================================================*
03===C           RTN810    BEGSR
|    C*
| 01-C           PT12      IFEQ *ZERO
|   C                     Z-ADD100       PT13
| 01*C                     ELSE
|   C           PT11      DIV  PT12      Z       64
|   C           Z         MULT 100       PT13
| 01-C                     END
|    C*
| 02-C           *IN30     IFEQ '1'
|   C                     WRITEPT1
| 02-C                     END
|    C*
|    C                     SETOF                     3130
|    C*
|    C                     ADD  PT11      PT21
|    C                     ADD  PT12      PT22
|    C                     Z-ADD*ZERO     PT11
|    C                     Z-ADD*ZERO     PT12
|    C                     Z-ADD*ZERO     PT13
|    C*
03===C           END810    ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK LR
     C*==============================================================*
04===C           RTN890    BEGSR
|    C*
| 01-C           PT22      IFEQ *ZERO
|   C                     Z-ADD100       PT23
| 01*C                     ELSE
|   C           PT21      DIV  PT22      Z       64
|   C           Z         MULT 100       PT23
| 01-C                     END
|    C*
|    C                     WRITEPT2
|    C                     WRITEPT3
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
05===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
**
正職兼職約聘講師
**
管理幕僚業務工程門市兼職
