     H****************************************************************
     H*   PROGRAM NAME : PYR1252                                     *
     H*   AUTHER       : TOM T.                                      *
     H*   CREATE DATE  : 89/09/01                                    *
     H*   UPDATE DATE  :                                             *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR1251C                                    *
     H*   PURPOSE      :
     H*   INDICATORS   :                                             *
     H****************************************************************
     FPYTXJF01IP  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYQJPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR125P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    W1      6   6  2
     E                    W2      1   6 12
     E*
     ITXJF01
     I                                              TX02  L1
     I                                              EM041 L2
     I                                              EM042 L2
     I                                              EM043 L2
     I                                              EM044 L2
     I*DATA AREA
     I           UDS
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DTX01
     I                                      503 509 DEM041
     I                                      510 516 DEM042
     I**                                    523 5280DTX041
     I**                                    529 5340DTX042
     I                                      535 536 DTX03
     I                                      537 544 DTX021
     I                                      545 552 DTX022
     I                                      553 5600WTX041
     I                                      561 5680WTX042
     I                                      569 569 DFMT
     I                                      570 570 DTYPE
     I                                      601 6060DTX041
     I                                      608 6130DTX042
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYDP     KLIST                           *PYDPPF
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100                     *WRITE PD1
     C*
     CL1                   SETON                     32
     CL2                   SETON                     31
     CLR 10                WRITEPE2
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           DTX01     CHAINCM0                  40
|    C   40                MOVE *BLANK    CM03
|    C*
|    C                     Z-ADD1         WI      20
|    C           DTX03     LOKUPW1,WI                    40
|    C   40                MOVELW2,WI     PH11
|    C*
|    C                     SETON                     103132
|    C                     SETON                     39
|    C                     MOVEL'Y'       $DATA
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... INITIAL GET HEADING
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
| 01-C           *INL2     IFEQ '1'
|   C           KEYDP     CHAINDP0                  40
|   C   40                MOVEL*BLANK    DP02
| 01-C                     END
|    C*
|    C           TX12      CHAINQJ0                  40
|    C   40                MOVEL*BLANK    QJ02
|    C*
| 02-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
|   C                     SETON                     3132
| 02-C                     END
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM TX04      P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM DFMT      P3104I  1
|    C*                    PARM DTYPE     P3105I  1
|    C*                    PARM           P3111O  80
|    C                     Z-ADDTX04      PTX04   60
|    C*
|    C                     WRITEPD1
|    C                     SETOF                     3132
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
03===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
03===C                     ENDSR
**
D1D2D5D6Z1Z2
**
留職停薪　
留職復職　
長期病假　
長病假復職
離職　　　
退休
