     H****************************************************************
     H*   PROGRAM NAME : PYR1012                                     *
     H*   AUTHER       : A1070 CHOIE                                 *
     H*   CREATE DATE  : 79/07/05                                    *
     H*   UPDATE DATE  : 81/10/06 PHILIP                             *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR1011C                                    *
     H*   PURPOSE      :
     H*   INDICATORS   :                                             *
     H****************************************************************
     FPYR101WFIP  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR101P O   E             39     PRINTER
     E*---------------------------------------------------------------
     IWF0
     I                                              WF01  L4
     I                                              WF02  L3
     I                                              WF03  L2
     I                                              WF04  L1
     I*
     ILDA        UDS
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      201 2080$A8YMD
     I                                      500 500 $DATA
     I*
     I                                      501 502 DEM01
     I                                      540 546 DEM041
     I                                      547 553 DEM042
     I*                                     503 507 DEM041
     I*                                     508 512 DEM042
     I                                      513 520 DEM021
     I                                      532 539 DEM022
     I                                      523 523 DYN
     I                                      530 530 EM1101
     I                                      531 531 EM1102
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN CM14      DFMT
     C           *LIKE     DEFN CM15      DTYPE
     C*---------------------------------------------------------------
     C           KEYDP     KLIST                           *SYAAPF
     C                     KFLD           DP011
     C                     KFLD           DP012
     C                     KFLD           DP013
     C                     KFLD           DP014
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
  01-C           *INL2     IFEQ '1'
    C                     MOVELWF01      DP011
    C                     MOVELWF02      DP012
    C                     MOVELWF03      DP013
    C                     MOVEL*BLANK    DP014
    C           KEYDP     CHAINDP0                  40
    C   40                MOVEL*BLANK    DP02
    C*                    MOVELDP02      PDP02H
    C*                    SETON                     39
  01-C                     END
     C*
     C                     EXSR RTN100
     C*
     C*L1 10                EXSR RTN810
     C*L2 10                EXSR RTN820
     C*L3 10                EXSR RTN830
     C*L4 10                EXSR RTN840
     CLR 10                EXSR RTN890
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   *NAMVAR
|    C           DEM01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C                     MOVE CM14      DFMT
|    C                     MOVE CM15      DTYPE
|    C*
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C                     Z-ADD*ZERO     PT11
|    C                     Z-ADD*ZERO     PT21
|    C                     Z-ADD*ZERO     PT31
|    C                     Z-ADD*ZERO     PT41
|    C                     Z-ADD*ZERO     PT51
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     MOVELWF01      EM041
|    C                     MOVELWF02      EM042
|    C                     MOVELWF03      EM043
|    C                     MOVELWF04      EM044
|    C                     MOVELWF05      DP02
|    C                     MOVELWF09      JT02
|    C                     MOVELWF06      EM02
|    C                     MOVELWF07      EM03
|    C                     MOVELWF10      EM06
|    C                     MOVELWF11      EM07
|    C                     MOVELWF12      EM32
|    C                     MOVELWF13      EM31
|    C                     MOVELWF15      EM40
|    C                     MOVELWF16      EM38
|    C                     MOVELWF17      EM11
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM WF08      P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM DFMT      P3104I  1
|    C*                    PARM DTYPE     P3105I  1
|    C*                    PARM           P3111O  80
|    C                     Z-ADDWF08      DEM13
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM WF14      P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM DFMT      P3104I  1
|    C*                    PARM DTYPE     P3105I  1
|    C*                    PARM           P3111O  80
|    C                     Z-ADDWF14      DEM33
|    C*
|    C                     WRITEPD1
|    C*
|    C*                    ADD  1         PT11
|    C                     ADD  1         PT51
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN810... LEVEL BREAK 1
     C*==============================================================*
03===C           RTN810    BEGSR
|    C*
|    C                     WRITEPT1
|    C*
|    C                     ADD  PT11      PT21
|    C                     Z-ADD*ZERO     PT11
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN820... LEVEL BREAK 2
     C*==============================================================*
04===C           RTN820    BEGSR
|    C*
|    C                     WRITEPT2
|    C*
|    C                     ADD  PT21      PT31
|    C                     Z-ADD*ZERO     PT21
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN830... LEVEL BREAK 3
     C*==============================================================*
05===C           RTN830    BEGSR
|    C*
|    C                     WRITEPT3
|    C*
|    C                     ADD  PT31      PT41
|    C                     Z-ADD*ZERO     PT31
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RTN840... LEVEL BREAK 4
     C*==============================================================*
06===C           RTN840    BEGSR
|    C*
|    C                     WRITEPT4
|    C*
|    C                     ADD  PT41      PT51
|    C                     Z-ADD*ZERO     PT41
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK LR --- HAS DATA
     C*==============================================================*
07===C           RTN890    BEGSR
|    C*
|    C                     WRITEPT5
|    C*
|    C                     Z-ADD*ZERO     PT51
|    C*
07===C           END890    ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
08===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
08===C           END899    ENDSR
