     H****************************************************************
     H*   PROGRAM NAME : PYR1062                                     *
     H*   AUTHER       : A1070 CHOIE                                 *
     H*   CREATE DATE  : 79/07/11                                    *
     H*   UPDATE DATE  : 88/11/26 A1274 EVA                          *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR1061C                                    *
     H*   PURPOSE      :
     H*   INDICATORS   :                                             *
     H****************************************************************
     FPYEMPF  IP  E           K        DISK
     FPYT4LF02IF  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR106P O   E             39     PRINTER
     E*---------------------------------------------------------------
     IEM0
     I                                              EM041 L3
     I                                              EM042 L2
     I                                              EM043 L1
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I*
     I           UDS
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DEM01
     I                                      503 509 DEM041
     I                                      510 516 DEM042
     I*                                     513 5160DYM
     I                                      517 5220WDYM
     I                                      601 6040DYM
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYT4     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C           KEYDP     KLIST
     C                     KFLD           DP011
     C                     KFLD           DP012
     C                     KFLD           DP013
     C                     KFLD           DP014
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
  01-C           *INL1     IFEQ '1'
    C                     MOVELEM041     DP011
    C                     MOVELEM042     DP012
    C                     MOVELEM043     DP013
    C                     MOVEL*BLANK    DP014
    C           KEYDP     CHAINDP0                  40
    C   40                MOVEL*BLANK    DP02
    C*                    MOVELDP02      PDP02H
    C*                    SETON                     39
  01-C                     END
     C*
     C                     EXSR RTN100
     C*
     C*L1 10                EXSR RTN810
     C*L2 10                EXSR RTN820
     C*L3 10                EXSR RTN830
     CLR 10                EXSR RTN890
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           DEM01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C*
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C                     Z-ADD*ZERO     PT11
|    C                     Z-ADD*ZERO     PT21
|    C                     Z-ADD*ZERO     PT31
|    C                     Z-ADD*ZERO     PT41
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     IN   PTDA01
|    C*
|    C                     MOVELEM041     DP011
|    C                     MOVELEM042     DP012
|    C                     MOVELEM043     DP013
|    C                     MOVELEM044     DP014
|    C           KEYDP     CHAINDP0                  40
|    C           KEYDP     CHAINDP0                  40
|    C   40                MOVEL*BLANK    DP02
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
|    C                     MOVEL*BLANKS   T401
|    C           KEYT4     SETGTT40
|    C           KEYT4     REDPET40                      40
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM EM13      P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM DFMT      P3104I  1
|    C*                    PARM DTYPE     P3105I  1
|    C*                    PARM           P3111O  80
|    C                     Z-ADDEM13      PEM13
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM EM20      P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM DFMT      P3104I  1
|    C*                    PARM DTYPE     P3105I  1
|    C*                    PARM           P3111O  80
|    C                     Z-ADDEM20      PEM20
|    C*
|    C                     WRITEPD1
|    C*                    ADD  1         PT11
|    C                     ADD  1         PT41
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN810... LEVEL BREAK 1
     C*==============================================================*
03===C           RTN810    BEGSR
|    C*
|    C                     WRITEPT1
|    C*
|    C                     ADD  PT11      PT21
|    C                     Z-ADD*ZERO     PT11
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN820... LEVEL BREAK 2
     C*==============================================================*
04===C           RTN820    BEGSR
|    C*
|    C                     WRITEPT2
|    C*
|    C                     ADD  PT21      PT31
|    C                     Z-ADD*ZERO     PT21
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN830... LEVEL BREAK 3
     C*==============================================================*
05===C           RTN830    BEGSR
|    C*
|    C                     WRITEPT3
|    C*
|    C                     ADD  PT31      PT41
|    C                     Z-ADD*ZERO     PT31
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK LR
     C*==============================================================*
06===C           RTN890    BEGSR
|    C*
|    C                     WRITEPT4
|    C*
|    C                     Z-ADD*ZERO     PT41
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
07===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
07===C                     ENDSR
