     H****************************************************************
     H*    PROGRAM NAME : PYR1102                                    *
     H*    AUTHOR       : A1070 CHOIE                                *
     H*    CREATE DATE  : 79/07/04                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     H*    SUBSYSTEM    :人事薪資系統                              *
     H*    PROCEDURE    :                                            *
     H*    REMARK       :                                            *
     H****************************************************************
     FPYEMPF  IP  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR110P O   E             39     PRINTER
     I*---------------------------------------------------------------
     IEM0
     I                                              EM041 L4
     I                                              EM042 L3
     I                                              EM043 L2
     I                                              EM044 L1
     I*
     I           UDS
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DEM01
     I                                      503 509 DEM041
     I                                      510 516 DEM042
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYDP     KLIST
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C*==============================================================*
     C*          MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100
     C*
     CL1 10                EXSR RTN810
     C*L2 10                EXSR RTN820
     C*L3 10                EXSR RTN830
     C*L4 10                EXSR RTN840
     CLR 10                EXSR RTN890
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           DEM01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C*
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C*
|    C                     EXSR RTN811
|    C                     EXSR RTN821
|    C                     EXSR RTN831
|    C                     EXSR RTN841
|    C                     EXSR RTN891
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*
| 01-C           EM104     IFEQ 'N'
| 02-C           EM32      IFEQ 'M'
|   C                     ADD  1         PD14
| 02*C                     ELSE
|   C                     ADD  1         PD15
| 02-C                     END
| 01-C                     END
|    C*
| 03-C           EM104     IFEQ 'Y'
| 04-C           EM32      IFEQ 'M'
|   C                     ADD  1         PD16
| 04*C                     ELSE
|   C                     ADD  1         PD17
| 04-C                     END
| 03-C                     END
|    C*
| 05-C           EM10      IFEQ '2'
| 06-C           EM32      IFEQ 'M'
|   C                     ADD  1         PD18
| 06*C                     ELSE
|   C                     ADD  1         PD19
| 06-C                     END
| 05-C                     END
|    C*
| 07-C           EM10      IFEQ '3'
| 08-C           EM32      IFEQ 'M'
|   C                     ADD  1         PD110
| 08*C                     ELSE
|   C                     ADD  1         PD111
| 08-C                     END
| 07-C                     END
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN810... LEVEL BREAK 1
     C*==============================================================*
03===C           RTN810    BEGSR
|    C*
|    C           KEYDP     CHAINDP0                  40
|    C   40                MOVEL*BLANK    DP02
|    C*
|    C           PD14      ADD  PD16      PD112
|    C                     ADD  PD18      PD112
|    C                     ADD  PD110     PD112
|    C           PD15      ADD  PD17      PD113
|    C                     ADD  PD19      PD113
|    C                     ADD  PD111     PD113
|    C           PD112     ADD  PD113     PD114
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
|    C                     WRITEPD1
|    C*
|    C                     ADD  PD14      PT44
|    C                     ADD  PD15      PT45
|    C                     ADD  PD16      PT46
|    C                     ADD  PD17      PT47
|    C                     ADD  PD18      PT48
|    C                     ADD  PD19      PT49
|    C                     ADD  PD110     PT410
|    C                     ADD  PD111     PT411
|    C                     ADD  PD112     PT412
|    C                     ADD  PD113     PT413
|    C                     ADD  PD114     PT414
|    C*
|    C                     EXSR RTN811
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN811... LEVEL BREAK 1 FIELD CLEAR
     C*==============================================================*
04===C           RTN811    BEGSR
|    C*
|    C                     Z-ADD*ZERO     PD14
|    C                     Z-ADD*ZERO     PD15
|    C                     Z-ADD*ZERO     PD16
|    C                     Z-ADD*ZERO     PD17
|    C                     Z-ADD*ZERO     PD18
|    C                     Z-ADD*ZERO     PD19
|    C                     Z-ADD*ZERO     PD110
|    C                     Z-ADD*ZERO     PD111
|    C                     Z-ADD*ZERO     PD112
|    C                     Z-ADD*ZERO     PD113
|    C                     Z-ADD*ZERO     PD114
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN820... LEVEL BREAK 2
     C*==============================================================*
05===C           RTN820    BEGSR
|    C*
|    C                     WRITEPT1
|    C*
|    C                     ADD  PT14      PT24
|    C                     ADD  PT15      PT25
|    C                     ADD  PT16      PT26
|    C                     ADD  PT17      PT27
|    C                     ADD  PT18      PT28
|    C                     ADD  PT19      PT29
|    C                     ADD  PT110     PT210
|    C                     ADD  PT111     PT211
|    C                     ADD  PT112     PT212
|    C                     ADD  PT113     PT213
|    C                     ADD  PT114     PT214
|    C*
|    C                     EXSR RTN821
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RTN821... LEVEL BREAK 1 FIELD CLEAR
     C*==============================================================*
06===C           RTN821    BEGSR
|    C*
|    C                     Z-ADD*ZERO     PT14
|    C                     Z-ADD*ZERO     PT15
|    C                     Z-ADD*ZERO     PT16
|    C                     Z-ADD*ZERO     PT17
|    C                     Z-ADD*ZERO     PT18
|    C                     Z-ADD*ZERO     PT19
|    C                     Z-ADD*ZERO     PT110
|    C                     Z-ADD*ZERO     PT111
|    C                     Z-ADD*ZERO     PT112
|    C                     Z-ADD*ZERO     PT113
|    C                     Z-ADD*ZERO     PT114
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          RTN830... LEVEL BREAK 3
     C*==============================================================*
07===C           RTN830    BEGSR
|    C*
|    C                     Z-ADD*ZERO     WRATE   73
| 01-C           PT214     IFNE *ZERO
|   C           PT212     DIV  PT214     WRATE     H
| 01-C                     END
|    C           WRATE     MULT 100       PT2C      H
|    C*
|    C                     Z-ADD*ZERO     WRATE
| 02-C           PT214     IFNE *ZERO
|   C           PT213     DIV  PT214     WRATE     H
| 02-C                     END
|    C           WRATE     MULT 100       PT2D      H
|    C*
|    C                     WRITEPT2
|    C*
|    C                     ADD  PT24      PT34
|    C                     ADD  PT25      PT35
|    C                     ADD  PT26      PT36
|    C                     ADD  PT27      PT37
|    C                     ADD  PT28      PT38
|    C                     ADD  PT29      PT39
|    C                     ADD  PT210     PT310
|    C                     ADD  PT211     PT311
|    C                     ADD  PT212     PT312
|    C                     ADD  PT213     PT313
|    C                     ADD  PT214     PT314
|    C*
|    C                     EXSR RTN831
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          RTN831... LEVEL BREAK 3 FIELD CLEAR
     C*==============================================================*
08===C           RTN831    BEGSR
|    C*
|    C                     Z-ADD*ZERO     PT24
|    C                     Z-ADD*ZERO     PT25
|    C                     Z-ADD*ZERO     PT26
|    C                     Z-ADD*ZERO     PT27
|    C                     Z-ADD*ZERO     PT28
|    C                     Z-ADD*ZERO     PT29
|    C                     Z-ADD*ZERO     PT210
|    C                     Z-ADD*ZERO     PT211
|    C                     Z-ADD*ZERO     PT212
|    C                     Z-ADD*ZERO     PT213
|    C                     Z-ADD*ZERO     PT214
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          RTN840... LEVEL BREAK 4
     C*==============================================================*
09===C           RTN840    BEGSR
|    C*
|    C                     Z-ADD*ZERO     WRATE
| 01-C           PT314     IFNE *ZERO
|   C           PT312     DIV  PT314     WRATE     H
| 01-C                     END
|    C           WRATE     MULT 100       PT3C      H
|    C*
|    C                     Z-ADD*ZERO     WRATE
| 02-C           PT314     IFNE *ZERO
|   C           PT313     DIV  PT314     WRATE     H
| 02-C                     END
|    C           WRATE     MULT 100       PT3D      H
|    C*
|    C                     WRITEPT3
|    C                     SETON                     39
|    C*
|    C                     ADD  PT34      PT44
|    C                     ADD  PT35      PT45
|    C                     ADD  PT36      PT46
|    C                     ADD  PT37      PT47
|    C                     ADD  PT38      PT48
|    C                     ADD  PT39      PT49
|    C                     ADD  PT310     PT410
|    C                     ADD  PT311     PT411
|    C                     ADD  PT312     PT412
|    C                     ADD  PT313     PT413
|    C                     ADD  PT314     PT414
|    C*
|    C                     EXSR RTN841
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          RTN841... LEVEL BREAK 1 FIELD CLEAR
     C*==============================================================*
10===C           RTN841    BEGSR
|    C*
|    C                     Z-ADD*ZERO     PT34
|    C                     Z-ADD*ZERO     PT35
|    C                     Z-ADD*ZERO     PT36
|    C                     Z-ADD*ZERO     PT37
|    C                     Z-ADD*ZERO     PT38
|    C                     Z-ADD*ZERO     PT39
|    C                     Z-ADD*ZERO     PT310
|    C                     Z-ADD*ZERO     PT311
|    C                     Z-ADD*ZERO     PT312
|    C                     Z-ADD*ZERO     PT313
|    C                     Z-ADD*ZERO     PT314
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK LR
     C*==============================================================*
11===C           RTN890    BEGSR
|    C*
|    C                     Z-ADD*ZERO     WRATE
| 01-C           PT414     IFNE *ZERO
|   C           PT412     DIV  PT414     WRATE     H
| 01-C                     END
|    C           WRATE     MULT 100       PT4C      H
|    C*
|    C                     Z-ADD*ZERO     WRATE
| 02-C           PT414     IFNE *ZERO
|   C           PT413     DIV  PT414     WRATE     H
| 02-C                     END
|    C           WRATE     MULT 100       PT4D      H
|    C*
|    C                     WRITEPT4
|    C                     WRITEPE1
|    C*
|    C                     EXSR RTN891
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          RTN891... LEVEL BREAK LR FIELD CLEAR
     C*==============================================================*
12===C           RTN891    BEGSR
|    C*
|    C                     Z-ADD*ZERO     PT44
|    C                     Z-ADD*ZERO     PT45
|    C                     Z-ADD*ZERO     PT46
|    C                     Z-ADD*ZERO     PT47
|    C                     Z-ADD*ZERO     PT48
|    C                     Z-ADD*ZERO     PT49
|    C                     Z-ADD*ZERO     PT410
|    C                     Z-ADD*ZERO     PT411
|    C                     Z-ADD*ZERO     PT412
|    C                     Z-ADD*ZERO     PT413
|    C                     Z-ADD*ZERO     PT414
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
13===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
13===C                     ENDSR
