     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : PYR1152                                    *
     H*    PROGRAM NAME :人員分類分析表                            *
     H*    AUTHOR       : A1226 PETER                                *
     H*    CREATE DATE  : 97/08/11                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FPYEMPF  IP  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYR115P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E*---------------------------------------------------------------
     IEM0
     I                                              EM041 L1
     I                                              EM042 L1
     I                                              EM043 L1
     I                                              EM044 L1
     I            DS
     I                                        1  200H1
     I                                        1   20PH11
     I                                        3   40PH13
     I                                        5   60PH15
     I                                        7   80PH17
     I                                        9  100PH19
     I                                       11  120PH111
     I                                       13  140PH113
     I                                       15  160PH115
     I                                       17  180PH117
     I                                       19  200PH119
     I            DS
     I                                        1  200H2
     I                                        1   20PH12
     I                                        3   40PH14
     I                                        5   60PH16
     I                                        7   80PH18
     I                                        9  100PH110
     I                                       11  120PH112
     I                                       13  140PH114
     I                                       15  160PH116
     I                                       17  180PH118
     I                                       19  200PH11A
     I           UDS
     I                                      203 2080DDATE
     I                                      203 2040DDATEY
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DEM01
     I                                      503 509 DEM041
     I                                      510 516 DEM042
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYDP     KLIST
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R0100
     C*
     C                     EXSR R2000
     C*
     CL1 10                EXSR R8100
     CLR 10                EXSR R8900
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R0100     INITIAL PROCESS
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     SETON                     1039
|    C*
|    C           DEM01     CHAINCM0                  40
|    C   40                MOVE *BLANK    CM03
|    C*
|    C                     MOVEL'Y'       $DATA
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL PROCESS
     C*==============================================================*
02===C           R2000     BEGSR
|    C*工作類別
| 01-C                     SELEC
|   C           EM111     WHEQ 'B'
|   C                     ADD  1         PD11
|   C           EM111     WHEQ 'F'
|   C                     ADD  1         PD12
|   C           EM111     WHEQ 'M'
|   C                     ADD  1         PD13
|   C           EM111     WHEQ 'P'
|   C                     ADD  1         PD14
|   C           EM111     WHEQ 'R'
|   C                     ADD  1         PD15
|   C           EM111     WHEQ 'T'
|   C                     ADD  1         PD16
|   C                     OTHER
|   C                     ADD  1         PD17
| 01-C                     END
|    C*人員分類
| 02-C                     SELEC
|   C           EM109     WHEQ '1'
|   C                     ADD  1         PD18
|   C           EM109     WHEQ '2'
|   C                     ADD  1         PD19
| 02-C                     END
|    C*
|    C                     ADD  1         TOTAL
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          R8100 ... L1 BREAK
     C*==============================================================*
03===C           R8100     BEGSR
|    C*
|    C                     MOVEL*BLANKS   DP02
|    C           KEYDP     CHAINDP0                  40
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                       39
| 01-C                     END
|    C*
|    C                     WRITEPD1
|    C*
|    C                     ADD  PD11      PT11
|    C                     ADD  PD12      PT12
|    C                     ADD  PD13      PT13
|    C                     ADD  PD14      PT14
|    C                     ADD  PD15      PT15
|    C                     ADD  PD16      PT16
|    C                     ADD  PD17      PT17
|    C                     ADD  PD18      PT18
|    C                     ADD  PD19      PT19
|    C*
|    C                     Z-ADD0         PD11
|    C                     Z-ADD0         PD12
|    C                     Z-ADD0         PD13
|    C                     Z-ADD0         PD14
|    C                     Z-ADD0         PD15
|    C                     Z-ADD0         PD16
|    C                     Z-ADD0         PD17
|    C                     Z-ADD0         PD18
|    C                     Z-ADD0         PD19
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          R8900 ... LR BREAK
     C*==============================================================*
04===C           R8900     BEGSR
|    C*
|    C           PT11      DIV  TOTAL     A       65
|    C           A         MULT 100       PT21      H
|    C           PT12      DIV  TOTAL     A
|    C           A         MULT 100       PT22      H
|    C           PT13      DIV  TOTAL     A
|    C           A         MULT 100       PT23      H
|    C           PT14      DIV  TOTAL     A
|    C           A         MULT 100       PT24      H
|    C           PT15      DIV  TOTAL     A
|    C           A         MULT 100       PT25      H
|    C           PT16      DIV  TOTAL     A
|    C           A         MULT 100       PT26      H
|    C           PT17      DIV  TOTAL     A
|    C           A         MULT 100       PT27      H
|    C           PT18      DIV  TOTAL     A
|    C           A         MULT 100       PT28      H
|    C           PT19      DIV  TOTAL     A
|    C           A         MULT 100       PT29      H
|    C*
|    C                     WRITEPT1
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
05===C           R8999     BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR R0100
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
