     H****************************************************************
     H*   PROGRAM NAME : PYR1082                                     *
     H*   AUTHER       : A1070 CHOIE                                 *
     H*   CREATE DATE  : 79/07/11                                    *
     H*   UPDATE DATE  : 88/10/27 A1274 EVA                          *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR1081C                                    *
     H*   PURPOSE      :
     H*   INDICATORS   :                                             *
     H****************************************************************
     FPYEMPF  IP  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYTXLF02IF  E           K        DISK
     FPYR108P O   E             39     PRINTER
     E*---------------------------------------------------------------
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I*
     I           UDS
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DEM01
     I                                      503 509 DEM041
     I                                      510 516 DEM042
     I**                                    513 5180DEM171
     I**                                    519 5240DEM172
     I                                      525 5320WEM171
     I                                      533 5400WEM172
     I                                      601 6060DEM171
     I                                      608 6130DEM172
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C           KEYDP     KLIST
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C*
     C           KEYTX1    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           WEM171
     C*
     C           KEYTX2    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100                     *WRITE PD1
     C*
     CLR 10                WRITEPE2
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL PROCESS
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     IN   PTDA01
|    C           DEM01     CHAINCM0                  40
|    C   40                MOVE *BLANK    CM03
|    C*
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C*
| 01-C           WEM172    IFEQ 0
|   C                     Z-ADD99999999  WEM172
| 01-C                     END
|    C*
| 02-C*          DEM171    IFEQ 010101
|   C*                    Z-ADD*ZERO     WEM171
| 02*C*                    ELSE
|   C                     CALL 'P31'
|   C                     PARM DEM171    P3101I  80
|   C                     PARM '1'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C                     PARM           P3111O  80
|   C                     Z-ADDP3111O    WEM171
| 02-C*                    END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*
|    C*留職歷史記錄列印
|    C           KEYTX1    SETLLTX0
|    C           KEYTX2    READETX0                      42
| 01-C           *IN42     DOWEQ'0'
|   C*
| 02-C           TX04      IFLE WEM172
|   C                     EXSR RTN150
| 02-C                     END
|   C           KEYTX2    READETX0                      42
| 01-C                     END
|    C                     GOTO E100
|    C*
|    C*目前留職資料列印
|    C*          EM11      IFEQ 'R'
|    C*          EM17      ANDGEWEM171
|    C*          EM17      ANDLEWEM172
|    C*                    MOVEL'2'       TX032
|    C*                    Z-ADDEM17      TX06
|    C*
|    C*
|    C*                    Z-ADDEM17      P6201I
|    C*                    Z-ADDEM26      P6202I
|    C*                    CALL 'P62'
|    C*                    PARM           P6201I  60
|    C*                    PARM           P6202I  40
|    C*                    PARM           P6211O  60
|    C*
|    C*                    Z-ADDP6211O    PTX04
|    C*                    EXSR RTN150
|    C*                    END
|    C*
|    C*目前長病資料列印
|    C*          EM11      IFEQ 'S'
|    C*          EM951     ANDGEWEM171
|    C*          EM951     ANDLEWEM172
|    C*                    MOVEL'6'       TX032
|    C*                    Z-ADDEM951     TX06
|    C*                    Z-ADDEM953     TX11
|    C*
|    C*                    Z-ADDEM951     P6201I
|    C*                    Z-ADDEM953     P6202I
|    C*                    CALL 'P62'
|    C*                    PARM           P6201I  60
|    C*                    PARM           P6202I  40
|    C*                    PARM           P6211O  60
|    C*
|    C*                    Z-ADDP6211O    PTX04
|    C*                    EXSR RTN150
|    C*                    END
|    C*
02===C           E100      ENDSR
     C*==============================================================*
     C*          RTN150... PRINT DETAIL
     C*==============================================================*
03===C           RTN150    BEGSR
|    C*
|    C           KEYDP     CHAINDP0                  40
|    C   40                MOVEL*BLANK    DP02
|    C*
|    C                     MOVEL*BLANK    PD11
|    C*******              MOVEL*BLANK    PD12
|    C*
| 01-C           TX031     IFEQ 'D'
| 02-C           TX032     IFEQ '2'
|   C                     MOVEL'*'       PD11
|   C*                    CALL 'P31'
|   C*                    PARM TX04      P3101I  80
|   C*                    PARM '2'       P3102I  1
|   C*                    PARM '1'       P3103I  1
|   C*                    PARM DFMT      P3104I  1
|   C*                    PARM DTYPE     P3105I  1
|   C*                    PARM           P3111O  80
|   C                     Z-ADDTX04      PTX04
|   C**
|   C*                    CALL 'P31'
|   C*                    PARM TX06      P3101I  80
|   C*                    PARM '2'       P3102I  1
|   C*                    PARM '1'       P3103I  1
|   C*                    PARM DFMT      P3104I  1
|   C*                    PARM DTYPE     P3105I  1
|   C*                    PARM           P3111O  80
|   C                     Z-ADDTX06      PTX06
|   C**
| 02*C                     ELSE
|   C*                    CALL 'P31'
|   C*                    PARM TX04      P3101I  80
|   C*                    PARM '2'       P3102I  1
|   C*                    PARM '1'       P3103I  1
|   C*                    PARM DFMT      P3104I  1
|   C*                    PARM DTYPE     P3105I  1
|   C*                    PARM           P3111O  80
|   C                     Z-ADDTX04      PTX06
|   C*
|   C                     Z-ADDTX07      TX11
|   C                     MOVEL'*'       PD11
| 02-C                     END
| 01-C                     END
|    C*
| 03-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 03-C                     END
|    C*
|    C*
|    C                     WRITEPD1
|    C                     Z-ADD0         PTX04
|    C                     Z-ADD0         PTX06
|    C                     SETON                     11
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
04===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
04===C                     ENDSR
