     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYR1021                                    *
     H*    PROGRAM NAME :調動人員資料列印                          *
     H*    AUTHOR       : A1232 ERIC                                 *
     H*    CREATE DATE  : 1997/01/03                                 *
     H*    UPDATE DATE  : 1999/10/02 A1274 EVA                       *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPT#YPF  IF  E           K        DISK
     FPYR102D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DTR01
     I                                      503 509 DEM041
     I                                      510 516 DEM042
     I*                                     513 517 DTR021
     I*                                     518 522 DTR022
     I**                                    523 5280DTR041
     I**                                    529 5340DTR042
     I                                      535 535 DTR03
     I                                      536 536 DTR03E
     I                                      537 544 DTR021
     I                                      545 552 DTR022
     I                                      553 5600WTR041
     I                                      561 5680WTR042
     I                                      569 582 TR03N
     I                                      601 6060DTR041
     I                                      608 6130DTR042
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C                     MOVEL*BLANK    W#Y01  10
     C                     MOVEL*BLANK    W#Y02  10
     C           KEY#Y     KLIST                           *PT#YPF
     C                     KFLD           W#Y01  10
     C                     KFLD           W#Y02  10
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN10     PARM *IN10     IN10    1
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   10                EXSR R0200                      *INIT MSG.
     C  N10                EXSR R0100                      *INIT VALUE
     C*
     C                     MOVEL*BLANK    @PRT    1        *PRINT
  01-C           *IN03     DOUEQ'1'
    C           @PRT      OREQ 'Y'
    C                     EXSR R1000                      *SCRN
  01-C                     END
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===CSR         R0100     BEGSR
|    C*
|    C*
|    C                     SETON                     1027
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     MOVE *BLANK    DEM041
|    C                     MOVE *BLANK    DEM042
|    C                     MOVE *BLANK    DTR021
|    C                     MOVE *BLANK    DTR022
|    C                     Z-ADD0         DTR041
|    C                     Z-ADD0         DTR042
|    C                     Z-ADD0         WTR041
|    C                     Z-ADD0         WTR042
|    C                     MOVE *BLANK    DTR03
|    C                     MOVE *BLANK    TR03N
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C*公司別
|    C                     MOVEL$COR      DTR01             公司別
| 01-C           $RMK03    IFNE 'Y'
|   C                     SETOF                     32
| 01*C                     ELSE
|   C                     SETON                     32
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ....INITIAL VALUE
     C*==============================================================*
02===CSR         R0200     BEGSR
|    C*
|    C                     IN   LDA
|    C                     SETON                     2799  報表格式MESSAGE
|    C*
| 01-C           $PENV     IFNE '2'                        NOT-BATCH
|   C           $DATA     ANDEQ'N'                        NO-DATA
|   C                     MOVEL'UPT2050' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     GOTO E0200
| 01-C                     END
|    C*
| 02-C           $PENV     IFEQ '0'                        INQUIRY
|   C                     MOVEL'UPT2142' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|    C*
| 03-C           $PENV     IFEQ '1'                        ON-LINE
|   C                     MOVEL'UPT2140' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C*
| 04-C           $PENV     IFEQ '2'                        BATCH
|   C                     MOVEL'UPT2110' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 04-C                     END
|    C*
02===C           E0200     ENDSR
     C*===============================================================*
     C*          R1000  ...SCREEN MAIN PROCESS
     C*===============================================================*
03===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           DTR042    IFEQ 999999
|   C                     Z-ADD0         DTR042
| 01-C                     END
|    C*
| 02-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 02-C                     END
|    C*
| 03-C           *IN04     IFEQ '1'
|   C                     EXSR R1E00                      .PROMPT
|   C                     GOTO E1000
| 03-C                     END
|    C*
|    C                     EXSR R1B00                      .CHECK      ?
|    C*
| 04-C           *IN99     IFEQ *ZERO
|   C                     SETOF                     27
|   C                     SETON                     28    .執行中
|   C                     WRITEDSPD1
|   C                     SETOF                     28
|   C*
|   C                     OUT  LDA
|   C                     MOVEL'Y'       @PRT
| 04-C                     END
|    C*
03===C           E1000     ENDSR
     C*===============================================================*
     C*          R1B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
04===C           R1B00     BEGSR
|    C*
|    C                     IN   PTDA01
|    C* << CHACK 公司別NOT *BLANK >>
| 01-C           DTR01     IFEQ *BLANK
|   C                     SETON                     6199
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DTR01     CM001I  2         公司代號
|    C                     PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C           DFMT      PARM           CM004O  1         日期格式
|    C           DTYPE     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 02-C           CM099O    IFEQ 'N'
|   C                     SETON                     6199
|   C                     MOVEL'US#0099' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
| 03-C           CM099O    IFEQ *BLANK
|   C                     SETON                     6199
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*+<<DATA CHECK>>+++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C*部門別迄值DEM042
| 04-C           DEM042    IFEQ *BLANK
|   C                     MOVEL*ALL'9'   DEM042
| 04-C                     END
|    C*
|    C*員工別迄值DTR042
| 05-C           DTR022    IFEQ *BLANK
|   C                     MOVEL*ALL'9'   DTR022
| 05-C                     END
|    C*
|    C*日期起值DTR041
| 06-C           DTR041    IFEQ *ZERO
|   C                     Z-ADD*ALL'0'   WTR041
|   C                     Z-ADD0         DTR041
| 06*C                     ELSE
| 07-C           DTR041    IFNE 0
|   C                     CALL 'P30'
|   C                     PARM DTR041    P3001I  80
|   C                     PARM '1'       P3002I  1
|   C                     PARM '1'       P3003I  1
|   C                     PARM           P3011O  1
| 08-C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 08-C                     END
| 07-C                     END
|   C   99                GOTO E1B00
|   C*
|   C                     CALL 'P31'
|   C                     PARM DTR041    P3101I  80
|   C                     PARM '1'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           WTR041    PARM           P3111O  80
| 06-C                     END
|    C*
|    C*日期迄值DTR042
| 09-C           DTR042    IFEQ *ZERO
|   C                     Z-ADD*HIVAL    WTR042
|   C                     Z-ADD*ALL'9'   DTR042
| 09*C                     ELSE
| 10-C           DTR042    IFNE *ALL'9'
|   C                     CALL 'P30'
|   C                     PARM DTR042    P3001I  80
|   C                     PARM '1'       P3002I  1
|   C                     PARM '1'       P3003I  1
|   C                     PARM           P3011O  1
| 11-C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 11-C                     END
| 10-C                     END
|   C   99                GOTO E1B00
|   C*
|   C                     CALL 'P31'
|   C                     PARM DTR042    P3101I  80
|   C                     PARM '1'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           WTR042    PARM           P3111O  80
| 09-C                     END
|    C*
|    C*日期區間檢核DTR041 DTR042
| 12-C           WTR041    IFGT WTR042
|   C                     MOVEL'UPT0041' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     646599
| 12-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*部門別區間DEM041 DEM42
| 13-C           DEM041    IFGT DEM042
|   C                     MOVEL'UPT1011' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 13-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*員工別區間DTR021 DTR22
| 14-C           DTR021    IFGT DTR022
|   C                     MOVEL'UPT1011' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 14-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*調動別檢核DTR03
| 15-C           DTR03     IFEQ *BLANK
|   C                     MOVEL*HIVAL    DTR03E
|   C                     MOVEL'全部'  TR03N
| 15*C                     ELSE
|   C                     MOVELDTR03     DTR03E
| 15-C                     END
|    C*
| 16-C           DTR03     IFNE *BLANK
|   C                     MOVEL*BLANK    TR03N  14 P
|   C                     MOVEL'TR03'    W#Y01
|   C                     MOVELDTR03     W#Y02
|   C           KEY#Y     CHAIN#Y0                  40
| 17-C           *IN40     IFEQ '0'
|   C                     CALL 'P65'
|   C                     PARM #Y03      P6501I 80
|   C                     PARM 14        P6502I  30
|   C           TR03N     PARM           P6511O 80
|   C                     PARM           P6512O 80
| 17-C                     END
| 16-C                     END
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C* CHK FUN AUT
| 18-C           $PENV     IFNE '2'
|   C           $INQ      ANDNE'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 18-C                     END
|    C   99                GOTO E1B00
|    C*
04===CSR         E1B00     ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
05===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*部門編號DEM041
| 01-C           #LIN      IFEQ 7
|   C           #COL      ANDGE41
|   C           #COL      ANDLE47
|   C                     CALL 'PYI512'
|   C           DEM041    PARM DEM041    I512I1  7         部門代碼
|   C                     PARM           @RTNC   2          FUN KEY
| 01-C                     END
|    C*部門編號DEM042
| 02-C           #LIN      IFEQ 8
|   C           #COL      ANDGE41
|   C           #COL      ANDLE47
|   C                     CALL 'PYI512'
|   C           DEM042    PARM DEM042    I512I1  7         部門代碼
|   C                     PARM           @RTNC   2          FUN KEY
| 02-C                     END
|    C*
|    C*員工編號DTR021
| 03-C           #LIN      IFEQ 10
|   C           #COL      ANDGE41
|   C           #COL      ANDLE48
|   C                     CALL 'PYI101'
|   C           DTR01     PARM DTR01     P101I1  2         公司別
|   C           DTR021    PARM DTR021    P101I2  8         員工　
|   C                     PARM           @RTNC   2          FUN KEY
| 03-C                     END
|    C*員工編號DTR022
| 04-C           #LIN      IFEQ 11
|   C           #COL      ANDGE41
|   C           #COL      ANDLE48
|   C                     CALL 'PYI101'
|   C           DTR01     PARM DTR01     P101I1  2         公司別
|   C           DTR022    PARM DTR022    P101I2  8         員工　
|   C                     PARM           @RTNC   2          FUN KEY
| 04-C                     END
|    C*
|    C*-------------------------------------------------------------***
|    C*調動類別DTR03
| 05-C           #LIN      IFEQ 16
|   C           #COL      ANDGE41
|   C           #COL      ANDLE41
|   C                     CALL 'TRW001'
|   C                     PARM 'TR03'    TR101I 10        調動類別
|   C           DTR03     PARM DTR03     TR102I 10
|   C                     PARM           TR103I 32
|   C                     PARM           TR104I  2
|   C*
|   C                     MOVEL*BLANK    TR03N  14 P
| 06-C           TR103I    IFNE *BLANK
|   C                     CALL 'P65'
|   C                     PARM TR103I    P6501I 80
|   C                     PARM 14        P6502I  30
|   C           TR03N     PARM           P6511O 80        類別說明
|   C                     PARM           P6512O 80
| 06-C                     END
| 05-C                     END
|    C*-------------------------------------------------------------***
|    C*印表機
| 07-C           #LIN      IFEQ 20
|   C           #COL      ANDGE14
|   C           #COL      ANDLE15
|   C                     CALL 'P64I'
|   C           $PRTCD    PARM $PRTCD    P64II1  2
| 07-C                     END
|    C*
05===C           E1E00     ENDSR
     C*==============================================================*
