     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYR2153                                    *
     H*    PROGRAM NAME :考勤刷卡資料表名單　                      *
     H*    AUTHOR       : A1336 KLAUS                                *
     H*    CREATE DATE  : 2001/10/19                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYR215WFIP  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR215P O   E             39     PRINTER
     E*---------------------------------------------------------------*
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DT505
     I                                      533 5360W502Y
     I                                      537 5380W502M
     I*
     I                                      539 5400MONTH
     I                                      541 5420DAY
     I*
     I                                      543 5500WYMD1
     I                                      543 5480DYM1
     I                                      547 5500DAY1
     I                                      543 5460WYY01
     I                                      547 5480WMM01
     I                                      549 5500WDD01
     I*
     I                                      551 5580WYMD2
     I                                      551 5560DYM2
     I                                      555 5580DAY2
     I                                      551 5540WYY02
     I                                      555 5560WMM02
     I                                      557 5580WDD02
     I            DS
     I                                        1   80BEGIN
     I                                        1   60BYM1
     I                                        7   80BDD
     I            DS
     I                                        1   80END
     I                                        1   60EYM2
     I                                        7   80EDD
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *LIKE     DEFN CM14      DFMT
     C           *LIKE     DEFN CM15      DTYPE
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*
     C                     EXSR R2000                      .DETAIL
     C*
     CLR 10                EXSR R8900
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R1000 ... INITIAL PROCESS
     C*==============================================================*
01===C           R1000     BEGSR
|    C*
|    C                     SETON                     1039
|    C*
|    C                     MOVE $C8YMD    DDATE
|    C                     Z-ADDWYMD1     BEGIN   80       *刷卡日起
|    C                     Z-ADDWYMD2     END     80       *刷卡日止
|    C*
|    C           DT505     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM01
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
02===C           R2000     BEGSR
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
|    C                     WRITEPD1
|    C*
02===C           E2000     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR --- HAS DATA
     C*==============================================================*
06===C           R8900     BEGSR
|    C*
|    C*                    WRITEPE1
|    C*
06===C           E8900     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
07===C           R8999     BEGSR
|    C*
|    C                     EXSR R1000
|    C*
|    C                     WRITEPH1
|    C                     WRITEPE9
|    C*
07===C           E8999     ENDSR
