     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYR2162                                    *
     H*    PROGRAM NAME :工時表                                    *
     H*    AUTHOR       : A1386 SHARON                               *
     H*    CREATE DATE  : 2004/12/31                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYR216W UF  E           K        DISK                      A
     I           UDS
     I                                      125 1270$CPY
     I                                      211 2160DDATE
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DT201
     I                                      560 566 DEM041
     I                                      567 573 DEM042
     I                                      513 5180WT2031
     I                                      519 5240WT2032
     I*                                     525 5280DT203
     I                                      529 5340WT203
     I                                      600 6040DT203
     C           KEYW6     KLIST
     C                     KFLD           WT01
     C                     KFLD           WT02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
|    C                     MOVE DT201     WT01
|    C           191100    ADD  DT203     WT02
|    C           KEYW6     SETLLPYR216W
|    C           LOOP      TAG
|    C           KEYW6     READEPYR216W                  40
|    C   40                GOTO ENDSR
|    C           WT04      IFGE DEM041
|    C           WT04      ANDLEDEM042
|    C                     Z-ADDPT14      WT14
|    C                     Z-ADDPT15      WT15
|    C                     Z-ADDPT151     WT151
|    C                     Z-ADDPT152     WT152
|    C                     Z-ADDPT16      WT16
|    C   44                WRITEW60
|    C  N44                UPDATW60
|    C*
|    C                     CLEARW60
|    C                     MOVE EM01      WT01
|    C           191100    ADD  DT203     WT02
|    C                     MOVE DS4       WT4
|    C                     MOVE 'F'       WTSEX
|    C           KEYW6     CHAINPYR216W              44
|    C                     Z-ADDPT11F     WT11
|    C                     Z-ADDPT12F     WT12
|    C                     Z-ADDPT13F     WT13
|    C                     Z-ADDPT14F     WT14
|    C                     Z-ADDPT15F     WT15
|    C                     Z-ADDPT15F1    WT151
|    C                     Z-ADDPT15F2    WT152
|    C                     Z-ADDPT16F     WT16
|    C   44                WRITEW60
|    C  N44                UPDATW60
|    C*
|    C                     CLEARW60
|    C                     MOVE EM01      WT01
|    C           191100    ADD  DT203     WT02
|    C                     MOVE DS4       WT4
|    C                     MOVE 'M'       WTSEX
|    C           KEYW6     CHAINPYR216W              44
|    C                     Z-ADDPT11M     WT11
|    C                     Z-ADDPT12M     WT12
|    C                     Z-ADDPT13M     WT13
|    C                     Z-ADDPT14M     WT14
|    C                     Z-ADDPT15M     WT15
|    C                     Z-ADDPT15M1    WT151
|    C                     Z-ADDPT15M2    WT152
|    C                     Z-ADDPT16M     WT16
|    C   44                WRITEW60
|    C  N44                UPDATW60
|    C                     END
|    C*
|    C                     ADD  PT11      PT21
|    C                     ADD  PT12      PT22
|    C                     ADD  PT13      PT23
|    C*                    ADD  PT14      PT24
|    C                     ADD  PT15      PT25
|    C                     ADD  PT151     PT251
|    C                     ADD  PT152     PT252
|    C*                    ADD  PT16      PT26
|    C*
|    C                     ADD  PT11F     PT21F
|    C                     ADD  PT12F     PT22F
|    C                     ADD  PT13F     PT23F
|    C*                    ADD  PT14F     PT24F
|    C                     ADD  PT15F     PT25F
|    C                     ADD  PT15F1    PT25F1
|    C                     ADD  PT15F2    PT25F2
|    C*                    ADD  PT16F     PT26F
|    C*
|    C                     ADD  PT11M     PT21M
|    C                     ADD  PT12M     PT22M
|    C                     ADD  PT13M     PT23M
|    C*                    ADD  PT14M     PT24M
|    C                     ADD  PT15M     PT25M
|    C                     ADD  PT15M1    PT25M1
|    C                     ADD  PT15M2    PT25M2
|    C*                    ADD  PT16M     PT26M
|    C*
|    C                     EXSR R8010
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR
     C*==============================================================*
06===C           R8900     BEGSR
|    C*
     C           PT21      SUB  PT22      PT24
     C           PT21F     SUB  PT22F     PT24F
     C           PT21M     SUB  PT22M     PT24M
     C                     ADD  PT23      PT24
     C                     ADD  PT23F     PT24F
     C                     ADD  PT23M     PT24M
     C*
     C           PT25      ADD  PT251     TEMP15
     C                     ADD  PT252     TEMP15
     C*
| 10-C           PT24      IFNE *ZERO
|   C           TEMP15    DIV  PT24      PT26      H
| 10*C                     ELSE
|   C                     Z-ADD*ZERO     PT26
| 10-C                     END
     C*
     C           PT25F     ADD  PT25F1    TEMP15
     C                     ADD  PT25F2    TEMP15
     C*
| 10-C           PT24F     IFNE *ZERO
|   C           TEMP15    DIV  PT24F     PT26F     H
| 10*C                     ELSE
|   C                     Z-ADD*ZERO     PT26F
| 10-C                     END
     C*
     C           PT25M     ADD  PT25M1    TEMP15
     C                     ADD  PT25M2    TEMP15
     C*
| 10-C           PT24M     IFNE *ZERO
|   C           TEMP15    DIV  PT24M     PT26M     H
| 10*C                     ELSE
|   C                     Z-ADD*ZERO     PT26M
| 10-C                     END
|    C*
|    C                     WRITEPT2F
|    C                     WRITEPT2M
|    C                     WRITEPT2
|    C*
|    C                     Z-ADD*ZERO     PT21
|    C                     Z-ADD*ZERO     PT22
|    C                     Z-ADD*ZERO     PT23
|    C                     Z-ADD*ZERO     PT24
|    C                     Z-ADD*ZERO     PT25
|    C                     Z-ADD*ZERO     PT26
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
07===C           R8999     BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR R0100
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
07===C                     ENDSR
     C*==============================================================*
