     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYR2223                                    *
     H*    PROGRAM NAME :員工出勤簡表　　　　                      *
     H*    AUTHOR       : A1274 EVA                                  *
     H*    CREATE DATE  : 1999/08/03                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYR222WFIP  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR222P O   E             39     PRINTER
     E*---------------------------------------------------------------*
     IW222
     I                                              W2202 L1
     I                                              W2206 L2
     I                                              W2201 L3
     I*
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I*公司
     I                                      501 502 DOV01
     I*部門
     I                                      609 615 DEM041
     I                                      616 622 DEM042
     I*員工編號
     I                                      513 520 DOV021
     I                                      521 528 DOV022
     I*出勤月份(YYMM) IN CHINESE
     I                                      529 5320DOV031
     I                                      533 5360DOV032
     I*月份(YYYYMM) IN ENGLISH
     I                                      537 5420WOV031
     I                                      543 5480WOV032
     I                                      547 5480WOV32M
     I            DS
     I                                        1   80WYMD
     I                                        1   60WYM
     I                                        1   40WYY
     I                                        5   60WMM
     I                                        7   80WDD
     I            DS
     I                                        1   40W2206
     I                                        1   20W2206Y
     I                                        3   40W2206M
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *LIKE     DEFN CM14      DFMT
     C           *LIKE     DEFN CM15      DTYPE
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*SYCMPF 公司主檔
     C           KEYCM     KLIST
     C                     KFLD           W2201
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*
     C                     EXSR R2000                      .DETAIL
     CL1 10                EXSR R8100                      .L1
     CL2 10                EXSR R8200                      .L2
     CL3 10                EXSR R8300                      .L3
     C*
     CLR 10                EXSR R8900
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R1000 ... INITIAL PROCESS
     C*==============================================================*
01===C           R1000     BEGSR
|    C*
|    C                     SETON                     1039
|    C*
|    C                     MOVE $C8YMD    DDATE
|    C*
|    C                     Z-ADD*ZERO     PTA1
|    C                     Z-ADD*ZERO     PTA2
|    C                     Z-ADD*ZERO     PTA3
|    C                     Z-ADD*ZERO     PTA4
|    C                     Z-ADD*ZERO     PTA5
|    C                     Z-ADD*ZERO     PTB1
|    C                     Z-ADD*ZERO     PTB2
|    C                     Z-ADD*ZERO     PTB3
|    C                     Z-ADD*ZERO     PTB4
|    C                     Z-ADD*ZERO     PTB5
|    C*
|    C           KEYCM     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM01
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
02===C           R2000     BEGSR
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
|    C*          W2208     IFEQ *ZERO
|    C*          W2209     ANDEQ*ZERO
|    C*          W2210     ANDEQ*ZERO
|    C*          W2211     ANDEQ*ZERO
|    C*          W2212     ANDEQ*ZERO
|    C*                    GOTO E2000
|    C*                    END
|    C*
|    C                     ADD  W2208     PTA1
|    C                     ADD  W2209     PTA2
|    C                     ADD  W2210     PTA3
|    C                     ADD  W2211     PTA4
|    C                     ADD  W2212     PTA5
|    C                     ADD  W2208     PTB1
|    C                     ADD  W2209     PTB2
|    C                     ADD  W2210     PTB3
|    C                     ADD  W2211     PTB4
|    C                     ADD  W2212     PTB5
|    C*
|    C                     WRITEPD1
|    C*
02===C           E2000     ENDSR
     C*==============================================================*
     C*          R8100 ... LEVEL BREAK L1        部門
     C*==============================================================*
03===C           R8100     BEGSR
|    C*
|    C                     WRITEPT1
|    C                     SETON                     39
|    C*
|    C                     Z-ADD*ZERO     PTA1
|    C                     Z-ADD*ZERO     PTA2
|    C                     Z-ADD*ZERO     PTA3
|    C                     Z-ADD*ZERO     PTA4
|    C                     Z-ADD*ZERO     PTA5
|    C*
03===C                     ENDSR
     C*==============================================================
     C*          R8200 ... LEVEL BREAK L2        出勤日期
     C*==============================================================
04===C           R8200     BEGSR
|    C*
|    C                     SETON                     39
|    C*
04===C                     ENDSR
     C*==============================================================
     C*          R8300 ... LEVEL BREAK L3        公司
     C*==============================================================
05===C           R8300     BEGSR
|    C*
|    C                     WRITEPT2
|    C                     WRITEPT3
|    C*
|    C                     SETON                     39
|    C*
|    C                     Z-ADD*ZERO     PTA1
|    C                     Z-ADD*ZERO     PTA2
|    C                     Z-ADD*ZERO     PTA3
|    C                     Z-ADD*ZERO     PTA4
|    C                     Z-ADD*ZERO     PTA5
|    C                     Z-ADD*ZERO     PTB1
|    C                     Z-ADD*ZERO     PTB2
|    C                     Z-ADD*ZERO     PTB3
|    C                     Z-ADD*ZERO     PTB4
|    C                     Z-ADD*ZERO     PTB5
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR --- HAS DATA
     C*==============================================================*
06===C           R8900     BEGSR
|    C*
06===C           E8900     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
07===C           R8999     BEGSR
|    C*
|    C                     WRITEPH1
|    C                     WRITEPE9
|    C*
07===C           E8999     ENDSR
