     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYR2172                                    *
     H*    PROGRAM NAME :員工出勤統計表                            *
     H*    AUTHOR       : A1386 SHARON                               *
     H*    CREATE DATE  : 2004/12/31                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYPEJF01IP  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FPYR217P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    @T1        31  2
     E*---------------------------------------------------------------
     IPEJF01
     I                                              EM041 L4
     I                                              EM042 L3
     I                                              EM043 L2
     I                                              EM044 L1
     I*
     I           UDS
     I                                      125 1270$CPY
     I                                      211 2160DDATE
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DT201
     I                                      560 566 DEM041
     I                                      567 573 DEM042
     I                                      600 6020DYEAR
     I                                      603 6060WYEAR
     I/COPY PYDDSSRC,PYPMDS01
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYDP     KLIST
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C*
     C                     MOVEL'01'      KPM01   2
     C           KEYPM     KLIST
     C                     KFLD           KPM01
     C                     KFLD           DT201
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R0100
     C*
     C                     EXSR R8100                      .DETAIL
     C*
     C*+ LEVEL BREAK PROCESS ++++++++++++++++++++++++++++++++++++++++
     CL1 10                EXSR R8200
     CLR 10                EXSR R8900
     C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R0100 ... INITIAL
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C*
|    C           DT201     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C*
|    C           KEYPM     CHAINPM0                  40
|    C*
|    C                     SETON                     31
|    C           KEYDP     CHAINDP0                  40
|    C   40                MOVEL*BLANK    DP02
|    C*
|    C                     Z-ADD*ZERO     CNT
|    C                     Z-ADD*ZERO     CNT1
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R8100 ... WRITE DETAIL
     C*==============================================================*
04===C           R8100     BEGSR
|    C*
|    C*實際工時=正常工時-請假工時
     C           PE04      SUB  PE05      PD11
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
|    C                     WRITEPD1
|    C                     SETOF                     31
|    C*
|    C                     ADD  1         CNT
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R8200 ... LEVEL BREAK
     C*==============================================================*
05===C           R8200     BEGSR
|    C*
|    C                     SETON                     31
|    C           KEYDP     CHAINDP0                  40
|    C   40                MOVEL*BLANK    DP02
|    C*
|    C                     WRITEPT1
|    C*
|    C                     ADD  CNT       CNT1
     C                     Z-ADD*ZERO     CNT
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR
     C*==============================================================*
06===C           R8900     BEGSR
|    C*
|    C                     WRITEPT2
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
07===C           R8999     BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR R0100
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
07===C                     ENDSR
     C*==============================================================*
