     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYR2233                                    *
     H*    PROGRAM NAME :員工出缺勤月份總表　                      *
     H*    AUTHOR       : A1274 EVA                                  *
     H*    CREATE DATE  : 1999/08/05                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYR223WFIP  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR223P O   E             39     PRINTER
     E*---------------------------------------------------------------*
     IW223
     I                                              W2302 L1
     I                                              W2301 L2
     I*
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I*公司
     I                                      501 502 DOV01
     I*部門
     I                                      609 615 DEM041
     I                                      616 622 DEM042
     I*員工編號
     I                                      513 520 DOV021
     I                                      521 528 DOV022
     I*出勤月份(YYMM) IN CHINESE
     I                                      529 5320DOV031
     I                                      529 5300DOV03Y
     I                                      531 5320DOV03M
     I*月份(YYYYMM) IN ENGLISH
     I                                      537 5420WOV031
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *LIKE     DEFN CM14      DFMT
     C           *LIKE     DEFN CM15      DTYPE
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*SYCMPF 公司主檔
     C           KEYCM     KLIST
     C                     KFLD           W2301
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*
     C                     EXSR R2000                      .DETAIL
     CL1 10                EXSR R8100                      .L1
     CL2 10                EXSR R8200                      .L2
     C*
     CLR 10                EXSR R8900
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R0100 ... INITIAL PRTF FIELD     PT1
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     Z-ADD*ZERO     PT108
|    C                     Z-ADD*ZERO     PT109
|    C                     Z-ADD*ZERO     PT110
|    C                     Z-ADD*ZERO     PT111
|    C                     Z-ADD*ZERO     PT112
|    C                     Z-ADD*ZERO     PT113
|    C                     Z-ADD*ZERO     PT114
|    C                     Z-ADD*ZERO     PT115
|    C                     Z-ADD*ZERO     PT116
|    C                     Z-ADD*ZERO     PT117
|    C                     Z-ADD*ZERO     PT118
|    C                     Z-ADD*ZERO     PT119
|    C                     Z-ADD*ZERO     PT120
|    C                     Z-ADD*ZERO     PT121
|    C                     Z-ADD*ZERO     PT122
|    C                     Z-ADD*ZERO     PT123
|    C                     Z-ADD*ZERO     PT124
|    C                     Z-ADD*ZERO     PT125
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ... INITIAL PRTF FIELD     PT2
     C*==============================================================*
02===C           R0200     BEGSR
|    C*
|    C                     Z-ADD*ZERO     PT208
|    C                     Z-ADD*ZERO     PT209
|    C                     Z-ADD*ZERO     PT210
|    C                     Z-ADD*ZERO     PT211
|    C                     Z-ADD*ZERO     PT212
|    C                     Z-ADD*ZERO     PT213
|    C                     Z-ADD*ZERO     PT214
|    C                     Z-ADD*ZERO     PT215
|    C                     Z-ADD*ZERO     PT216
|    C                     Z-ADD*ZERO     PT217
|    C                     Z-ADD*ZERO     PT218
|    C                     Z-ADD*ZERO     PT219
|    C                     Z-ADD*ZERO     PT220
|    C                     Z-ADD*ZERO     PT221
|    C                     Z-ADD*ZERO     PT222
|    C                     Z-ADD*ZERO     PT223
|    C                     Z-ADD*ZERO     PT224
|    C                     Z-ADD*ZERO     PT225
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          R1000 ... INITIAL PROCESS
     C*==============================================================*
03===C           R1000     BEGSR
|    C*
|    C                     SETON                     1039
|    C*
|    C                     MOVE $C8YMD    DDATE
|    C*欄位清空PT1,PT2
|    C                     EXSR R0100
|    C                     EXSR R0200
|    C*公司名稱
|    C           KEYCM     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM01
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
04===C           R2000     BEGSR
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
|    C                     ADD  W2308     PT108
|    C                     ADD  W2309     PT109
|    C                     ADD  W2310     PT110
|    C                     ADD  W2311     PT111
|    C                     ADD  W2312     PT112
|    C                     ADD  W2313     PT113
|    C                     ADD  W2314     PT114
|    C                     ADD  W2315     PT115
|    C                     ADD  W2316     PT116
|    C                     ADD  W2317     PT117
|    C                     ADD  W2318     PT118
|    C                     ADD  W2319     PT119
|    C                     ADD  W2320     PT120
|    C                     ADD  W2321     PT121
|    C                     ADD  W2322     PT122
|    C                     ADD  W2323     PT123
|    C                     ADD  W2324     PT124
|    C                     ADD  W2325     PT125
|    C*
|    C                     ADD  W2308     PT208
|    C                     ADD  W2309     PT209
|    C                     ADD  W2310     PT210
|    C                     ADD  W2311     PT211
|    C                     ADD  W2312     PT212
|    C                     ADD  W2313     PT213
|    C                     ADD  W2314     PT214
|    C                     ADD  W2315     PT215
|    C                     ADD  W2316     PT216
|    C                     ADD  W2317     PT217
|    C                     ADD  W2318     PT218
|    C                     ADD  W2319     PT219
|    C                     ADD  W2320     PT220
|    C                     ADD  W2321     PT221
|    C                     ADD  W2322     PT222
|    C                     ADD  W2323     PT223
|    C                     ADD  W2324     PT224
|    C                     ADD  W2325     PT225
|    C*
|    C                     WRITEPD1
|    C*
04===C           E2000     ENDSR
     C*==============================================================*
     C*          R8100 ... LEVEL BREAK L1        部門
     C*==============================================================*
05===C           R8100     BEGSR
|    C*
|    C                     WRITEPT1
|    C                     SETON                     39
|    C*
|    C                     EXSR R0100
|    C*
05===C                     ENDSR
     C*==============================================================
     C*          R8200 ... LEVEL BREAK L2        公司
     C*==============================================================
06===C           R8200     BEGSR
|    C*
|    C                     WRITEPT2
|    C                     WRITEPE1
|    C*
|    C                     SETON                     39
|    C*
|    C                     EXSR R0100
|    C                     EXSR R0200
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR --- HAS DATA
     C*==============================================================*
07===C           R8900     BEGSR
|    C*
07===C           E8900     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
08===C           R8999     BEGSR
|    C*
|    C                     WRITEPH1
|    C                     WRITEPE9
|    C*
08===C           E8999     ENDSR
