     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYR2032                                    *
     H*    PROGRAM NAME :請假資料明細表　　　　　　　　　　　　    *
     H*    AUTHER       : A1084 CHARLES                              *
     H*    CREATE DATE  : 79/07/17                                   *
     H*    UPDATE DATE  : 90/04/16 A1274 EVA                         *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FPYLVJF01IP  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYLCPF  IF  E           K        DISK
     F*PYLTPF  IF  E           K        DISK
     FPYLVLF01IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FPYR203P O   E             39     PRINTER
     E*---------------------------------------------------------------
     ILVJF01
     I                                              EM041 L2
     I                                              EM042 L2
     I                                              EM043 L2
     I                                              EM044 L2
     I                                              LV02  L1
     I*
     I/COPY QDDSSRC,PYPMDS01
     I/COPY QRPGSRC,PYC02I
     I*
     I           UDS
     I                                      125 1270$CPY
     I                                      203 2080DDATE
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DLV01
     I                                      560 566 DEM041
     I                                      567 573 DEM042
     I                                      513 520 DLV021
     I                                      521 528 DLV022
     I**                                    529 5340DLV031
     I**                                    535 5400DLV032
     I                                      541 541 DFMT
     I                                      542 542 DTYPE
     I                                      543 5500WLV031
     I                                      551 5580WLV032
     I                                      600 6050DLV031
     I                                      607 6120DLV032
     I            DS
     I                                        1   80WLV03
     I                                        1   40LV03Y
     I                                        5   60LV03M
     I                                        5   80LV03MD
     I            DS
     I                                        1   80LV03W
     I                                        1   40LV03YW
     I                                        5   60LV03MW
     I                                        5   80LV03DW
     I            DS
     I                                        1   80EM113W
     I                                        5   80EM113D
     I*
     IPYLV      E DSPYLVJF01
     IPYLVD       DS                          1  95
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN LV01      KLV01
     C           *LIKE     DEFN LV02      KLV02
     C           *LIKE     DEFN LV03      KLV03
     C           *LIKE     DEFN LV03      SLV03
     C           *LIKE     DEFN LV04      KLV04
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYPM     KLIST                           *PYPMPF
     C                     KFLD           PM01
     C                     KFLD           DLV01
     C           KEYDP     KLIST
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           DP014
     C           KEYLV1    KLIST
     C                     KFLD           KLV01
     C                     KFLD           KLV02
     C                     KFLD           KLV04
     C                     KFLD           KLV03
     C           KEYLV2    KLIST
     C                     KFLD           KLV01
     C                     KFLD           KLV02
     C                     KFLD           KLV04
     C*          KEYLT     KLIST
     C*                    KFLD           KLV01
     C*                    KFLD           KLV02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
  01-C           *INL2     IFEQ '1'
    C           KEYDP     CHAINDP0                  40
    C   40                MOVEL*BLANK    DP02
    C                     SETON                     3132
  01-C                     END
     C*
     C                     EXSR RTN100
     C*
     CL1 10                EXSR RTN810
     CL2 10                EXSR RTN820
     CLR 10                EXSR RTN890
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           DLV01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C*
|    C                     MOVEL'01'      PM01
|    C           KEYPM     CHAINPM0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     Z-ADD8         PM101
|   C                     MOVEL*BLANK    PM104
|   C                     MOVEL*BLANK    PM105
| 01-C                     END
|    C*
|    C                     SETON                     1039
|    C                     SETON                     3132
|    C                     MOVEL'Y'       $DATA
|    C*
|    C*****                Z-ADD*ZERO     PT11
|    C*****                Z-ADD*ZERO     PT21
|    C                     Z-ADD*ZERO     PT31
|    C                     Z-ADD*ZERO     PT41
|    C                     Z-ADD*ZERO     PT51
|    C*****                Z-ADD*ZERO     PT12
|    C*****                Z-ADD*ZERO     PT22
|    C                     Z-ADD*ZERO     PT32
|    C                     Z-ADD*ZERO     PT42
|    C                     Z-ADD*ZERO     PT52
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     Z-ADDEM113     EM113W
|    C                     Z-ADDLV03      LV03W
|    C*                    Z-ADDLV03      P3101I
|    C*                    CALL 'P31'
|    C*                    PARM           P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM DFMT      P3104I  1
|    C*                    PARM DTYPE     P3105I  1
|    C*                    PARM           P3101O  80
|    C                     Z-ADDLV03      DLV03
|    C                     Z-ADDLV03      WLV03
|    C*
|    C*                    Z-ADDLV05      P3101I
|    C*                    CALL 'P31'
|    C*                    PARM           P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM DFMT      P3104I  1
|    C*                    PARM DTYPE     P3105I  1
|    C*                    PARM           P3101O  80
|    C                     Z-ADDLV05      DLV05
|    C*
|    C                     MOVELEM044     DP014
|    C           KEYDP     CHAINDP0                  40
|    C   40                MOVEL*BLANK    DP02
|    C*
|    C           LV04      CHAINLC0                  40
|    C   40                Z-ADD999       LC06
|    C   40                MOVEL*BLANK    LC02
|    C                     MOVELLC02      PD11
|    C*------------------------------------------------------------***
|    C*說明：時數單位表示為（天.時）
     C*20040427 SHARON DEL START
|    C*                    Z-ADD*ZERO     WPD12   52
|    C*                    Z-ADD*ZERO     PD12
|    C                     Z-ADD*ZERO     WALL    52
|    C*
|    C*          LV09      MULT PM101     WPD12
|    C*          LV09      MULT PM101     WPD12
|    C*                    ADD  LV08      WPD12
|    C*
| 01-C*          WPD12     IFNE *ZERO
|   C*                    Z-ADDWPD12     WALL
|   C*                    EXSR RTN120
|   C*                    Z-ADDWUNIT     PD12
| 01-C*                    END
|    C*------------------------------------------------------------***
|    C*20040427 SHARON DEL END
|    C                     Z-ADDLV09      PD12
|    C                     Z-ADDLV08      PD13
| 02-C*          LV04      IFEQ PM104
|   C*          LV04      OREQ PM105
|   C*                    EXSR RTN110
| 02-C*                    END
|    C*
     C                     Z-ADD0         YEAR
|    C*
| 02-C           LV04      IFEQ PM106                      特休
| 02-C           LV04      OREQ PM110                      轉休
     C*          LV03DW    IFGE EM113D
|   C                     Z-ADDLV03YW    YEAR
| 19-C*                    ELSE
|   C*          LV03YW    SUB  1         YEAR
| 19-C*                    END
| 19-C                     END
|    C*
| 03-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 03-C                     END
|    C*
|    C                     WRITEPD1
|    C                     SETOF                     3132
|    C*
|    C*------------------------------------------------------------***
|    C*說明：時數單位表示為（天.時）
|    C***                  Z-ADD*ZERO     WPT11   51
|    C***                  Z-ADD*ZERO     PT11
|    C***                  Z-ADD*ZERO     WALL    51
|    C*
|    C***                  ADD  WPD12     WPT11
|    C*
|    C***        WPT11     IFNE *ZERO
|    C***                  Z-ADDWPT11     WALL
|    C***                  EXSR RTN120
|    C***                  Z-ADDWUNIT     PT11
|    C***                  END
|    C*------------------------------------------------------------***
|    C***                  ADD  PD13      PT12
|    C*------------------------------------------------------------***
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN110... OVER全年可請MARK
     C*==============================================================*
03===C           RTN110    BEGSR
|    C*
| 01-C           LC06      IFEQ 999                        無限制
|   C                     GOTO END110
| 01-C                     END
|    C                     MOVELPYLV      PYLVD
|    C*
|    C*                    Z-ADDLV03      P3101I
|    C*                    CALL 'P31'
|    C*                    PARM           P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM DFMT      P3104I  1
|    C*                    PARM DTYPE     P3105I  1
|    C*                    PARM           P3101O  80
|    C                     Z-ADDLV03      WLV03
|    C*
| 02-C           LV03M     IFGT PM103
|   C           LV03Y     ADD  1         #C02I1  40
| 02*C                     ELSE
|   C                     Z-ADDLV03Y     #C02I1
| 02-C                     END
|    C*
|    C                     EXSR #C0200                     在職月數
|    C           LC06      MULT PM101     WTM     91
|    C                     MULT #C02M1    WTM
|    C                     DIV  12        WTM       H      可請時數
|    C*
|    C                     MOVELLV01      KLV01
|    C                     MOVELLV02      KLV02
|    C                     MOVEL#C02F     KLV03
|    C                     MOVE '01'      KLV03
|    C                     Z-ADDLV03      SLV03
|    C                     MOVELLV04      KLV04
|    C                     Z-ADD*ZERO     WLVT    91
|    C           KEYLV1    SETLLLV0
|    C           KEYLV2    READELV0                      40
| 03-C           *IN40     DOWEQ'0'
|   C           LV03      ANDLESLV03
|   C           LV09      MULT PM101     WLV     92
|   C                     ADD  LV08      WLV
|   C                     ADD  WLV       WLVT
|   C           KEYLV2    READELV0                      40
| 03-C                     END
|    C*
| 04-C           WLVT      IFGT WTM
|   C           WLVT      SUB  WTM       WLV
| 05-C           WLV       IFGT PD12
|   C                     Z-ADDPD12      PD13
| 05*C                     ELSE
|   C                     Z-ADDWLV       PD13
| 05-C                     END
| 04-C                     END
|    C*
|    C                     MOVELPYLVD     PYLV
|    C*
03===C           END110    ENDSR
     C*==============================================================*
     C*          RTN120...時數單位換算：（天.時）
     C*==============================================================*
04===C           RTN120    BEGSR
|    C*
|    C                     Z-ADD*ZERO     A01     50
|    C                     Z-ADD*ZERO     A02     31
|    C                     Z-ADD*ZERO     WUNIT   51       換算單位
|    C*
|    C           WALL      DIV  PM101     A01
|    C                     MVR            A02
|    C           A02       MULT 0.1       A02
|    C*
|    C           A01       ADD  A02       WUNIT
|    C*
04===C           END120    ENDSR
     C*==============================================================*
     C*          RTN810... LEVEL BREAK 1
     C*==============================================================*
05===C           RTN810    BEGSR
|    C*
|    C****                 WRITEPT1
|    C*
|    C****                 ADD  PT11      PT21
|    C****                 ADD  PT12      PT22
|    C*
|    C****                 Z-ADD*ZERO     PT11
|    C****                 Z-ADD*ZERO     PT12
|    C                     SETON                     32
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RTN820... LEVEL BREAK 2
     C*==============================================================*
06===C           RTN820    BEGSR
|    C*
|    C*                    WRITEPT2
|    C*
|    C*                    ADD  PT21      PT31
|    C*                    ADD  PT22      PT32
|    C*
|    C*                    Z-ADD*ZERO     PT21
|    C*                    Z-ADD*ZERO     PT22
|    C*
|    C           KEYDP     CHAINDP0                  40
|    C   40                MOVEL*BLANK    DP02
|    C                     SETON                     31
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          RTN830... LEVEL BREAK 3
     C*==============================================================*
07===C           RTN830    BEGSR
|    C*
|    C                     WRITEPT3
|    C*
|    C                     ADD  PT31      PT41
|    C                     ADD  PT32      PT42
|    C*
|    C                     Z-ADD*ZERO     PT31
|    C                     Z-ADD*ZERO     PT32
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          RTN840... LEVEL BREAK 4
     C*==============================================================*
08===C           RTN840    BEGSR
|    C*
|    C                     WRITEPT4
|    C*
|    C                     ADD  PT41      PT51
|    C                     ADD  PT42      PT52
|    C*
|    C                     Z-ADD*ZERO     PT41
|    C                     Z-ADD*ZERO     PT42
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          RTN850... LEVEL BREAK 5
     C*==============================================================*
09===C           RTN850    BEGSR
|    C*
|    C                     WRITEPT5
|    C*
|    C                     Z-ADD*ZERO     PT51
|    C                     Z-ADD*ZERO     PT52
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK LR
     C*==============================================================*
10===C           RTN890    BEGSR
|    C*
|    C                     WRITEPE1
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
11===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
11===C                     ENDSR
     C*
     I/COPY QRPGSRC,PYC02
