     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYR2252                                    *
     H*    PROGRAM NAME :加班請假記錄表列印                        *
     H*    AUTHOR       : A1336 KLAUS                                *
     H*    CREATE DATE  : 2001/10/18                                 *
     H*    UPDATE DATE  : 2001/11/05 A1274 EVA                       *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYEMPF  IP  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYLCPF  IF  E           K        DISK
     FPYOVPF  IF  E           K        DISK
     FPYLVPF  IF  E           K        DISK
     FPYLTPF  IF  E           K        DISK
     FPYLAPF  IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR225P O   E             39     PRINTER
     FPYR225WFO   E                    DISK
     E*---------------------------------------------------------------
     E                    H1         13  1               .假別代碼
     E                    H2         13  6               .假別說明
     E                    D1         13  5 1             .平日
     E                    D2         13  5 1             .年度
     E*---------------------------------------------------------------
     IEM0
     I                                              EM02  L1
     I                                              EM041 L2
     I                                              EM042 L2
     I                                              EM043 L2
     I                                              EM044 L2
     I*
     I/COPY QDDSSRC,PYPMDS01
     I*
     I           UDS
     I                                      125 1270$CPY
     I                                      203 2080DDATE
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DEM01
     I                                      615 621 DEM041
     I                                      622 628 DEM042
     I                                      513 520 DEM021
     I                                      521 528 DEM022
     I                                      601 6060DOV031
     I                                      608 6130DOV032
     I                                      541 541 DFMT
     I                                      542 542 DTYPE
     I                                      543 5500WOV031
     I                                      543 5460WOVYS
     I                                      547 5500W031MD
     I                                      551 5580WOV032
     I                                      551 5540WOVYE
     I                                      555 5580W032MD
     I                                      559 5600DYEAR
     I                                      561 5680WYMDS
     I                                      561 5640WYYS
     I                                      565 5680WMDS
     I                                      569 5760WYMDE
     I                                      569 5720WYYE
     I                                      573 5760WMDE
     I*
     I                                      581 5880WYMDB
     I                                      581 5840WYYB
     I                                      585 5880WMDB
     I                                      589 5960WYMDD
     I                                      589 5920WYYD
     I                                      593 5960WMDD
     I            DS
     I                                        1  78 H2
     I                                        1   6 PHA
     I                                        7  12 PHB
     I                                       13  18 PHC
     I                                       19  24 PHD
     I                                       25  30 PHE
     I                                       31  36 PHF
     I                                       37  42 PHG
     I                                       43  48 PHH
     I                                       49  54 PHI
     I                                       55  60 PHJ
     I                                       61  66 PHK
     I                                       67  72 PHL
     I                                       73  78 PHM
     I*
     I            DS
     I                                        1  65 D1
     I                                        1   51PD1A
     I                                        6  101PD1B
     I                                       11  151PD1C
     I                                       16  201PD1D
     I                                       21  251PD1E
     I                                       26  301PD1F
     I                                       31  351PD1G
     I                                       36  401PD1H
     I                                       41  451PD1I
     I                                       46  501PD1J
     I                                       51  551PD1K
     I                                       56  601PD1L
     I                                       61  651PD1M
     I*
     I            DS
     I                                        1  65 D2
     I                                        1   51PD2A
     I                                        6  101PD2B
     I                                       11  151PD2C
     I                                       16  201PD2D
     I                                       21  251PD2E
     I                                       26  301PD2F
     I                                       31  351PD2G
     I                                       36  401PD2H
     I                                       41  451PD2I
     I                                       46  501PD2J
     I                                       51  551PD2K
     I                                       56  601PD2L
     I                                       61  651PD2M
     I*
     I            DS
     I                                        1   80EM113
     I                                        5   80EM113D
     I            DS
     I                                        1   80CKYMDS
     I                                        5   80CKMDS
     I                                        1   40CKY
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYPM     KLIST                           *PYPMPF
     C                     KFLD           PM01
     C                     KFLD           DEM01
     C           KEYDP     KLIST
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C*PYOVPF
     C           KEYOV1    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           WOV031
     C           KEYOV2    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C           KEYOV3    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C*                    KFLD           WYMDS
     C*PYLVPF
     C           KEYLV1    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           WOV031
     C           KEYLV2    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C           KEYLV3    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           WYMDS
     C           KEYLV4    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           CKYMDS
     C*PYLTPF
     C           KEYLT1    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           YEAR01  40
     C           KEYLT2    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           YEAR02  40
     C*PYLAPF
     C           KEYLA1    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           WOV031
     C           KEYLA2    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C           KEYLA3    KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           WYMDS
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100
     C*
     CL1 10                EXSR RTN810
     CL2 10                EXSR RTN820
     C*
     CLR 10                EXSR RTN890
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           DEM01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C*
|    C                     MOVEL'01'      PM01
|    C           KEYPM     CHAINPM0                  40
|    C   40                Z-ADD8         PM101
|    C*
|    C*起迄日期．考勤年度以民國年表示
|    C                     Z-ADD*ZERO     POV031
|    C                     Z-ADD*ZERO     POV032
|    C                     Z-ADD*ZERO     PYEAR
|    C                     Z-ADD*ZERO     PDTS    80
|    C                     Z-ADD*ZERO     PDTE    80
|    C                     Z-ADD*ZERO     CKYMDS
|    C*
| 01-C           WOV031    IFNE *ALL'0'
|   C           WOV031    SUB  19110000  POV031
|   C           WOV031    SUB  19110000  PDTS
| 01-C                     END
|    C*
| 02-C           WOV032    IFNE *ALL'9'
|   C           WOV032    SUB  19110000  POV032
|   C           WOV032    SUB  19110000  PDTE
| 02*C                     ELSE
|   C                     Z-ADD*ALL'9'   POV032
|   C                     Z-ADD*ALL'9'   PDTE
| 02-C                     END
|    C*
|   C                     Z-ADDEM113     EM113X
| 03-C           WYYS      IFNE *ZERO
|   C                     Z-ADDWYYS      PYEAR
| 03-C                     END
|    C*
|    C*------------------------------------------------------------***
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C*HEADING假別
|    C                     Z-ADD0         WI      20
|    C*
|    C           *LOVAL    SETLLLC0
|    C                     READ LC0                      40
| 04-C           *IN40     DOWEQ'0'
|   C           WI        ANDLT13
|   C                     ADD  1         WI
|   C                     MOVELLC01      H1,WI
|   C                     MOVELLC02      H2,WI
|   C                     READ LC0                      40
| 04-C                     END
|    C*當期
|    C*　　　　 　　
|    C                     Z-ADD*ZERO     PD11             *加班天時(平日)
|    C                     Z-ADD*ZERO     PD1II            *補休天時
|    C                     Z-ADD*ZERO     PD1O
|    C                     MOVEL*ZERO     D1
|    C*
|    C*年度
|    C                     Z-ADD*ZERO     PD21             *加班天時
|    C                     Z-ADD*ZERO     PD2II            *補休天時
|    C                     Z-ADD*ZERO     PD2O
|    C                     MOVEL*ZERO     D2
|    C*
|    C*本年應有年假
|    C                     Z-ADD*ZERO     PD1N
|    C*部門人數
|    C                     Z-ADD*ZERO     PT01             人數
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... DETAIL COMPUTE
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*-------------------------------------------------------------
|    C*在職員工
| 01-C           EM13      IFGT WOV032
|   C                     GOTO END100                     到職＞迄
| 01-C                     END
|    C*
| 02-C           EM11      IFEQ 'Y'                        已離職
|   C           EM11      OREQ '*'
| 03-C           EM19      IFLT WOV031
|   C                     GOTO END100                     離職＜起
| 03-C                     END
| 02-C                     END
|    C*-------------------------------------------------------------
|    C*說明：時數單位表示為（天.時）．次數單位表示為（次數）
|    C*-------------------------------------------------------------
|    C*加班統計：加班時數為加班轉休時數
|    C           KEYOV1    SETLLOV0                        平日累計
|    C           KEYOV2    READEOV0                      40
| 04-C           *IN40     DOWEQ'0'
|   C           OV03      ANDLEWOV032
|   C                     ADD  OV12      PD11
|   C           KEYOV2    READEOV0                      40
| 04-C                     END
|    C*
|    C           KEYOV3    SETLLOV0                        年度累計
|    C           KEYOV2    READEOV0                      41
| 05-C           *IN41     DOWEQ'0'
|   C           OV03      ANDLEWYMDE
|   C                     ADD  OV12      PD21
|   C           KEYOV2    READEOV0                      41
| 05-C                     END
|    C*
|    C*加班時數單位換算
|    C                     Z-ADD*ZERO     WALL    51
|    C*
| 06-C           PD11      IFNE *ZERO                      平日累計
|   C                     Z-ADDPD11      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD11
| 06-C                     END
|    C*
| 07-C           PD21      IFNE *ZERO                      年度累計
|   C                     Z-ADDPD21      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD21
| 07-C                     END
|    C*-------------------------------------------------------------
|    C*遲到統計
|    C           KEYLA1    SETLLLA0                        平日累計
|    C           KEYLA2    READELA0                      40
| 08-C           *IN40     DOWEQ'0'
|   C           LA03      ANDLEWOV032
|   C                     ADD  LA04      PD1O
|   C           KEYLA2    READELA0                      40
| 08-C                     END
|    C*
|    C*
|    C           KEYLA3    SETLLLA0                        年度累計
|    C           KEYLA2    READELA0                      41
| 09-C           *IN41     DOWEQ'0'
|   C           LA03      ANDLEWYMDE
|   C                     ADD  LA04      PD2O
|   C           KEYLA2    READELA0                      41
| 09-C                     END
|    C*
|    C*-------------------------------------------------------------
|    C*年假統計
     C                     SETOF                     66
     C                     Z-ADDEM113D    EM113E
     C                     Z-ADDEM113D    CKMDS
     C                     Z-ADDW032MD    MD032E
| 38-C           WOVYE     IFGT WOVYS
     C           W032MD    ADD  1200      MD032E  40
     C           EM113D    IFLT W031MD
     C           EM113D    ADD  1200      EM113E  40
     C                     END
     C                     END
     C*
     C*
     C           EM113E    IFGE W031MD
     C           EM113E    ANDLEMD032E
     C           EM113E    IFLE 1231
     C                     Z-ADDWOVYS     CKY
     C                     END
     C           EM113E    IFGT 1231
     C                     Z-ADDWOVYE     CKY
     C                     END
     C                     SETON                     66
     C                     END
|    C*-------------------------------------------------------------
|    C*請假統計
|   C*
|    C           KEYLV1    SETLLLV0                        平日累計
|    C           KEYLV2    READELV0                      40
| 10-C           *IN40     DOWEQ'0'
|   C           LV03      ANDLEWOV032
|   C*
|   C           LV09      MULT PM101     WD1     51
|   C                     ADD  LV08      WD1
|   C*
|   C                     Z-ADD1         WI
|   C*
     C           *IN66     IFEQ '1'
     C           LV04      ANDEQ'A'
     C           LV03      ANDGECKYMDS
|   C                     GOTO NXTTAG
|   C                     ELSE
|   C*
|   C           LV04      LOKUPH1,WI                    41
|   C   41                ADD  WD1       D1,WI
| 10-C                     END
|   C*
     C           NXTTAG    TAG
|   C           KEYLV2    READELV0                      40
| 10-C                     END
|    C*
|    C*          KEYLV3    SETLLLV0                        平日累計
|    C           KEYLV2    SETLLLV0                        平日累計
|    C           KEYLV2    READELV0                      42
| 11-C           *IN42     DOWEQ'0'
|   C           LV03      ANDLEWYMDE
| |  C*
  12 C           LV04      IFNE 'R'
|   C           LV03      ANDGEWYMDS
| |  C*
|   C           LV04      OREQ 'R'
|   C*
|   C           LV09      MULT PM101     WD2     51
|   C                     ADD  LV08      WD2
|   C*
|   C                     Z-ADD1         WI
|   C           LV04      LOKUPH1,WI                    43
|   C   43                ADD  WD2       D2,WI
|   C*
| 12-C                     END
|   C           KEYLV2    READELV0                      42
| 11-C                     END
|    C*
|    C*
     C           *IN66     IFEQ '1'                         跨年
|   C                     Z-ADD0         PD2A
|    C*
|    C           KEYLV4    SETLLLV0                        平日累計
|    C           KEYLV2    READELV0                      42
| 11-C           *IN42     DOWEQ'0'
|   C           LV03      ANDLEWYMDE
|   C*
     C           LV04      IFEQ 'A'
     C*
|   C           LV09      MULT PM101     WD2     51
|   C                     ADD  LV08      WD2
|   C*
|   C                     Z-ADD1         WI
|   C           LV04      LOKUPH1,WI                    43
|   C   43                ADD  WD2       D2,WI
     C                     END
|   C*
|   C           KEYLV2    READELV0                      42
| 11-C                     END
| 11-C                     END
|    C*請假時數單位換算
|    C                     Z-ADD*ZERO     WALL
|    C*
| 12-C           PD1A      IFNE *ZERO
|   C                     Z-ADDPD1A      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD1A
| 12-C                     END
|    C*
| 13-C           PD1B      IFNE *ZERO
|   C                     Z-ADDPD1B      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD1B
| 13-C                     END
|    C*
| 14-C           PD2B      IFNE *ZERO
|   C                     Z-ADDPD2B      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD2B
| 14-C                     END
|    C*
| 15-C           PD1C      IFNE *ZERO
|   C                     Z-ADDPD1C      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD1C
| 15-C                     END
|    C*
| 16-C           PD2C      IFNE *ZERO
|   C                     Z-ADDPD2C      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD2C
| 16-C                     END
|    C*
| 17-C           PD1D      IFNE *ZERO
|   C                     Z-ADDPD1D      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD1D
| 17-C                     END
|    C*
| 18-C           PD2D      IFNE *ZERO
|   C                     Z-ADDPD2D      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD2D
| 18-C                     END
|    C*
| 19-C           PD1E      IFNE *ZERO
|   C                     Z-ADDPD1E      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD1E
| 19-C                     END
|    C*
| 20-C           PD2E      IFNE *ZERO
|   C                     Z-ADDPD2E      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD2E
| 20-C                     END
|    C*
| 21-C           PD1F      IFNE *ZERO
|   C                     Z-ADDPD1F      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD1F
| 21-C                     END
|    C*
| 22-C           PD2F      IFNE *ZERO
|   C                     Z-ADDPD2F      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD2F
| 22-C                     END
|    C*
| 23-C           PD1G      IFNE *ZERO
|   C                     Z-ADDPD1G      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD1G
| 23-C                     END
|    C*
| 24-C           PD2G      IFNE *ZERO
|   C                     Z-ADDPD2G      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD2G
| 24-C                     END
|    C*
| 25-C           PD1H      IFNE *ZERO
|   C                     Z-ADDPD1H      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD1H
| 25-C                     END
|    C*
| 26-C           PD2H      IFNE *ZERO
|   C                     Z-ADDPD2H      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD2H
| 26-C                     END
|    C*
| 27-C           PD1I      IFNE *ZERO
|   C                     Z-ADDPD1I      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD1I
|   C                     Z-ADDWUNIT     PD1II            *補休天時（平日）
| 27-C                     END
|    C*
| 28-C           PD2I      IFNE *ZERO
|   C                     Z-ADDPD2I      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD2I
|   C                     Z-ADDWUNIT     PD2II            *補休天時（當期）
| 28-C                     END
|    C*
| 29-C           PD1J      IFNE *ZERO
|   C                     Z-ADDPD1J      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD1J
| 29-C                     END
|    C*
| 30-C           PD2J      IFNE *ZERO
|   C                     Z-ADDPD2J      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD2J
| 30-C                     END
|    C*
| 31-C           PD1K      IFNE *ZERO
|   C                     Z-ADDPD1K      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD1K
| 31-C                     END
|    C*
| 32-C           PD2K      IFNE *ZERO
|   C                     Z-ADDPD2K      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD2K
| 32-C                     END
|    C*
| 33-C           PD1L      IFNE *ZERO
|   C                     Z-ADDPD1L      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD1L
| 33-C                     END
|    C*
| 34-C           PD2L      IFNE *ZERO
|   C                     Z-ADDPD2L      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD2L
| 34-C                     END
|    C*
| 35-C           PD1M      IFNE *ZERO
|   C                     Z-ADDPD1M      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD1M
| 35-C                     END
|    C*
| 36-C           PD2M      IFNE *ZERO
|   C                     Z-ADDPD2M      WALL
|   C                     EXSR RTN110
|   C                     Z-ADDWUNIT     PD2M
| 36-C                     END
|    C*
|    C*-------------------------------------------------------------
|    C*考勤年度特休時數資料：
|    C*１．若無當年資料找前一年資料
|    C*２．獲得個人年度特休（年假）已休時數累計
|    C*３．起迄日期區間內人員才給"NEW"
     C           *IN66     IFEQ '1'
     C                     Z-ADDCKY       YEAR01
     C                     ELSE
|    C                     Z-ADDWYYS      YEAR01
     C                     END
|    C           WYYS      SUB  1         YEAR02
|    C*
|    C                     Z-ADD*ZERO     PD2A
|    C                     Z-ADD*ZERO     KLT12   31
|    C*
|    C           KEYLT1    CHAINLT0                  40
| 37-C           *IN40     IFEQ '0'
|   C                     Z-ADDLT10      PD1N
|   C           LT12      MULT 0.1       KLT12
|   C           LT11      ADD  KLT12     PD2A
|   C*
| 38-C*          EM113D    IFGE W031MD
|   C*          EM113D    ANDLEW032MD
     C           *IN66     IFEQ '1'
|   C                     MOVEL'NEW'     PNEW
| 38*C                     ELSE
|   C                     MOVEL'   '     PNEW
| 38-C                     END
|   C*
| 37*C                     ELSE
|   C           KEYLT2    CHAINLT0                  41
| 39-C           *IN41     IFEQ '0'
|   C                     Z-ADDLT10      PD1N
|   C           LT12      MULT 0.1       KLT12
|   C           LT11      ADD  KLT12     PD2A
|   C                     MOVEL'   '     PNEW
| 39*C                     ELSE
|   C                     Z-ADD*ZERO     PD1N
|   C                     Z-ADD*ZERO     PD2A
|   C                     MOVEL*BLANK    PNEW
| 39-C                     END
| 37-C                     END
|    C*-------------------------------------------------------------
|    C*寫入工作檔
|    C                     MOVELDEM01     W22501
|    C                     MOVELEM02      W22502
|    C                     WRITEW225
|    C*
|    C*-------------------------------------------------------------
|    C*部門名稱
|    C           KEYDP     CHAINDP0                  40
|    C   40                MOVEL*BLANK    DP02
|    C*
| 40-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 40-C                     END
|    C*
02===C           END100    ENDSR
     C*==============================================================*
     C*          RTN110...時數單位換算：（天.時）
     C*==============================================================*
03===C           RTN110    BEGSR
|    C*
|    C                     Z-ADD*ZERO     A01     50
|    C                     Z-ADD*ZERO     A02     31
|    C                     Z-ADD*ZERO     WUNIT   51       換算單位
|    C*
|    C           WALL      DIV  PM101     A01
|    C                     MVR            A02
|    C           A02       MULT 0.1       A02
|    C*
|    C           A01       ADD  A02       WUNIT
|    C*
03===C           END110    ENDSR
     C*==============================================================*
     C*          RTN810... LEVEL BREAK 1
     C*==============================================================*
04===C           RTN810    BEGSR
|    C*
|    C                     WRITEPD1
|    C*
|    C                     ADD  1         PT01             人數
|    C*-------------------------------------------------------------
|    C*當期
|    C*加班時數（平日）
|    C                     Z-ADD*ZERO     PD11
|    C*補休時數
|    C                     Z-ADD*ZERO     PD1II
|    C                     Z-ADD*ZERO     PD1O
|    C                     MOVEL*ZERO     D1
|    C*
|    C*年度
|    C                     Z-ADD*ZERO     PD21
|    C                     Z-ADD*ZERO     PD2II
|    C                     Z-ADD*ZERO     PD2O
|    C                     MOVEL*ZERO     D2
|    C*
|    C*本年應有年假
|    C                     Z-ADD*ZERO     PD1N
|    C*
04===C           END810    ENDSR
     C*==============================================================*
     C*          RTN820... LEVEL BREAK 2
     C*==============================================================*
05===C           RTN820    BEGSR
|    C*
| 01-C           PT01      IFEQ *ZERO
|   C                     GOTO END820
| 01-C                     END
|    C*
|    C                     WRITEPT1
|    C                     SETON                     39
|    C*-------------------------------------------------------------
|    C                     Z-ADD*ZERO     PT01             人數
|    C*
05===C           END820    ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK LR
     C*==============================================================*
06===C           RTN890    BEGSR
|    C*
|    C                     WRITEPE1
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
07===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
07===C                     ENDSR
