     H****************************************************************
     H*   獂び戈癟м秨祇Τそ⌒舦┮Τ    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : PYR2082                                    *
     H*    PROGRAM NAME :σ对癘魁参璸                        *
     H*    AUTHOR       : A1226 PETER                                *
     H*    CREATE DATE  : 1997/01/15                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :ㄆ羱戈                                  *
     H****************************************************************
     FPYEMPF  IP  E           K        DISK
     FPYLAPF  IF  E           K        DISK
     FPYLVPF  IF  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FPYR208P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    @T1        31  2
     E*---------------------------------------------------------------
     IEM0
     I                                              EM041 L1
     I                                              EM042 L1
     I                                              EM043 L1
     I                                              EM044 L1
     I*
     I           UDS
     I                                      125 1270$CPY
     I                                      203 2080DDATE
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DEM01
     I                                      560 566 DEM041
     I                                      567 573 DEM042
     I                                      513 5160DYM
     I                                      518 5230WYM
     I/COPY QDDSSRC,PYPMDS01
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYEM     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C           KEYDP     KLIST
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C           KEYPM     KLIST
     C                     KFLD           PM01
     C                     KFLD           DEM01
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R0100
     C*+ LEVEL BREAK INIT PROCESS +++++++++++++++++++++++++++++++++++
     C   L1                EXSR R7100
     C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     C*
     C                     EXSR R2000                      .DETAIL
     C*
     C*+ LEVEL BREAK PROCESS ++++++++++++++++++++++++++++++++++++++++
     CL1 10                EXSR R8100
     CLR 10                EXSR R8900
     C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R0100 ... INITIAL
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     SETON                     103931
|    C                     MOVEL'Y'       $DATA
|    C*
|    C           DEM01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C*GET PAYROLL PARAMETER
|    C                     MOVEL'01'      PM01
|    C           KEYPM     CHAINPM0                  40
|    C*
|    C                     Z-ADD*ZERO     PD11
|    C                     Z-ADD*ZERO     PD12
|    C                     Z-ADD*ZERO     PD13
|    C                     Z-ADD*ZERO     PD14
|    C                     Z-ADD*ZERO     PD15
|    C                     Z-ADD*ZERO     PT11
|    C                     Z-ADD*ZERO     PT12
|    C                     Z-ADD*ZERO     PT13
|    C                     Z-ADD*ZERO     PT14
|    C                     Z-ADD*ZERO     PT15
|    C                     Z-ADD*ZERO     PT21
|    C                     Z-ADD*ZERO     PT22
|    C                     Z-ADD*ZERO     PT23
|    C                     Z-ADD*ZERO     PT24
|    C                     Z-ADD*ZERO     PT25
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
02===C           R2000     BEGSR
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*筐
|    C           KEYEM     SETLLLA0
|    C           KEYEM     READELA0                      40
| 02-C           *IN40     DOWEQ'0'
|   C                     ADD  LA04      PD11
|   C           KEYEM     READELA0                      40
| 02-C                     END
|    C*
|    C           KEYEM     SETLLLV0
|    C           KEYEM     READELV0                      40
| 03-C           *IN40     DOWEQ'0'
|   C*ㄆ安
| 04-C           LV04      IFEQ PM104
|   C                     ADD  1         PD12
|   C           LV09      MULT PM101     WFLD    40
|   C                     ADD  WFLD      PD13
|   C                     ADD  LV08      PD13
| 04-C                     END
|   C*痜安
| 05-C           LV04      IFEQ PM105
|   C                     ADD  1         PD14
|   C           LV09      MULT PM101     WFLD    40
|   C                     ADD  WFLD      PD15
|   C                     ADD  LV08      PD15
| 05-C                     END
|   C*
|   C           KEYEM     READELV0                      40
| 03-C                     END
|    C*
|    C                     WRITEPD1
|    C*
|    C                     ADD  PD11      PT11
|    C                     ADD  PD12      PT12
|    C                     ADD  PD13      PT13
|    C                     ADD  PD14      PT14
|    C                     ADD  PD15      PT15
|    C                     Z-ADD*ZERO     PD11
|    C                     Z-ADD*ZERO     PD12
|    C                     Z-ADD*ZERO     PD13
|    C                     Z-ADD*ZERO     PD14
|    C                     Z-ADD*ZERO     PD15
|    C*
|    C                     SETOF                     31
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          R7100 ... LEVEL BREAK 1 :INIT PROCESS
     C*==============================================================*
03===C           R7100     BEGSR
|    C*
|    C                     SETON                     31
|    C*
|    C           KEYDP     CHAINDP0                  40
|    C   40                MOVEL*BLANK    DP02
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          R8100 ... LEVEL BREAK 1
     C*==============================================================*
04===C           R8100     BEGSR
|    C*
|    C                     WRITEPT1
|    C*
|    C                     ADD  PT11      PT21
|    C                     ADD  PT12      PT22
|    C                     ADD  PT13      PT23
|    C                     ADD  PT14      PT24
|    C                     ADD  PT15      PT25
|    C                     Z-ADD*ZERO     PT11
|    C                     Z-ADD*ZERO     PT12
|    C                     Z-ADD*ZERO     PT13
|    C                     Z-ADD*ZERO     PT14
|    C                     Z-ADD*ZERO     PT15
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR
     C*==============================================================*
05===C           R8900     BEGSR
|    C*
|    C                     WRITEPT2
|    C                     WRITEPT3
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
06===C           R8999     BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR R0100
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
06===C                     ENDSR
     C*==============================================================*
