     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : PYR2202                                    *
     H*    PROGRAM NAME :刷卡資料異常表列印
     H*    AUTHOR       : A1184                                      *
     H*    CREATE DATE  : 85/03/06                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     H****************************************************************
     FPYT6JF01IP  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FPYLCPF  IF  E           K        DISK
     FPYR211P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    WFUN    7   7  8
     E                    @T6N    5  10 16
     E                    @T6        10  1               異常別
     E*---------------------------------------------------------------
     IT6JF01
     I                                              EM041 L2
     I                                              EM042 L2
     I                                              EM043 L2
     I                                              EM044 L2
     I                                              T603  L1
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      187 1920DDATE
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DT602
     I                                      560 566 DEM04F
     I                                      567 573 DEM04T
     I                                      513 520 DT603F
     I                                      521 528 DT603T
     I**                                    529 5340DT601F
     I**                                    535 5400DT601T
     I                                      541 541 DFMT
     I                                      542 542 DTYPE
     I                                      543 5500WT601F
     I                                      551 5580WT601T
     I                                      600 6060DT601F
     I                                      607 6130DT601T
     I            DS
     I                                        1   7 EM04
     I                                        1   1 EM041
     I                                        2   2 EM042
     I                                        3   3 EM043
     I                                        4   7 EM044
     I            DS
     I                                        1   40T612
     I                                        1   20T612H
     I                                        3   40T612M
     I            DS
     I                                        1   40T613
     I                                        1   20T613H
     I                                        3   40T613M
     I            DS
     I                                        1   40T614
     I                                        1   20T614H
     I                                        3   40T614M
     I            DS
     I                                        1   40T615
     I                                        1   20T615H
     I                                        3   40T615M
     I/COPY PYDDSSRC,PYPMDS01
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN $A8YMD    FDATE            .TRANS DATE USE
     C           *LIKE     DEFN DDATE     WT601                        USE
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYPM     KLIST
     C                     KFLD           PM01
     C                     KFLD           DT602
     C           KEYDP     KLIST
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*+ LEVEL BREAK INIT PROCESS +++++++++++++++++++++++++++++++++++
     C   L1                EXSR R7100
     C   L2                EXSR R7200
     C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     C*
     C                     EXSR R2000                      .DETAIL
     C*
     C*+ LEVEL BREAK PROCESS ++++++++++++++++++++++++++++++++++++++++
     CL2 10                EXSR R8100
     CLR 10                EXSR R8900
     C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R1000 ... INITIAL PROCESS
     C*==============================================================*
01===C           R1000     BEGSR
|    C*
|    C                     SETON                     1039
|    C*
|    C                     MOVEL'01'      PM01
|    C           KEYPM     CHAINPM0                  40
|    C*
|    C                     MOVEL'*'       @T6,1
|    C                     MOVEL'#'       @T6,2
|    C                     MOVEL'L'       @T6,3
|    C                     MOVEL'N'       @T6,4
|    C                     MOVEL'E'       @T6,5
|    C                     MOVEL'F'       @T6,6
|    C                     MOVEL'T'       @T6,7
|    C                     MOVEL'D'       @T6,8
|    C                     MOVEL'C'       @T6,9
|    C                     MOVEL'!'       @T6,10
|    C*
|    C*GET表頭公司別++++++++++++++++++++++++++++++++++++++++++++++++
|    C           DT602     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C*
|    C*CLEAR TOTAL FIELD
|    C                     Z-ADD*ZERO     PT11
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
02===C           R2000     BEGSR
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
|   C* BREAK CONTROL FOR FIELD PRINTED +++++++++++++++++++++++++++++++
|   C                     SETON                     31
|   C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
| 01-C                     END
|    C*帶星期
|    C                     CALL 'P31'
|    C                     PARM T601      P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM DFMT      P3104I  1
|    C                     PARM DTYPE     P3105I  1
|    C           WT601     PARM           P3101O  80
|    C*
|    C                     Z-ADD0         I1      10
|    C                     CALL 'P40'
|    C                     PARM WT601     P4001I  60
|    C                     PARM           P4011O  10
|    C                     Z-ADDP4011O    I1
|    C                     MOVELWFUN,I1   TFUN
|    C*
|    C                     MOVEL*BLANK    T604N
|    C                     MOVEL*BLANK    T607N
|    C*
|    C           T604      CHAINLC0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVELLC02      T604N
| 02*C                     ELSE
|   C                     Z-ADD1         X       20
|   C           T604      LOKUP@T6,X                    40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVEL@T6N,X    T604N
| 03*C                     ELSE
| 04-C           T604      IFEQ PM146                      輪休
|   C                     MOVEL'輪休'  T604N
| 04-C                     END
| 03-C                     END
| 02-C                     END
|    C*
|    C           T607      CHAINLC0                  40
| 05-C           *IN40     IFEQ '0'
|   C                     MOVELLC02      T607N
| 05*C                     ELSE
|   C                     Z-ADD1         X       20
|   C           T607      LOKUP@T6,X                    40
| 06-C           *IN40     IFEQ '1'
|   C                     MOVEL@T6N,X    T607N
| 06*C                     ELSE
| 07-C           T607      IFEQ PM146                      輪休
|   C                     MOVEL'輪休'  T607N
| 07-C                     END
| 06-C                     END
| 05-C                     END
|    C*
|    C****19991101 A1274 EVA
|    C                     Z-ADDWT601     PT601            刷卡日期
|    C*
|    C**                   CALL 'P31'
|    C**                   PARM WT601     P3101I  80
|    C**                   PARM DFMT      P3102I  1
|    C**                   PARM DTYPE     P3103I  1
|    C**                   PARM '2'       P3104I  1
|    C**                   PARM '1'       P3105I  1
|    C**         PT601     PARM           P3101O  80
|    C*
|    C                     WRITEPD1
|    C* BREAK CONTROL FOR FIELD PRINTED +++++++++++++++++++++++++++++++
|    C                     SETOF                     31
|    C* ACCUMULATE TOTAL
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          R7100 ... LEVEL BREAK 1 :INIT PROCESS
     C*==============================================================*
03===C           R7100     BEGSR
|    C*
|    C* BREAK CONTROL FOR FIELD PRINTED +++++++++++++++++++++++++++++++
|    C                     SETON                     31
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* << IF THIS KEY BREAK SKIP PAGE THEN SETON >>-------------------
|    C***                  SETON                     39
|    C*----------------------------------------------------------------
|    C                     ADD  1         PT11
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          R7200 ... LEVEL BREAK 2 :INIT PROCESS
     C*==============================================================*
04===C           R7200     BEGSR
|    C*
|    C           KEYDP     CHAINDP0                  40
|    C   40                MOVEL*BLANK    DP02
|    C*
|    C* BREAK CONTROL FOR FIELD PRINTED +++++++++++++++++++++++++++++++
|    C                     SETON                     31
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* << IF THIS KEY BREAK SKIP PAGE THEN SETON >>-------------------
|    C                     SETON                     39
|    C*----------------------------------------------------------------
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R8100 ... LEVEL BREAK 2
     C*==============================================================*
05===C           R8100     BEGSR
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* << TOTAL LINE DATA PREPARE >>
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C                     WRITEPT1
|    C*
|    C* << ACCUMULATE & CLEAR >>+++++++++++++++++++++++++++++++++++++++
|    C                     Z-ADD*ZERO     PT11
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR -- HAS DATA
     C*==============================================================*
06===C           R8900     BEGSR
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* << TOTAL LINE DATA PREPARE >>
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C*
|    C* << ACCUMULATE & CLEAR >>+++++++++++++++++++++++++++++++++++++++
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR -- NO DATA
     C*==============================================================*
07===C           R8999     BEGSR
|    C*
|    C                     EXSR R1000
|    C*
|    C                     WRITEPH1
|    C*
|    C                     WRITEPE9
|    C*
07===C                     ENDSR
**
星期一星期二星期三星期四星期五星期六星期日
**
無上班刷卡資料無下班刷卡資料遲到　　　　　無排班資料　　早退　　　　　
忘刷卡　　　　簽到　　　　　不處理　　　　公出　　　　　多刷卡
