     H****************************************************************
     H*   PROGRAM NAME : PYR3262                                     *
     H*   AUTHER       : A1490 TERESA                                *
     H*   CREATE DATE  : 96/05/08                                    *
     H*   UPDATE DATE  :                                             *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :ㄆ羱戈╰参                               *
     H*   PROCEDURE    : PYR3071C                                    *
     H****************************************************************
     FPYEMPF  IF  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYDHPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR326P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E*---------------------------------------------------------------
     ILDA        UDS
     I                                      125 1270$CPY
     I                                      201 2080PDATE
     I                                      203 2080DDATE
     I                                      209 2160$C8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I                                      501 5040DYM
     I                                      503 5040DMM
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      601 602 DEM011
     I                                      603 604 DEM012
     I                                      605 611 DEM041
     I                                      612 618 DEM042
     I                                      619 626 DEM021
     I                                      627 634 DEM022
     I                                      635 6420CDYMD
     I                                      635 6400CDYM
     I                                      635 6380CDYMYY
     I                                      639 6400CDYMMM
     I                                      641 6420CDYMDD
     I                                      643 643 DHD04
     I                                      644 644 DOP
     I*
     IWF05        DS
     I                                        1   1 WF051
     I                                        2   2 WF052
     I                                        3   3 WF053
     I                                        4   7 WF054
     I*
     I            DS
     I                                        1   7 O04
     I                                        1   1 O041
     I                                        2   2 O042
     I                                        3   3 O043
     I                                        4   7 O044
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*
     C           KEYDH     KLIST
     C                     KFLD           EM01
     C                     KFLD           CDYM
     C                     KFLD           EM02
     C*
     C           KEYDP     KLIST
     C                     KFLD           EM041            场絪腹
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*PRINT FILE HEADING
     C                     EXSR RTN010                      HEADING
     C*
     C           *LOVAL    SETLLPYEMPF
     C                     READ PYEMPF                   46
     C*                    CLEARPH2
     C           KEYDP     CHAINPYDPPF               40
     C*                    WRITEPH2
     C                     MOVELEM041     O041
     C                     MOVELEM042     O042
     C                     MOVELEM043     O043
     C                     MOVELEM044     O044
  01-C           *IN46     DOWEQ*OFF
    C*HEADING
    C   39      EM01      CHAINSYCMPF               40
    C   39                WRITEPH1
    C   39                SETOF                     39
    C*
    C*传场
  02-C           O041      IFNE EM041
    C           O042      ORNE EM042
    C           O043      ORNE EM043
    C           O044      ORNE EM044
    C                     SETON                     61
    C                     MOVEL*ALL'-'   LINE4
    C                     WRITEPT1
    C                     CLEARPT1
    C*                    CLEARPH2
    C           KEYDP     CHAINPYDPPF               40
    C*                    WRITEPH2
    C                     MOVELEM041     O041
    C                     MOVELEM042     O042
    C                     MOVELEM043     O043
    C                     MOVELEM044     O044
  02-C                     ENDIF
    C                     EXSR RTN200
    C                     EXSR RTN300
    C                     READ PYEMPF                   46
  01-C                     ENDDO
     C*
     C*                    MOVEL*ALL'-'   LINE5
     C                     EXSR RTN900                      PRINT END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010... PRINT FILE HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*盿PRINT FILE HEADING戈
|    C*
|    C                     MOVEL*ALL'-'   LINE1
|    C                     MOVEL*ALL'-'   LINE2
|    C           DEM011    CHAINSYCMPF               40
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETON                     61
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN200... WRITE TO PRTF
     C*==============================================================*
02===C           RTN200    BEGSR
|    C*
|    C                     MOVELEM02      PEM02
|    C                     MOVELEM03      PEM03
|    C                     Z-ADDEM13      PEM13
|    C                     Z-ADDEM19      PEM19
|    C*
|    C           KEYDH     CHAINDH0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     Z-ADDDH04      PDW04
|   C                     Z-ADDDH05      PDW05
|   C                     Z-ADDDH06      PDW06
|   C                     Z-ADDDH07      PDW07
|   C                     Z-ADDDH08      PDW08
|   C                     Z-ADDDH09      PDW09
| 01*C                     ELSE
|   C                     Z-ADD0         PDW04
|   C                     Z-ADD0         PDW05
|   C                     Z-ADD0         PDW06
|   C                     Z-ADD0         PDW07
|   C                     Z-ADD0         PDW08
|   C                     Z-ADD0         PDW09
|   C                     Z-ADD0         DH04
|   C                     Z-ADD0         DH05
|   C                     Z-ADD0         DH06
|   C                     Z-ADD0         DH07
|   C                     Z-ADD0         DH08
|   C                     Z-ADD0         DH09
|   C*
| 01-C                     ENDIF
|    C*
| 02-C           DH04      IFNE 0
|   C           DH05      ORNE 0
|   C           DH06      ORNE 0
|   C           DH07      ORNE 0
|   C           DH08      ORNE 0
|   C           DH09      ORNE 0
|   C*
|   C                     WRITEPD1
|   C                     SETOF                     61
|   C*
| 02-C                     ENDIF
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN300... PRINT FILE
     C*==============================================================*
03===C           RTN300    BEGSR
|    C*糶PT1
|    C                     ADD  DH04      PTO01
|    C                     ADD  DH05      PTO02
|    C                     ADD  DH06      PTO03
|    C                     ADD  DH07      PTO04
|    C                     ADD  DH08      PTO05
|    C                     ADD  DH09      PTO06
|    C*
|    C                     ADD  DH04      PTO11
|    C                     ADD  DH05      PTO12
|    C                     ADD  DH06      PTO13
|    C                     ADD  DH07      PTO14
|    C                     ADD  DH08      PTO15
|    C                     ADD  DH09      PTO16
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN900... PRINT ENDING
     C*==============================================================*
04===C           RTN900    BEGSR
|    C*
|    C                     MOVEL*ALL'-'   LINE4
|    C                     WRITEPT1
|    C                     WRITEPT2
|    C                     WRITEPE1
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          *INZSR    INITIAL
     C*==============================================================*
05===C           *INZSR    BEGSR
|    C*
|    C                     MOVEL*ALL'-'   LINE3
|    C                     MOVEL*ALL'-'   LINE5
|    C*
05===C                     ENDSR
