     H****************************************************************
     H*   PROGRAM NAME : PYR3082                                     *
     H*   AUTHER       : A1490 TERESA                                *
     H*   CREATE DATE  : 96/05/02                                    *
     H*   UPDATE DATE  :                                             *
     H*   SYSTEM       :人事薪資系統                               *
     H****************************************************************
     FPYEMPF  IP  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYSSLF03IF  E           K        DISK
     FPYHDPF  IF  E           K        DISK
     FPYH4PF  IF  E           K        DISK
     FPYR308P O   E             39     PRINTER
     I*---------------------------------------------------------------
     ILDA        UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      555 556 DEM01
     I                                      623 629 DEM041
     I                                      630 636 DEM042
     I                                      531 538 DEM021
     I                                      539 546 DEM022
     I                                      547 5520WDYM
     I                                      547 5500WDYMY
     I                                      551 5520WDYMM
     I                                      553 5540WDYDD
     I                                      547 5540WDYMD
     I                                      557 557 DPH04
     I              '公司提繳6%'        C         CON1
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYDP     KLIST
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C           KEYHD     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           WDYM
     C                     KFLD           DPH04
     C           KEYSS     KLIST
     C                     KFLD           SS09             項目屬性
     C                     KFLD           CM13             薪資組別
     C                     KFLD           HD05             薪資代碼
     C           KEYH4     KLIST
     C                     KFLD           EM01             公司別
     C                     KFLD           EM02             工號
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C  N10                EXSR RTN010
     C*
     C           EM11      IFNE 'Y'
     C           EM19      ORGT WDYMD
     C           KEYHD     CHAINPYHDPF               40
     C           *IN40     IFEQ *OFF
     C                     EXSR RTN020
     C                     ENDIF
     C                     ENDIF
     C*
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     IN   *NAMVAR
|    C                     SETON                     10
|    C*
|    C                     MOVEL'Y'       $DATA
     C                     MOVEL'1'       SS09
|    C*
|    C           DEM01     CHAINCM0                  40
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN020... MAIN PROCESS
     C*==============================================================*
02===C           RTN020    BEGSR
|    C*
     C                     SETON                     39
     C                     WRITEPH1
     C                     CLEARPD1
     C                     MOVELEM02      PEM02
     C                     MOVELEM31      PEM31
     C                     MOVELEM03      PEM03
     C           KEYDP     CHAINPYDPPF               40
     C                     EXSR RTN021                     算薪水
     C           TOT1      SUB  TOT2      TOT3             實領金額
     C                     Z-ADDTOT3      TOT6             金額
     C                     WRITEPD1
     C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN021...算薪水
     C*==============================================================*
02===C           RTN021    BEGSR
|    C*
     C           KEYHD     SETLLPYHDPF
     C           KEYHD     READEPYHDPF                   46
     C           *IN46     DOWEQ*OFF
     C           KEYSS     CHAINPYSSLF03             40
     C           SS04      IFEQ 'A'                        加項金額
     C                     SELEC                           列印位置
     C           SS021     WHEQ *BLANK
     C                     MOVELSS02      SS021
     C                     Z-ADDHD06      HD061
     C           SS022     WHEQ *BLANK
     C                     MOVELSS02      SS022
     C                     Z-ADDHD06      HD062
     C           SS023     WHEQ *BLANK
     C                     MOVELSS02      SS023
     C                     Z-ADDHD06      HD063
     C           SS024     WHEQ *BLANK
     C                     MOVELSS02      SS024
     C                     Z-ADDHD06      HD064
     C           SS025     WHEQ *BLANK
     C                     MOVELSS02      SS025
     C                     Z-ADDHD06      HD065
     C           SS026     WHEQ *BLANK
     C                     MOVELSS02      SS026
     C                     Z-ADDHD06      HD066
     C           SS027     WHEQ *BLANK
     C                     MOVELSS02      SS027
     C                     Z-ADDHD06      HD067
     C           SS028     WHEQ *BLANK
     C                     MOVELSS02      SS028
     C                     Z-ADDHD06      HD068
     C           SS029     WHEQ *BLANK
     C                     MOVELSS02      SS029
     C                     Z-ADDHD06      HD069
     C           SS0210    WHEQ *BLANK
     C                     MOVELSS02      SS0210
     C                     Z-ADDHD06      HD0610
     C           SS0211    WHEQ *BLANK
     C                     MOVELSS02      SS0211
     C                     Z-ADDHD06      HD0611
     C           SS0212    WHEQ *BLANK
     C                     MOVELSS02      SS0212
     C                     Z-ADDHD06      HD0612
     C           SS0213    WHEQ *BLANK
     C                     MOVELSS02      SS0213
     C                     Z-ADDHD06      HD0613
     C           SS0214    WHEQ *BLANK
     C                     MOVELSS02      SS0214
     C                     Z-ADDHD06      HD0614
     C           SS0215    WHEQ *BLANK
     C                     MOVELSS02      SS0215
     C                     Z-ADDHD06      HD0615
     C           SS0216    WHEQ *BLANK
     C                     MOVELSS02      SS0216
     C                     Z-ADDHD06      HD0616
     C                     ENDSL
     C                     ADD  HD06      TOT1
     C           SS03      IFEQ 'Y'
     C                     ADD  HD06      TOT4             應稅總額
     C                     ELSE
     C                     ADD  HD06      TOT5             免稅總額
     C                     ENDIF
     C                     ELSE                            減項金額
     C                     SELEC
     C           SS0222    WHEQ *BLANK
     C                     MOVELSS02      SS0222
     C                     Z-ADDHD06      HD0622
     C           SS0223    WHEQ *BLANK
     C                     MOVELSS02      SS0223
     C                     Z-ADDHD06      HD0623
     C           SS0224    WHEQ *BLANK
     C                     MOVELSS02      SS0224
     C                     Z-ADDHD06      HD0624
     C           SS0225    WHEQ *BLANK
     C                     MOVELSS02      SS0225
     C                     Z-ADDHD06      HD0625
     C           SS0226    WHEQ *BLANK
     C                     MOVELSS02      SS0226
     C                     Z-ADDHD06      HD0626
     C           SS0227    WHEQ *BLANK
     C                     MOVELSS02      SS0227
     C                     Z-ADDHD06      HD0627
     C           SS0228    WHEQ *BLANK
     C                     MOVELSS02      SS0228
     C                     Z-ADDHD06      HD0628
     C           SS0229    WHEQ *BLANK
     C                     MOVELSS02      SS0229
     C                     Z-ADDHD06      HD0629
     C           SS0230    WHEQ *BLANK
     C                     MOVELSS02      SS0230
     C                     Z-ADDHD06      HD0630
     C           SS0231    WHEQ *BLANK
     C                     MOVELSS02      SS0231
     C                     Z-ADDHD06      HD0631
     C           SS0232    WHEQ *BLANK
     C                     MOVELSS02      SS0232
     C                     Z-ADDHD06      HD0632
     C           SS0233    WHEQ *BLANK
     C                     MOVELSS02      SS0233
     C                     Z-ADDHD06      HD0633
     C           SS0234    WHEQ *BLANK
     C                     MOVELSS02      SS0234
     C                     Z-ADDHD06      HD0634
     C           SS0235    WHEQ *BLANK
     C                     MOVELSS02      SS0235
     C                     Z-ADDHD06      HD0635
     C           SS0236    WHEQ *BLANK
     C                     MOVELSS02      SS0236
     C                     Z-ADDHD06      HD0636
     C           SS0237    WHEQ *BLANK
     C                     MOVELSS02      SS0237
     C                     Z-ADDHD06      HD0637
     C                     ENDSL
     C                     ADD  HD06      TOT2             扣除總額
     C                     ENDIF
     C           KEYHD     READEPYHDPF                   46
     C                     ENDDO
     C           KEYH4     CHAINPYH4PF               40
     C  N40                MOVELCON1      SS0241
     C  N40      H409      MULT 0.06      HD0641
     C*
02===C                     ENDSR
     C*==============================================================*
