     H****************************************************************
     H*   PROGRAM NAME : PYR3012                                     *
     H*   AUTHER       : A1084 CHARLES                               *
     H*   CREATE DATE  : 82/02/14                                    *
     H*   UPDATE DATE  : 90/04/18 A1274 EVA                          *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR3011C                                    *
     H****************************************************************
     FPYPYJF01IP  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYSSLF01IF  E           K        DISK
     FPYPDPF  IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FPYEMPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYJTPF  IF  E           K        DISK
     FSYBNPF  IF  E           K        DISK
     FPYR301P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    A1         48  2
     E                    A2         48 14
     E                    A3         48  9 0
     E                    T1         48 10 0
     E                    T2         48 10 0
     E                    T3         48 10 0
     E                    T4         48 10 0
     E                    T5         48 10 0
     E*---------------------------------------------------------------
     IPYJF01
     I                                              EM041 L2
     I                                              EM042 L2
     I                                              EM043 L2
     I                                              EM044 L2
     I                                              PY02  L1
     ILDA        UDS
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DEM01
     I                                      503 509 DEM041
     I                                      510 516 DEM042
     I                                      551 558 DEM021
     I                                      559 566 DEM022
     I                                      529 529 DYN
     I/COPY QDDSSRC,PYPMDS01
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN SS09      WSS09
     C           *LIKE     DEFN SS05      WSS05
     C           *LIKE     DEFN SS18      WSS18
     C           *LIKE     DEFN CM14      DFMT
     C           *LIKE     DEFN CM15      DTYPE
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           KEYDP     KLIST
     C                     KFLD           DP011
     C                     KFLD           DP012
     C                     KFLD           DP013
     C                     KFLD           DP014
     C           KEYSS     KLIST                           *PYSSPF
     C                     KFLD           WSS09
     C                     KFLD           WSS05
     C                     KFLD           WSS18
     C           KEYPD     KLIST
     C                     KFLD           PY01
     C                     KFLD           PY02
     C           KEYPM     KLIST
     C                     KFLD           DPM01
     C                     KFLD           PY01
     C           KEYPD1    KLIST
     C                     KFLD           PY01
     C           KEYJT     KLIST
     C                     KFLD           EM05
     C           KEYBN     KLIST
     C                     KFLD           PY04
     C                     KFLD           PY05
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
  01-C           *INL2     IFEQ '1'
    C                     MOVELEM041     DP011
    C                     MOVELEM042     DP012
    C                     MOVELEM043     DP013
    C                     MOVELEM044     DP014
    C           KEYDP     CHAINDP0                  40
    C   40                MOVEL*BLANK    DP02
  01-C                     END
     C*
     C                     EXSR RTN100
     C*
     C*L1 10                EXSR RTN810
     C*L2 10                EXSR RTN820
     C*L3 10                EXSR RTN830
     C*L4 10                EXSR RTN840
     CLR 10                EXSR RTN890
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   *NAMVAR
|    C*
|    C           DEM01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C   40                MOVEL*BLANKS   WSS18
|    C  N40                MOVELCM13      WSS18
|    C                     MOVE CM14      DFMT
|    C                     MOVE CM15      DTYPE
|    C*
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C                     Z-ADD*ZERO     PT11
|    C                     Z-ADD*ZERO     PT21
|    C                     Z-ADD*ZERO     PT31
|    C                     Z-ADD*ZERO     PT41
|    C                     Z-ADD*ZERO     PT51
|    C                     Z-ADD*ZERO     PT12
|    C                     Z-ADD*ZERO     PT22
|    C                     Z-ADD*ZERO     PT32
|    C                     Z-ADD*ZERO     PT42
|    C                     Z-ADD*ZERO     PT52
|    C                     Z-ADD0         A3
|    C                     Z-ADD0         T1
|    C                     Z-ADD0         T2
|    C                     Z-ADD0         T3
|    C                     Z-ADD0         T4
|    C                     Z-ADD0         T5
|    C                     MOVE *BLANKS   A1
|    C                     MOVE *BLANKS   A2
|    C                     MOVE *BLANKS   PBN02
|    C                     Z-ADD*ZERO     PALL
|    C                     Z-ADD*ZERO     T5045
|    C                     Z-ADD*ZERO     COUNT   20       列印筆數
|    C*薪資項目
|    C                     Z-ADD0         I       20
|    C                     MOVEL'1'       WSS09
|    C                     MOVEL'1'       WSS05
|    C           KEYSS     SETLLSS0
|    C           KEYSS     READESS0                      46
| 01-C           *IN46     DOWEQ'0'
|   C           I         ANDLT48
|   C                     ADD  1         I
|   C                     MOVELSS01      A1,I
|   C                     MOVELSS02      A2,I
|   C           KEYSS     READESS0                      46
| 01-C                     END
|     *
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     MOVELEM041     DP011
|    C                     MOVELEM042     DP012
|    C                     MOVELEM043     DP013
|    C                     MOVELEM044     DP014
|    C           KEYDP     CHAINDP0                  40
|    C   40                MOVEL*BLANK    DP02
|    C*
|    C*OVER FLOWER
| 01-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 01-C                     END
|    C*DETL
|    C                     EXSR RTN300
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200... WRITE HEADING
     C*==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C                     MOVELEM041     DP011
|    C                     MOVELEM042     DP012
|    C                     MOVELEM043     DP013
|    C                     MOVELEM044     DP014
|    C                     MOVEL*BLANK    DP02
|    C           KEYDP     CHAINDP0                  40
|     *
|    C                     MOVEL*BLANKS   SS021
|    C                     MOVEL*BLANKS   SS022
|    C                     MOVEL*BLANKS   SS023
|    C                     MOVEL*BLANKS   SS024
|    C                     Z-ADD0         J       20
|    C                     Z-ADD0         L       20
| 01-C           L         DOWLT4
|   C                     ADD  1         J
|   C                     ADD  1         L
| 02-C           L         IFEQ 1
|   C                     MOVELA2,J      SS021
| 02-C                     END
| 03-C           L         IFEQ 2
|   C                     MOVELA2,J      SS022
| 03-C                     END
| 04-C           L         IFEQ 3
|   C                     MOVELA2,J      SS023
| 04-C                     END
| 05-C           L         IFEQ 4
|   C                     MOVELA2,J      SS024
| 05-C                     END
| 01-C                     END
|    C                     WRITEPH1
|    C*
| 06-C           J         DOWLTI
|   C                     MOVEL*BLANKS   SS021
|   C                     MOVEL*BLANKS   SS022
|   C                     MOVEL*BLANKS   SS023
|   C                     MOVEL*BLANKS   SS024
|   C                     Z-ADD0         L
| 07-C           L         DOWLT4
|   C                     ADD  1         J
|   C                     ADD  1         L
| 08-C           L         IFEQ 1
|   C                     MOVELA2,J      SS021
| 08-C                     END
| 09-C           L         IFEQ 2
|   C                     MOVELA2,J      SS022
| 09-C                     END
| 10-C           L         IFEQ 3
|   C                     MOVELA2,J      SS023
| 10-C                     END
| 11-C           L         IFEQ 4
|   C                     MOVELA2,J      SS024
| 11-C                     END
| 07-C                     END
|   C                     WRITEPH11
| 06-C                     END
|    C                     WRITEPH12
|    C*
|    C                     SETOF                     313233
|    C                     SETOF                     3435
03===C                     ENDSR
     C*==============================================================*
     C*          RTN300... WRITE DETAIL
     C*==============================================================*
04===C           RTN300    BEGSR
|    C*
|    C                     MOVELEM041     DP011
|    C                     MOVELEM042     DP012
|    C                     MOVELEM043     DP013
|    C                     MOVELEM044     DP014
|    C                     MOVEL*BLANK    PBN02
|    C                     MOVEL*BLANK    DP02
|    C           KEYDP     CHAINDP0                  40
|    C*
|    C                     MOVE *BLANKS   JT02
|    C           KEYJT     CHAINJT0                  40
|    C*
|    C                     MOVEL*BLANK    PBN02
|    C           KEYBN     CHAINBN0                  41
| 01-C           *IN41     IFEQ '0'
|   C                     CALL 'P65'
|   C                     PARM BN02      P6501I 80
|   C                     PARM 9         P6502I  30
|   C           PBN02     PARM           P6511O 80
|   C                     PARM           P6512O 80
| 01-C                     END
|    C*
|    C*OVER FLOWER
|    C*WRITE PD
|    C                     EXSR RTN400
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN400... WRITE DETAIL
     C*==============================================================*
05===C           RTN400    BEGSR
|    C*
     C                     MOVEL'01'      DPM01   2
     C           KEYPM     CHAINPM0                  41
     C           *IN41     IFEQ '0'
|    C*
|    C                     Z-ADD*ZERO     DPY03   70       個人合計
|    C*                    Z-ADDPY03      PALL
|    C*
     C           KEYPD     CHAINEM0                  40
     C           *IN40     IFEQ '0'
|    C*
     C           EM100     IFEQ '1'                         *月薪
|    C                     Z-ADDPY03      DPY03            個人合計
     C                     END
     C           EM100     IFEQ '2'                         *日薪
|    C           PY03      MULT PM102     DPY03     H      個人合計
     C                     END
|    C*
|    C                     Z-ADDDPY03     PALL             個人合計
     C                     END
|    C*
     C                     END
|    C*
|    C           KEYPD     SETLLPD0
|    C           KEYPD     READEPD0                      46
| 01-C           *IN46     DOWEQ'0'
|   C                     Z-ADD1         Y       20
|   C           PD03      LOKUPA1,Y                     40
| 02-C           *IN40     IFEQ '1'
|   C                     Z-ADDPD04      A3,Y
|   C                     ADD  PD04      PALL             個人合計
| 02-C                     END
|   C           KEYPD     READEPD0                      46
| 01-C                     END
|    C*
|    C                     Z-ADD0         PD041
|    C                     Z-ADD0         PD042
|    C                     Z-ADD0         PD043
|    C                     Z-ADD0         PD044
|    C                     Z-ADD0         X       20
|    C                     Z-ADD0         K       20
|    C*
| 03-C           K         DOWLT4
|   C                     ADD  1         X
|   C                     ADD  1         K
| 04-C           K         IFEQ 1
|   C                     Z-ADDA3,X      PD041
| 04-C                     END
| 05-C           K         IFEQ 2
|   C                     Z-ADDA3,X      PD042
| 05-C                     END
| 06-C           K         IFEQ 3
|   C                     Z-ADDA3,X      PD043
| 06-C                     END
| 07-C           K         IFEQ 4
|   C                     Z-ADDA3,X      PD044
| 07-C                     END
| 03-C                     END
|    C*
|    C*
| 08-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 08-C                     END
|    C*
|    C                     ADD  1         COUNT
|    C*
|    C                     WRITEPD1
|    C*-------------------------------------------------------------***
|    C                     ADD  1         PT51
|    C                     ADD  PY03      PT52
|    C                     ADD  PALL      T5045
|    C                     Z-ADD*ZERO     PALL             個人合計
|    C                     MOVEL*BLANKS   PBN02
|    C*
| 09-C           X         DOWLTI
|   C                     Z-ADD0         PD041
|   C                     Z-ADD0         PD042
|   C                     Z-ADD0         PD043
|   C                     Z-ADD0         PD044
|   C                     Z-ADD0         K
| 10-C           K         DOWLT4
|   C                     ADD  1         X
|   C                     ADD  1         K
| 11-C           K         IFEQ 1
|   C                     Z-ADDA3,X      PD041
| 11-C                     END
| 12-C           K         IFEQ 2
|   C                     Z-ADDA3,X      PD042
| 12-C                     END
| 13-C           K         IFEQ 3
|   C                     Z-ADDA3,X      PD043
| 13-C                     END
| 14-C           K         IFEQ 4
|   C                     Z-ADDA3,X      PD044
| 14-C                     END
| 10-C                     END
|    *
| 15-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 15-C                     END
|   C*
|   C                     ADD  1         COUNT
|   C*
| 16-C           COUNT     IFEQ 50
|   C                     WRITEPD2
|   C                     SETON                     39
|   C                     Z-ADD0         COUNT
| 16*C                     ELSE
|   C                     WRITEPD2
| 16-C                     END
|   C*
| 09-C                     END
|    C*-------------------------------------------------------------***
|    C*
|    C                     Z-ADD0         X       20
| 17-C           X         DOWLTI
|   C                     ADD  1         X
|   C*                    ADD  A3,X      T1,X
|   C                     ADD  A3,X      T5,X
| 17-C                     END
|    C*
|    C                     Z-ADD0         A3
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RTN810... LEVEL BREAK 1
     C*==============================================================*
06===C           RTN810    BEGSR
|    C*
|    C                     SETOF                     31
|    C                     Z-ADD0         X       20
|    C                     Z-ADD0         T1041
|    C                     Z-ADD0         T1042
|    C                     Z-ADD0         T1043
|    C                     Z-ADD0         T1044
| 01-C           X         DOWLT4
|   C                     ADD  1         X
| 02-C           X         IFEQ 1
|   C                     Z-ADDT1,X      T1041
| 02-C                     END
| 03-C           X         IFEQ 2
|   C                     Z-ADDT1,X      T1042
| 03-C                     END
| 04-C           X         IFEQ 3
|   C                     Z-ADDT1,X      T1043
| 04-C                     END
| 05-C           X         IFEQ 4
|   C                     Z-ADDT1,X      T1044
| 05-C                     END
| 01-C                     END
|     *
| 06-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 06-C                     END
|    C                     WRITEPT1
|    C                     SETON                     31
|    C*
| 07-C           X         DOWLTI
|   C                     Z-ADD0         T1041
|   C                     Z-ADD0         T1042
|   C                     Z-ADD0         T1043
|   C                     Z-ADD0         T1044
|   C                     Z-ADD0         K       20
| 08-C           K         DOWLT4
|   C                     ADD  1         X
|   C                     ADD  1         K
| 09-C           K         IFEQ 1
|   C                     Z-ADDT1,X      T1041
| 09-C                     END
| 10-C           K         IFEQ 2
|   C                     Z-ADDT1,X      T1042
| 10-C                     END
| 11-C           K         IFEQ 3
|   C                     Z-ADDT1,X      T1043
| 11-C                     END
| 12-C           K         IFEQ 4
|   C                     Z-ADDT1,X      T1044
| 12-C                     END
| 08-C                     END
|    *
| 13-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 13-C                     END
|    *
|   C                     WRITEPT1
| 07-C                     END
|     *
|    C                     Z-ADD0         X       20
| 14-C           X         DOWLTI
|   C                     ADD  1         X
|   C                     ADD  T1,X      T2,X
| 14-C                     END
|    C                     Z-ADD0         T1
|    C*
|    C                     ADD  PT11      PT21
|    C                     ADD  PT12      PT22
|    C                     Z-ADD*ZERO     PT11
|    C                     Z-ADD*ZERO     PT12
06===C                     ENDSR
     C*==============================================================*
     C*          RTN820... LEVEL BREAK 2
     C*==============================================================*
07===C           RTN820    BEGSR
|    C*
|    C                     SETOF                     32
|    C                     Z-ADD0         X       20
|    C                     Z-ADD0         T2041
|    C                     Z-ADD0         T2042
|    C                     Z-ADD0         T2043
|    C                     Z-ADD0         T2044
| 01-C           X         DOWLT4
|   C                     ADD  1         X
| 02-C           X         IFEQ 1
|   C                     Z-ADDT2,X      T2041
| 02-C                     END
| 03-C           X         IFEQ 2
|   C                     Z-ADDT2,X      T2042
| 03-C                     END
| 04-C           X         IFEQ 3
|   C                     Z-ADDT2,X      T2043
| 04-C                     END
| 05-C           X         IFEQ 4
|   C                     Z-ADDT2,X      T2044
| 05-C                     END
| 01-C                     END
|     *
| 06-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 06-C                     END
|    C                     WRITEPT2
|    C                     SETON                     32
|    C*
| 07-C           X         DOWLTI
|   C                     Z-ADD0         T2041
|   C                     Z-ADD0         T2042
|   C                     Z-ADD0         T2043
|   C                     Z-ADD0         T2044
|   C                     Z-ADD0         K
| 08-C           K         DOWLT4
|   C                     ADD  1         X
|   C                     ADD  1         K
| 09-C           K         IFEQ 1
|   C                     Z-ADDT2,X      T2041
| 09-C                     END
| 10-C           K         IFEQ 2
|   C                     Z-ADDT2,X      T2042
| 10-C                     END
| 11-C           K         IFEQ 3
|   C                     Z-ADDT2,X      T2043
| 11-C                     END
| 12-C           K         IFEQ 4
|   C                     Z-ADDT2,X      T2044
| 12-C                     END
| 08-C                     END
|    *
| 13-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 13-C                     END
|    *
|   C                     WRITEPT2
| 07-C                     END
|     *
|    C                     Z-ADD0         X       20
| 14-C           X         DOWLTI
|   C                     ADD  1         X
|   C                     ADD  T2,X      T3,X
| 14-C                     END
|    C                     Z-ADD0         T2
|    C*
|    C                     ADD  PT21      PT31
|    C                     ADD  PT22      PT32
|    C                     Z-ADD*ZERO     PT21
|    C                     Z-ADD*ZERO     PT22
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          RTN830... LEVEL BREAK 3
     C*==============================================================*
08===C           RTN830    BEGSR
|    C*
|    C                     SETOF                     33
|    C                     Z-ADD0         X       20
|    C                     Z-ADD0         T3041
|    C                     Z-ADD0         T3042
|    C                     Z-ADD0         T3043
|    C                     Z-ADD0         T3044
| 01-C           X         DOWLT4
|   C                     ADD  1         X
| 02-C           X         IFEQ 1
|   C                     Z-ADDT3,X      T3041
| 02-C                     END
| 03-C           X         IFEQ 2
|   C                     Z-ADDT3,X      T3042
| 03-C                     END
| 04-C           X         IFEQ 3
|   C                     Z-ADDT3,X      T3043
| 04-C                     END
| 05-C           X         IFEQ 4
|   C                     Z-ADDT3,X      T3044
| 05-C                     END
| 01-C                     END
|     *
| 06-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 06-C                     END
|    C                     WRITEPT3
|    C                     SETON                     33
|    C*
| 07-C           X         DOWLTI
|   C                     Z-ADD0         T3041
|   C                     Z-ADD0         T3042
|   C                     Z-ADD0         T3043
|   C                     Z-ADD0         T3044
|   C                     Z-ADD0         K
| 08-C           K         DOWLT4
|   C                     ADD  1         X
|   C                     ADD  1         K
| 09-C           K         IFEQ 1
|   C                     Z-ADDT3,X      T3041
| 09-C                     END
| 10-C           K         IFEQ 2
|   C                     Z-ADDT3,X      T3042
| 10-C                     END
| 11-C           K         IFEQ 3
|   C                     Z-ADDT3,X      T3043
| 11-C                     END
| 12-C           K         IFEQ 4
|   C                     Z-ADDT3,X      T3044
| 12-C                     END
| 08-C                     END
|    *
| 13-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 13-C                     END
|    *
|   C                     WRITEPT3
| 07-C                     END
|     *
|    C                     Z-ADD0         X       20
| 14-C           X         DOWLTI
|   C                     ADD  1         X
|   C                     ADD  T3,X      T4,X
| 14-C                     END
|    C                     Z-ADD0         T3
|    C*
|    C                     ADD  PT31      PT41
|    C                     ADD  PT32      PT42
|    C                     Z-ADD*ZERO     PT31
|    C                     Z-ADD*ZERO     PT32
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          RTN840... LEVEL BREAK 4
     C*==============================================================*
09===C           RTN840    BEGSR
|    C*
|    C                     SETOF                     34
|    C                     Z-ADD0         X       20
|    C                     Z-ADD0         T4041
|    C                     Z-ADD0         T4042
|    C                     Z-ADD0         T4043
|    C                     Z-ADD0         T4044
| 01-C           X         DOWLT4
|   C                     ADD  1         X
| 02-C           X         IFEQ 1
|   C                     Z-ADDT4,X      T4041
| 02-C                     END
| 03-C           X         IFEQ 2
|   C                     Z-ADDT4,X      T4042
| 03-C                     END
| 04-C           X         IFEQ 3
|   C                     Z-ADDT4,X      T4043
| 04-C                     END
| 05-C           X         IFEQ 4
|   C                     Z-ADDT4,X      T4044
| 05-C                     END
| 01-C                     END
|     *
| 06-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 06-C                     END
|    C                     WRITEPT4
|    C                     SETON                     34
|    C*
| 07-C           X         DOWLTI
|   C                     Z-ADD0         T4041
|   C                     Z-ADD0         T4042
|   C                     Z-ADD0         T4043
|   C                     Z-ADD0         T4044
|   C                     Z-ADD0         K
| 08-C           K         DOWLT4
|   C                     ADD  1         X
|   C                     ADD  1         K
| 09-C           K         IFEQ 1
|   C                     Z-ADDT4,X      T4041
| 09-C                     END
| 10-C           K         IFEQ 2
|   C                     Z-ADDT4,X      T4042
| 10-C                     END
| 11-C           K         IFEQ 3
|   C                     Z-ADDT4,X      T4043
| 11-C                     END
| 12-C           K         IFEQ 4
|   C                     Z-ADDT4,X      T4044
| 12-C                     END
| 08-C                     END
|    *
| 13-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 13-C                     END
|   C                     WRITEPT4
| 07-C                     END
|    C*
|    C                     Z-ADD0         X       20
| 14-C           X         DOWLTI
|   C                     ADD  1         X
|   C                     ADD  T4,X      T5,X
| 14-C                     END
|    C                     Z-ADD0         T4
|    C*
|    C                     ADD  PT41      PT51
|    C                     ADD  PT42      PT52
|    C                     Z-ADD*ZERO     PT41
|    C                     Z-ADD*ZERO     PT42
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK LR
     C*==============================================================*
10===C           RTN890    BEGSR
|    C*
|    C*------------------------------------------------------------***
|    C*
|    C                     SETOF                     35
|    C                     Z-ADD0         X       20
|    C                     Z-ADD0         T5041
|    C                     Z-ADD0         T5042
|    C                     Z-ADD0         T5043
|    C                     Z-ADD0         T5044
|    C*
| 01-C           X         DOWLT4
|   C                     ADD  1         X
| 02-C           X         IFEQ 1
|   C                     Z-ADDT5,X      T5041
| 02-C                     END
| 03-C           X         IFEQ 2
|   C                     Z-ADDT5,X      T5042
| 03-C                     END
| 04-C           X         IFEQ 3
|   C                     Z-ADDT5,X      T5043
| 04-C                     END
| 05-C           X         IFEQ 4
|   C                     Z-ADDT5,X      T5044
| 05-C                     END
| 01-C                     END
|    C*
| 06-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 06-C                     END
|    C*
|    C                     WRITEPT5
|    C                     SETON                     35
|    C*------------------------------------------------------------***
| 07-C           X         DOWLTI
|   C                     Z-ADD0         T5041
|   C                     Z-ADD0         T5042
|   C                     Z-ADD0         T5043
|   C                     Z-ADD0         T5044
|   C                     Z-ADD0         K
| 08-C           K         DOWLT4
|   C                     ADD  1         X
|   C                     ADD  1         K
| 09-C           K         IFEQ 1
|   C                     Z-ADDT5,X      T5041
| 09-C                     END
| 10-C           K         IFEQ 2
|   C                     Z-ADDT5,X      T5042
| 10-C                     END
| 11-C           K         IFEQ 3
|   C                     Z-ADDT5,X      T5043
| 11-C                     END
| 12-C           K         IFEQ 4
|   C                     Z-ADDT5,X      T5044
| 12-C                     END
| 08-C                     END
|   C*
| 13-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 13-C                     END
|   C*
|   C                     WRITEPT5
| 07-C                     END
|    C                     WRITEPE2
|    C*
|    C                     Z-ADD0         T5
|    C*
|    C                     Z-ADD*ZERO     PT51
|    C                     Z-ADD*ZERO     PT52
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
11===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
11===C                     ENDSR
