     H****************************************************************
     H*   PROGRAM NAME : PYR3042 薪資歷史資料列印                  *
     H*   AUTHER       : A1084 CHARLES                               *
     H*   CREATE DATE  : 82/02/14                                    *
     H*   UPDATE DATE  :                                             *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR3041C                                    *
     H*   PURPOSE      :
     H*   INDICATORS   :                                             *
     H****************************************************************
     FPYPYJF01IP  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYSSLF01IF  E           K        DISK
     FPYPDPF  IF  E           K        DISK
     FPYSHPF  IF  E           K        DISK
     FPYSDPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR304P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    A1         48  2
     E                    A2         48 14
     E                    SS0X        8 14
     E                    SD0X        8  7 0
     E                    A4         48  7 0
     E*---------------------------------------------------------------
     IPYJF01
     I                                              PY02  L1
     I                                              EM041 L2
     I                                              EM042 L2
     I                                              EM043 L2
     I                                              EM044 L2
     ILDA        UDS
     I                                      211 2160DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DEM01
     I                                      623 629 DEM041
     I                                      630 636 DEM042
     I                                      513 520 DEM021
     I                                      521 528 DEM022
     I**                                    529 5340DSH031
     I**                                    535 5400DSH032
     I                                      541 5480WSH031
     I                                      549 5560WSH032
     I                                      600 6060DSH031
     I                                      607 6130DSH032
     I            DS
     I                                        1 112 SS0X
     I                                        1  14 SS021
     I                                       15  28 SS022
     I                                       29  42 SS023
     I                                       43  56 SS024
     I                                       57  70 SS025
     I                                       71  84 SS026
     I                                       85  98 SS027
     I                                       99 112 SS028
     I            DS
     I                                        1  560SD0X
     I                                        1   70SD061
     I                                        8  140SD062
     I                                       15  210SD063
     I                                       22  280SD064
     I                                       29  350SD065
     I                                       36  420SD066
     I                                       43  490SD067
     I                                       50  560SD068
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN SS09      WSS09
     C           *LIKE     DEFN SS05      WSS05
     C           *LIKE     DEFN SS18      WSS18
     C           *LIKE     DEFN CM14      DFMT
     C           *LIKE     DEFN CM15      DTYPE
     C*==============================================================*
     C*                    KEYLIST
     C*==============================================================*
     C           KEYDP     KLIST
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C           KEYSS     KLIST
     C                     KFLD           WSS09
     C                     KFLD           WSS05
     C                     KFLD           WSS18
     C           KEYPD     KLIST
     C                     KFLD           PY01
     C                     KFLD           PY02
     C           KEYSH     KLIST
     C                     KFLD           PY01
     C                     KFLD           PY02
     C           KEYSH1    KLIST
     C                     KFLD           PY01
     C                     KFLD           PY02
     C                     KFLD           KSH03   80
     C           KEYSD     KLIST
     C                     KFLD           PY01
     C                     KFLD           PY02
     C                     KFLD           SH03
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
  01-C           *INL2     IFEQ '1'
    C                     MOVEL*BLANK    DP014
    C           KEYDP     CHAINDP0                  40
    C   40                MOVEL*BLANK    DP02
    C*                    MOVELDP02      PDP02H
    C*                    SETON                     39
    C                     SETOF                     2021
  01-C                     END
     C*
     C                     EXSR RTN300
     C*
     CL1 10NLR             EXSR RTN700
     CLR 10                WRITEPE2
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   *NAMVAR
|    C*
|    C           DEM01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C   40                MOVEL*BLANK    WSS18
|    C  N40                MOVELCM13      WSS18
|    C                     MOVE CM14      DFMT
|    C                     MOVE CM15      DTYPE
|    C*
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C                     MOVE *BLANKS   A1
|    C                     MOVE *BLANKS   A2
|    C*薪資項目
|    C                     Z-ADD0         I       20
|    C                     MOVEL'1'       WSS09
|    C                     MOVEL'1'       WSS05
|    C           KEYSS     SETLLSS0
|    C           KEYSS     READESS0                      46
| 01-C           *IN46     DOWEQ'0'
|   C           I         ANDLT48
|   C                     ADD  1         I
|   C                     MOVELSS01      A1,I
|   C                     MOVELSS02      A2,I
|   C           KEYSS     READESS0                      46
| 01-C                     END
|     *
01===C                     ENDSR
     C*==============================================================*
     C*          RTN200... WRITE HEADING
     C*==============================================================*
02===C           RTN200    BEGSR
|     *
|    C                     MOVEL*BLANKS   SS0X
|    C                     Z-ADD0         J       20
|    C                     Z-ADD0         L       20
| 01-C           L         DOWLT8
|   C                     ADD  1         J
|   C                     ADD  1         L
|   C                     MOVELA2,J      SS0X,L
| 01-C                     END
|    C                     WRITEPH1
|    C*
| 02-C           J         DOWLTI
|   C                     MOVEL*BLANKS   SS0X
|   C                     Z-ADD0         L
| 03-C           L         DOWLT8
|   C                     ADD  1         J
|   C                     ADD  1         L
|   C                     MOVELA2,J      SS0X,L
| 03-C                     END
|   C                     WRITEPH2
| 02-C                     END
|    C                     WRITEPH3
|    C*
|    C                     SETOF                     202139
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN300... WRITE DETAIL
     C*IN38 CONTROL是否有調薪明細列印
     C*==============================================================*
03===C           RTN300    BEGSR
|    C*
|    C                     SETOF                     38
| 01-C           EM13      IFGE WSH031
|   C           EM13      ANDLEWSH032
|   C                     SETON                     38
|   C                     EXSR RTN400                     .到職薪資
| 01-C                     END
|    C*
|    C                     MOVEL'N'       SWEM             .調薪
|    C*Z-ADDDSH031    KSH03
|    C                     CALL 'P31'
|    C                     PARM DSH031    P3101I  80
|    C                     PARM DFMT      P3102I  1
|    C                     PARM DTYPE     P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           KSH03     PARM           P3111O  80
|    C*
|    C           KEYSH1    SETLLSH0
|    C           KEYSH     READESH0                      46
|    C*                    CALL 'P31'
|    C*                    PARM DSH032    P3101I  80
|    C*                    PARM DFMT      P3102I  1
|    C*                    PARM DTYPE     P3103I  1
|    C*                    PARM '2'       P3104I  1
|    C*                    PARM '1'       P3105I  1
|    C*                    PARM           P3111O  80
|    C*                    Z-ADDP3111O    WSH032  80
| 02-C           *IN46     DOWEQ'0'
|   C********************************************************
|   C           SH03      ANDLEWSH032
|   C*
| 03-C           SH06      IFNE *ZERO
|   C                     SETON                     38    .HAS DATA
|   C                     MOVEL*ZERO     A4
|   C*調薪明細
|   C           KEYSD     SETLLSD0
|   C           KEYSD     READESD0                      44
| 04-C           *IN44     DOWEQ'0'
|   C*
|   C                     Z-ADD1         Y       20
|   C           SD04      LOKUPA1,Y                     40
| 05-C           *IN40     IFEQ '1'
|   C                     Z-ADDSD06      A4,Y
| 05-C                     END
|   C*
|   C           KEYSD     READESD0                      44
| 04-C                     END
|   C*
|   C                     EXSR RTN500
| 03-C                     END
|   C*
|   C           KEYSH     READESH0                      46
| 02-C                     END
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN400... WRITE DETAIL到職記錄
     C*==============================================================*
04===C           RTN400    BEGSR
|    C*
|    C                     MOVEL*ZERO     A4
|    C*
|    C                     Z-ADD*ZERO     KSH03
|    C           KEYSH1    SETLLSH0
|    C           KEYSH     READESH0                      46
|    C*
| 01-C           *IN46     IFEQ '0'                        .有調過薪
|   C           SH06      ANDNE*ZERO
|   C                     MOVEL'Y'       SWSH    1
|   C*調薪明細
|   C           KEYSD     SETLLSD0
|   C           KEYSD     READESD0                      44
|   C*
| 02-C           *IN44     DOWEQ'0'
|   C                     Z-ADD1         Y       20
|   C           SD04      LOKUPA1,Y                     40
| 03-C           *IN40     IFEQ '1'
|   C                     Z-ADDSD05      A4,Y
| 03-C                     END
|    *WRITE PD
|   C           KEYSD     READESD0                      44
| 02-C                     END
|   C*
| 01*C                     ELSE                            .無調薪
|   C*
|   C                     MOVEL'N'       SWSH
|   C*
|   C           KEYPD     SETLLPD0
|   C           KEYPD     READEPD0                      46
|   C*
| 04-C           *IN46     DOWEQ'0'
|   C                     Z-ADD1         Y       20
|   C           PD03      LOKUPA1,Y                     40
| 05-C           *IN40     IFEQ '1'
|   C                     Z-ADDPD04      A4,Y
| 05-C                     END
|   C*
|   C           KEYPD     READEPD0                      46
| 04-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     MOVEL'Y'       SWEM    1        .到職
|    C                     EXSR RTN500
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN500... WRITE DETAIL
     C*==============================================================*
05===C           RTN500    BEGSR
|    C*FIRST
| 01-C           SWEM      IFEQ 'N'
|   C*CHG BY JADI         Z-ADDSH03      PSH03
|   C                     CALL 'P31'
|   C                     PARM SH03      P3101I  80
|   C                     PARM '2'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM DFMT      P3104I  1
|   C                     PARM DTYPE     P3105I  1
|   C                     PARM           P3111O  80
|   C                     Z-ADDP3111O    PSH03
|   C*
|   C                     Z-ADDSH08      PPY03
|   C                     MOVELSH04      PSH04
|   C                     MOVELSH05      PSH05
| 01*C                     ELSE
|   C*Z-ADDEM13      PSH03
|   C                     CALL 'P31'
|   C                     PARM EM13      P3101I  80
|   C                     PARM '2'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM DFMT      P3104I  1
|   C                     PARM DTYPE     P3105I  1
|   C                     PARM           P3111O  80
|   C                     Z-ADDP3111O    PSH03
|   C*
|   C                     MOVEL*BLANK    PSH04
|   C                     MOVEL*BLANK    PSH05
| 02-C           SWSH      IFEQ 'Y'
|   C                     Z-ADDSH07      PPY03
| 02*C                     ELSE
|   C                     Z-ADDPY03      PPY03
| 02-C                     END
| 01-C                     END
|    C*
|    C                     Z-ADD0         SD0X
|    C                     Z-ADD0         X       20
| 03-C           X         DOWLT8
|   C                     ADD  1         X
|   C                     Z-ADDA4,X      SD0X,X
| 03-C                     END
|     *
| 04-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
| 04-C                     END
|    C                     WRITEPD1
|    C                     SETON                     2021
|    C*SECOND
| 05-C           X         DOWLTI
|   C                     Z-ADD0         K       20
|   C                     Z-ADD0         SD0X
|   C*
| 06-C           K         DOWLT8
|   C                     ADD  1         X
|   C                     ADD  1         K
|   C                     Z-ADDA4,X      SD0X,K
| 06-C                     END
|   C*
| 07-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
| 07-C                     END
|   C                     WRITEPD1
|   C*
| 05-C                     END
|    C*
|    C                     SETOF                     21
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RTN700... WRITE LINE
     C*==============================================================*
06===C           RTN700    BEGSR
|    C*
|    C   38                WRITEPLINE
|    C                     SETOF                     2021
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
07===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
07===C                     ENDSR
