     H****************************************************************
     H*   PROGRAM NAME : PYR3102                                     *
     H*   AUTHER       : A1084 CHARLES                               *
     H*   CREATE DATE  : 82/02/14                                    *
     H*   UPDATE DATE  :                                             *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR3101C                                    *
     H*   PURPOSE      :
     H*   INDICATORS   :                                             *
     H****************************************************************
     FPYPYPF  IP  E           K        DISK
     FPYEMPF  IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     F*PYPHPF  IF  E           K        DISK
     F*PYPWPF  IF  E           K        DISK
     F*PYBCPF  IF  E           K        DISK
     FPYR310F O   E                    DISK
     I*DATA AREA
     ILDA        UDS
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DPY01
     I*                                     503 5080DYMD
     I*                                     503 5060DYM
     I*                                     505 5060DMM
     I*                                     507 5080DPY07
     I                                      509 511 DBN01
     I                                      516 518 DBN02
     I                                      523 523 DSEL
     I                                      524 524 DOP
     I                                      525 5320WDYMD
     I                                      525 5280WDYM
     I                                      529 5300WDMM
     I                                      525 5300WYM
     I                                      531 5320WDPY07
     I                                      601 6040DYMD
     I                                      601 6040DYM
     I                                      603 6040DMM
     I                                      606 6110DPY07
     I            DS
     I                                        1   80PYMD
     I                                        1   60PYM
     I                                        1   40PYY
     I                                        5   60PMM
     I                                        7   80PDD
     I/COPY QDDSSRC,PYPMDS01
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN CM004O    DFMT
     C           *LIKE     DEFN CM005O    DTYPE
     C*==============================================================*
     C*                    KEY
     C*==============================================================*
     C           KEYEM     KLIST                           *SYPHPF
     C                     KFLD           PY01
     C                     KFLD           PY02
     C           KEYPM     KLIST
     C                     KFLD           PM01
     C                     KFLD           DPY01
     C*          KEYBC     KLIST                           *SYEMPF
     C*                    KFLD           PY01
     C*                    KFLD           PY02
     C*                    KFLD           DSEL
     C*                    KFLD           PYM
     C*                    KFLD           PDD
     C*          KEYPH     KLIST                           *SYPHPF
     C*                    KFLD           PY01
     C*                    KFLD           PY02
     C*                    KFLD           WYM
     C*                    KFLD           DSEL
     C*          KEYPW     KLIST                           *SYPHPF
     C*                    KFLD           PY01
     C*                    KFLD           WYM
     C*                    KFLD           DSEL
     C*                    KFLD           PY02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN300
     C*
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     SETON                     10
|    C                     MOVEL'Y'       $DATA
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   *NAMVAR
|    C*
|    C                     MOVEL'01'      PM01
|    C           KEYPM     CHAINPM0                  40
|    C   40                Z-ADD0         PM203
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DPY01     CM001I  2         公司代號
|    C                     PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C           DFMT      PARM           CM004O  1         日期格式
|    C           DTYPE     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C*
|    C*Z-ADDDYMD      PYMD
|    C*                    CALL 'P39'
|    C*                    PARM DYMD      P3901I  60
|    C*                    PARM '1'       P3902I  1
|    C*                    PARM '1'       P3903I  1
|    C*                    PARM '2'       P3904I  1
|    C*                    PARM '1'       P3905I  1
|    C*          PYMD      PARM           P3911O  60
|    C*          DSEL      IFEQ '1'                        .下期
|    C*                    ADD  PM203     PMM
|    C*          PMM       IFGT 12
|    C*                    SUB  12        PMM
|    C*                    ADD  1         PYY
|    C*                    END
|    C*                    END
|    C*
|    C*          PDD       IFNE 99
|    C*                    CALL 'P34'
|    C*                    PARM PYM       P3401I  60
|    C*                    PARM '2'       P3403I  1
|    C*                    PARM '1'       P3404I  1
|    C*                    PARM           P3411O  1
|    C*          PDD       PARM           P3412O  20
|    C*                    END
|     *
01===C                     ENDSR
     C*==============================================================*
     C*          RTN300... WRITE DETAIL
     C*==============================================================*
02===C           RTN300    BEGSR
|    C*
|    C           KEYEM     CHAINEM0                  40
|    C   40                MOVEL*BLANKS   EM041
|    C   40                MOVEL*BLANKS   EM042
|    C   40                MOVEL*BLANKS   EM043
|    C   40                MOVEL*BLANKS   EM044
|    C*
|    C                     MOVELPY01      R3101
|    C                     MOVELPY02      R3102
|    C                     MOVELPY04      R3103
|    C                     MOVELPY05      R3104
|    C                     MOVELPY06      R3105
|    C                     Z-ADD0         R3106
|    C                     MOVEL*BLANK    R3107
|    C                     MOVELEM041     R3108
|    C                     MOVELEM042     R3109
|    C                     MOVELEM043     R3110
|    C                     MOVELEM044     R3111
|    C*
|    C*          DOP       IFEQ '2'
|    C*          KEYPH     CHAINPH0                  40
|    C*          *IN40     IFEQ '0'
|    C*          DSEL      IFEQ '1'                        下期薪
|    C*          PH05      ADD  PH17      R3106
|    C*          PH17      ADD  PH27      R3106
|    C*                    ADD  PH16      R3106
|    C*                    SUB  PH28      R3106
|    C*                    SUB  PH29      R3106
|    C*                    SUB  PH18      R3106
|    C*                    ELSE                            上期薪
|    C*                    Z-ADDPH30      R3106
|    C*                    END
|    C*                    END
|    C*
|    C*                    ELSE
|    C*          KEYPW     CHAINPW0                  40
|    C*          *IN40     IFEQ '0'
|    C*          DSEL      IFEQ '1'                        下期薪
|    C*          PW05      ADD  PW17      R3106
|    C*          PW17      ADD  PW27      R3106
|    C*                    ADD  PW16      R3106
|    C*                    SUB  PW28      R3106
|    C*                    SUB  PW29      R3106
|    C*                    SUB  PW18      R3106
|    C*                    ELSE                            上期薪
|    C*                    Z-ADDPW30      R3106
|    C*                    END
|    C*                    END
|    C*
|    C*                    END
|    C*
|    C*          R3106     IFGT 0
|    C                     EXSR RTN400
|    C*                    END
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN400... WRITE DETAIL
     C*==============================================================*
03===C           RTN400    BEGSR
|    C*
|    C*          KEYBC     CHAINBC0                  40
|    C*          *IN40     IFEQ '0'
|    C*                    MOVEL*BLANK    R3103
|    C*                    MOVEL*BLANK    R3104
|    C*                    MOVEL*BLANK    R3105
|    C*                    MOVELBC06      R3107
|    C*                    END
|    C*
|    C                     WRITER310
|    C*
03===C                     ENDSR
