     H****************************************************************
     H*   PROGRAM NAME : PYR1042                                     *
     H*   AUTHER       : A1084 CHARLES                               *
     H*   CREATE DATE  : 79/07/17                                    *
     H*   UPDATE DATE  :                                             *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR1041C                                    *
     H*   PURPOSE      :                                             *
     H*   INDICATORS   :                                             *
     H****************************************************************
     FPYLVJF01IP  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYLCPF  IF  E           K        DISK
     FPYLVLF01IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FPYR318P O   E             39     PRINTER
     E*---------------------------------------------------------------
     ILVJF01
     I                                              EM041 L5
     I                                              EM042 L4
     I                                              EM043 L3
     I                                              EM044 L2
     I                                              LV02  L1
     I*
     I/COPY PYDDSSRC,PYPMDS01
     I/COPY PYRPGSRC,PYC02I
     I*
     I           UDS
     I                                      211 2160DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DLV01
     I                                      603 609 DEM041
     I                                      610 616 DEM042
     I                                      531 538 DLV021
     I                                      539 546 DLV022
     I                                      547 5520WLV96
     I                                      523 5270DLV96
     I            DS
     I                                        1   60WLV03
     I                                        1   20LV03Y
     I                                        3   40LV03M
     I*
     IPYLV      E DSPYLVJF01
     IPYLVD       DS                          1  95
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN LV01      KLV01
     C           *LIKE     DEFN LV02      KLV02
     C           *LIKE     DEFN LV03      KLV03
     C           *LIKE     DEFN LV03      SLV03
     C           *LIKE     DEFN LV04      KLV04
     C           *LIKE     DEFN CM14      DFMT
     C           *LIKE     DEFN CM15      DTYPE
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYPM     KLIST                           *PYPMPF
     C                     KFLD           PM01
     C                     KFLD           DLV01
     C           KEYDP     KLIST
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           DP014
     C           KEYLV1    KLIST
     C                     KFLD           KLV01
     C                     KFLD           KLV02
     C                     KFLD           KLV04
     C                     KFLD           KLV03
     C           KEYLV2    KLIST
     C                     KFLD           KLV01
     C                     KFLD           KLV02
     C                     KFLD           KLV04
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
  01-C           *INL3     IFEQ '1'
    C                     MOVEL*BLANK    DP014
    C           KEYDP     CHAINDP0                  40
    C   40                MOVEL*BLANK    DP02
    C*                    MOVELDP02      PDP02H
    C*                    SETON                     393132
    C                     SETON                     3132
  01-C                     END
     C*
     C                     EXSR RTN100
     C*
     CL1 10                EXSR RTN810
     C*L2 10                EXSR RTN820
     C*L3 10                EXSR RTN830
     C*L4 10                EXSR RTN840
     C*L5 10                EXSR RTN850
     CLR 10                EXSR RTN890
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           DLV01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C                     MOVE CM14      DFMT
|    C                     MOVE CM15      DTYPE
|    C*
|    C                     MOVEL'01'      PM01
|    C           KEYPM     CHAINPM0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     Z-ADD8         PM101
|   C                     MOVEL*BLANK    PM104
|   C                     MOVEL*BLANK    PM105
| 01-C                     END
|    C*
|    C                     SETON                     1039
|    C                     SETON                     3132
|    C                     MOVEL'Y'       $DATA
|    C*
|    C                     Z-ADD*ZERO     PT11
|    C                     Z-ADD*ZERO     PT21
|    C                     Z-ADD*ZERO     PT31
|    C                     Z-ADD*ZERO     PT41
|    C                     Z-ADD*ZERO     PT51
|    C                     Z-ADD*ZERO     PT61
|    C                     Z-ADD*ZERO     PT12
|    C                     Z-ADD*ZERO     PT22
|    C                     Z-ADD*ZERO     PT32
|    C                     Z-ADD*ZERO     PT42
|    C                     Z-ADD*ZERO     PT52
|    C                     Z-ADD*ZERO     PT62
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     MOVELEM044     DP014
|    C           KEYDP     CHAINDP0                  40
|    C   40                MOVEL*BLANK    DP02
|    C*
|    C           LV04      CHAINLC0                  40
|    C   40                Z-ADD999       LC06
|    C   40                MOVEL*BLANK    LC02
|    C                     MOVELLC02      PD11
|    C*
|    C           LV09      MULT PM101     PD12
|    C                     ADD  LV08      PD12
|    C*
|    C                     MOVELLV02      DLV02
|    C*Z-ADDLV03      DLV03
|    C                     CALL 'P31'
|    C                     PARM LV03      P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM DFMT      P3104I  1
|    C                     PARM DTYPE     P3105I  1
|    C                     PARM           P3111O  80
|    C                     Z-ADDP3111O    DLV03   70
|    C*
|    C*Z-ADDLV05      DLV05
|    C                     CALL 'P31'
|    C                     PARM LV05      P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM DFMT      P3104I  1
|    C                     PARM DTYPE     P3105I  1
|    C                     PARM           P3111O  80
|    C                     Z-ADDP3111O    DLV05   70
|    C*
|    C                     Z-ADDLV06      DLV06
|    C                     Z-ADDLV07      DLV07
|    C                     Z-ADDLV12      DLV12
|    C*
|    C                     Z-ADD0         PD13
| 01-C           LV04      IFEQ PM104
|   C           LV04      OREQ PM105
|   C                     EXSR RTN110
| 01-C                     END
|    C*
| 02-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 02-C                     END
|    C*
|    C                     WRITEPD1
|    C                     SETOF                     3132
|    C*
|    C                     ADD  PD12      PT11
|    C                     ADD  PD13      PT12
|    C*
|    C                     ADD  PD12      PT61
|    C                     ADD  PD13      PT62
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN110... OVER全年可請MARK
     C*==============================================================*
03===C           RTN110    BEGSR
|    C*
| 01-C           LC06      IFEQ 999                        無限制
|   C                     GOTO END110
| 01-C                     END
|    C                     MOVELPYLV      PYLVD
|    C*
|    C                     Z-ADDLV03      WLV03
| 02-C           LV03M     IFGT PM103
|   C           LV03Y     ADD  1         #C02I1  20
| 02*C                     ELSE
|   C                     Z-ADDLV03Y     #C02I1
| 02-C                     END
|    C*
|    C                     EXSR #C0200                     在職月數
|    C           LC06      MULT PM101     WTM     91
|    C                     MULT #C02M1    WTM
|    C                     DIV  12        WTM       H      可請時數
|    C*
|    C                     MOVELLV01      KLV01
|    C                     MOVELLV02      KLV02
|    C                     MOVEL#C02F     KLV03
|    C                     MOVE '01'      KLV03
|    C                     Z-ADDLV03      SLV03
|    C                     MOVELLV04      KLV04
|    C                     Z-ADD*ZERO     WLVT    91
|    C           KEYLV1    SETLLLV0
|    C           KEYLV2    READELV0                      40
| 03-C           *IN40     DOWEQ'0'
|   C           LV03      ANDLESLV03
|   C           LV09      MULT PM101     WLV     92
|   C                     ADD  LV08      WLV
|   C                     ADD  WLV       WLVT
|   C           KEYLV2    READELV0                      40
| 03-C                     END
|    C*
| 04-C           WLVT      IFGT WTM
|   C           WLVT      SUB  WTM       WLV
| 05-C           WLV       IFGT PD12
|   C                     Z-ADDPD12      PD13
| 05*C                     ELSE
|   C                     Z-ADDWLV       PD13
| 05-C                     END
| 04-C                     END
|    C*
|    C                     MOVELPYLVD     PYLV
|    C*
03===C           END110    ENDSR
     C*==============================================================*
     C*          RTN810... LEVEL BREAK 1
     C*==============================================================*
04===C           RTN810    BEGSR
|    C*
|    C                     WRITEPT1
|    C*
|    C                     ADD  PT11      PT21
|    C                     ADD  PT12      PT22
|    C*
|    C                     Z-ADD*ZERO     PT11
|    C                     Z-ADD*ZERO     PT12
|    C                     SETON                     32
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN820... LEVEL BREAK 2
     C*==============================================================*
05===C           RTN820    BEGSR
|    C*
|    C                     WRITEPT2
|    C*
|    C                     ADD  PT21      PT31
|    C                     ADD  PT22      PT32
|    C*
|    C                     Z-ADD*ZERO     PT21
|    C                     Z-ADD*ZERO     PT22
|    C                     SETON                     31
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RTN830... LEVEL BREAK 3
     C*==============================================================*
06===C           RTN830    BEGSR
|    C*
|    C                     WRITEPT3
|    C*
|    C                     ADD  PT31      PT41
|    C                     ADD  PT32      PT42
|    C*
|    C                     Z-ADD*ZERO     PT31
|    C                     Z-ADD*ZERO     PT32
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          RTN840... LEVEL BREAK 4
     C*==============================================================*
07===C           RTN840    BEGSR
|    C*
|    C                     WRITEPT4
|    C*
|    C                     ADD  PT41      PT51
|    C                     ADD  PT42      PT52
|    C*
|    C                     Z-ADD*ZERO     PT41
|    C                     Z-ADD*ZERO     PT42
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          RTN850... LEVEL BREAK 5
     C*==============================================================*
08===C           RTN850    BEGSR
|    C*
|    C                     WRITEPT5
|    C*
|    C                     ADD  PT51      PT61
|    C                     ADD  PT52      PT62
|    C*
|    C                     Z-ADD*ZERO     PT51
|    C                     Z-ADD*ZERO     PT52
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK LR
     C*==============================================================*
09===C           RTN890    BEGSR
|    C*
|    C                     WRITEPT6
|    C*
|    C                     Z-ADD*ZERO     PT61
|    C                     Z-ADD*ZERO     PT62
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
10===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
10===C                     ENDSR
     C*
     I/COPY PYRPGSRC,PYC02
