     FPYWHJF01IP  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYR305P O   E             39     PRINTER
     E*-场浪琩----------------------------------------------------*
     E                    S#01       35  7               场腹
     E*---------------------------------------------------------------
     IWHJF01
     I                                              EM041 L1
     I                                              EM042 L1
     I                                              EM043 L1
     I                                              EM044 L1
     I*场浪琩-----------------------------------------------------
     I            DS
     I                                        1   7 EM04
     I                                        1   1 EM041
     I                                        2   2 EM042
     I                                        3   3 EM043
     I                                        4   7 EM044
     I            DS
     I                                        1 245 S#01
     I                                        1 245 CM202O
     ILDA        UDS
     I*
     I                                      211 2160$CHYMD
     I                                      501 502 DEM01
     I                                      623 629 DEM041
     I                                      630 636 DEM042
     I                                      531 538 DEM021
     I                                      539 546 DEM022
     I                                      601 6050DYYMM
     I                                      529 530 DEM01T
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C           KEYDP     KLIST                           *PYDPPF
     C                     KFLD           DP011
     C                     KFLD           DP012
     C                     KFLD           DP013
     C                     KFLD           DP014
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
  01-C           *INL1     IFEQ '1'
  02-C           CM201O    IFNE 'Y'
    C                     Z-ADD1         I       20
    C           EM04      LOKUPS#01,I                   40
  03-C           S#01,I    IFEQ *BLANK
    C                     SETOF                         40
  03-C                     END
  04-C           *IN40     IFEQ '1'
    C                     SETON                     39
    C                     EXSR RTN100
  04-C                     END
  02*C                     ELSE
    C                     SETON                     39
    C                     EXSR RTN100
  02-C                     END
  01-C                     END
     C*
     C                     EXSR RTN200
     C*
     CLR 10                WRITEPE1
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     IN   *NAMVAR
|    C*
|    C                     SETON                     10
|    C*
|    C           WH01      CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C*--------------------------------------------------------------*
|    C*浪琌癸场场Τ舦盿恨场
|    C                     CALL 'PYSCM2'
|    C                     PARM DEM01     CM201I  4        そ
|    C                     PARM           CM201O  1        舦
|    C                     PARM           CM202O           场腹
|    C                     SETOF                     95
|    C*--------------------------------------------------------------*
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     MOVELEM041     DP011
|    C                     MOVELEM042     DP012
|    C                     MOVELEM043     DP013
|    C                     MOVELEM044     DP014
|    C           KEYDP     CHAINDP0                  40
|    C   40                MOVEL*BLANK    DP02
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200... WRITE  TO PRINTFILE
     C*==============================================================*
03===C           RTN200    BEGSR
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
|    C                     WRITEPD1
|    C*
03===C           END200    ENDSR
     C*==============================================================*
