     H****************************************************************
     H*   PROGRAM NAME : PYR3112                                     *
     H*   AUTHER       : A1084 CHARLES                               *
     H*   CREATE DATE  : 82/02/14                                    *
     H*   UPDATE DATE  : 90/03/02 A1274 EVA                          *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H****************************************************************
     FPYPHJF01IP  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYSSLF03IF  E           K        DISK
     FPYHDPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR311P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    WTAB    1   2 10
     E                    A1         48  2
     E                    A2         48 14
     E                    SS0X        8 14
     E                    T10X        8  8 0
     E                    T10F        8  8 0
     E                    T50X        8  8 0
     E                    T50F        8  8 0
     E                    T50M        8  8 0
     E                    T1         48 10 0
     E                    TX         48 10 0
     E                    T5         48 10 0
     E                    TF         48 10 0
     E                    TM         48 10 0
     E*---------------------------------------------------------------
     IPHJF01
     I                                              EM041 L2
     I                                              EM042 L2
     I                                              EM043 L2
     I                                              EM044 L2
     I                                              EM32  L1
     ILDA        UDS
     I                                      187 1920DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DEM01
     I                                      623 629 DEM041
     I                                      630 636 DEM042
     I                                      531 538 DEM021
     I                                      539 546 DEM022
     I                                      547 5520WDYM
     I                                      601 6050DYM
     I                                      604 6050DMM
     I                                      527 527 DOP
     I                                      528 528 DPW04
     I            DS
     I                                        1 112 SS0X
     I                                        1  14 SS021
     I                                       15  28 SS022
     I                                       29  42 SS023
     I                                       43  56 SS024
     I                                       57  70 SS025
     I                                       71  84 SS026
     I                                       85  98 SS027
     I                                       99 112 SS028
     I            DS
     I                                        1  640T10X
     I                                        1   80T1061
     I                                        9  160T1062
     I                                       17  240T1063
     I                                       25  320T1064
     I                                       33  400T1065
     I                                       41  480T1066
     I                                       49  560T1067
     I                                       57  640T1068
     I            DS
     I                                        1  640T10F
     I                                        1   80T1061X
     I                                        9  160T1062X
     I                                       17  240T1063X
     I                                       25  320T1064X
     I                                       33  400T1065X
     I                                       41  480T1066X
     I                                       49  560T1067X
     I                                       57  640T1068X
     I            DS
     I                                        1  640T50X
     I                                        1   80T5061
     I                                        9  160T5062
     I                                       17  240T5063
     I                                       25  320T5064
     I                                       33  400T5065
     I                                       41  480T5066
     I                                       49  560T5067
     I                                       57  640T5068
     I            DS
     I                                        1  640T50F
     I                                        1   80T5061F
     I                                        9  160T5062F
     I                                       17  240T5063F
     I                                       25  320T5064F
     I                                       33  400T5065F
     I                                       41  480T5066F
     I                                       49  560T5067F
     I                                       57  640T5068F
     I            DS
     I                                        1  640T50M
     I                                        1   80T5061M
     I                                        9  160T5062M
     I                                       17  240T5063M
     I                                       25  320T5064M
     I                                       33  400T5065M
     I                                       41  480T5066M
     I                                       49  560T5067M
     I                                       57  640T5068M
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN SS09      WSS09
     C*
     C           *NAMVAR   DEFN *LDA      LDA
     C*---------------------------------------------------------------
     C           KEYDP     KLIST                           *SYAAPF
     C                     KFLD           DP011
     C                     KFLD           DP012
     C                     KFLD           DP013
     C                     KFLD           DP014
     C           KEYHD     KLIST                           *SYAAPF
     C                     KFLD           PH01
     C                     KFLD           PH02
     C                     KFLD           PH03
     C                     KFLD           PH04
     C*
     C                     MOVEL'1'       WSS09
     C           KEYSS     KLIST
     C                     KFLD           WSS09            薪資項目
     C                     KFLD           CM13             薪資組別
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN300
     C*
     CL1 10                EXSR RTN81X
     CL2 10                EXSR RTN810
     CLR 10                EXSR RTN89F
     CLR 10                EXSR RTN89M
     CLR 10                EXSR RTN890
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     IN   *NAMVAR
|    C                     MOVELDPW04     N       10
|    C                     MOVELWTAB,N    DPW04C
|    C*確認
|    C                     SETON                     20
|    C           DEM01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C*
|    C                     SETON                     1039
|    C                     SETOF                     21
|    C                     MOVEL'Y'       $DATA
|    C*
|    C                     Z-ADD*ZERO     T105
|    C                     Z-ADD*ZERO     T505
|    C                     Z-ADD0         TX
|    C                     Z-ADD0         T1
|    C                     Z-ADD0         T5
|    C                     MOVE *BLANKS   A1
|    C                     MOVE *BLANKS   A2
|    C*薪資項目
|    C                     Z-ADD0         I       20
|    C*
|    C           KEYSS     SETLLSS0
|    C           KEYSS     READESS0                      46
| 01-C           *IN46     DOWEQ'0'
|   C**         I         ANDLT48
|   C**                   ADD  1         I
|   C*
| 02-C           DPW04     IFEQ '2'
|   C                     Z-ADDSS15      WI      20
| 02*C                     ELSE
|   C                     Z-ADDSS12      WI
| 02-C                     END
|   C*
| 03-C           WI        IFNE *ZERO
|   C                     MOVELSS01      A1,WI
|   C                     MOVELSS02      A2,WI
| 03-C                     END
|   C*
| 04-C           WI        IFGT I
|   C                     Z-ADDWI        I
| 04-C                     END
|   C*
|   C           KEYSS     READESS0                      46
| 01-C                     END
|     *
01===C                     ENDSR
     C*==============================================================*
     C*          RTN200... WRITE HEADING
     C*==============================================================*
02===C           RTN200    BEGSR
|     *
|    C                     MOVEL*BLANKS   SS0X
|    C                     Z-ADD0         J       20
|    C                     Z-ADD0         L       20
| 01-C           L         DOWLT8
|   C                     ADD  1         J
|   C                     ADD  1         L
|   C                     MOVELA2,J      SS0X,L
| 01-C                     END
|    C                     WRITEPH1
|    C*
| 02-C           J         DOWLTI
|   C                     MOVEL*BLANKS   SS0X
|   C                     Z-ADD0         L
| 03-C           L         DOWLT8
|   C                     ADD  1         J
|   C                     ADD  1         L
|   C                     MOVELA2,J      SS0X,L
| 03-C                     END
|   C                     WRITEPH2
| 02-C                     END
|    C                     WRITEPH4
|    C                     WRITEPH3
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN300... WRITE DETAIL
     C*==============================================================*
03===C           RTN300    BEGSR
|    C*
|    C           KEYHD     SETLLHD0
|    C           KEYHD     READEHD0                      46
| 01-C           *IN46     DOWEQ'0'
|   C                     Z-ADD1         Y       20
|   C           HD05      LOKUPA1,Y                     40
| 02-C           *IN40     IFEQ '1'
|   C                     ADD  HD06      T1,Y
|   C                     ADD  HD06      TX,Y
| 02-C                     END
|   C*
|   C           KEYHD     READEHD0                      46
| 01-C                     END
|    C*
|    C                     ADD  PH05      T105
|    C                     ADD  PH05      T105X
|    C                     ADD  PH17      T117
|    C                     ADD  PH17      T117X
|    C                     ADD  PH27      T127
|    C                     ADD  PH27      T127X
|    C                     ADD  PH16      T116
|    C                     ADD  PH16      T116X
|    C                     ADD  PH17      T1ADD
|    C                     ADD  PH17      T1ADDX
|    C                     ADD  PH27      T1ADD
|    C                     ADD  PH27      T1ADDX
|    C                     ADD  PH16      T1ADD
|    C                     ADD  PH16      T1ADDX
|     *
|    C                     ADD  PH28      T128
|    C                     ADD  PH28      T128X
|    C                     ADD  PH29      T129
|    C                     ADD  PH29      T129X
|    C                     ADD  PH18      T118
|    C                     ADD  PH18      T118X
|    C*
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN81X... LEVEL BREAK 1
     C*==============================================================*
04===C           RTN81X    BEGSR
|    C*
|    C                     MOVELEM041     DP011
|    C                     MOVELEM042     DP012
|    C                     MOVELEM043     DP013
|    C                     MOVELEM044     DP014
|    C           KEYDP     CHAINDP0                  40
|    C   40                MOVEL*BLANK    DP02
|    C                     SETOF                     31
|    C*
|    C                     Z-ADD0         T10F
|    C                     Z-ADD0         X       20
| 01-C           X         DOWLT8
|   C                     ADD  1         X
|   C                     Z-ADDTX,X      T10F,X
| 01-C                     END
|     *
| 02-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 02-C                     END
|    C                     WRITEPT111X
|    C                     SETON                     31
|    C*
| 03-C           X         DOWLTI
|   C                     Z-ADD0         T10F
|   C                     Z-ADD0         K       20
| 04-C           K         DOWLT8
|   C                     ADD  1         X
|   C                     ADD  1         K
|   C                     Z-ADDTX,X      T10F,K
| 04-C                     END
|    *
| 05-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 05-C                     END
|    *
|   C                     WRITEPT111X
| 03-C                     END
|     *
|    C           T1ADDX    SUB  T128X     T1TOTX
|    C                     SUB  T129X     T1TOTX
|    C                     SUB  T118X     T1TOTX
|    C*
|    C                     WRITEPT113X
|    C*男女部門總計
|    C           EM32      IFEQ 'F'
|    C                     ADD  T105X     T505F
|    C                     ADD  T117X     T517F
|    C                     ADD  T127X     T527F
|    C                     ADD  T116X     T516F
|    C                     ADD  T1ADDX    T5ADDF
|    C*
|    C                     ADD  T128X     T528F
|    C                     ADD  T129X     T529F
|    C                     ADD  T118X     T518F
|    C                     ADD  T1TOTX    T5TOTF
|    C                     ELSE
|    C                     ADD  T105X     T505M
|    C                     ADD  T117X     T517M
|    C                     ADD  T127X     T527M
|    C                     ADD  T116X     T516M
|    C                     ADD  T1ADDX    T5ADDM
|    C*
|    C                     ADD  T128X     T528M
|    C                     ADD  T129X     T529M
|    C                     ADD  T118X     T518M
|    C                     ADD  T1TOTX    T5TOTM
|    C                     END
|    C                     Z-ADD0         T117X
|    C                     Z-ADD0         T105X
|    C                     Z-ADD0         T127X
|    C                     Z-ADD0         T116X
|    C                     Z-ADD0         T1ADDX
|    C*
|    C                     Z-ADD0         T128X
|    C                     Z-ADD0         T129X
|    C                     Z-ADD0         T118X
|    C                     Z-ADD0         T1TOTX
|    C*
|    C           EM32      IFEQ 'F'
|    C                     Z-ADD0         X       20
| 06-C           X         DOWLTI
|   C                     ADD  1         X
|   C                     ADD  TX,X      TF,X
| 06-C                     END
|    C                     ELSE
|    C                     Z-ADD0         X       20
| 06-C           X         DOWLTI
|   C                     ADD  1         X
|   C                     ADD  TX,X      TM,X
| 06-C                     END
|    C                     END
|    C                     Z-ADD0         TX
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN810... LEVEL BREAK 1
     C*==============================================================*
04===C           RTN810    BEGSR
|    C*
|    C                     MOVELEM041     DP011
|    C                     MOVELEM042     DP012
|    C                     MOVELEM043     DP013
|    C                     MOVELEM044     DP014
|    C           KEYDP     CHAINDP0                  40
|    C   40                MOVEL*BLANK    DP02
|    C                     SETOF                     31
|    C*
|    C                     Z-ADD0         T10X
|    C                     Z-ADD0         X       20
| 01-C           X         DOWLT8
|   C                     ADD  1         X
|   C                     Z-ADDT1,X      T10X,X
| 01-C                     END
|     *
| 02-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 02-C                     END
|    C                     WRITEPT111
|    C                     SETON                     31
|    C*
| 03-C           X         DOWLTI
|   C                     Z-ADD0         T10X
|   C                     Z-ADD0         K       20
| 04-C           K         DOWLT8
|   C                     ADD  1         X
|   C                     ADD  1         K
|   C                     Z-ADDT1,X      T10X,K
| 04-C                     END
|    *
| 05-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 05-C                     END
|    *
|   C                     WRITEPT111
| 03-C                     END
|     *
|    C           T1ADD     SUB  T128      T1TOT
|    C                     SUB  T129      T1TOT
|    C                     SUB  T118      T1TOT
|     *
|    C                     WRITEPT113
|    C                     ADD  T105      T505
|    C                     ADD  T117      T517
|    C                     ADD  T127      T527
|    C                     ADD  T116      T516
|    C                     ADD  T1ADD     T5ADD
|     *
|    C                     ADD  T128      T528
|    C                     ADD  T129      T529
|    C                     ADD  T118      T518
|    C                     ADD  T1TOT     T5TOT
|    C                     Z-ADD0         T105
|    C                     Z-ADD0         T117
|    C                     Z-ADD0         T127
|    C                     Z-ADD0         T116
|    C                     Z-ADD0         T1ADD
|    C*
|    C                     Z-ADD0         T128
|    C                     Z-ADD0         T129
|    C                     Z-ADD0         T118
|    C                     Z-ADD0         T1TOT
|    C*
|    C                     Z-ADD0         X       20
| 06-C           X         DOWLTI
|   C                     ADD  1         X
|   C                     ADD  T1,X      T5,X
| 06-C                     END
|    C                     Z-ADD0         T1
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN89F... LEVEL BREAK LR
     C*==============================================================*
05===C           RTN89F    BEGSR
|     *
|    C                     SETOF                     35
|    C                     Z-ADD0         X       20
|    C                     Z-ADD0         T50F
| 01-C           X         DOWLT8
|   C                     ADD  1         X
|   C                     Z-ADDTF,X      T50F,X
| 01-C                     END
|     *
| 02-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 02-C                     END
|    C                     WRITEPT511F
|    C                     SETON                     35
|    C*
| 03-C           X         DOWLTI
|   C                     Z-ADD0         T50F
|   C                     Z-ADD0         K
| 04-C           K         DOWLT8
|   C                     ADD  1         X
|   C                     ADD  1         K
|   C                     Z-ADDTF,X      T50F,K
| 04-C                     END
|   C*
| 05-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 05-C                     END
|   C                     WRITEPT511F
| 03-C                     END
|     *
|    C                     WRITEPT513F
|     *
05===C                     ENDSR
     C*==============================================================*
     C*          RTN89M... LEVEL BREAK LR
     C*==============================================================*
05===C           RTN89M    BEGSR
|     *
|    C                     SETOF                     35
|    C                     Z-ADD0         X       20
|    C                     Z-ADD0         T50M
| 01-C           X         DOWLT8
|   C                     ADD  1         X
|   C                     Z-ADDTM,X      T50M,X
| 01-C                     END
|     *
| 02-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 02-C                     END
|    C                     WRITEPT511M
|    C                     SETON                     35
|    C*
| 03-C           X         DOWLTI
|   C                     Z-ADD0         T50M
|   C                     Z-ADD0         K
| 04-C           K         DOWLT8
|   C                     ADD  1         X
|   C                     ADD  1         K
|   C                     Z-ADDTM,X      T50M,K
| 04-C                     END
|   C*
| 05-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 05-C                     END
|   C                     WRITEPT511M
| 03-C                     END
|     *
|    C                     WRITEPT513M
|     *
05===C                     ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK LR
     C*==============================================================*
05===C           RTN890    BEGSR
|     *
|    C                     SETOF                     35
|    C                     Z-ADD0         X       20
|    C                     Z-ADD0         T50X
| 01-C           X         DOWLT8
|   C                     ADD  1         X
|   C                     Z-ADDT5,X      T50X,X
| 01-C                     END
|     *
| 02-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 02-C                     END
|    C                     WRITEPT511
|    C                     SETON                     35
|    C*
| 03-C           X         DOWLTI
|   C                     Z-ADD0         T50X
|   C                     Z-ADD0         K
| 04-C           K         DOWLT8
|   C                     ADD  1         X
|   C                     ADD  1         K
|   C                     Z-ADDT5,X      T50X,K
| 04-C                     END
|   C*
| 05-C           *IN39     IFEQ '1'
|   C                     EXSR RTN200
|   C                     SETOF                     39
| 05-C                     END
|   C                     WRITEPT511
| 03-C                     END
|     *
|    C                     WRITEPT513
|    C                     WRITEPE2
|     *
05===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
06===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
06===C                     ENDSR
**
下期薪資
上期薪資
