     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : PYR3352                                    *
     H*    PROGRAM NAME :薪資差異明細表-員工                     *
     H*    AUTHOR       : A1266 HANK                                 *
     H*    CREATE DATE  : 891106                                     *
     H*    UPDATE DATE  : 90/05/21 A1274 EVA                         *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYEMLF07IP  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYWDPF  IF  E           K        DISK
     FPYJTPF  IF  E           K        DISK
     FPYTRPF  IF  E           K        DISK
     FPYR335P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    WD5        12  2
     E                    A0X        12  6 0
     E                    B0X        12  6 0
     E                    C0X        11  7 0
     E                    D0X        11  7 0
     E*---------------------------------------------------------------
     I           UDS
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DEM01
     I                                      603 609 DEM04S
     I                                      610 616 DEM04E
     I                                      513 520 DEM02S
     I                                      521 528 DEM02E
     I                                      529 5320DYMS
     I                                      534 5370DYME
     I                                      539 5440KYMS
     I                                      545 5500KYME
     I*
     I           IDS
     I                                        1  720A0X
     I                                        1   60A01
     I                                        7  120A02
     I                                       13  180A03
     I                                       19  240A04
     I                                       25  300A05
     I                                       31  360A06
     I                                       37  420A07
     I                                       43  480A08
     I                                       49  540A09
     I                                       55  600A10
     I                                       61  660A11
     I*
     I           IDS
     I                                        1  720B0X
     I                                        1   60B01
     I                                        7  120B02
     I                                       13  180B03
     I                                       19  240B04
     I                                       25  300B05
     I                                       31  360B06
     I                                       37  420B07
     I                                       43  480B08
     I                                       49  540B09
     I                                       55  600B10
     I                                       61  660B11
     I*
     I           IDS
     I                                        1  770C0X
     I                                        1   70C01
     I                                        8  140C02
     I                                       15  210C03
     I                                       22  280C04
     I                                       29  350C05
     I                                       36  420C06
     I                                       43  490C07
     I                                       50  560C08
     I                                       57  630C09
     I                                       64  700C10
     I                                       71  770C11
     I*
     I           IDS
     I                                        1  770D0X
     I                                        1   70D01
     I                                        8  140D02
     I                                       15  210D03
     I                                       22  280D04
     I                                       29  350D05
     I                                       36  420D06
     I                                       43  490D07
     I                                       50  560D08
     I                                       57  630D09
     I                                       64  700D10
     I                                       71  770D11
     I*
     I            DS
     I                                        1   80EM19
     I                                        1   60EM19YM
     I            DS
     I                                        1   7 EM04
     I                                        1   1 EM041
     I                                        2   2 EM042
     I                                        3   3 EM043
     I                                        4   7 EM044
     I*
     I           IDS
     I                                        1   80KYMD
     I                                        1   60YYMM
     I                                        7   80DD
     I*
     I           IDS
     I                                        1   7 TR05
     I                                        1   1 TR051
     I                                        2   2 TR052
     I                                        3   3 TR053
     I                                        4   7 TR054
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN CM14      DFMT
     C           *LIKE     DEFN CM15      DTYPE
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYDP     KLIST                           *PYDPPF
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C           KEYDPT    KLIST                           *PYDPPF
     C                     KFLD           TR051
     C                     KFLD           TR052
     C                     KFLD           TR053
     C                     KFLD           TR054
     C*
     C           KEYPY     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C*
     C           KEYWDS    KLIST
     C                     KFLD           EM01             *公司
     C                     KFLD           KYMS             *起值年月
     C                     KFLD           @1               *期別
     C                     KFLD           EM02             *員工編號
     C*
     C           KEYWDE    KLIST
     C                     KFLD           EM01             *公司
     C                     KFLD           KYME             *迄值年月
     C                     KFLD           @1               *期別
     C                     KFLD           EM02             *員工編號
     C                     MOVEL'1'       @1      1
     C*
     C           KEYTRS    KLIST
     C                     KFLD           EM01             *公司
     C                     KFLD           EM02             *員工編號
     C                     KFLD           KYMD             *年月日
     C           KEYTR     KLIST
     C                     KFLD           EM01             *公司
     C                     KFLD           EM02             *員工編號
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R0100                      *INITIAL
     C*
     C                     EXSR R2000                      *DETAIL
     CLR 10                EXSR R8900                                  RT
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R0100 ... INITIAL ROUTINE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C*          *NAMVAR   DEFN *LDA      LDA
|    C*                    IN   LDA
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DEM01     CM001I  2         公司代號
|    C                     PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C           DFMT      PARM           CM004O  1         日期格式
|    C           DTYPE     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C*
|    C           DEM01     CHAINCM0                  40    *公司名稱
|    C   40                MOVEL*BLANK    CM03
|    C*
|    C                     Z-ADDKYMS      PYMS             對照年月
|    C                     Z-ADDKYME      PYME             計薪年月
|    C*
|    C                     SETON                     10
|    C                     MOVEL'Y'       $DATA
|    C                     WRITEPH1
|    C*---------------------------------------------------------------
|    C*薪資項目WD05
|    C                     MOVEL'01'      WD5,1            *底薪
|    C                     MOVEL'02'      WD5,2            *主管加給
|    C                     MOVEL'03'      WD5,3            *職務加給
|    C                     MOVEL'12'      WD5,4            *交通津貼
|    C                     MOVEL'11'      WD5,5            *午餐津貼
|    C                     MOVEL'14'      WD5,6            *安全津貼
|    C                     MOVEL'15'      WD5,7            *特別津貼
|    C                     MOVEL'16'      WD5,8            *電話津貼
|    C                     MOVEL'29'      WD5,9            *休假代金
|    C                     MOVEL'61'      WD5,10           *事假扣款
|    C                     MOVEL'62'      WD5,11           *病假扣款
|    C                     MOVEL'13'      WD5,12           *交通津貼
|    C*
|    C                     Z-ADDKYME      YYMM             計薪年月
|    C                     Z-ADD00        DD
|    C*
|    C                     CLEARA0X
|    C                     CLEARB0X
|    C                     CLEARC0X
|    C                     CLEARD0X
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... GET DETAIL
     C*==============================================================*
02===C           R2000     BEGSR
|    C*
|    C*EM19離職日期
| 01-C           EM19YM    IFNE 0
|   C           EM19YM    ANDNEKYME
|   C                     GOTO E2000
| 01-C                     END
|    C*
| 02-C           EM19YM    IFEQ 0
|   C                     SETOF                     90
| 02*C                     ELSE
|   C                     SETON                     90
| 02-C                     END
|    C*部門名稱
|    C           KEYDP     CHAINDP0                  40    *部門名稱
| 03-C           *IN40     IFEQ '0'
|   C                     MOVELDP02      EM04N
| 03*C                     ELSE
|   C                     MOVEL*BLANK    EM04N
| 03-C                     END
|    C*職稱名稱
|    C           EM05      CHAINJT0                  40    *職稱名稱
| 04-C           *IN40     IFEQ '0'
|   C                     MOVELJT02      EM05N
| 04*C                     ELSE
|   C                     MOVEL*BLANK    EM05N
| 04-C                     END
|    C**************************************************************
|    C**到職日
|    C***                  CALL 'P31'
|    C**                   PARM EM13      P3101I  80
|    C**                   PARM '2'       P3102I  1
|    C**                   PARM '1'       P3103I  1
|    C**                   PARM DFMT      P3104I  1
|    C**                   PARM DTYPE     P3105I  1
|    C**                   PARM           P3111O  80
|    C**                   Z-ADDP3111O    PEM13            *到職日
|    C*離職日
|    C**                   CALL 'P31'
|    C**                   PARM EM19      P3101I  80
|    C**                   PARM '2'       P3102I  1
|    C**                   PARM '1'       P3103I  1
|    C**                   PARM DFMT      P3104I  1
|    C**                   PARM DTYPE     P3105I  1
|    C**                   PARM           P3111O  80
|    C**                   Z-ADDP3111O    PEM19            *離職日
|    C**************************************************************
|    C*起值年月(異動前) *對照年月*
|    C                     CLEARB0X
|    C           KEYWDS    SETLLWD0
|    C           KEYWDS    READEWD0                      46
| 05-C           *IN46     DOWEQ'0'
|   C                     Z-ADD1         M       20
|   C           WD05      LOKUPWD5,M                    40
| 06-C           *IN40     IFEQ '1'
|   C                     Z-ADDWD06      B0X,M
| 06-C                     END
|   C           KEYWDS    READEWD0                      46
| 05-C                     END
|    C*
|    C*WD5,4(交通津貼)WD5,12
|    C           B0X,4     ADD  B0X,12    B0X,4
|    C*----------------------------------------------------------------
|    C*PYTRPF人事調動資料檔
|    C                     MOVEL*BLANK    EM04B            *部門
|    C                     MOVEL*BLANK    EM04NB           *部門
|    C                     MOVEL*BLANK    EM06B            *職等
|    C                     MOVEL*BLANK    EM05NB           *職稱名稱
|    C*
|    C           KEYTRS    SETLLTR0
|    C           KEYTR     READETR0                      46
| 07-C           *IN46     IFEQ '0'
|   C                     MOVELTR054     EM04B            *部門
|   C                     MOVELTR09      EM06B            *職等
|   C*
|   C           TR07      CHAINJT0                  40
| 08-C           *IN40     IFEQ '0'
|   C                     MOVELJT02      EM05NB           *職稱名稱
| 08-C                     END
|   C*
|   C           KEYDPT    CHAINDP0                  40    *部門名稱
| 09-C           *IN40     IFEQ '0'
|   C                     MOVELDP02      EM04NB
| 09-C                     END
|   C*
| 10-C           EM04      IFEQ EM04B
|   C           EM05      ANDEQTR07
|   C           EM06      ANDEQEM06B
|   C                     MOVEL*BLANK    EM04B            *部門
|   C                     MOVEL*BLANK    EM04NB           *部門
|   C                     MOVEL*BLANK    EM06B            *職等
|   C                     MOVEL*BLANK    EM05NB           *職稱名稱
| 10-C                     END
| 07-C                     END
|    C*
|    C*----------------------------------------------------------------
|    C*迄值年月(異動後) *計薪年月*
|    C                     CLEARA0X
|    C*
|    C           KEYWDE    SETLLWD0
|    C           KEYWDE    READEWD0                      46
| 11-C           *IN46     DOWEQ'0'
|   C                     Z-ADD1         M       20
|   C           WD05      LOKUPWD5,M                    40
| 12-C           *IN40     IFEQ '1'
|   C                     Z-ADDWD06      A0X,M
| 12-C                     END
|   C           KEYWDE    READEWD0                      46
| 11-C                     END
|    C*
|    C*WD5,4(交通津貼)WD5,12
|    C           A0X,4     ADD  A0X,12    A0X,4
|    C*------------------------------------------------------------***
|    C*合計
|    C           A0X,1     ADD  A0X,2     ATT
|    C                     ADD  A0X,3     ATT
|    C                     ADD  A0X,4     ATT
|    C                     ADD  A0X,5     ATT
|    C                     ADD  A0X,6     ATT
|    C                     ADD  A0X,7     ATT
|    C                     ADD  A0X,8     ATT
|    C                     ADD  A0X,9     ATT
|    C                     SUB  A0X,10    ATT
|    C                     SUB  A0X,11    ATT
|    C                     ADD  A0X,12    ATT
|    C*
|    C           B0X,1     ADD  B0X,2     BTT
|    C                     ADD  B0X,3     BTT
|    C                     ADD  B0X,4     BTT
|    C                     ADD  B0X,5     BTT
|    C                     ADD  B0X,6     BTT
|    C                     ADD  B0X,7     BTT
|    C                     ADD  B0X,8     BTT
|    C                     ADD  B0X,9     BTT
|    C                     SUB  B0X,10    BTT
|    C                     SUB  B0X,11    BTT
|    C                     ADD  B0X,12    BTT
|    C*
|    C*------------------------------------------------------------***
|    C*差異狀況之認定：
|    C*　１．總額不同時須列印
|    C*　２．總額相同但是其中的薪資項目不相等時亦須列印
|    C*
|    C           ATT       SUB  BTT       ADD
|    C*
|    C*狀況一：------------------------------------------------------
| 13-C           ATT       IFNE BTT
|   C                     SETON                     66
| 14-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 14-C                     END
     C                     Z-ADDEM13      PEM13
     C                     Z-ADDEM19      PEM19
|   C                     WRITEPD1
|   C                     EXSR R2100
|   C*
|   C                     ADD  A0X       C0X
|   C                     ADD  B0X       D0X
|   C                     ADD  ATT       CTT
|   C                     ADD  ADD       CDD
|   C                     ADD  BTT       DTT
| 13-C                     END
|    C*
|    C*狀況二：------------------------------------------------------
| 15-C           ATT       IFEQ BTT
|   C*
|   C                     Z-ADD1         X       20
|   C*
| 16-C           X         DO   12
| 17-C           A0X,X     IFNE B0X,X
|   C                     SETON                     66
| 18-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 18-C                     END
     C                     Z-ADDEM13      PEM13
     C                     Z-ADDEM19      PEM19
|   C                     WRITEPD1
|   C                     EXSR R2100
|   C                     ADD  A0X       C0X
|   C                     ADD  B0X       D0X
|   C                     ADD  ATT       CTT
|   C                     ADD  ADD       CDD
|   C                     ADD  BTT       DTT
|   C                     LEAVE
| 17-C                     END
|   C                     ADD  1         X
| 16-C                     END
|   C*
| 15-C                     END
|    C*------------------------------------------------------------***
|    C*
02===C           E2000     ENDSR
     C*==============================================================*
     C*          R2100  ..人事調動時
     C*==============================================================*
03===C           R2100     BEGSR
|    C*
|    C*該計薪年月內若有多次人事調動時皆列印出來
|    C*PYTRPF人事調動資料檔
|    C                     MOVEL*BLANK    EM04C            *部門
|    C                     MOVEL*BLANK    EM04CB           *部門
|    C                     MOVEL*BLANK    EM06C            *職等
|    C                     MOVEL*BLANK    EM05CB           *職稱名稱
|    C                     Z-ADD*ZERO     CUNT    20       *計次
|    C*
|    C           KEYTRS    SETLLTR0
|    C           KEYTR     READETR0                      46
| 01-C           *IN46     DOWEQ'0'
|   C                     ADD  1         CUNT
|   C*
| 02-C           CUNT      IFGE 2
|   C                     MOVELTR054     EM04C            *部門
|   C                     MOVELTR09      EM06C            *職等
|   C*
|   C           TR07      CHAINJT0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     MOVELJT02      EM05CB           *職稱名稱
| 03-C                     END
|   C*
|   C           KEYDPT    CHAINDP0                  40    *部門名稱
| 04-C           *IN40     IFEQ '0'
|   C                     MOVELDP02      EM04CB
| 04-C                     END
|   C*
| 05-C           EM04      IFEQ EM04C
|   C           EM05      ANDEQTR07
|   C           EM06      ANDEQEM06C
|   C                     MOVEL*BLANK    EM04C            *部門
|   C                     MOVEL*BLANK    EM04CB           *部門
|   C                     MOVEL*BLANK    EM06C            *職等
|   C                     MOVEL*BLANK    EM05CB           *職稱名稱
| 05-C                     END
|   C*
| 06-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 06-C                     END
|   C                     WRITEPD2
|   C*
| 02-C                     END
|   C*
|   C           KEYTR     READETR0                      46
| 01-C                     END
|    C*
03===C           E2100     ENDSR
     C*==============================================================*
     C*          R8900  .. LEVEL BREAK LR --- HAVE DATA
     C*==============================================================*
04===C           R8900     BEGSR
|    C*
|    C                     WRITEPT0                                    RT
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
05===C           R8999     BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C           *IN66     ANDEQ'0'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR R0100
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
05===C                     ENDSR
