     H****************************************************************/
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     H*                                                              */
     H*    PROGRAM-ID   : PYA3202                                    */
     H*    PROGRAM NAME :薪資所得扣繳稅額繳款書                    */
     H*    AUTHOR       : A1226 PETER                                */
     H*    CREATE DATE  : 86/01/20                                   */
     H*    UPDATE DATE  : 90/05/16 A1274 EVA                         */
     H*    SYSTEM       :人事薪資系統                              */
     H****************************************************************/
     FPYEMPF  IP  E           K        DISK
     FPYPHPF  IF  E           K        DISK
     FPYHDPF  IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FPYR320WFO   E                    DISK
     I*--------------------------------------------------------------**
     IEM0
     I                                              EM01  L1
     ILDA        UDS
     I                                      211 2160DDATE
     I                                      125 1270$CPY
     I                                      128 129 $PRTID
     I                                      152 161 $USERN
     I                                      162 162 $EVR
     I*
     I                                      501 502 DPH01
     I                                      541 5450DYM
     I                                      546 5470DMM
     I                                      507 508 DPH01T
     I                                      509 5160WYMD
     I                                      509 5140WYM
     I                                      513 5140WMM
     I                                      515 5160WPH01T
     I                                      520 527 DPH021
     I                                      528 535 DPH022
     I                                      550 550 DSEL
     I                                      551 5560KYM
     I*
     I            DS
     I                                        1   60PH03
     I                                        1   60PH031
     I                                        1   60PH032
     I                                        3   60PH03W
     I                                        3   60PH031W
     I                                        3   60PH032W
     I/COPY PYDDSSRC,PYPMDS01
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN CM004O    DFMT
     C           *LIKE     DEFN CM005O    DTYPE
     C*==============================================================*
     C*                    KEY
     C*==============================================================*
     C           KEYPM     KLIST
     C                     KFLD           PM01
     C                     KFLD           EM01
     C*
     C           KEYPH     KLIST                           *SYPHPF
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           WYM
     C                     KFLD           KHD04   1
     C*
     C           KEYHD     KLIST                           *SYPHPF
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           WYM
     C                     KFLD           KHD04   1
     C                     KFLD           PM318
     C*
     C           KEYEM     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
  01-C           *INL1     IFEQ '1'
    C                     EXSR RTN010
  01-C                     END
     C*
     C                     EXSR RTN100
     C*
     CL1 10                EXSR RTN200
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DPH01     CM001I  2         公司代號
|    C                     PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C           DFMT      PARM           CM004O  1         日期格式
|    C           DTYPE     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   *NAMVAR
|    C*
|    C                     MOVEL'01'      PM01
|    C           KEYPM     CHAINPM0                  40
|    C*
|    C                     MOVEL'1'       KHD04
|    C*
|    C                     SETON                     10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... ACCOUNT
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     MOVELDPH01     W320AA            公司代號
|    C*
|    C                     CALL 'P39'
|    C                     PARM DYM       P3901I  60
|    C                     PARM DFMT      P3902I  1
|    C                     PARM DTYPE     P3903I  1
|    C                     PARM '2'       P3904I  1
|    C                     PARM '1'       P3905I  1
|    C           WYM       PARM           P3911O  60
|    C*
|    C                     CALL 'P39'
|    C                     PARM DYM       P3901I  60
|    C                     PARM DFMT      P3902I  1
|    C                     PARM DTYPE     P3903I  1
|    C                     PARM '2'       P3904I  1
|    C                     PARM '2'       P3905I  1
|    C           KYM       PARM           P3911O  60
|    C*
|    C*------------------------------------------------------------***
|    C***薪資部份(PYPHPF,PYHDPF)
|    C*　說明：按人事基本資料設定中所得扣繳EM101的設定值而來
|    C*　　　　１．一般
|    C*　　　　２．１０％
|    C*　　　　３．２０％
|    C*　　　　４．固定金額
|    C*　　　　５．６％
|    C*
|    C           KEYPH     CHAINPH0                  40
| 01-C           *IN40     IFEQ '0'
|   C*
|   C*固定薪資按扣繳稅額表扣繳
|   C*免扣繳
| 02-C           EM101     IFEQ '1'
|   C           EM101     OREQ '4'
|   C*
|   C           KEYHD     CHAINHD0                  41
| 03-C           *IN41     IFEQ '0'
|   C                     ADD  1         W32011           固定扣繳
|   C                     ADD  PH17      W32013
|   C                     ADD  PH27      W32013
|   C                     SUB  PH28      W32013
|   C                     SUB  PH29      W32013
|   C                     ADD  HD06      W32014
| 03*C                     ELSE
|   C                     ADD  1         W32051           免扣繳
|   C                     ADD  PH17      W32053
|   C                     ADD  PH27      W32053
|   C                     SUB  PH28      W32053
|   C                     SUB  PH29      W32053
| 03-C                     END
| 02-C                     END
|   C*
|   C*６％扣繳
| 04-C           EM101     IFEQ '5'
|   C                     ADD  PH17      W32023
|   C                     ADD  PH27      W32023
|   C                     SUB  PH28      W32023
|   C                     SUB  PH29      W32023
|   C*
|   C           KEYHD     CHAINHD0                  41
| 05-C           *IN41     IFEQ '0'
|   C                     ADD  HD06      W32024
| 05-C                     END
|   C*
|   C                     ADD  1         W32021
| 04-C                     END
|   C*
|   C*１０％扣繳
| 06-C           EM101     IFEQ '2'
|   C                     ADD  PH17      W32033
|   C                     ADD  PH27      W32033
|   C                     SUB  PH28      W32033
|   C                     SUB  PH29      W32033
|   C*
|   C           KEYHD     CHAINHD0                  41
| 07-C           *IN41     IFEQ '0'
|   C                     ADD  HD06      W32034
| 07-C                     END
|   C*
|   C                     ADD  1         W32031
| 06-C                     END
|   C*
|   C*２０％扣繳
| 08-C           EM101     IFEQ '3'
|   C                     ADD  PH17      W32043
|   C                     ADD  PH27      W32043
|   C                     SUB  PH28      W32043
|   C                     SUB  PH29      W32043
|   C*
|   C           KEYHD     CHAINHD0                  41
| 09-C           *IN41     IFEQ '0'
|   C                     ADD  HD06      W32044
| 09-C                     END
|   C*
|   C                     ADD  1         W32041
| 08-C                     END
|   C*
| 01-C                     END
|    C*
|    C*------------------------------------------------------------***
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200... ACCOUNT
     C*==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C                     Z-ADDKYM       W32012
|    C                     Z-ADDKYM       W32022
|    C                     Z-ADDKYM       W32032
|    C                     Z-ADDKYM       W32042
|    C                     Z-ADDKYM       W32052
|    C*
|    C                     WRITEW320
|    C*
03===C                     ENDSR
