     H****************************************************************/
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     H*                                                              */
     H*    PROGRAM-ID   : PYR3213                                    */
     H*    PROGRAM NAME :薪資所得扣繳稅額繳款書－工作地點          */
     H*    AUTHOR       : A1274 EVA                                  */
     H*    CREATE DATE  : 90/04/13                                   */
     H*    UPDATE DATE  :                                            */
     H*    SYSTEM       :人事薪資系統                              */
     H****************************************************************/
     FPYR321WFIP  E           K        DISK
     FPYR321P O   E             39     PRINTER
     I*--------------------------------------------------------------**
     I              '含提撥退休金員工'  C         SORT1
     I              '不含提撥退休金員工'C         SORT2
     IW321
     I                                              W321AAL1
     I                                              W321PAL1
     ILDA        UDS
     I                                      211 2160DDATE
     I                                      125 1270$CPY
     I                                      128 129 $PRTID
     I                                      152 161 $USERN
     I                                      162 162 $EVR
     I*
     I                                      501 502 DPH01
     I                                      541 5450DYM
     I                                      546 5470DMM
     I                                      507 508 DPH01T
     I                                      509 5160WYMD
     I                                      509 5140WYM
     I                                      513 5140WMM
     I                                      515 5160WPH01T
     I                                      520 527 DPH021
     I                                      528 535 DPH022
     I                                      550 550 DSEL
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*==============================================================*
     C*                    KEY
     C*==============================================================*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100
     C*
     CL1 10                EXSR RTN200
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   *NAMVAR
|    C*
|    C                     SETON                     10
|    C*
| 01-C           DSEL      IFEQ 'Y'
|   C                     MOVELSORT1     PSEL      P
| 01*C                     ELSE
|   C                     MOVELSORT2     PSEL      P
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... ACCOUNT
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     Z-ADDW32111    PT11
|    C                     ADD  W32121    PT11
|    C                     ADD  W32131    PT11
|    C                     ADD  W32141    PT11
|    C                     ADD  W32151    PT11
|    C                     Z-ADDW32113    PTOT1
|    C                     ADD  W32123    PTOT1
|    C                     ADD  W32133    PTOT1
|    C                     ADD  W32143    PTOT1
|    C                     ADD  W32153    PTOT1
|    C                     Z-ADDW32114    PTOT2
|    C                     ADD  W32124    PTOT2
|    C                     ADD  W32134    PTOT2
|    C                     ADD  W32144    PTOT2
|    C                     ADD  W32154    PTOT2
|    C*
|    C                     Z-ADDW321A1    PT12
|    C                     ADD  W321B1    PT12
|    C                     ADD  W321C1    PT12
|    C                     ADD  W321D1    PT12
|    C                     ADD  W321E1    PT12
|    C                     ADD  W321F1    PT12
|    C                     ADD  W321G1    PT12
|    C                     ADD  W321H1    PT12
|    C                     Z-ADDW321A3    PTOTA
|    C                     ADD  W321B3    PTOTA
|    C                     ADD  W321C3    PTOTA
|    C                     ADD  W321D3    PTOTA
|    C                     ADD  W321E3    PTOTA
|    C                     ADD  W321F3    PTOTA
|    C                     ADD  W321G3    PTOTA
|    C                     ADD  W321H3    PTOTA
|    C                     Z-ADDW321A4    PTOTB
|    C                     ADD  W321B4    PTOTB
|    C                     ADD  W321C4    PTOTB
|    C                     ADD  W321D4    PTOTB
|    C                     ADD  W321E4    PTOTB
|    C                     ADD  W321F4    PTOTB
|    C                     ADD  W321G4    PTOTB
|    C                     ADD  W321H4    PTOTB
|    C*
|    C                     WRITEPH1
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200... ACCOUNT
     C*==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C                     WRITEPT1
|    C*
|    C                     SETON                       39
|    C*------------------------------------------------------------***
|    C                     Z-ADD*ZERO     PT11
|    C                     Z-ADD*ZERO     PTOT1
|    C                     Z-ADD*ZERO     PTOT2
|    C                     Z-ADD*ZERO     PT12
|    C                     Z-ADD*ZERO     PTOTA
|    C                     Z-ADD*ZERO     PTOTB
|    C*------------------------------------------------------------***
|    C*
03===C                     ENDSR
