     H****************************************************************
     H*   PROGRAM NAME : PYR3062                                     *
     H*   AUTHER       : A1138 DAVID, CHEN.                          *
     H*   CREATE DATE  : 81/02/26                                    *
     H*   UPDATE DATE  : 90/04/13 A1274 EVA                          *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR3061C                                    *
     H*   PURPOSE      :                                             *
     H*   INDICATORS   :                                             *
     H****************************************************************
     FPYOSJF01IP  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYSSLF01IF  E           K        DISK
     FPYR306P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    A1         48  2
     E                    A2         48 14
     E                    SS0X        6 14
     E                    PD         48  7 0
     E                    PE         48  7 0
     E                    PD0X        6  7 0
     E                    PE0X        6  7 0
     E                    WTAB    1   2 10
     E*---------------------------------------------------------------
     IOSJF01
     I                                              EM041 L2
     I                                              EM042 L2
     I                                              EM043 L2
     I                                              EM044 L2
     I                                              OS02  L1
     ILDA        UDS
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DEM01
     I                                      623 629 DEM041
     I                                      630 636 DEM042
     I                                      513 520 DEM021
     I                                      521 528 DEM022
     I                                      535 535 DOS04
     I                                      536 5410DYYMMW
     I                                      601 6040DYYMM
     I*
     I            DS
     I                                        1  84 SS0X
     I                                        1  14 SS021
     I                                       15  28 SS022
     I                                       29  42 SS023
     I                                       43  56 SS024
     I                                       57  70 SS025
     I                                       71  84 SS026
     I*
     I            DS
     I                                        1  420PD0X
     I                                        1   70PD041
     I                                        8  140PD042
     I                                       15  210PD043
     I                                       22  280PD044
     I                                       29  350PD045
     I                                       36  420PD046
     I            DS
     I                                        1  420PE0X
     I                                        1   70PE041
     I                                        8  140PE042
     I                                       15  210PE043
     I                                       22  280PE044
     I                                       29  350PE045
     I                                       36  420PE046
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN SS09      WSS09
     C           *LIKE     DEFN SS05      WSS05
     C           *LIKE     DEFN SS18      WSS18
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYDP     KLIST                           *PYDPPF
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C           KEYSS     KLIST                           *PYSSPF
     C                     KFLD           WSS09
     C                     KFLD           WSS05
     C                     KFLD           WSS18
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100
     C*
     CL1 10                EXSR RTN810
     CL2 10                EXSR RTN820
     C*
     CLR 10                EXSR RTN890
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   *NAMVAR
|    C*
|    C           DEM01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C   40                MOVEL*BLANK    WSS18
|    C  N40                MOVELCM13      WSS18
|    C*
|    C                     SETON                     1039
|    C                     SETOF                     21
|    C                     MOVEL'Y'       $DATA
|    C*
|    C                     MOVE *BLANKS   A1
|    C                     MOVE *BLANKS   A2
|    C                     MOVE *BLANKS   SS0X
|    C                     Z-ADDDYYMMW    PYYMM
|    C                     Z-ADD0         PD
|    C                     Z-ADD0         PD0X
|    C                     Z-ADD0         PE
|    C                     Z-ADD0         PE0X
|    C                     MOVELDOS04     N       10
|    C                     MOVELWTAB,N    DOS04C
|    C*薪資項目
|    C                     Z-ADD0         I       20
|    C                     MOVEL'1'       WSS09
|    C                     MOVEL'2'       WSS05
|    C           KEYSS     SETLLSS0
|    C           KEYSS     READESS0                      46
| 01-C           *IN46     DOWEQ'0'
|   C           I         ANDLT48
|   C*
| 02-C           DOS04     IFEQ '1'                        下期
|   C           DOS04     OREQ '2'                        上期
|   C           SS17      ANDEQ'Y'                        上期項目
|   C                     ADD  1         I
|   C                     MOVELSS01      A1,I
|   C                     MOVELSS02      A2,I
| 02-C                     END
|   C*
|   C           KEYSS     READESS0                      46
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*部門編號．名稱
|    C           KEYDP     CHAINDP0                  40
|    C   40                MOVEL*BLANK    DP02
|    C*
|    C*--------------------------------------------------------***
| 01-C           *IN39     IFEQ '1'
|   C*
|   C                     MOVEL*BLANKS   SS0X
|   C                     Z-ADD0         J       20
|   C                     Z-ADD0         L       20
| 02-C           L         DOWLT6
|   C                     ADD  1         J
|   C                     ADD  1         L
|   C                     MOVELA2,J      SS0X,L
| 02-C                     END
|   C*
|   C                     WRITEPH1
|   C*
| 03-C           J         DOWLTI
|   C                     MOVEL*BLANKS   SS0X
|   C                     Z-ADD0         L
| 04-C           L         DOWLT6
|   C                     ADD  1         J
|   C                     ADD  1         L
|   C                     MOVELA2,J      SS0X,L
| 04-C                     END
|   C                     WRITEPH11
| 03-C                     END
|   C*
|   C                     WRITEPH12
|   C*
|   C                     SETOF                     39
| 01-C                     END
|    C*--------------------------------------------------------***
|    C*
|    C                     SETON                         20
|    C*
|    C                     Z-ADD1         Y       20
|    C           OS05      LOKUPA1,Y                     45
| 05-C           *IN45     IFEQ '1'
|   C                     Z-ADDOS06      PD,Y
|   C                     ADD  OS06      PE,Y
| 05-C                     END
|    C*
02===C                     ENDSR
     C*========================================================*
     C*          RTN810    LEVEL BRAEK 1
     C*========================================================*
03===C           RTN810    BEGSR
|    C*
|    C*--------------------------------------------------------***
|    C                     Z-ADD0         PD0X
|    C                     Z-ADD0         R       20
|    C                     Z-ADD0         S       20
| 01-C           S         DOWLT6
|   C                     ADD  1         R
|   C                     ADD  1         S
|   C                     Z-ADDPD,R      PD0X,S
| 01-C                     END
|    C*
|    C                     WRITEPD1
|    C*
|    C                     Z-ADD0         PD0X
| 02-C           R         DOWLTI
|   C                     Z-ADD0         PD0X
|   C                     Z-ADD0         S
| 03-C           S         DOWLT6
|   C                     ADD  1         R
|   C                     ADD  1         S
|   C                     Z-ADDPD,R      PD0X,S
| 03-C                     END
|   C                     WRITEPD2
| 02-C                     END
|    C*--------------------------------------------------------***
|    C                     WRITEPE1
|    C*
|    C                     Z-ADD0         PD
|    C*
03===C                     ENDSR
     C*========================================================*
     C*          RTN820    LEVEL BRAEK 2
     C*========================================================*
04===C           RTN820    BEGSR
|    C*
|    C                     Z-ADD0         PD
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN890 .. LEVEL BREAK LR --- HAVE DATA
     C*==============================================================*
05===C           RTN890    BEGSR
|    C*
|    C*--------------------------------------------------------***
|    C                     Z-ADD0         PE0X
|    C                     Z-ADD0         R       20
|    C                     Z-ADD0         S       20
| 01-C           S         DOWLT6
|   C                     ADD  1         R
|   C                     ADD  1         S
|   C                     Z-ADDPE,R      PE0X,S
| 01-C                     END
|    C*
|    C                     WRITEPE3
|    C*
|    C                     Z-ADD0         PE0X
| 02-C           R         DOWLTI
|   C                     Z-ADD0         PE0X
|   C                     Z-ADD0         S
| 03-C           S         DOWLT6
|   C                     ADD  1         R
|   C                     ADD  1         S
|   C                     MOVELPE,R      PE0X,S
| 03-C                     END
|   C                     WRITEPE4
| 02-C                     END
|    C*--------------------------------------------------------***
|    C                     WRITEPE2
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
06===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
06===C                     ENDSR
     C*==============================================================*
**
下期薪資
上期薪資
