     H****************************************************************
     H*   PROGRAM NAME : PYR3282                                     *
     H*   AUTHER       : A1491 EASON                                 *
     H*   CREATE DATE  : 2007/08/31                                  *
     H*   UPDATE DATE  :                                             *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR3282                                     *
     H*   PURPOSE      :
     H*   INDICATORS   :                                             *
     H****************************************************************
     FPYPTPF  IP  E           K        DISK
     FPYENPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR328P O   E             39     PRINTER
     E*---------------------------------------------------------------
     IPT0
     I                                              PT01  L1
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I*
     I           UDS
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 SPT01
     I                                      503 504 EPT01
     I                                      509 509 DOPT
     I                                      530 5330SPT03
     I                                      540 5430SPT04
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYEN     KLIST
     C                     KFLD           PT01
     C                     KFLD           PT02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100
     C*
     CL1 10                EXSR RTN810
     CLR 10                EXSR RTN890
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           EN01      CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C   40                MOVEL*BLANK    CM02
|    C                     MOVELCM02      DCM02
|    C                     SETON                     91
|    C*
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C                     Z-ADD*ZERO     PTO1
|    C                     Z-ADD*ZERO     PTO2
     C*
     C           DOPT      IFEQ '1'
     C                     CALL 'P39'
     C                     PARM PT03      P3901I  60
     C                     PARM '2'       P3902I  1
     C                     PARM '1'       P3903I  1
     C                     PARM '1'       P3904I  1
     C                     PARM '1'       P3905I  1
     C                     PARM           P3911O  60
     C                     Z-ADDP3911O    DPT03
     C           DPT03     IFEQ *ZERO
     C                     Z-ADDSPT03     DPT03
     C                     ENDIF
     C                     ELSE
     C                     CALL 'P39'
     C                     PARM PT04      P3901I  60
     C                     PARM '2'       P3902I  1
     C                     PARM '1'       P3903I  1
     C                     PARM '1'       P3904I  1
     C                     PARM '1'       P3905I  1
     C                     PARM           P3911O  60
     C                     Z-ADDP3911O    DPT03
     C           DPT03     IFEQ *ZERO
     C                     Z-ADDSPT04     DPT03
     C                     ENDIF
     C                     ENDIF
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     IN   PTDA01
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
|    C*
|    C           PT01      CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM02
|    C  N40                MOVELCM02      DCM02
     C           KEYEN     CHAINEN0                  40
     C   40                MOVEL*BLANK    DEN03
|    C  N40                MOVELEN03      DEN03
|    C*
|    C                     WRITEPD1
|    C*
|    C                     SETOF                     91
|    C*
|    C                     ADD  1         PTO1
|    C                     ADD  PT05      PTO12
|    C                     ADD  PT06      PTO13
|    C                     ADD  PT07      PTO14
|    C                     ADD  PT08      PTO15
|    C                     ADD  PT09      PTO16
|    C                     ADD  PT10      PTO17
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN810... LEVEL BREAK 1
     C*==============================================================*
03===C           RTN810    BEGSR
|    C*
|    C                     WRITEPT1
|    C*
|    C                     SETON                     91
|    C                     ADD  PTO1      PTO2
|    C                     ADD  PTO12     PTO22
|    C                     ADD  PTO13     PTO23
|    C                     ADD  PTO14     PTO24
|    C                     ADD  PTO15     PTO25
|    C                     ADD  PTO16     PTO26
|    C                     ADD  PTO17     PTO27
|    C                     Z-ADD*ZERO     PTO1
|    C                     Z-ADD*ZERO     PTO12
|    C                     Z-ADD*ZERO     PTO13
|    C                     Z-ADD*ZERO     PTO14
|    C                     Z-ADD*ZERO     PTO15
|    C                     Z-ADD*ZERO     PTO16
|    C                     Z-ADD*ZERO     PTO17
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK LR
     C*==============================================================*
04===C           RTN890    BEGSR
|    C*
|    C                     WRITEPT2
|    C*
|    C                     Z-ADD*ZERO     PTO2
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
05===C           RTN899    BEGSR
|    C*
| 01-C*          $PENV     IFNE '2'
|   C*                    MOVEL'N'       $DATA
| 01*C*                    ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C*                    END
|    C*
05===C                     ENDSR
