     H****************************************************************
     H*   PROGRAM NAME : PYR3302                                     *
     H*   AUTHER       : A1490 TERESA                                *
     H*   CREATE DATE  : 96/09/19                                    *
     H*   UPDATE DATE  :
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR3301C                                    *
     H*   PURPOSE      :
     H*   INDICATORS   :                                             *
     H****************************************************************
     FPYPTPF  IP  E           K        DISK
     FPYENPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR330P O   E             39     PRINTER
     E*---------------------------------------------------------------
     IPT0
     I                                              PT02  L1
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I*
     I           UDS
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 SEN01
     I                                      503 504 EEN01
     I                                      505 514 SEN02
     I                                      515 524 EEN02
     I                                      525 5280DYY
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYEN     KLIST
     C                     KFLD           PT01
     C                     KFLD           PT02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100
     C*
     CL1                   EXSR RTN810
     CLR 10                EXSR RTN890
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     IN   PTDA01
|    C*
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... 加總
     C*==============================================================*
02===C           RTN100    BEGSR
     C*
     C                     ADD  PT05      TPT05
     C                     ADD  PT06      TPT06
     C                     ADD  PT07      TPT07
     C                     ADD  PT08      TPT08
     C                     ADD  PT09      TPT09
     C                     ADD  PT10      TPT10
     C                     ADD  PT05      TT05
     C                     ADD  PT06      TT06
     C                     ADD  PT07      TT07
     C                     ADD  PT08      TT08
     C                     ADD  PT09      TT09
     C                     ADD  PT10      TT10
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN810... LEVEL BREAK 1
     C*==============================================================*
03===C           RTN810    BEGSR
|    C*
| 01-C           *IN39     IFEQ '1'
     C                     MOVEL*BLANK    PCM03
     C           PT01      CHAINCM0                  40
     C  N40                MOVELCM03      PCM03
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
     C                     MOVEL*BLANK    PCM02
|    C           PT01      CHAINCM0                  40
|    C  N40                MOVELCM02      PCM02
|    C*
     C                     MOVEL*BLANK    PEN03
|    C           KEYEN     CHAINEN0                  40
     C                     MOVELEN03      PEN03
     C*
     C                     MOVEL*BLANK    PPT02
     C                     MOVELPT02      PPT02
|    C*
|    C                     WRITEPD1
|    C                     Z-ADD0         TPT05
C    C                     Z-ADD0         TPT06
C    C                     Z-ADD0         TPT07
|    C                     Z-ADD0         TPT08
|    C                     Z-ADD0         TPT09
|    C                     Z-ADD0         TPT10
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK LR
     C*==============================================================*
04===C           RTN890    BEGSR
|    C*
     C                     WRITEPT1
|    C                     WRITEPE1
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
05===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
05===C                     ENDSR
