     H****************************************************************/
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   */
     H*                                                              */
     H*    PROGRAM-ID   : PYA3202                                    */
     H*    PROGRAM NAME :薪資所得扣繳稅額繳款書                    */
     H*    AUTHOR       : A1226 PETER                                */
     H*    CREATE DATE  : 86/01/20                                   */
     H*    UPDATE DATE  : 89/04/06 A1274 EVA                         */
     H*    SYSTEM       :人事薪資系統                              */
     H****************************************************************/
     FPYR320WFIP  E           K        DISK
     FPYR320P O   E             39     PRINTER
     I*--------------------------------------------------------------**
     I              '含提撥退休金員工'  C         SORT1
     I              '不含提撥退休金員工'C         SORT2
     IW320
     I                                              W320AAL1
     ILDA        UDS
     I                                      211 2160DDATE
     I                                      125 1270$CPY
     I                                      128 129 $PRTID
     I                                      152 161 $USERN
     I                                      162 162 $EVR
     I*
     I                                      501 502 DPH01
     I                                      541 5450DYM
     I                                      546 5470DMM
     I                                      507 508 DPH01T
     I                                      509 5160WYMD
     I                                      509 5140WYM
     I                                      513 5140WMM
     I                                      515 5160WPH01T
     I                                      520 527 DPH021
     I                                      528 535 DPH022
     I                                      550 550 DSEL
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*==============================================================*
     C*                    KEY
     C*==============================================================*
     C           KEY32     KLIST
     C                     KFLD           DPH01
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
  01-C           *INL1     IFEQ '1'
    C                     SETON                       39
    C                     EXSR RTN010
  01-C                     END
     C*
     C                     EXSR RTN100
     C*
     CL1 10                EXSR RTN200
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   *NAMVAR
|    C*
|    C                     SETON                     10
|    C*
| 01-C           DSEL      IFEQ 'Y'
|   C                     MOVELSORT1     PSEL      P
| 01*C                     ELSE
|   C                     MOVELSORT2     PSEL      P
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... ACCOUNT
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     Z-ADDW32011    PT11
|    C                     ADD  W32021    PT11
|    C                     ADD  W32031    PT11
|    C                     ADD  W32041    PT11
|    C                     ADD  W32051    PT11
|    C                     Z-ADDW32013    PTOT1
|    C                     ADD  W32023    PTOT1
|    C                     ADD  W32033    PTOT1
|    C                     ADD  W32043    PTOT1
|    C                     ADD  W32053    PTOT1
|    C                     Z-ADDW32014    PTOT2
|    C                     ADD  W32024    PTOT2
|    C                     ADD  W32034    PTOT2
|    C                     ADD  W32044    PTOT2
|    C                     ADD  W32054    PTOT2
|    C*
|    C                     Z-ADDW320A1    PT12
|    C                     ADD  W320B1    PT12
|    C                     ADD  W320C1    PT12
|    C                     ADD  W320D1    PT12
|    C                     ADD  W320E1    PT12
|    C                     ADD  W320F1    PT12
|    C                     ADD  W320G1    PT12
|    C                     ADD  W320H1    PT12
|    C                     Z-ADDW320A3    PTOTA
|    C                     ADD  W320B3    PTOTA
|    C                     ADD  W320C3    PTOTA
|    C                     ADD  W320D3    PTOTA
|    C                     ADD  W320E3    PTOTA
|    C                     ADD  W320F3    PTOTA
|    C                     ADD  W320G3    PTOTA
|    C                     ADD  W320H3    PTOTA
|    C                     Z-ADDW320A4    PTOTB
|    C                     ADD  W320B4    PTOTB
|    C                     ADD  W320C4    PTOTB
|    C                     ADD  W320D4    PTOTB
|    C                     ADD  W320E4    PTOTB
|    C                     ADD  W320F4    PTOTB
|    C                     ADD  W320G4    PTOTB
|    C                     ADD  W320H4    PTOTB
|    C*
|    C                     WRITEPH1
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200... ACCOUNT
     C*==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C                     WRITEPT1
|    C*
03===C                     ENDSR
