     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : PYR404D                                    *
     H*    PROGRAM NAME :獎金銀行資料列印                          *
     H*    AUTHOR       : A1232 ERIC                                 *
     H*    CREATE DATE  : 1997/01/17                                 *
     H*    UPDATE DATE  : 2002/07/09 KIN WANG                        *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYR404D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      187 1920DDATE
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DPB01
     I                                      503 5050DPB03
     I*                                     503 5060DPB05
     I*                                     505 5060DPB05M
     I*                                     507 5080DPB05D
     I                                      509 510 DPB041
     I                                      511 512 DPB042
     I                                      513 519 DBN01
     I                                      520 526 DBN02
     I                                      531 5340WPB03
     I*                                     531 5380WPB05
     I*                                     543 5490DPB05
     I*                                     546 5470DPB05M
     I*                                     548 5490DPB05D
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *LIKE     DEFN CM004O    DFMT
     C           *LIKE     DEFN CM005O    DTYPE
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN10     PARM *IN10     IN10    1
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   10                EXSR R0200                      *INIT MSG.
     C  N10                EXSR R0100                      *INIT VALUE
     C*
     C                     MOVEL*BLANK    @PRT    1        *PRINT
  01-C           *IN03     DOUEQ'1'
    C           @PRT      OREQ 'Y'
    C                     EXSR R1000                      *SCRN
  01-C                     END
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===CSR         R0100     BEGSR
|    C*
|    C                     IN   LDA
|    C*
|    C                     SETON                     1027
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C*                    Z-ADD0         DPB05
|    C                     Z-ADD0         DPB03
|    C*                    Z-ADD0         DPB05D
|    C                     MOVEL*BLANK    DPB041
|    C                     MOVEL*BLANK    DPB042
|    C                     MOVEL*BLANK    DBN01
|    C                     MOVEL*BLANK    DBN02
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C*公司別
|    C                     MOVEL$COR      DPB01             公司別
| 01-C           $RMK03    IFNE 'Y'
|   C                     SETOF                     32
| 01*C                     ELSE
|   C                     SETON                     32
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ....INITIAL VALUE
     C*==============================================================*
02===CSR         R0200     BEGSR
|    C*
|    C                     SETON                     2799  報表格式MESSAGE
|    C*
| 01-C           $PENV     IFNE '2'                        NOT-BATCH
|   C           $DATA     ANDEQ'N'                        NO-DATA
|   C                     MOVEL'UPT2050' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     GOTO E0200
| 01-C                     END
|    C*
| 02-C           $PENV     IFEQ '0'                        INQUIRY
|   C                     MOVEL'UPT2142' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|    C*
| 03-C           $PENV     IFEQ '1'                        ON-LINE
|   C                     MOVEL'UPT2140' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C*
| 04-C           $PENV     IFEQ '2'                        BATCH
|   C                     MOVEL'UPT2110' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 04-C                     END
|    C*
02===C           E0200     ENDSR
     C*===============================================================*
     C*          R1000  ...SCREEN MAIN PROCESS
     C*===============================================================*
03===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
|   C                     EXSR R1E00                      .PROMPT
|   C                     GOTO E1000
| 02-C                     END
|    C*
|    C                     EXSR R1B00                      .CHECK      ?
|    C*
| 03-C           *IN99     IFEQ *ZERO
|   C                     SETOF                     27
|   C                     SETON                     28    .執行中
|   C                     WRITEDSPD1
|   C                     SETOF                     28
|   C*
|   C                     OUT  LDA
|   C                     MOVEL'Y'       @PRT
| 03-C                     END
|    C*
03===C           E1000     ENDSR
     C*===============================================================*
     C*          R1B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
04===C           R1B00     BEGSR
|    C*
|    C* << CHACK 公司別NOT *BLANK >>
| 01-C           DPB01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DPB01     CM001I  2         公司代號
|    C                     PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C           DFMT      PARM           CM004O  1         日期格式
|    C           DTYPE     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 02-C           CM099O    IFEQ 'N'
|   C                     SETON                     6199
|   C                     MOVEL'US#0099' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
| 03-C           CM099O    IFEQ *BLANK
|   C                     SETON                     6199
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*+<<DATA CHECK>>+++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C*日期檢核DPB03
| 04-C           DPB03     IFEQ 0
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 04*C*                    ELSE
| 05-C*          DPB05M    IFLT 1
|   C*          DPB05M    ORGT 12
|   C*                    MOVEL'UPT0040' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6399
| 05-C*                    END
| 04-C                     END
|    C*  99                GOTO E1B00
|    C*
|    C*                    CALL 'P39'
|    C*                    PARM DPB05     P3901I  60
|    C*                    PARM DFMT      P3902I  1
|    C*                    PARM DTYPE     P3903I  1
|    C*                    PARM '2'       P3904I  1
|    C*                    PARM '1'       P3905I  1
|    C*          WPB05     PARM           P3911O  60
|    C*
|    C*          DPB05     ADD  19110000  WPB05
|    C           DPB03     ADD  1911      WPB03
|    C*天數檢核DPB052
| 06-C*          DPB05D    IFLT 1
|   C*          DPB05D    ORGT 31
|   C*                    MOVEL'UPT0040' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6599
| 06-C*                    END
|    C*  99                GOTO E1B00
|    C*
|    C*獎金別迄值DPB042
| 07-C           DPB042    IFEQ *BLANK
|   C                     MOVE *ALL'9'   DPB042
| 07-C                     END
|    C*
|    C*獎金別區間檢核DPB041 DPB042
| 08-C           DPB041    IFGT DPB042
|   C                     MOVEL'UPT1011' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 08-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*銀行代碼迄值DBN02
| 09-C           DBN02     IFEQ *BLANK
|   C                     MOVE *ALL'9'   DBN02
| 09-C                     END
|    C*
|    C*銀行代碼區間DBN01 DBN02
| 10-C           DBN01     IFGT DBN02
|   C                     MOVEL'UPT1011' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6699
| 10-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C* CHK FUN AUT
| 11-C           $PENV     IFNE '2'
|   C           $INQ      ANDNE'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 11-C                     END
|    C   99                GOTO E1B00
|    C*
04===CSR         E1B00     ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
05===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*獎金代碼DPB041
| 01-C           #LIN      IFEQ 8
|   C           #COL      ANDGE46
|   C           #COL      ANDLE47
|   C                     CALL 'PYI503'
|   C                     PARM           I503I1  2         薪資組別
|   C           DPB041    PARM DPB041    I503I2  2         薪資代碼
|   C                     PARM           @RTNC   2          FUN KEY
| 01-C                     END
|    C*獎金代碼DPB042
| 02-C           #LIN      IFEQ 9
|   C           #COL      ANDGE46
|   C           #COL      ANDLE47
|   C                     CALL 'PYI503'
|   C                     PARM           I503I1  2         薪資組別
|   C           DPB042    PARM DPB042    I503I2  2         薪資代碼
|   C                     PARM           @RTNC   2          FUN KEY
| 02-C                     END
|    C*銀行代碼DBN01
| 03-C           #LIN      IFEQ 11
|   C           #COL      ANDGE46
|   C           #COL      ANDLE52
|   C                     CALL 'PYI516'
|   C           DBN01     PARM DBN01     I516I1  7         銀行代碼
|   C                     PARM           @RTNC   2          FUN KEY
| 03-C                     END
|    C*銀行代碼DBN02
| 04-C           #LIN      IFEQ 12
|   C           #COL      ANDGE46
|   C           #COL      ANDLE52
|   C                     CALL 'PYI516'
|   C           DBN02     PARM DBN02     I516I1  7         銀行代碼
|   C                     PARM           @RTNC   2          FUN KEY
| 04-C                     END
|    C*
|    C*印表機
| 05-C           #LIN      IFEQ 19
|   C           #COL      ANDGE14
|   C           #COL      ANDLE15
|   C                     CALL 'P64I'
|   C           $PRTCD    PARM $PRTCD    P64II1  2
| 05-C                     END
|    C*
05===C           E1E00     ENDSR
     C*==============================================================*
