     H****************************************************************
     H*   PROGRAM NAME : PYR3102                                     *
     H*   AUTHER       : A1084 CHARLES                               *
     H*   CREATE DATE  : 82/02/14                                    *
     H*   UPDATE DATE  : 89/11/16 A1274 EVA                          *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR3101C                                    *
     H*   PURPOSE      :
     H*   INDICATORS   :                                             *
     H****************************************************************
     FPYPBJF02IP  E           K        DISK
     FPYBCPF  IF  E           K        DISK
     FPYR310F O   E           K        DISK
     I*-------------------------------------------------------------***
     IPBJF02
     I                                              PB02  L1
     ILDA        UDS
     I                                      187 1920DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DPY01
     I                                      509 510 DPB041
     I                                      511 512 DPB042
     I                                      513 519 DBN01
     I                                      520 526 DBN02
     I                                      531 5340WPB03
     I                                      503 5060DPB03
     I*                                     531 5360DPB05M
     I*                                     537 5380DPB05D
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           KEYBC     KLIST                           *SYEMPF
     C                     KFLD           PB01
     C                     KFLD           PB02
     C                     KFLD           DSEL    1
     C*                    KFLD           DPB05M
     C*                    KFLD           DPB05D
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C*********  PB06      SUB  PB08      WAMT    70
     C*********            ADD  WAMT      PH1678  70
     C                     ADD  PB12      PH1678  70
     C*
     CL1 10                EXSR RTN300
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   *NAMVAR
|    C*
|    C                     SETON                     10
|    C                     Z-ADD*ZERO     PH1678
|    C                     MOVEL'5'       DSEL
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN300... WRITE DETAIL
     C*==============================================================*
02===C           RTN300    BEGSR
|    C*
|    C                     MOVELPB01      R3101
|    C                     MOVELPB02      R3102
|    C                     MOVELPY04      R3103
|    C                     MOVELPY05      R3104
|    C                     MOVELPY06      R3105
|    C                     Z-ADDPH1678    R3106
|    C                     MOVEL*BLANK    R3107
|    C*
| 01-C           PH1678    IFGT 0
|   C                     EXSR RTN400
| 01-C                     END
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN400... WRITE DETAIL
     C*==============================================================*
03===C           RTN400    BEGSR
|    C*
|    C           KEYBC     CHAINBC0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL*BLANK    R3103
|   C                     MOVEL*BLANK    R3104
|   C                     MOVEL*BLANK    R3105
|   C                     MOVELBC06      R3107
| 01-C                     END
|    C*
|    C                     WRITER310
|    C                     Z-ADD0         PH1678
|    C*
03===C                     ENDSR
