     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYR4052                                    *
     H*    PROGRAM NAME :福利獎金資料列印-員工                   *
     H*    AUTHOR       : A1328 JEFFREY                              *
     H*    CREATE DATE  : 90/02/27                                   *
     H*    UPDATE DATE  : 90/05/09 A1274 EVA                         *
     H*    SYSTEM       :音教講師管理系統                          *
     H****************************************************************
     FPYPBJF01IP  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYEMPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYSSPF  IF  E           K        DISK
     FPYR405P O   E             39     PRINTER
     E*---------------------------------------------------------------
     IPBJF01
     I                                              PB01  L2
     I                                              EM041 L1
     I                                              EM042 L1
     I                                              EM043 L1
     I                                              EM044 L1
     I*
     I           UDS
     I                                      211 2160DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DPB01
     I                                      601 6070DPB051
     I                                      608 6140DPB052
     I                                      541 5480WPB051
     I                                      549 5560WPB052
     I                                      517 518 DPB041
     I                                      519 520 DPB042
     I                                      601 607 DEM041
     I                                      608 614 DEM042
     I                                      531 538 DPB021
     I                                      561 568 DPB022
     I            DS
     I                                        1   70PBYMD
     I                                        1   50WPB05
     I                                        6   70PB05D
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYSS     KLIST
     C                     KFLD           CM13
     C                     KFLD           PB04
     C           KEYDP     KLIST
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C           KEYEMA    KLIST
     C                     KFLD           PB01
     C                     KFLD           PB02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*
     C                     EXSR R2000                      .DETAIL
     CL1 10                EXSR R8100                      .L1
     CL2 10                EXSR R8200                      .L2
     C*
     CLR 10                EXSR R8900
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R1000 ... INITIAL PROCESS
     C*==============================================================*
01===C           R1000     BEGSR
|    C*
|    C                     SETON                     1039
|    C*公司名稱
|    C           DPB01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C*
|    C                     Z-ADD*ZERO     PT21
|    C                     Z-ADD*ZERO     PT22
|    C                     Z-ADD*ZERO     PT23
|    C                     Z-ADD*ZERO     PT27
|    C                     Z-ADD*ZERO     PT51
|    C                     Z-ADD*ZERO     PT52
|    C                     Z-ADD*ZERO     PT53
|    C                     Z-ADD*ZERO     PT57
|    C                     Z-ADD*ZERO     PEM19
|    C                     MOVEL*BLANK    PSS02
|    C                     Z-ADD*ZERO     PPB06
|    C                     Z-ADD*ZERO     PPB08
|    C                     Z-ADD*ZERO     PPB12
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
02===C           R2000     BEGSR
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
|    C*獎金名稱
|    C           KEYSS     CHAINSS0                  40
|    C   40                MOVEL*BLANK    PSS02
|    C  N40                MOVELSS02      PSS02
|    C*
|    C*部門名稱
|    C           KEYDP     CHAINDP0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     CALL 'P65'
|   C                     PARM DP02      P6501I 80
|   C                     PARM 9         P6502I  30
|   C           PDP02     PARM           P6511O 80
|   C                     PARM           P6512O 80
| 02*C                     ELSE
|   C                     MOVEL*BLANK    PDP02
| 02-C                     END
|    C*
|    C*福利獎金．扣繳稅額．實領總額
|    C                     Z-ADDPB06      PPB06
|    C                     Z-ADDPB08      PPB08
|    C                     Z-ADDPB12      PPB12
|    C*發放日期
|    C           PB05      SUB  191100    WPB05
|    C*離職日期
|    C           KEYEMA    CHAINEM0                  40
| 03-C           *IN40     IFEQ '0'
| 04-C           EM19      IFEQ 0
|   C                     Z-ADD*ZERO     PEM19
| 04*C                     ELSE
|   C           EM19      SUB  19110000  PEM19
| 04-C                     END
| 03*C                     ELSE
|   C                     Z-ADD*ZERO     PEM19
| 03-C                     END
|    C*
|    C                     ADD  1         PT21
|    C                     ADD  PB06      PT22
|    C                     ADD  PB08      PT23
|    C                     ADD  PB12      PT27
|    C*
|    C                     ADD  1         PT51
|    C                     ADD  PB06      PT52
|    C                     ADD  PB08      PT53
|    C                     ADD  PB12      PT57
|    C*
|    C                     WRITEPD1
|    C*
02===C           E2000     ENDSR
     C*==============================================================*
     C*          R8100 ... LEVEL BREAK L1        部門
     C*==============================================================*
03===C           R8100     BEGSR
|    C*
|    C                     WRITEPT2
|    C*部門名稱
|    C           KEYDP     CHAINDP0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     CALL 'P65'
|   C                     PARM DP02      P6501I 80
|   C                     PARM 9         P6502I  30
|   C           PDP02     PARM           P6511O 80
|   C                     PARM           P6512O 80
| 01*C                     ELSE
|   C                     MOVEL*BLANK    PDP02
| 01-C                     END
|    C*
|    C                     Z-ADD*ZERO     PT21
|    C                     Z-ADD*ZERO     PT22
|    C                     Z-ADD*ZERO     PT23
|    C                     Z-ADD*ZERO     PT27
|    C*
03===C                     ENDSR
     C*==============================================================
     C*          R8200 ... LEVEL BREAK L2        獎金項目
     C*==============================================================
04===C           R8200     BEGSR
|    C*
|    C                     WRITEPT5
|    C*
|    C                     Z-ADD*ZERO     PT21
|    C                     Z-ADD*ZERO     PT22
|    C                     Z-ADD*ZERO     PT23
|    C                     Z-ADD*ZERO     PT27
|    C                     Z-ADD*ZERO     PT51
|    C                     Z-ADD*ZERO     PT52
|    C                     Z-ADD*ZERO     PT53
|    C                     Z-ADD*ZERO     PT57
|    C                     MOVEL*BLANK    PDP02
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR --- HAS DATA
     C*==============================================================*
05===C           R8900     BEGSR
|    C*
05===C           E8900     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
06===C           R8999     BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
06===C           E8999     ENDSR
     C*==============================================================*
