     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : PYR5322                                    *
     H*    PROGRAM NAME :員工考績資料表　　　　                    *
     H*    AUTHOR       : TOM                                        *
     H*    CREATE DATE  : 2000/09/15                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYRV4PF IP  E           K        DISK
     FPYRV1PF IF  E           K        DISK
     FPYEMPF  IF  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR532P O   E             39     PRINTER
     E*---------------------------------------------------------------
     IRVD0
     I                                              RVD04 L1
     I                                              RVD03 L2
     I           UDS
     I                                      211 2160DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DRV01
     I                                      601 607 DEM041
     I                                      608 614 DEM042
     I                                      523 5250DRV03
     I                                      541 548 DRV021
     I                                      549 556 DRV022
     I                                      557 5600WRV02
     I            DS
     I                                        1   7 RVD03
     I                                        1   1 RVD031
     I                                        2   2 RVD032
     I                                        3   3 RVD033
     I                                        4   7 RVD034
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN CM004O    DFMT
     C           *LIKE     DEFN CM005O    DTYPE
     C*==============================================================*
     C*                    KEYLIST
     C*==============================================================*
     C           KEYDP     KLIST                           *PYDPPF
     C                     KFLD           RVD031
     C                     KFLD           RVD032
     C                     KFLD           RVD033
     C                     KFLD           RVD034
     C           KEYEM     KLIST                           *PYEMPF
     C                     KFLD           DRV01
     C                     KFLD           RVD04
     C           KEYRV     KLIST                           *PYRV1PF
     C                     KFLD           RVD01
     C                     KFLD           RVD02
     C                     KFLD           RVD03
     C                     KFLD           RVD04
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100                     *WRITE PD1
     C*
     CLR 10                WRITEPT5
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           DRV01     CHAINCM0                  40
|    C   40                MOVE *BLANK    CM03
|    C*
|    C                     Z-ADD*ZERO     CNT     40
|    C*
|    C                     SETON                     10
|    C                     SETON                     39
|    C                     MOVEL'Y'       $DATA
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... INITIAL GET HEADING
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DRV01     CM001I  2         公司代號
|    C                     PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C           DFMT      PARM           CM004O  1         日期格式
|    C           DTYPE     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C*
| 01-C           *INL1     IFEQ '1'
|   C           KEYEM     CHAINEM0                  40
|   C   40                MOVEL*BLANK    EM03
| 01-C                     END
|    C*
| 02-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 02-C                     END
|    C*
|   C                     CALL 'P82'
|   C                     PARM RVD02     P8201I  40
|   C                     PARM '2'       P8202I  1
|   C                     PARM '1'       P8203I  1
|   C                     PARM DFMT      P8204I  1
|   C                     PARM DTYPE     P8205I  1
|   C           DRV03     PARM           P8211O  40
     C*
     C                     Z-ADD*ZERO     RVAMT
     C           KEYRV     SETLLRVA0
     C           KEYRV     READERVA0                     57
     C           *IN57     DOWEQ'0'
     C                     ADD  RVA07     RVAMT
     C           KEYRV     READERVA0                     57
     C                     END
     C*
     C                     ADD  1         CNT
     C*
| 01-C           *INL2     IFEQ '1'
|   C           KEYDP     CHAINDP0                  40
|   C   40                MOVEL*BLANK    DP02
     C                     ELSE
|   C                     MOVEL*BLANK    RVD03
|   C                     MOVEL*BLANK    DP02
| 01-C                     END
     C*
|    C                     WRITEPD1
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
03===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
03===C                     ENDSR
     C*==============================================================*
