     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : PYR5312                                    *
     H*    PROGRAM NAME :考績等級分數設定對照表                    *
     H*    AUTHOR       : TOM                                        *
     H*    CREATE DATE  : 2000/09/14                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYRRPF  IP  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR531P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    W1      2   2  1
     E                    W2      1   2  6
     E*---------------------------------------------------------------
     I           UDS
     I                                      211 2160DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DRR01
     I                                      511 511 DRR021
     I                                      512 512 DRR022
     I                                      521 522 DRR031
     I                                      531 532 DRR032
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN CM004O    DFMT
     C           *LIKE     DEFN CM005O    DTYPE
     C*==============================================================*
     C*                    KEYLIST
     C*==============================================================*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100                     *WRITE PD1
     C*
     C*L1                   SETON                     32
     C*L2                   SETON                     31
     CLR 10                WRITEPT5
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           DRR01     CHAINCM0                  40
|    C   40                MOVE *BLANK    CM03
|    C*
|    C                     SETON                     103132
|    C                     SETON                     39
|    C                     MOVEL'Y'       $DATA
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... INITIAL GET HEADING
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DRR01     CM001I  2         公司代號
|    C           CM02      PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C           DFMT      PARM           CM004O  1         日期格式
|    C           DTYPE     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
|   C                     SETON                     3132
| 01-C                     END
|    C*
|    C                     Z-ADD1         WI      20
|    C           RR02      LOKUPW1,WI                    40
|    C   40                MOVELW2,WI     RR02N
|    C*
|    C           RR04      DIV  100       RR04N   32
|    C*
|    C                     WRITEPD1
|    C                     SETOF                     3132
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
03===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
03===C                     ENDSR
     C*==============================================================*
**
AB
**
調薪
獎金
