     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYR6342                                    *
     H*    PROGRAM NAME :健保投保額人數統計表　                    *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 2006/05/10                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FPYEMPF  IP  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYE8PF  IF  E           K        DISK
     FPYE3PF  IF  E           K        DISK
     FPYR634P O   E             39     PRINTER
     E*---------------------------------------------------------------*
     E                    RATE       70  7 0
     E                    NUM        70  5 0
     E                    N           4  5 0
     E*                   X           4  9 0
     E*---------------------------------------------------------------*
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      111 118 $CHYMD
     I                                      119 124 $ADMDY
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I                                      203 2080DDATE
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DEM01
     I                                      521 527 DEM04S
     I                                      531 537 DEM04E
     I                                      541 5440DYM
     I                                      551 5560DYMA
     I            DS
     I                                        1   80E803
     I                                        1   60E803YM
     I            DS
     I                                        1   80WYMD
     I                                        1   60WYM
     I                                        1   40WY
     I                                        5   60WM
     I                                        7   80WD
     I            DS
     I                                        1 490 RATE
     I                                        1   70RATE01
     I                                        8  140RATE02
     I                                       15  210RATE03
     I                                       22  280RATE04
     I                                       29  350RATE05
     I                                       36  420RATE06
     I                                       43  490RATE07
     I                                       50  560RATE08
     I                                       57  630RATE09
     I                                       64  700RATE10
     I                                       71  770RATE11
     I                                       78  840RATE12
     I                                       85  910RATE13
     I                                       92  980RATE14
     I                                       99 1050RATE15
     I                                      106 1120RATE16
     I                                      113 1190RATE17
     I                                      120 1260RATE18
     I                                      127 1330RATE19
     I                                      134 1400RATE20
     I                                      141 1470RATE21
     I                                      148 1540RATE22
     I                                      155 1610RATE23
     I                                      162 1680RATE24
     I                                      169 1750RATE25
     I                                      176 1820RATE26
     I                                      183 1890RATE27
     I                                      190 1960RATE28
     I                                      197 2030RATE29
     I                                      204 2100RATE30
     I                                      211 2170RATE31
     I                                      218 2240RATE32
     I                                      225 2310RATE33
     I                                      232 2380RATE34
     I                                      239 2450RATE35
     I                                      246 2520RATE36
     I                                      253 2590RATE37
     I                                      260 2660RATE38
     I                                      267 2730RATE39
     I                                      274 2800RATE40
     I                                      281 2870RATE41
     I                                      288 2940RATE42
     I                                      295 3010RATE43
     I                                      302 3080RATE44
     I                                      309 3150RATE45
     I                                      316 3220RATE46
     I                                      323 3290RATE47
     I                                      330 3360RATE48
     I                                      337 3430RATE49
     I                                      344 3500RATE50
     I                                      351 3570RATE51
     I                                      358 3640RATE52
     I                                      365 3710RATE53
     I                                      372 3780RATE54
     I                                      379 3850RATE55
     I                                      386 3920RATE56
     I                                      393 3990RATE57
     I                                      400 4060RATE58
     I                                      407 4130RATE59
     I                                      414 4200RATE60
     I                                      421 4270RATE61
     I                                      428 4340RATE62
     I                                      435 4410RATE63
     I                                      442 4480RATE64
     I                                      449 4550RATE65
     I                                      456 4620RATE66
     I                                      463 4690RATE67
     I                                      470 4760RATE68
     I                                      477 4830RATE69
     I                                      484 4900RATE70
     I            DS
     I                                        1 350 NUM
     I                                        1   50NUM01
     I                                        6  100NUM02
     I                                       11  150NUM03
     I                                       16  200NUM04
     I                                       21  250NUM05
     I                                       26  300NUM06
     I                                       31  350NUM07
     I                                       36  400NUM08
     I                                       41  450NUM09
     I                                       46  500NUM10
     I                                       51  550NUM11
     I                                       56  600NUM12
     I                                       61  650NUM13
     I                                       66  700NUM14
     I                                       71  750NUM15
     I                                       76  800NUM16
     I                                       81  850NUM17
     I                                       86  900NUM18
     I                                       91  950NUM19
     I                                       96 1000NUM20
     I                                      101 1050NUM21
     I                                      106 1100NUM22
     I                                      111 1150NUM23
     I                                      116 1200NUM24
     I                                      121 1250NUM25
     I                                      126 1300NUM26
     I                                      131 1350NUM27
     I                                      136 1400NUM28
     I                                      141 1450NUM29
     I                                      146 1500NUM30
     I                                      151 1550NUM31
     I                                      156 1600NUM32
     I                                      161 1650NUM33
     I                                      166 1700NUM34
     I                                      171 1750NUM35
     I                                      176 1800NUM36
     I                                      181 1850NUM37
     I                                      186 1900NUM38
     I                                      191 1950NUM39
     I                                      196 2000NUM40
     I                                      201 2050NUM41
     I                                      206 2100NUM42
     I                                      211 2150NUM43
     I                                      216 2200NUM44
     I                                      221 2250NUM45
     I                                      226 2300NUM46
     I                                      231 2350NUM47
     I                                      236 2400NUM48
     I                                      241 2450NUM49
     I                                      246 2500NUM50
     I                                      251 2550NUM51
     I                                      256 2600NUM52
     I                                      261 2650NUM53
     I                                      266 2700NUM54
     I                                      271 2750NUM55
     I                                      276 2800NUM56
     I                                      281 2850NUM57
     I                                      286 2900NUM58
     I                                      291 2950NUM59
     I                                      296 3000NUM60
     I                                      301 3050NUM61
     I                                      306 3100NUM62
     I                                      311 3150NUM63
     I                                      316 3200NUM64
     I                                      321 3250NUM65
     I                                      326 3300NUM66
     I                                      331 3350NUM67
     I                                      336 3400NUM68
     I                                      341 3450NUM69
     I                                      346 3500NUM70
     I            DS
     I                                        1  20 N
     I                                        1   50N1
     I                                        6  100N2
     I                                       11  150N3
     I                                       16  200N4
     I*           DS
     I*                                       1  36 X
     I*                                       1   90X1
     I*                                      10  180X2
     I*                                      19  270X3
     I*                                      28  360X4
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*PYEMPF
     C*          KEYEM     KLIST
     C*                    KFLD           DEM01            .公司代號
     C*                    KFLD           KEM02  10        .員工代號
     C*PYE8PF
     C           KEYE3     KLIST
     C                     KFLD           DEM01            .公司代號
     C                     KFLD           EM02             .員工代號
     C                     KFLD           WYMD             .日期
     C*PYE8PF
     C           KEYE4     KLIST
     C                     KFLD           DEM01            .公司代號
     C                     KFLD           EM02             .員工代號
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R0100
     C                     EXSR R1000                      .DETAIL
     C*                    SETON                     LR
     CLR 10                EXSR R900
     C*==============================================================*
     C*          R0100 ... INITIAL PROCESS
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     MOVEL*BLANK    RATE
|    C                     Z-ADD*ZEROS    NUM
|    C                     Z-ADD*ZEROS    N
|    C*                    Z-ADD*ZEROS    X
|    C                     Z-ADDDYMA      WYM
|    C                     Z-ADD31        WD
|    C*
|    C                     IN   LDA
|    C                     SETON                     10
|    C*
|    C           DEM01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C*健保級距表寫入
|    C                     Z-ADD1         I       20
|    C           *LOVAL    SETLLE30
|    C                     READ E30                      46
| 01-C           *IN46     DOWEQ'0'
|   C                     Z-ADDE302      RATE,I
|   C                     ADD  1         I
|   C                     READ E30                      46
| 01-C                     END
|    C*
|    C                     WRITEPH1
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ... DETAIL
     C*==============================================================*
02===C           R1000     BEGSR
|    C* 去抓健保主檔將員工代號、公司檔、生效日期
|    C           KEYE3     SETGTE80
|    C           KEYE4     REDPEE80                      47
| 01-C           *IN47     IFEQ '0'
|   C*在處理年月內
| 02-C           E803YM    IFEQ DYMA
|   C*異動類別
| 03-C                     SELEC
|   C*異動類別'投保'
|   C           E804      WHEQ '1'
|   C           E804      OREQ '4'
|   C                     ADD  1         N3
|   C                     ADD  1         SN1
|   C*歸入級距
|   C                     EXSR R1100
|   C*
|   C*異動類別'調整'
|   C           E804      WHEQ '2'
|   C                     ADD  1         N2
|   C                     ADD  1         SN1
|   C*歸入級距
|   C                     EXSR R1100
|   C*
|   C*異動類別'退保'
|   C           E804      WHEQ '3'
|   C           E804      OREQ '5'
|   C           E804      OREQ '9'
|   C                     ADD  1         N4
|   C                     GOTO NEXT
| 03-C                     ENDSL
|   C*
     C*              比對上一筆資料
| 02*C                     ELSE                            範圍外
| 04-C                     SELEC
|   C*異動類別'投保'
|   C           E804      WHEQ '1'
|   C                     ADD  1         SN1
|   C*歸入級距
|   C                     EXSR R1100
|   C*
|   C*異動類別'調整'
|   C           E804      WHEQ '2'
|   C                     ADD  1         SN1
|   C*歸入級距
|   C                     EXSR R1100
|   C*
|   C*異動類別'退保'
|   C           E804      WHEQ '3'
|   C                     GOTO NEXT
| 04-C                     ENDSL
|   C*
| 02-C                     ENDIF
| 01-C                     ENDIF
     C*
|    C*
|    C           NEXT      TAG
|    C*
|    C   47                MOVEL*BLANK    E804
|    C   47                Z-ADD*ZERO     E805
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          R1100 ... DETAIL
     C*==============================================================*
03===C           R1100     BEGSR
|    C*
|    C                     Z-ADD0         I       20
| 01-C           1         DO   70        I
| 02-C           E805      IFEQ RATE,I
|   C                     ADD  1         NUM,I
| 02-C                     ADD  E805      SX1
     C*                    MOVE RATE,I    RATEE
     C*                    MOVE NUM,I     NUMM
|   C                     GOTO E1100
| 02-C                     ENDIF
| 01-C                     ENDDO
|    C*
03===C           E1100     ENDSR
     C*==============================================================*
     C*          R900  ... WRITE PRINT
     C*==============================================================*
03===C           R900      BEGSR
|    C*
     C           1         DO   70        I
     C                     MOVE RATE,I    RATEE
     C                     MOVE NUM,I     NUMM
     C*
     C           RATE,I    IFEQ *ZERO
     C                     ITER
     C                     ENDIF
     C*
     C                     WRITEPD1
     C*
     C                     ENDDO
     C*
| 01-C                     WRITEPT1
|    C*
03===C           E900      ENDSR
     C*==============================================================*
