     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : PYR6181                                    *
     H*    PROGRAM NAME :勞保投保資料明細表印                      *
     H*    AUTHOR       : A1226 PETER                                *
     H*    CREATE DATE  : 1997/08/07                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYEMPF  IP  E           K        DISK
     FPYTXPF  IF  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR618P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    W1      3   3  6
     E*---------------------------------------------------------------
     IEM0
     I                                              EM02  L1
     I                                              EM041 L2
     I                                              EM042 L2
     I                                              EM043 L2
     I                                              EM044 L2
     I           UDS
     I                                      187 1920DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DEM01
     I                                      540 546 DEM041
     I                                      547 553 DEM042
     I                                      554 563 DEM021
     I                                      564 573 DEM022
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN CM14      DFMT
     C           *LIKE     DEFN CM15      DTYPE
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYTX     KLIST                           *PYDPPF
     C                     KFLD           DEM01
     C                     KFLD           EM02
     C                     KFLD           TX031
     C           KEYDP     KLIST                           *PYDPPF
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100                     *WRITE PD1
     C*
     CL1                   SETON                     32
     CL2                   SETON                     31
     CLR 10                WRITEPE2
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           DEM01     CHAINCM0                  40
|    C   40                MOVE *BLANK    CM03
|    C                     MOVE CM14      DFMT
|    C                     MOVE CM15      DTYPE
|    C*
|    C                     SETON                     103132
|    C                     SETON                     39
|    C                     MOVEL'Y'       $DATA
|    C*
|    C                     MOVEL'A'       TX031
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... INITIAL GET HEADING
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
| 01-C           *INL2     IFEQ '1'
|   C           KEYDP     CHAINDP0                  40
|   C   40                MOVEL*BLANK    DP02
| 01-C                     END
|    C*
|    C                     CALL 'P31'
|    C                     PARM EM33      P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM DFMT      P3104I  1
|    C                     PARM DTYPE     P3105I  1
|    C                     PARM           P3111O  80
|    C                     Z-ADDP3111O    EM33W
|    C*
| 02-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
|   C                     SETON                     3132
| 02-C                     END
|    C*
|    C           KEYTX     SETGTTX0
|    C           KEYTX     REDPETX0                      40
|    C*
| 03-C           *IN40     IFEQ '0'
|   C                     MOVELTX032     X       10
|   C                     MOVELW1,X      TX03N
|   C*
|   C                     CALL 'P31'
|   C                     PARM TX04      P3101I  80
|   C                     PARM '2'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM DFMT      P3104I  1
|   C                     PARM DTYPE     P3105I  1
|   C                     PARM           P3111O  80
|   C                     Z-ADDP3111O    TX04W
|   C*
|   C                     WRITEPD1
|   C                     SETOF                     3132
| 03-C                     END
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
03===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
03===C                     ENDSR
     C*==============================================================*
**
投保調整退保
