     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : PYR6443                                    *
     H*    PROGRAM NAME :全民健保費用証明表　　                    *
     H*    AUTHOR       : A1336 KLAUS                                *
     H*    CREATE DATE  : 92/03/05                                   *
     H*    UPDATE DATE  : 06/06/16 CLOUD                             *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYR646WFIP  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPT#YPF  IF  E           K        DISK
     FPYR646P O   E             39     PRINTER
     IWF0
     I                                              WF02  L1
     I           UDS
     I                                      187 1920DDATE
     I                                      125 1270$CPY
     I                                      201 2080$A8YMD
     I                                      210 2150PDATE
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DEM01
     I                                      503 509 DEM041
     I                                      510 516 DEM042
     I                                      541 550 DEM021
     I                                      551 560 DEM022
     I                                      601 6020DPEN
     I                                      611 6140DPENK
     I*系統日期
     I            DS
     I                                        1   60SYMD
     I                                        1   20SYY
     I                                        3   40SMM
     I                                        5   60SDD
     C*==============================================================*
     C*                    KEYLIST
     C*==============================================================*
     C*PT#YPF
     C           KEY#Y     KLIST
     C                     KFLD           #Y01
     C                     KFLD           #Y02
     C*PYHDPF
     C           KEYHD     KLIST
     C                     KFLD           WF01
     C                     KFLD           WF02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN200                     *WRITE PD1
     C*
     CL1 10                EXSR RTN810
     CLR 10                EXSR RTN890
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C*
     C           DEM01     CHAINCM0                  40
|    C                     MOVELCM08      DCM08
|    C*
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C                     Z-ADDDPENK     DYM
     C                     Z-ADD$A8YMD    SYMD
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN200... PROCESS
     C*==============================================================*
02===C           RTN200    BEGSR
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
|   C                     ENDIF
|    C*稱謂
|    C                     SELEC
     C           WF05      WHEQ 'X'
|    C                     MOVEL'本人'  WF06N
     C                     OTHER
     C                     MOVEL'RELATION'#Y01
     C                     MOVELWF05      #Y02
     C           KEY#Y     CHAIN#Y0                  40
     C  N40                MOVEL#Y03      WF06N
     C   40                MOVEL*BLANK    WF06N
     C                     ENDSL
|    C*
     C                     WRITEPD1
|    C*勞保總計
     C                     ADD  WF09      L1
|    C*健保總計
     C                     ADD  WF08      E1
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN810... LEVEL BREAK 1
     C*==============================================================*
03===C           RTN810    BEGSR
|    C*
|    C*
     C           L1        ADD  E1        T1
|    C*
|    C                     WRITEPT1
|    C                     WRITEPE1
|    C*
     C                     Z-ADD0         L1
     C                     Z-ADD0         E1
     C                     Z-ADD0         T1
|    C*
|    C                     SETON                       39
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
03===C           RTN890    BEGSR
|    C*
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
04===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
04===C                     ENDSR
     C*==============================================================*
