     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : PYR6062                                    *
     H*    PROGRAM NAME :綜合福利金餘額查詢表                      *
     H*    AUTHOR       : A1274 EVA                                  *
     H*    CREATE DATE  : 90/04/18                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYGHJF01IP  E           K        DISK
     FPYGDLF01IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYR606P O   E             39     PRINTER
     I*-------------------------------------------------------------***
     IGHJF01
     I                                              EM041 L2
     I                                              EM042 L2
     I                                              EM043 L2
     I                                              EM044 L2
     I                                              GH02  L1
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      211 2160$DATE
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DEM01
     I                                      503 507 DEM041
     I                                      508 512 DEM042
     I                                      513 520 DEM021
     I                                      521 528 DEM022
     I                                      534 5360DYEAR
     I                                      601 6040WYEAR
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYDP     KLIST                           *PYDPPF
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C*PYGDPF
     C           KEYGD     KLIST
     C                     KFLD           DEM01
     C                     KFLD           WYEAR
     C                     KFLD           GH02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*
     C                     MOVEL'Y'       $DATA
     C                     EXSR R2000                      .DETAIL
     C*
     CL2 10                EXSR R8200
     CLR 10                EXSR R8900
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R1000 ... INITIAL PROCESS
     C*==============================================================*
01===C           R1000     BEGSR
|    C*
|    C                     SETON                     103931
|    C                     IN   PTDA01
|    C*公司別
|    C           DEM01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
02===C           R2000     BEGSR
|    C*
| 01-C           *INL2     IFEQ '1'
|   C           KEYDP     CHAINDP0                  40
|   C   40                MOVEL*BLANK    DP02
| 01-C                     END
|    C*
|    C*換頁　
| 02-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 02-C                     END
|    C*-------------------------------------------------------------***
|    C                     Z-ADD*ZERO     PPAY
|    C                     Z-ADD*ZERO     PRST
|    C*-------------------------------------------------------------***
|    C*年度福利金額．個人申請總額．福利金餘額
|    C*
|    C           KEYGD     SETLLGD0
|    C           KEYGD     READEGD0                      46
| 03-C           *IN46     DOWEQ'0'
|   C                     ADD  GD08      PPAY
|   C           KEYGD     READEGD0                      46
| 03-C                     END
|    C*
|    C           GH04      SUB  PPAY      PRST
|    C*-------------------------------------------------------------***
|    C   L2                SETON                     31
|    C                     WRITEPD1
|    C*
|    C                     SETOF                     31
|    C   L2                Z-ADD0         TT01
|    C                     ADD  1         TT00    40       *總人數
|    C                     ADD  1         TT01    40       *總人數
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          R8200 ... LEVEL BREAK LR.....
     C*==============================================================*
03===C           R8200     BEGSR
|    C*
|    C                     WRITEPT1                        *小計
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR.....HAS DATA
     C*==============================================================*
04===C           R8900     BEGSR
|    C*
|    C                     WRITEPT2                        *總計
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR.....NO DATA
     C*==============================================================*
05===C           R8999     BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     WRITEPH1
|   C                     WRITEPE9                                  *
| 01-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
