     H****************************************************************
     H*   PROGRAM ID   : PYR6091                                     *
     H*   PROGRAM NAME : YYY/MM貸款扣款明細表-員工              *
     H*   AUTHER       : WILLIAMS
     H*   CREATE DATE  : 90/02/08                                    *
     H*   UPDATE DATE  :                                             *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PURPOSE      :
     H****************************************************************
     FPYR609D CF  E                    WORKSTN      KINFDS DSPFDS
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     ILDA        UDS
     I                                      101 110 $USER
     I                                      211 2160$DATE
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*----------------------------------------------------------------
     I                                      501 502 DLN01
     I                                      601 607 DEM04S
     I                                      608 614 DEM04E
     I                                      519 526 DLN02S
     I                                      527 534 DLN02E
     I                                      535 542 DLN12S
     I                                      543 550 DLN12E
     I                                      551 551 DLN03S
     I                                      552 552 DLN03E
     I                                      553 5570DYM
     I                                      558 558 DSOPT
     I                                      561 5660WYM
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *LIKE     DEFN CM004O    DFMT
     C           *LIKE     DEFN CM005O    DTYPE
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN10     PARM *IN10     IN10    1
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   10                EXSR R0200                      *INIT MSG.
     C  N10                EXSR R0100                      *INIT VALUE
     C*
     C                     MOVEL*BLANK    @PRT    1        *PRINT
  01-C           *IN03     DOUEQ'1'
    C           @PRT      OREQ 'Y'
    C                     EXSR R1000                      *SCRN
  01-C                     END
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===CSR         R0100     BEGSR
|    C*
|    C*
|    C                     SETON                     1027
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     MOVE *BLANK    DLN01            *公司別
|    C                     MOVE *BLANK    DEM04S           *部門起
|    C                     MOVE *BLANK    DEM04E           *部門迄
|    C                     MOVE *BLANK    DLN02S           *員工起
|    C                     MOVE *BLANK    DLN02E           *員工迄
|    C                     MOVE *BLANK    DLN12S           *契約起
|    C                     MOVE *BLANK    DLN12E           *契約迄
|    C                     MOVE *BLANK    DLN03S           *貸款起
|    C                     MOVE *BLANK    DLN03E           *貸款迄
|    C                     Z-ADD*ZERO     DYM              *扣款年月
|    C                     MOVEL'1'       DSOPT            *排序方式
|    C                     MOVEL*BLANK    ERRID
|    C                     MOVEL*BLANK    ERRF
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C*公司別
|    C                     MOVEL$COR      DLN01             公司別
| 01-C           $RMK03    IFNE 'Y'
|   C                     SETOF                     32
| 01*C                     ELSE
|   C                     SETON                     32
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ....INITIAL VALUE
     C*==============================================================*
02===CSR         R0200     BEGSR
|    C*
|    C                     IN   LDA
|    C                     SETON                     2799  報表格式MESSAGE
|    C*
| 01-C           $PENV     IFNE '2'                        NOT-BATCH
|   C           $DATA     ANDEQ'N'                        NO-DATA
|   C                     MOVEL'UPT2050' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     GOTO E0200
| 01-C                     END
|    C*
| 02-C           $PENV     IFEQ '0'                        INQUIRY
|   C                     MOVEL'UPT2142' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|    C*
| 03-C           $PENV     IFEQ '1'                        ON-LINE
|   C                     MOVEL'UPT2140' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C*
| 04-C           $PENV     IFEQ '2'                        BATCH
|   C                     MOVEL'UPT2110' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 04-C                     END
|    C*
02===C           E0200     ENDSR
     C*===============================================================*
     C*          R1000  ...SCREEN MAIN PROCESS
     C*===============================================================*
03===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
|   C                     EXSR R1E00                      .PROMPT
|   C                     GOTO E1000
| 02-C                     END
|    C*
|    C                     EXSR R1B00                      .CHECK      ?
|    C*
| 03-C           *IN99     IFEQ *ZERO
|   C                     SETOF                     27
|   C                     SETON                     28    .執行中
|   C                     WRITEDSPD1
|   C                     SETOF                     28
|   C*
|   C                     OUT  LDA
|   C                     MOVEL'Y'       @PRT
| 03-C                     END
|    C*
03===C           E1000     ENDSR
     C*===============================================================*
     C*          R1B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
04===C           R1B00     BEGSR
|    C*
| 01-C           DLN01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DLN01     CM001I  2         公司代號
|    C                     PARM           CM002O 22         公司名稱
|    C                     PARM           CM003O 32         代碼說明
|    C           DFMT      PARM           CM004O  1         日期格式
|    C           DTYPE     PARM           CM005O  1         日期曆別
|    C                     PARM           CM098O 50         備用欄
|    C                     PARM           CM099O  1         存在否？
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 02-C           CM099O    IFEQ 'N'
|   C                     SETON                     6199
|   C                     MOVEL'US#0099' ERRID
|   C                     MOVEL'S#MF'    ERRF
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
| 03-C           CM099O    IFEQ *BLANK
|   C                     SETON                     6199
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*部門別迄值DEM04E
| 04-C           DEM04E    IFEQ *BLANK
|   C                     MOVE *ALL'9'   DEM04E
| 04-C                     END
|    C*
|    C*部門別區間DEM04S DEM04E
| 05-C           DEM04S    IFGT DEM04E
|   C                     MOVEL'UPT1011' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 05-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*員工別迄值DLN02E
| 06-C           DLN02E    IFEQ *BLANK
|   C                     MOVE *ALL'9'   DLN02E
| 06-C                     END
|    C*員工別區間DLN02S DLN02E
| 07-C           DLN02S    IFGT DLN02E
|   C                     MOVEL'UPT1011' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 07-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*契約別迄值DLN12E
| 08-C           DLN12E    IFEQ *BLANK
|   C                     MOVE *ALL'9'   DLN12E
| 08-C                     END
|    C*契約別區間DLN12S DLN12E
| 09-C           DLN12S    IFGT DLN12E
|   C                     MOVEL'UPT1011' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 09-C                     END
|    C*
|    C*貸款別迄值DLN03E
| 10-C           DLN03E    IFEQ *BLANK
|   C                     MOVE *ALL'9'   DLN03E
| 10-C                     END
|    C*
|    C*貸款別區間DLN03S DLN03E
| 11-C           DLN03S    IFGT DLN03E
|   C                     MOVEL'UPT1011' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 11-C                     END
|    C   99                GOTO E1B00
|    C*扣款年月
| 12-C           DYM       IFEQ 0
|   C                     Z-ADD*ZERO     WYM
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6699
| 12-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'P38'
|    C                     PARM DYM       P3801I  60
|    C                     PARM DFMT      P3802I  1
|    C                     PARM DTYPE     P3803I  1
|    C                     PARM           P3801O  60
|    C                     PARM           P3811O  1
| 13-C           P3811O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6699
| 13-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'P39'
|    C                     PARM DYM       P3901I  60
|    C                     PARM DFMT      P3902I  1
|    C                     PARM DTYPE     P3903I  1
|    C                     PARM '2'       P3904I  1
|    C                     PARM '1'       P3905I  1
|    C           WYM       PARM           P3911O  60
|    C*
04===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
05===C           R1E00     BEGSR
|    C*
|    C                     SETON                     99
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*部門編號DEM04S
| 01-C           #LIN      IFEQ 6
|   C           #COL      ANDGE42
|   C           #COL      ANDLE48
|   C                     CALL 'PYI512'
|   C           DEM04S    PARM DEM04S    I512I1  7         部門代碼
|   C                     PARM           @RTNC   2          FUN KEY
| 01-C                     END
|    C*部門編號DEM04E
| 02-C           #LIN      IFEQ 6
|   C           #COL      ANDGE52
|   C           #COL      ANDLE58
|   C                     CALL 'PYI512'
|   C           DEM04E    PARM DEM04E    I512I1  7         部門代碼
|   C                     PARM           @RTNC   2          FUN KEY
| 02-C                     END
|    C*
|    C*員工編號DEM02S
| 03-C           #LIN      IFEQ 7
|   C           #COL      ANDGE42
|   C           #COL      ANDLE49
|   C                     CALL 'PYI101'
|   C           DLN01     PARM DLN01     PA01I1  2         公司別
|   C           DLN02S    PARM DLN02S    PA01I2  8         員工　
|   C                     PARM           @RTNC   2          FUN KEY
| 03-C                     END
|    C*員工編號DEM02E
| 04-C           #LIN      IFEQ 7
|   C           #COL      ANDGE58
|   C           #COL      ANDLE65
|   C                     CALL 'PYI101'
|   C           DLN01     PARM DLN01     PA01I1  2         公司別
|   C           DLN02E    PARM DLN02E    PA01I2  8         員工　
|   C                     PARM           @RTNC   2          FUN KEY
| 04-C                     END
|    C*貸款類別DLN03S
| 05-C           #LIN      IFEQ 9
|   C           #COL      ANDEQ42
|   C                     MOVEL*BLANK    DLN03S
|   C                     CALL 'TRW001'
|   C                     PARM 'LN'      P101I1 10        *代碼欄位
|   C           DLN03S    PARM DLN03S    P101I2 10        *代碼內容
|   C                     PARM           P101I3 32        *代碼說明
|   C                     PARM           @RTNC   2          FUN KEY
| 05-C                     END
|    C*貸款類別DLN03E
| 06-C           #LIN      IFEQ 9
|   C           #COL      ANDEQ46
|   C                     MOVEL*BLANK    DLN03E
|   C                     CALL 'TRW001'
|   C                     PARM 'LN'      P101I1 10        *代碼欄位
|   C           DLN03E    PARM DLN03E    P101I2 10        *代碼內容
|   C                     PARM           P101I3 32        *代碼說明
|   C                     PARM           @RTNC   2          FUN KEY
| 06-C                     END
|    C*
|    C*印表機
| 07-C           #LIN      IFEQ 19
|   C           #COL      ANDGE14
|   C           #COL      ANDLE15
|   C                     CALL 'P64I'
|   C           $PRTCD    PARM $PRTCD    P64II1  2
| 07-C                     END
|    C*
05===C                     ENDSR
