     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : PYR6453                                    *
     H*    PROGRAM NAME :團保保險費證明表　　　                    *
     H*    AUTHOR       : A1336 KLAUS                                *
     H*    CREATE DATE  : 92/03/05                                   *
     H*    UPDATE DATE  : 95/03/01 JENNIFER                          *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYR643WFIP  E           K        DISK
     FPYR645P O   E             39     PRINTER
     IWF0
     I                                              WF02  L1
     I           UDS
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      201 2080$A8YMD
     I                                      210 2160PDATE
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DEM01
     I                                      503 509 DEM041
     I                                      510 516 DEM042
     I                                      541 548 DEM021
     I                                      551 558 DEM022
     I                                      601 6020DPEN
     I                                      611 6140DPENK
     I*系統日期
     I            DS
     I                                        1   60SYMD
     I                                        1   20SYY
     I                                        3   40SMM
     I                                        5   60SDD
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN200                     *WRITE PD1
     C*
     CL1 10                EXSR RTN810
     CLR 10                EXSR RTN890
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C*                    CALL 'P82'
|    C*                    PARM DPENK     P8201I  40
|    C*                    PARM '2'       P8202I  1
|    C*                    PARM '1'       P8203I  1
|    C*                    PARM '1'       P8204I  1
|    C*                    PARM '2'       P8205I  1
|    C*                    PARM           P8211O  40
|    C                     Z-ADDDPENK     PYYS             年
|    C                     Z-ADDDPENK     PYYE             年
|    C                     Z-ADD1         PMMS             月
|    C                     Z-ADD12        PMME             月
|    C                     Z-ADD1         PDDS             日
|    C                     Z-ADD31        PDDE             日
|    C                     Z-ADD$A8YMD    SYMD             系統年月日
|    C*
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN200... PROCESS
     C*==============================================================*
02===C           RTN200    BEGSR
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
|   C                     ENDIF
|    C*
02===C           ETN200    ENDSR
     C*==============================================================*
     C*          RTN810... LEVEL BREAK 1
     C*==============================================================*
03===C           RTN810    BEGSR
|    C*
|    C                     WRITEPD1
|    C                     WRITEPT5
|    C                     WRITEPE1
|    C*
|    C                     SETON                       39
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
03===C           RTN890    BEGSR
|    C*
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
04===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
04===C                     ENDSR
     C*==============================================================*
