     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : PYR6423                                    *
     H*    PROGRAM NAME :健保保額調低明細表                        *
     H*    AUTHOR       : A1274 EVA                                  *
     H*    CREATE DATE  : 90/03/26                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :員工保險維護子系統                        *
     H****************************************************************
     FPYR642WFIP  E           K        DISK
     FPYEMPF  IF  E           K        DISK
     FPYR642P O   E             39     PRINTER
     E*---------------------------------------------------------------*
     I           UDS
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DEM01
     I                                      571 578 DEM02S
     I                                      581 588 DEM02E
     I                                      535 5380DYM
     I                                      561 5660WYM
     I                                      567 567 DOPT
     I*
     I           IDS
     I                                        1   50YYMMS
     I                                        1   30YY
     I                                        4   50MM
     I*
     I              '依調整後金額'      C         SORT1
     I              '依講師身份証號'    C         SORT2
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN CM004O    DFMT
     C           *LIKE     DEFN CM005O    DTYPE
     C*==============================================================*
     C*                    KEY
     C*==============================================================*
     C           KEYEM     KLIST                           *TRA131WF
     C                     KFLD           W6401            *公司
     C                     KFLD           EM02             *員工編號
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN200
     C*
     CLR 10                EXSR RTN890
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     IN   *NAMVAR
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C*
|    C                     CALL 'PYSCM0'
|    C                     PARM DEM01     CM001I  2        *公司編號
|    C                     PARM           CM002O 22        *公司名稱
|    C                     PARM           CM003O 32        *代碼說明
|    C           DFMT      PARM           CM004O  1        *日期格式
|    C           DTYPE     PARM           CM005O  1        *日期曆別
|    C                     PARM           CM098O 50        *備用欄
|    C                     PARM           CM099O  1        *存在否？
|    C*
| 01-C           CM099O    IFEQ 'N'
|   C                     MOVEL*BLANK    CM03
| 01*C                     ELSE
|   C                     MOVELCM003O    CM03
| 01-C                     END
|    C*----------------------------------------------------------------
|    C                     Z-ADD0         TT01             人數總計
|    C*----------------------------------------------------------------
|    C*排序方式
| 02-C           DOPT      IFEQ '1'
|   C                     MOVELSORT1     DOPTN     P
| 02-C                     END
|    C*
| 03-C           DOPT      IFEQ '2'
|   C                     MOVELSORT2     DOPTN     P
| 03-C                     END
|    C*-----------------------------------------------------------***
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN200... WRITE DETAIL
     C*==============================================================*
02===C           RTN200    BEGSR
|    C*
|    C*調整後保額＜調整前保額者才列印
| 01-C           W6406     IFGE W6405
|   C                     GOTO END200
| 01-C                     END
|    C*
     C                     MOVELW6402     EM02
|    C           KEYEM     CHAINEM0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    EM03             姓名
| 02-C                     END
|    C*
|    C                     ADD  1         TT01             人數總計
|    C*
| 03-C           *IN39     IFEQ '1'
|   C                     WRITEPH1                        *表頭
|   C                     SETOF                     39
|   C                     SETON                     31
| 03-C                     END
|    C*
|    C                     WRITEPD1                        *明細
|    C*
02===C           END200    ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK LR --- HAS DATA
     C*==============================================================*
03===C           RTN890    BEGSR
|    C*
|    C                     WRITEPT1                        *合計
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
04===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPE9                        *無資料
| 01-C                     END
|    C*
04===C                     ENDSR
     C*==============================================================*
