     H****************************************************************
     H*  泛太資訊科技開發股份有限公司－版權所有    TEL:7313250     *
     H*   PROGRAM-ID   : PYR6022                                     *
     H*   PROGRAM NAME :員工福利金扣繳明細表                       *
     H*   AUTHER       : A1328 JEFFREY                               *
     H*   CREATE DATE  : 90/03/28                                    *
     H*   UPDATE DATE  :                                             *
     H*   SYSTEM       :                                             *
     H****************************************************************
     FPYEMPF  IP  E           K        DISK
     FPT#YPF  IF  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYERPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR602P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    A1         48  2               .代碼
     E                    A2         48 14               .代碼簡稱
     E                    #Y0X        8 14               .PH11代碼簡稱
     E                    PD         48  6 0             .金額
     E                    ER0X        8  6 0             .PD2金額
     E                    TT1        48  8 0             .小計金額
     E                    TT1X        8  8 0             .TT11小計金額
     E                    TT2        48  8 0             .總計金額
     E                    TT2X        8  8 0             .TT21總計金額
     E*---------------------------------------------------------------
     IEM0
     I                                              EM041 L1
     I                                              EM042 L1
     I                                              EM043 L1
     I                                              EM044 L1
     ILDA        UDS
     I                                      211 2160DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DER01
     I                                      511 5130DYEAR
     I                                      601 6040WYEAR
     I*
     I            DS
     I                                        1 112 #Y0X
     I                                        1  14 P#Y031
     I                                       15  28 P#Y032
     I                                       29  42 P#Y033
     I                                       43  56 P#Y034
     I                                       57  70 P#Y035
     I                                       71  84 P#Y036
     I                                       85  98 P#Y037
     I                                       99 112 P#Y038
     I*
     I            DS
     I                                        1  480ER0X
     I                                        1   60PER051
     I                                        7  120PER052
     I                                       13  180PER053
     I                                       19  240PER054
     I                                       25  300PER055
     I                                       31  360PER056
     I                                       37  420PER057
     I                                       43  480PER058
     I*
     I            DS
     I                                        1  640TT1X
     I                                        1   80TT11
     I                                        9  160TT12
     I                                       17  240TT13
     I                                       25  320TT14
     I                                       33  400TT15
     I                                       41  480TT16
     I                                       49  560TT17
     I                                       57  640TT18
     I*
     I            DS
     I                                        1  640TT2X
     I                                        1   80TT21
     I                                        9  160TT22
     I                                       17  240TT23
     I                                       25  320TT24
     I                                       33  400TT25
     I                                       41  480TT26
     I                                       49  560TT27
     I                                       57  640TT28
     I*
     I            DS
     I                                        1   80ER03
     I                                        1   40WER03
     I*
     I              '年度補助金'        C         D1
     I              '補助金發放'        C         D2
     I              '薪資福利金'        C         D3
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*          *LIKE     DEFN SS09      WSS09
     C*          *LIKE     DEFN SS05      WSS05
     C*          *LIKE     DEFN SS18      WSS18
     C*---------------------------------------------------------------
     C           KEYDP     KLIST                           *PYDPPF
     C                     KFLD           EM041            .部門代號1
     C                     KFLD           EM042            .部門代號2
     C                     KFLD           EM043            .部門代號3
     C                     KFLD           EM044            .部門代號4
     C           KEY#Y     KLIST                           *PT#YPF
     C                     KFLD           D#Y01  10        .公司編號
     C*                    KFLD           D#Y02            .員工編號
     C           KEYER     KLIST                           *PYERPF
     C                     KFLD           DER01            .公司編號
     C                     KFLD           DER02   8        .員工編號
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C   L1                EXSR RTN100
     C*
     C                     EXSR RTN300
     C*
     CL1 10NLR             EXSR RTN810
     CLR 10                EXSR R8900
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   *NAMVAR
|    C*
|    C           DER01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C*
|    C                     SETON                     10
|    C                     MOVEL'Y'       $DATA
|    C                     MOVE *BLANKS   A1               .代碼
|    C                     MOVE *BLANKS   A2               .代碼簡稱
|    C                     MOVE *BLANKS   #Y0X             .PH11代碼簡稱
|    C                     Z-ADD0         PD               .金額
|    C                     Z-ADD0         ER0X             .PD2金額
|    C                     Z-ADD0         TT1              .小計金額
|    C                     Z-ADD0         TT1X             .TT11小計金額
|    C                     Z-ADD0         TT2              .總計金額
|    C                     Z-ADD0         TT2X             .TT21總計金額
|    C                     Z-ADD0         TEMP1  100       .員工是否為 0
|    C                     Z-ADD1         TEMP2  100       .部門是否為 0
|    C                     Z-ADD0         TEMP3  100       .總計是否為 0
|    C                     Z-ADD0         TT031  100       .其他所得合計
|    C                     Z-ADD0         TT032  100
|    C                     Z-ADD0         TT03   100
|    C                     Z-ADD0         TT041  100       .機會中獎合計
|    C                     Z-ADD0         TT042  100
|    C                     Z-ADD0         TT043  100
|    C                     Z-ADD0         TT04   100
|    C                     Z-ADD0         WTT04  100
|    C                     Z-ADD0         TT051  100       .部門合計
|    C                     Z-ADD0         TT052  100
|    C                     Z-ADD0         TT061  100       .公司合計
|    C                     Z-ADD0         TT062  100
|    C*收支項目(固定欄位名稱)
|    C                     MOVEL'A2'      A1,1
|    C                     MOVELD2        A2,1
|    C                     Z-ADD1         I       20
|    C** 收支項目(非固定欄位名稱 )
|    C                     MOVEL'GIFT'    D#Y01
|    C           KEY#Y     SETLL#Y0
|    C           KEY#Y     READE#Y0                      46
|    C*
| 01-C           *IN46     DOWEQ'0'
|   C           I         ANDLT48
|   C*
| 02-C           #Y02      IFNE 'A2'
|   C           #Y02      ANDNE'A1'
|   C*代碼說明長度切割
|   C                     CALL 'P65'
|   C                     PARM #Y03      P6501I 80        *代碼說明
|   C                     PARM 13        P6502I  30       .長度
|   C           #Y03      PARM           P6511O 80        .轉換後字串
|   C                     PARM           P6512O 80
|   C*
|   C                     ADD  1         I
|   C                     MOVEL#Y02      A1,I             .代碼
|   C                     MOVEL#Y03      A2,I             .代碼簡稱
| 02-C                     END
|   C*
|   C           KEY#Y     READE#Y0                      46
| 01-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
| 01-C           TEMP2     IFGT 0
|   C*
|   C                     EXSR RTN200
|   C                     Z-ADD0         TEMP2
|   C*
| 01-C                     END
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200... WRITE HEADING
     C*==============================================================*
03===C           RTN200    BEGSR
|     *
|    C                     MOVEL*BLANKS   #Y0X
|    C                     Z-ADD0         J       20
|    C                     Z-ADD0         L       20
| 01-C           L         DOWLT8
|   C                     ADD  1         J
|   C                     ADD  1         L
|   C                     MOVELA2,J      #Y0X,L
| 01-C                     END
|    C                     WRITEPH1
|    C*
| 02-C           J         DOWLTI
|   C                     MOVEL*BLANKS   #Y0X
|   C                     Z-ADD0         L
| 03-C           L         DOWLT8
|   C                     ADD  1         J
|   C                     ADD  1         L
|   C                     MOVELA2,J      #Y0X,L
| 03-C                     END
|   C                     WRITEPH11
| 02-C                     END
|    C                     WRITEPH12
|    C                     WRITEPH13
|    C                     SETOF                     2139
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN300... READ  DETAIL  TO ARRAY
     C*==============================================================*
04===C           RTN300    BEGSR
|    C*
|    C                     SETON                         20
|    C*
|    C                     MOVELEM02      DER02            .員工編號
|    C*
|    C           KEYER     SETLLER0
|    C           KEYER     READEER0                      43
|    C*
| 01-C           *IN43     DOWEQ'0'
|   C                     Z-ADD1         Y       20
|   C           ER06      LOKUPA1,Y                     45.收支項目
| 02-C           *IN45     IFEQ '1'
|   C* ER07 <> DER07 即不顯示
| 03-C           WER03     IFEQ WYEAR                      .福利年度
|   C*
|   C                     ADD  ER05      PD,Y
|   C                     ADD  ER05      TT1,Y
|   C                     ADD  ER05      TT2,Y
|   C                     ADD  ER05      TEMP1            .員工是否為0
|   C                     ADD  ER05      TEMP2            .部門是否為0
|   C                     ADD  ER05      TEMP3            .總計是否為0
|   C*
|   C* 小計欄位
|   C                     ADD  ER05      TT19             .部門合計
|   C                     ADD  ER05      TT29             .公司合計
|   C*
|   C*其他所得合計欄位
| 04-C           ER06      IFNE 'OA'
|   C           ER06      ANDNE'OB'
|   C           ER06      ANDNE'OC'
|   C           ER06      ANDNE'B1'
|   C           ER06      ANDNE'A1'
|   C                     ADD  ER05      TT031
| 04-C                     END
| 05-C           ER06      IFEQ 'B1'
|   C                     ADD  ER05      TT032
| 05-C                     END
|   C*
|   C*機會中獎合計欄位
| 06-C                     SELEC
|   C           ER06      WHEQ 'OA'
|   C                     ADD  ER05      TT041
|   C           ER06      WHEQ 'OB'
|   C                     ADD  ER05      TT042
|   C           ER06      WHEQ 'OC'
|   C                     ADD  ER05      TT043
| 06-C                     END
|   C*
| 03-C                     END
| 02-C                     END
|   C*
|   C           KEYER     READEER0                      43
| 01-C                     END
|    C*
|    C           TT031     SUB  TT032     TT03             .其他所得合計
|    C                     ADD  TT03      TT051            .部門合計
|    C                     ADD  TT03      TT061            .公司合計
|    C*
|    C           TT041     ADD  TT042     WTT04            .機會中獎合計
|    C           WTT04     SUB  TT043     TT04
|    C                     ADD  TT04      TT052            .部門合計
|    C                     ADD  TT04      TT062            .公司合計
|    C*
|    C*個人小計計算
|    C           TT03      ADD  TT04      PER059
|    C*
|    C* 資料為0即不WRITE DETAIL
| 07-C           TEMP1     IFNE 0
|   C                     ADD  1         TT10
|   C                     ADD  1         TT20
|   C                     EXSR RTN400
|   C                     SETON                     21
|   C                     Z-ADD0         PD
|   C                     Z-ADD0         TEMP1
| 07-C                     END
|    C*
04===C           ERT300    ENDSR
     C*==============================================================*
     C*          RTN400... WRITE  TO PRINTFILE
     C*==============================================================*
05===C           RTN400    BEGSR
|     * WRITE PD1
|    C                     Z-ADD0         ER0X
|    C                     Z-ADD0         R       20
|    C                     Z-ADD0         S       20
| 01-C           S         DOWLT8
|   C                     ADD  1         R
|   C                     ADD  1         S
|   C                     MOVELPD,R      ER0X,S
| 01-C                     END
|     * 是否跳頁（顯示標題）
|    C                     EXSR RTN900
| 02-C           *IN21     IFEQ '1'
|   C                     WRITEPE1
| 02-C                     END
|    C*901227S KLAUS
|   C*部門名稱
|   C           KEYDP     CHAINDP0                  40
|   C   40                MOVEL*BLANK    PDP02
|   C  N40                MOVELDP02      PDP02
|    C*901227E KLAUS
|    C                     WRITEPD1
|    C*WRITE PD2
|    C                     Z-ADD0         ER0X
| 03-C           R         DOWLTI
|   C                     Z-ADD0         ER0X
|   C                     Z-ADD0         S
| 04-C           S         DOWLT8
|   C                     ADD  1         R                .PD接續
|   C                     ADD  1         S
|   C                     MOVELPD,R      ER0X,S
| 04-C                     END
|    * 是否跳頁（顯示標題）
|   C                     EXSR RTN900
|   C                     WRITEPD2
| 03-C                     END
|    C*
|    C                     WRITEPD3
|    C                     Z-ADD0         PER059           .員工合計欄
|    C                     Z-ADD0         TT03             .其他所得合計
|    C                     Z-ADD0         TT031
|    C                     Z-ADD0         TT032
|    C                     Z-ADD0         TT04             .機會中獎合計
|    C                     Z-ADD0         TT041
|    C                     Z-ADD0         TT042
|    C                     Z-ADD0         TT043
|    C*
05===C                     ENDSR
     C*========================================================*
     C*          RTN810    L1  ON
     C*========================================================*
06===C           RTN810    BEGSR
|    C*WRITE TT10 部門小計
|    C*部門小計為0 即不顯示
| 01-C           TEMP2     IFNE 0
|   C*
|   C                     WRITEPH13
|   C*
|   C                     Z-ADD0         P       20
|   C                     Z-ADD0         Q       20
| 02-C           Q         DOWLT8
|   C                     ADD  1         P
|   C                     ADD  1         Q
|   C                     Z-ADDTT1,P     TT1X,Q
| 02-C                     END
|   C                     WRITETT01
|   C*
|   C*WRITE TT11 部門小計
| 03-C           P         DOWLTI
|   C                     MOVEL*BLANKS   TT1X
|   C                     Z-ADD0         Q
| 04-C           Q         DOWLT8
|   C                     ADD  1         P
|   C                     ADD  1         Q
|   C                     Z-ADDTT1,P     TT1X,Q
| 04-C                     END
|   C                     WRITETT011
| 03-C                     END
|   C*
|   C                     WRITETT012
|   C  N22                WRITEPE2
|   C*
|   C                     SETON                     39
|   C*
|   C                     Z-ADD0         TT051            .其他所得小計
|   C                     Z-ADD0         TT052
|   C                     Z-ADD0         TT10             .小計ARRAY
|   C                     Z-ADD0         TT1              .小計人數
|   C                     Z-ADD0         TT1X             .T11小計ARRAY
|   C                     Z-ADD0         PD               .金額ARRAY
|   C                     Z-ADD0         TT19             .部門合計
| 01-C                     END
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR --- HAS DATA
     C*==============================================================*
07===C           R8900     BEGSR
|    C* 所有員工資料需不為0
| 01-C           TEMP3     IFNE 0
|   C*
|   C                     SETON                     22
|   C                     EXSR RTN810
|   C                     SETOF                     22
|   C*
|   C                     Z-ADD0         T       20
|   C                     Z-ADD0         S       20
| 02-C           S         DOWLT8
|   C                     ADD  1         T
|   C                     ADD  1         S
|   C                     Z-ADDTT2,T     TT2X,S
| 02-C                     END
|   C                     WRITETT02
|   C*
| 03-C           T         DOWLTI
|   C                     MOVEL*BLANKS   TT2X
|   C                     Z-ADD0         S
| 04-C           S         DOWLT8
|   C                     ADD  1         T
|   C                     ADD  1         S
|   C                     Z-ADDTT2,T     TT2X,S
| 04-C                     END
|   C                     WRITETT021
| 03-C                     END
|   C*
|   C                     WRITETT022
|   C                     WRITEPE2
|   C*
| 01*C                     ELSE
|   C                     MOVEL'2'       $PENV
|   C                     EXSR RTN899
| 01-C                     END
|    C*
07===C           E8900     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
08===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C*                    WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          RTN900....OVERFLOW
     C*==============================================================*
09===C           RTN900    BEGSR
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH13
|   C                     EXSR RTN200
| 01-C                     END
09===C                     ENDSR
