     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYR6193                                    *
     H*    PROGRAM NAME :全民健保投保資料明細表                    *
     H*    AUTHOR       : A1413 CLOUD                                *
     H*    CREATE DATE  : 2006/06/12                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYR619WFIP  E           K        DISK
     FPYR619XFIF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPT#YPF  IF  E           K        DISK
     FPYR619P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    W1      3   3  6
     E*---------------------------------------------------------------
     IWF0
     I                                              WF03  L1
     I                                              WF011 L2
     I                                              WF012 L2
     I                                              WF013 L2
     I                                              WF014 L2
     I           UDS
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DEM01
     I                                      540 546 DEM04S
     I                                      547 553 DEM04E
     I                                      554 561 DEM02S
     I                                      564 571 DEM02E
     I                                      575 575 DOPT0
     I                                      576 576 DOPT1
     I                                      577 577 DSTORY
     I                                      578 578 DSEQ
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN CM14      DFMT
     C           *LIKE     DEFN CM15      DTYPE
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYWF1    KLIST                           *PYR619XF
     C                     KFLD           WF03
     C*
     C           KEY#Y     KLIST                           *PYZYPF
     C                     KFLD           #Y01             代碼欄位
     C                     KFLD           #Y02             代碼編號
     C*
     C*          KEYDP     KLIST                           *PYDPPF
     C*                    KFLD           WF011
     C*                    KFLD           WF012
     C*                    KFLD           WF013
     C*                    KFLD           WF014
     C*
     C*          KEYL3     KLIST                           *PYL3PF
     C*                    KFLD           DEM01
     C*                    KFLD           WF02
     C*                    KFLD           WF04
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100                     *WRITE PD1
     C*
     C   L1                EXSR RTN200
     C*
     CL1                   SETON                     32
     CL2                   SETON                     31
     CLR 10                WRITEPE2
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           DEM01     CHAINCM0                  40
|    C   40                MOVE *BLANK    CM03
|    C                     MOVE CM14      DFMT
|    C                     MOVE CM15      DTYPE
|    C*
|    C                     SETON                     103132
|    C                     SETON                     39
|    C                     MOVEL'Y'       $DATA
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... INITIAL GET HEADING
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
| 01-C*          *INL2     IFEQ '1'
|   C*                    MOVELWF02      WF02             部門簡稱
| 01-C*                    END
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM WF06      P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM DFMT      P3104I  1
|    C*                    PARM DTYPE     P3105I  1
|    C*                    PARM           P3111O  80
|    C                     Z-ADDWF06      WF06C             出生日期
|    C*
| 02-C           *IN39     IFEQ '1'
| 02-C           DOPT0     IFEQ '1'
|   C                     WRITEPH1
| 02-C                     ELSE
|   C                     WRITEPH2
| 02-C                     END
|   C                     SETOF                     39
|   C                     SETON                     3132
| 02-C                     END
|    C*
|   C                     SELEC
|   C           WF07      WHEQ '1'
|   C                     MOVELW1,1      WF07N            異動名稱
|   C           WF07      WHEQ '2'
|   C                     MOVELW1,2      WF07N            異動名稱
|   C           WF07      WHEQ '3'
|   C                     MOVELW1,3      WF07N            異動名稱
| 03-C                     ENDSL
|   C*
|   C*                    CALL 'P31'
|   C*                    PARM WF08      P3101I  80
|   C*                    PARM '2'       P3102I  1
|   C*                    PARM '1'       P3103I  1
|   C*                    PARM DFMT      P3104I  1
|   C*                    PARM DTYPE     P3105I  1
|   C*                    PARM           P3111O  80
|   C                     Z-ADDWF08      WF08C            生效日期
|   C*
|   C                     WRITEPD1
|   C                     SETOF                     3132
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200... INITIAL GET HEADING
     C*==============================================================*
02===C           RTN200    BEGSR
|    C*
|    C           KEYWF1    SETGTWF1                  49
|    C           KEYWF1    REDPEWF1                      47
|    C           *IN47     DOWEQ'0'
|    C*
|    C*                    CALL 'P31'
|    C*                    PARM WF13      P3101I  80
|    C*                    PARM '2'       P3102I  1
|    C*                    PARM '1'       P3103I  1
|    C*                    PARM DFMT      P3104I  1
|    C*                    PARM DTYPE     P3105I  1
|    C*                    PARM           P3111O  80
|    C                     Z-ADDWF13      WF13C             出生日期
|    C*
| 02-C           *IN39     IFEQ '1'
| 02-C           DOPT0     IFEQ '1'
|   C                     WRITEPH1
| 02-C                     ELSE
|   C                     WRITEPH2
| 02-C                     END
|   C                     SETOF                     39
|   C                     SETON                     3132
| 02-C                     END
|    C*
|   C                     SELEC
|   C           WF14      WHEQ '1'
|   C                     MOVELW1,1      WF14N            異動名稱
|   C           WF14      WHEQ '2'
|   C                     MOVELW1,2      WF14N            異動名稱
|   C           WF14      WHEQ '3'
|   C                     MOVELW1,3      WF14N            異動名稱
| 03-C                     ENDSL
|   C*
|   C*                    CALL 'P31'
|   C*                    PARM WF15      P3101I  80
|   C*                    PARM '2'       P3102I  1
|   C*                    PARM '1'       P3103I  1
|   C*                    PARM DFMT      P3104I  1
|   C*                    PARM DTYPE     P3105I  1
|   C*                    PARM           P3111O  80
|   C                     Z-ADDWF15      WF15C            生效日期
|   C*
|    C                     MOVEL*BLANKS   #Y01
|    C                     MOVEL*BLANKS   #Y02
|    C                     MOVEL*BLANKS   WF17N            稱謂中文
|    C                     MOVEL'RELATION'#Y01
|    C                     MOVELWF17      #Y02
|    C           KEY#Y     CHAIN#Y0                  40
| 02*C  N40                MOVEL#Y03      WF17N            稱謂中文
|   C   40                MOVEL*BLANKS   WF17N            稱謂中文
|   C*
|   C                     WRITEPD2
|   C                     SETOF                     3132
|   C*
|    C           KEYWF1    REDPEWF1                      47
02===C                     ENDDO
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
03===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
| 02-C           DOPT0     IFEQ '1'
|   C                     WRITEPH1
| 02-C                     ELSE
|   C                     WRITEPH2
| 02-C                     END
|   C                     WRITEPE9
| 01-C                     END
|    C*
03===C                     ENDSR
     C*==============================================================*
**
投保調整退保
