     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYR6302                                    *
     H*    PROGRAM NAME :勞保投保額人數統計表　                    *
     H*    AUTHOR       : A1413 CLOUD                                *
     H*    CREATE DATE  : 2006/05/08                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FPYEMPF  IP  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYL1PF  IF  E           K        DISK
     FPYL3PF  IF  E           K        DISK
     FPYR630P O   E             39     PRINTER
     E*---------------------------------------------------------------*
     E                    RATE       40  7 0
     E                    NUM        40  5 0
     E                    N           4  5 0
     E*                   X           4  9 0
     E*---------------------------------------------------------------*
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      111 118 $CHYMD
     I                                      119 124 $ADMDY
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I                                      203 2080DDATE
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DEM01
     I                                      521 527 DEM04S
     I                                      531 537 DEM04E
     I                                      541 5440DYM
     I                                      551 5560DYMA
     I            DS
     I                                        1   80L303
     I                                        1   60L303YM
     I            DS
     I                                        1   80WYMD
     I                                        1   60WYM
     I                                        1   40WY
     I                                        5   60WM
     I                                        7   80WD
     I            DS
     I                                        1 280 RATE
     I                                        1   70RATE01
     I                                        8  140RATE02
     I                                       15  210RATE03
     I                                       22  280RATE04
     I                                       29  350RATE05
     I                                       36  420RATE06
     I                                       43  490RATE07
     I                                       50  560RATE08
     I                                       57  630RATE09
     I                                       64  700RATE10
     I                                       71  770RATE11
     I                                       78  840RATE12
     I                                       85  910RATE13
     I                                       92  980RATE14
     I                                       99 1050RATE15
     I                                      106 1120RATE16
     I                                      113 1190RATE17
     I                                      120 1260RATE18
     I                                      127 1330RATE19
     I                                      134 1400RATE20
     I                                      141 1470RATE21
     I                                      148 1540RATE22
     I                                      155 1610RATE23
     I                                      162 1680RATE24
     I                                      169 1750RATE25
     I                                      176 1820RATE26
     I                                      183 1890RATE27
     I                                      190 1960RATE28
     I                                      197 2030RATE29
     I                                      204 2100RATE30
     I                                      211 2170RATE31
     I                                      218 2240RATE32
     I                                      225 2310RATE33
     I                                      232 2380RATE34
     I                                      239 2450RATE35
     I                                      246 2520RATE36
     I                                      253 2590RATE37
     I                                      260 2660RATE38
     I                                      267 2730RATE39
     I                                      274 2800RATE40
     I            DS
     I                                        1 200 NUM
     I                                        1   50NUM01
     I                                        6  100NUM02
     I                                       11  150NUM03
     I                                       16  200NUM04
     I                                       21  250NUM05
     I                                       26  300NUM06
     I                                       31  350NUM07
     I                                       36  400NUM08
     I                                       41  450NUM09
     I                                       46  500NUM10
     I                                       51  550NUM11
     I                                       56  600NUM12
     I                                       61  650NUM13
     I                                       66  700NUM14
     I                                       71  750NUM15
     I                                       76  800NUM16
     I                                       81  850NUM17
     I                                       86  900NUM18
     I                                       91  950NUM19
     I                                       96 1000NUM20
     I                                      101 1050NUM21
     I                                      106 1100NUM22
     I                                      111 1150NUM23
     I                                      116 1200NUM24
     I                                      121 1250NUM25
     I                                      126 1300NUM26
     I                                      131 1350NUM27
     I                                      136 1400NUM28
     I                                      141 1450NUM29
     I                                      146 1500NUM30
     I                                      151 1550NUM31
     I                                      156 1600NUM32
     I                                      161 1650NUM33
     I                                      166 1700NUM34
     I                                      171 1750NUM35
     I                                      176 1800NUM36
     I                                      181 1850NUM37
     I                                      186 1900NUM38
     I                                      191 1950NUM39
     I                                      196 2000NUM40
     I            DS
     I                                        1  20 N
     I                                        1   50N1
     I                                        6  100N2
     I                                       11  150N3
     I                                       16  200N4
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*PYL3PF
     C           KEYL3     KLIST
     C                     KFLD           DEM01            .公司代號
     C                     KFLD           EM02             .員工代號
     C                     KFLD           WYMD             .日期
     C*
     C           KEYL31    KLIST
     C                     KFLD           DEM01            .公司代號
     C                     KFLD           EM02             .員工代號
     C*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R0100
     C                     EXSR R1000                      .DETAIL
     C*                    SETON                     LR
     CLR                   EXSR R900
     C*==============================================================*
     C*          R0100 ... INITIAL PROCESS
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     MOVEL*BLANK    RATE
|    C                     Z-ADD*ZEROS    NUM
|    C                     Z-ADD*ZEROS    N
|    C                     Z-ADDDYMA      WYM
|    C                     Z-ADD31        WD
|    C*
|    C                     Z-ADD*ZEROS    SN1
|    C                     Z-ADD*ZEROS    N2
|    C                     Z-ADD*ZEROS    N3
|    C                     Z-ADD*ZEROS    N4
|    C*
|    C                     IN   LDA
|    C                     SETON                     10
|    C*
|    C           DEM01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C*勞保級距表寫入
|    C                     Z-ADD1         I       20
|    C           *LOVAL    SETLLL10
|    C                     READ L10                      46
| 01-C           *IN46     DOWEQ'0'
|   C                     Z-ADDL102      RATE,I
|   C                     ADD  1         I
|   C                     READ L10                      46
| 01-C                     END
|    C*
|    C*                    WRITEPH1
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ... DETAIL
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C           KEYL3     SETGTL30
|    C           KEYL31    REDPEL30                      45
| 01-C           *IN45     IFEQ '0'
|   C*在處理年月內
| 02-C           L303YM    IFEQ DYMA
|   C*異動類別
| 03-C                     SELEC
|   C*異動類別'投保'
|   C           L307      WHEQ 'A1'
|   C                     ADD  1         N3
|   C                     ADD  1         SN1
|   C*異動類別'調整'
|   C           L307      WHEQ 'A2'
|   C                     ADD  1         N2
|   C                     ADD  1         SN1
|   C*異動類別'退保'
|   C           L307      WHEQ 'A3'
|   C                     ADD  1         N4
|   C                     GOTO NEXT
| 03-C                     ENDSL
|   C*
| 02*C                     ELSE                            範圍外
| 04-C                     SELEC
|   C*異動類別'投保'
|   C           L307      WHEQ 'A1'
|   C                     ADD  1         SN1
|   C*                    ADD  1         TEMP1   30
|   C*異動類別'調整'
|   C           L307      WHEQ 'A2'
|   C                     ADD  1         SN1
|   C*                    ADD  1         TEMP2   30
|   C*異動類別'退保'
|   C           L307      WHEQ 'A3'
|   C                     GOTO NEXT
| 04-C                     ENDSL
|   C*
| 02-C                     ENDIF
|   C*歸入級距
|   C                     EXSR R1100
|   C*
| 01-C                     ENDIF
|    C*
|    C           NEXT      TAG
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          R1100 ... DETAIL
     C*==============================================================*
03===C           R1100     BEGSR
|    C*
|   C*                    SETOF                     80
|    C                     Z-ADD0         I       20
| 01-C           1         DO   40        I
| 02-C           L304      IFEQ RATE,I
|   C                     ADD  1         NUM,I
| 02-C                     ADD  L304      SX1
|   C*                    ADD  1         TEMP3   30
|   C*                    SETON                     80
|   C                     GOTO E1100
| 02-C                     ENDIF
| 01-C                     ENDDO
|   C* N80      EM02      DSPLY
|    C*
03===C           E1100     ENDSR
     C*==============================================================*
     C*          R900  ... WRITE PRINT
     C*==============================================================*
03===C           R900      BEGSR
|    C*
| 01-C                     WRITEPH1
|    C*
03===C           E900      ENDSR
