     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYR7082                                    *
     H*    PROGRAM NAME :年度應稅所得明細表－員工                  *
     H*    AUTHOR       : A1274 EVA                                  *
     H*    CREATE DATE  : 89/12/18                                   *
     H*    UPDATE DATE  : 90/01/16 A1274                             *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYEMPF  IP  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYPBPF  IF  E           K        DISK
     FPYPHPF  IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FPYHDLF01IF  E           K        DISK
     FPYR709P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    A01        12 10 0
     E                    A02        12 10 0
     E                    B01        12 10 0
     E                    B02        12 10 0
     E                    C01        12 10 0
     E                    C02        12 10 0
     E*---------------------------------------------------------------
     IEM0
     I                                              EM041 L2
     I                                              EM042 L2
     I                                              EM043 L2
     I                                              EM044 L2
     I                                              EM02  L1
     I*
     I           UDS
     I                                      125 1270$CPY
     I                                      211 2160DDATE
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I*公司
     I                                      501 502 DEM01
     I*部門
     I                                      611 617 DEM041
     I                                      618 624 DEM042
     I*員工編號
     I                                      513 520 DEM021
     I                                      521 528 DEM022
     I*扣繳年月(YYYY) IN ENGLISH
     I                                      531 5340WYEAR
     I*(YYYY/MM) IN ENGLISH
     I                                      535 5400SYYMM
     I                                      535 5380SYY
     I                                      539 5400SMM
     I                                      541 5460EYYMM
     I                                      541 5440EYY
     I                                      545 5460EMM
     I*扣繳年月(YYY) IN CHINESE
     I                                      600 6020DYEAR
     I            DS
     I                                        1 1200A01
     I                                        1  100PD11
     I                                       11  200PD12
     I                                       21  300PD13
     I                                       31  400PD14
     I                                       41  500PD15
     I                                       51  600PD16
     I                                       61  700PD17
     I                                       71  800PD18
     I                                       81  900PD19
     I                                       91 1000PD1A
     I                                      101 1100PD1B
     I                                      111 1200PD1C
     I            DS
     I                                        1 1200A02
     I                                        1  100PD21
     I                                       11  200PD22
     I                                       21  300PD23
     I                                       31  400PD24
     I                                       41  500PD25
     I                                       51  600PD26
     I                                       61  700PD27
     I                                       71  800PD28
     I                                       81  900PD29
     I                                       91 1000PD2A
     I                                      101 1100PD2B
     I                                      111 1200PD2C
     I            DS
     I                                        1 1200B01
     I                                        1  100PD41
     I                                       11  200PD42
     I                                       21  300PD43
     I                                       31  400PD44
     I                                       41  500PD45
     I                                       51  600PD46
     I                                       61  700PD47
     I                                       71  800PD48
     I                                       81  900PD49
     I                                       91 1000PD4A
     I                                      101 1100PD4B
     I                                      111 1200PD4C
     I            DS
     I                                        1 1200B02
     I                                        1  100PD51
     I                                       11  200PD52
     I                                       21  300PD53
     I                                       31  400PD54
     I                                       41  500PD55
     I                                       51  600PD56
     I                                       61  700PD57
     I                                       71  800PD58
     I                                       81  900PD59
     I                                       91 1000PD5A
     I                                      101 1100PD5B
     I                                      111 1200PD5C
     I            DS
     I                                        1 1200C01
     I                                        1  100PD71
     I                                       11  200PD72
     I                                       21  300PD73
     I                                       31  400PD74
     I                                       41  500PD75
     I                                       51  600PD76
     I                                       61  700PD77
     I                                       71  800PD78
     I                                       81  900PD79
     I                                       91 1000PD7A
     I                                      101 1100PD7B
     I                                      111 1200PD7C
     I            DS
     I                                        1 1200C02
     I                                        1  100PD81
     I                                       11  200PD82
     I                                       21  300PD83
     I                                       31  400PD84
     I                                       41  500PD85
     I                                       51  600PD86
     I                                       61  700PD87
     I                                       71  800PD88
     I                                       81  900PD89
     I                                       91 1000PD8A
     I                                      101 1100PD8B
     I                                      111 1200PD8C
     I            DS
     I                                        1   60PH03
     I                                        5   60PH03M
     I            DS
     I                                        1   60HD03
     I                                        5   60HD03M
     I*
     I/COPY PYDDSSRC,PYPMDS01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*PYDPPF
     C           KEYDP     KLIST
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C*PYPBPF
     C           KEYPB     KLIST
     C                     KFLD           DEM01
     C                     KFLD           EM02
     C                     KFLD           WYEAR
     C*PYPHPF
     C           KEYPH1    KLIST
     C                     KFLD           DEM01
     C                     KFLD           EM02
     C                     KFLD           SYYMM
     C           KEYPH2    KLIST
     C                     KFLD           DEM01
     C                     KFLD           EM02
     C*PYPMPF
     C                     MOVEL'01'      WPM01   2
     C           KEYPM     KLIST
     C                     KFLD           WPM01
     C                     KFLD           DEM01
     C*PYHDLF01
     C                     MOVEL'1'       DHD04   1        期別
     C           KEYHD1    KLIST
     C                     KFLD           DEM01
     C                     KFLD           EM02
     C                     KFLD           DHD04
     C                     KFLD           DHD05
     C                     KFLD           SYYMM
     C           KEYHD2    KLIST
     C                     KFLD           DEM01
     C                     KFLD           EM02
     C                     KFLD           DHD04
     C                     KFLD           DHD05
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*
     C                     EXSR R2000                      .DETAIL
     C*
     CL1 10                EXSR R8100
     CL2 10                EXSR R8200
     C*
     CLR 10                EXSR R8900
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R1000 ... INITIAL
     C*==============================================================*
01===C           R1000     BEGSR
|    C*
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C*
|    C           DEM01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C*
|    C           KEYDP     CHAINDP0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    DP02
| 01-C                     END
|    C*
|    C                     MOVEL*BLANK    DHD05   2
|    C           KEYPM     CHAINPM0                  41
| 02-C           *IN41     IFEQ '0'
|   C                     MOVELPM318     DHD05     P
| 02-C                     END
|    C*
|    C                     Z-ADD*ZERO     A01
|    C                     Z-ADD*ZERO     A02
|    C                     Z-ADD*ZERO     B01
|    C                     Z-ADD*ZERO     B02
|    C                     Z-ADD*ZERO     C01
|    C                     Z-ADD*ZERO     C02
|    C                     Z-ADD*ZERO     PD1E   100
|    C                     Z-ADD*ZERO     PD2E   100
|    C                     Z-ADD*ZERO     PD3E   100
|    C                     Z-ADD*ZERO     PD4E
|    C                     Z-ADD*ZERO     PD5E
|    C                     Z-ADD*ZERO     PD6E
|    C                     Z-ADD*ZERO     PD7E
|    C                     Z-ADD*ZERO     PD8E
|    C                     Z-ADD*ZERO     PD9E
|    C                     Z-ADD*ZERO     PD1D   100
|    C                     Z-ADD*ZERO     PD2D   100
|    C                     Z-ADD*ZERO     PD4D
|    C                     Z-ADD*ZERO     PD5D
|    C                     Z-ADD*ZERO     PD7D
|    C                     Z-ADD*ZERO     PD8D
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
02===C           R2000     BEGSR
|    C*
|    C*部門名稱
|    C           KEYDP     CHAINDP0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    DP02
| 01-C                     END
|    C*
| 02-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 02-C                     END
|    C*------------------------------------------------------------***
|    C*獎金．稅額
|    C           KEYPB     SETLLPB0
|    C           KEYPB     READEPB0                      46
| 03-C           *IN46     DOWEQ'0'
| 04-C           PB96      IFNE *ZERO
|   C*
|   C                     ADD  PB06      PD1D             員工
|   C                     ADD  PB06      PD1E
|   C                     ADD  PB06      PD3E
|   C                     ADD  PB06      PD4D             部門
|   C                     ADD  PB06      PD4E
|   C                     ADD  PB06      PD6E
|   C                     ADD  PB06      PD7D             公司
|   C                     ADD  PB06      PD7E
|   C                     ADD  PB06      PD9E
|   C*
|   C                     ADD  PB08      PD2D             員工
|   C                     ADD  PB08      PD2E
|   C                     SUB  PB08      PD3E
|   C                     ADD  PB08      PD5D             部門
|   C                     ADD  PB08      PD5E
|   C                     SUB  PB08      PD6E
|   C                     ADD  PB08      PD8D             公司
|   C                     ADD  PB08      PD8E
|   C                     SUB  PB08      PD9E
|   C*
| 04-C                     END
|   C           KEYPB     READEPB0                      46
| 03-C                     END
|    C*------------------------------------------------------------***
|    C*年度每月應稅收入
|    C                     Z-ADD*ZERO     WM      20
|    C*
|    C           KEYPH1    SETLLPH0
|    C           KEYPH2    READEPH0                      47
| 05-C           *IN47     DOWEQ'0'
|   C*
| 06-C           PH03      IFGT EYYMM
|   C                     LEAVE
| 06-C                     END
|   C*
| 06-C           PH04      IFNE '1'                        只作下期
|   C                     GOTO NEXT
| 06-C                     END
|   C*
|   C                     Z-ADDPH03M     WM      20
|   C                     ADD  1         WM
|   C*去年12月
| 07-C           WM        IFEQ 13
|   C                     Z-ADD1         WM
| 07-C                     END
|   C*
|   C           PH17      ADD  PH27      WK     100
|   C                     SUB  PH28      WK
|   C                     SUB  PH29      WK
|   C*
|   C                     ADD  WK        A01,WM
|   C                     ADD  WK        B01,WM
|   C                     ADD  WK        C01,WM
|   C*
|   C                     ADD  WK        PD1E
|   C                     ADD  WK        PD4E
|   C                     ADD  WK        PD7E
|   C                     ADD  WK        PD3E
|   C                     ADD  WK        PD6E
|   C                     ADD  WK        PD9E
|   C*
     C           NEXT      TAG
|   C           KEYPH2    READEPH0                      47
| 05-C                     END
|    C*------------------------------------------------------------***
|    C*年度每月扣繳稅額
|    C                     Z-ADD*ZERO     WM      20
|    C*
|    C                     MOVELPM318     DHD05     P
|    C           KEYHD1    SETLLHD0
|    C           KEYHD2    READEHD0                      48
| 08-C           *IN48     DOWEQ'0'
|   C*
| 09-C           HD03      IFGT EYYMM
|   C                     LEAVE
| 09-C                     END
|   C*
|   C                     Z-ADDHD03M     WM      20
|   C                     ADD  1         WM
|   C*去年12月
| 10-C           WM        IFEQ 13
|   C                     Z-ADD1         WM
| 10-C                     END
|   C*
|   C                     Z-ADDHD06      WK
|   C                     ADD  WK        A02,WM
|   C                     ADD  WK        B02,WM
|   C                     ADD  WK        C02,WM
|   C*
|   C                     ADD  WK        PD2E
|   C                     ADD  WK        PD5E
|   C                     ADD  WK        PD8E
|   C                     SUB  WK        PD3E
|   C                     SUB  WK        PD6E
|   C                     SUB  WK        PD9E
|   C*
|   C           KEYHD2    READEHD0                      48
| 08-C                     END
|    C*
|    C*加班所得稅扣繳稅額
|    C                     MOVEL'57'      DHD05     P
|    C           KEYHD1    SETLLHD0
|    C           KEYHD2    READEHD0                      48
| 11-C           *IN48     DOWEQ'0'
|   C*
| 12-C           HD03      IFGT EYYMM
|   C                     LEAVE
| 12-C                     END
|   C*
|   C                     Z-ADDHD03M     WM      20
|   C                     ADD  1         WM
|   C*去年12月
| 13-C           WM        IFEQ 13
|   C                     Z-ADD1         WM
| 13-C                     END
|   C*
|   C                     Z-ADDHD06      WHD06   70
|   C                     ADD  WHD06     A02,WM
|   C                     ADD  WHD06     B02,WM
|   C                     ADD  WHD06     C02,WM
|   C*
|   C                     ADD  WHD06     PD2E
|   C                     ADD  WHD06     PD5E
|   C                     ADD  WHD06     PD8E
|   C                     SUB  WHD06     PD3E
|   C                     SUB  WHD06     PD6E
|   C                     SUB  WHD06     PD9E
|   C*
|   C           KEYHD2    READEHD0                      48
| 11-C                     END
|    C*
|    C*------------------------------------------------------------***
|    C*個人年度收入淨額
|    C           PD1E      SUB  PD2E      PD3E
|    C*
|    C*年度收入為零者不列印
| 14-C           PD1E      IFEQ *ZERO
|   C                     GOTO TAG
| 14-C                     END
|    C*------------------------------------------------------------***
|    C*
|    C*                    WRITEPD1
|    C*
|    C           TAG       TAG
|    C*
     C                     CLEARPD1
|    C                     Z-ADD*ZERO     A01
|    C                     Z-ADD*ZERO     A02
|    C                     Z-ADD*ZERO     PD1D
|    C                     Z-ADD*ZERO     PD2D
|    C                     Z-ADD*ZERO     PD1E
|    C                     Z-ADD*ZERO     PD2E
|    C                     Z-ADD*ZERO     PD3E
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          R8100 ... LEVEL BREAK 1         員工
     C*==============================================================*
03===C           R8100     BEGSR
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
|    C                     SETOF                     31
|    C*
|    C                     Z-ADD*ZERO     A01
|    C                     Z-ADD*ZERO     A02
|    C                     Z-ADD*ZERO     PD1E
|    C                     Z-ADD*ZERO     PD2E
|    C                     Z-ADD*ZERO     PD3E
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          R8200 ... LEVEL BREAK 2
     C*==============================================================*
04===C           R8200     BEGSR
|    C*
|    C*------------------------------------------------------------***
|    C*部門年度收入淨額
|    C           PD4E      SUB  PD5E      PD6E
|    C*------------------------------------------------------------***
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
|    C                     WRITEPT1
|    C*
|    C           KEYDP     CHAINDP0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    DP02
| 01-C                     END
|    C*
|    C                     Z-ADD*ZERO     A01
|    C                     Z-ADD*ZERO     A02
|    C                     Z-ADD*ZERO     B01
|    C                     Z-ADD*ZERO     B02
|    C                     Z-ADD*ZERO     PD1E
|    C                     Z-ADD*ZERO     PD2E
|    C                     Z-ADD*ZERO     PD3E
|    C                     Z-ADD*ZERO     PD4E
|    C                     Z-ADD*ZERO     PD5E
|    C                     Z-ADD*ZERO     PD6E
|    C                     Z-ADD*ZERO     PD1D
|    C                     Z-ADD*ZERO     PD2D
|    C                     Z-ADD*ZERO     PD4D
|    C                     Z-ADD*ZERO     PD5D
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR
     C*==============================================================*
05===C           R8900     BEGSR
|    C*
|    C*------------------------------------------------------------***
|    C*公司年度收入淨額
|    C           PD7E      SUB  PD8E      PD9E
|    C*------------------------------------------------------------***
|    C*
|    C                     WRITEPT2
|    C                     SETON                     39
|    C*
|    C                     Z-ADD*ZERO     A01
|    C                     Z-ADD*ZERO     A02
|    C                     Z-ADD*ZERO     B01
|    C                     Z-ADD*ZERO     B02
|    C                     Z-ADD*ZERO     C01
|    C                     Z-ADD*ZERO     C02
|    C                     Z-ADD*ZERO     PD1E
|    C                     Z-ADD*ZERO     PD2E
|    C                     Z-ADD*ZERO     PD3E
|    C                     Z-ADD*ZERO     PD4E
|    C                     Z-ADD*ZERO     PD5E
|    C                     Z-ADD*ZERO     PD6E
|    C                     Z-ADD*ZERO     PD7E
|    C                     Z-ADD*ZERO     PD8E
|    C                     Z-ADD*ZERO     PD9E
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
06===C           R8999     BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     Z-ADD*ZERO     A01
|   C                     Z-ADD*ZERO     A02
|   C                     Z-ADD*ZERO     B01
|   C                     Z-ADD*ZERO     B02
|   C                     Z-ADD*ZERO     C01
|   C                     Z-ADD*ZERO     C02
|   C                     Z-ADD*ZERO     PD1E
|   C                     Z-ADD*ZERO     PD2E
|   C                     Z-ADD*ZERO     PD3E
|   C                     Z-ADD*ZERO     PD4E
|   C                     Z-ADD*ZERO     PD5E
|   C                     Z-ADD*ZERO     PD6E
|   C                     Z-ADD*ZERO     PD7E
|   C                     Z-ADD*ZERO     PD8E
|   C                     Z-ADD*ZERO     PD9E
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
06===C                     ENDSR
     C*==============================================================*
