     H****************************************************************
     H*   PROGRAM NAME : PYR7012                                     *
     H*   AUTHER       : A1137 JOHNSON                               *
     H*   CREATE DATE  : 81/03/05                                    *
     H*   UPDATE DATE  :                                             *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR3021C                                    *
     H*   PURPOSE      :                                             *
     H*   INDICATORS   :                                             *
     H*                                                              *
     H****************************************************************
     FPYBTJF01IP  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FSYBNPF  IF  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYR701P O   E             39     PRINTER
     E*--------------------------------------------------------------
     E                    A1X     1   5 16
     E*--------------------------------------------------------------
     IBTJF01
     I                                              BT01  L1
     I*                                              EM042 L1
     I*                                              EM043 L1
     I*                                              EM044 L1
     ILDA        UDS
     I*
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DBT01
     I                                      503 505 DBT061
     I                                      522 522 DBT03
     I                                      523 5280DBT04
     I                                      531 5380WBT04
     I                                      527 5280DBT05
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *LIKE     DEFN CM14      DFMT
     C           *LIKE     DEFN CM15      DTYPE
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYBN     KLIST                           *SYBNPF
     C                     KFLD           WBN011  3
     C                     KFLD           WBN012  4
     C           KEYDP     KLIST                           *PYDPPF
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010
    C                     SETON                     10
    C                     MOVEL'Y'       $DATA
  01-C                     END
     C*
     C                     EXSR RTN100
     CL1                   EXSR RTN890
     CLR 10                EXSR RTN110
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010....WRITE HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
| 01-C*          DBT01     IFEQ '01'
|   C*                    MOVE '14140482'XXXX
| 01-C*                    END
|    C*
|    C                     IN   *NAMVAR
|    C*
|    C           DBT01     CHAINCM0                  40    *公司名稱
|    C   40                MOVEL*BLANK    CM03
|    C*
|    C                     MOVE DBT061    WBN011
|    C                     MOVE *BLANK    WBN012
|    C           KEYBN     CHAINBN0                  40    *銀行簡稱
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    PBN041
| 02*C                     ELSE
|   C                     MOVE BN04      PBN041
| 02-C                     END
|    C*
|    C                     MOVE DBT03     I       20
|    C                     MOVELA1X,I     PS01             *類別
|    C*
|    C                     WRITEPH1
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....WRITE       PD2
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C           KEYDP     CHAINDP0                  40    *
|    C   40                MOVE *BLANK    DP02
|    C                     MOVE CM14      DFMT
|    C                     MOVE CM15      DTYPE
|    C*
| 01-C           *INL1     IFEQ '1'
|   C                     SETON                     31
| 01-C                     END
|    C*
|    C                     MOVE BT061     WBN011
|    C                     MOVE BT062     WBN012
|    C           KEYBN     CHAINBN0                  40    *銀行
|    C   40                MOVE *BLANK    BN04
|    C*
|    C                     EXSR RTN900                     *CHECK OVERFLOW
|    C*
|    C*                    CALL 'P39'
|    C*                    PARM BT04      P3901I  60
|    C*                    PARM DFMT      P3902I  1
|    C*                    PARM DTYPE     P3903I  1
|    C*                    PARM '2'       P3904I  1
|    C*                    PARM '1'       P3905I  1
|    C*          BT04W     PARM           P3911O  60
|    C*
|    C                     Z-ADDDBT04     BT04W
|    C*
|    C                     WRITEPD1
|    C                     SETOF                     31
|    C                     ADD  BT08      PT11    90
|    C                     ADD  1         PT12    30
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN110....WRITE    TOTAL OUTPUT (PT1) & FOOTING (PE2)
     C*==============================================================*
03===C           RTN110    BEGSR
|    C*
|    C                     ADD  PT11      PT21
|    C                     ADD  PT12      PT22
|    C*
|    C                     WRITEPT2
|    C                     WRITEPE2
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK L1
     C*==============================================================*
04===C           RTN890    BEGSR
|    C*
|    C                     ADD  PT11      PT21
|    C                     ADD  PT12      PT22
|    C*
|    C*                    WRITEPT1
|    C*
|    C                     Z-ADD*ZERO     PT11
|    C                     Z-ADD*ZERO     PT12
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
05===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPE9
| 01-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RTN900....OVERFLOW
     C*==============================================================*
06===C           RTN900    BEGSR
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
06===C                     ENDSR
     C*==============================================================*
**
  5日薪資
  20日薪資
 外勞
 公司獎金
