     H****************************************************************
     H*   PROGRAM NAME : PYR7052                                     *
     H*   AUTHER       : K781056                                     *
     H*   CREATE DATE  : 82/01/13                                    *
     H*   UPDATE DATE  : 89/02/21 A1274 EVA                          *
     H*   SYSTEM       : S1021908                                    *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR7051C                                    *
     H*   PURPOSE      :                                             *
     H*   INDICATORS   :                                             *
     H****************************************************************
     FPYPBJF01IP  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     F*PYSSPF  IF  E           K        DISK
     FPYR705P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    ARA     5   5 10
     E*---------------------------------------------------------------
     IPBJF01
     I                                              PB04  L2
     I                                              EM041 L1
     I                                              EM042 L1
     I                                              EM043 L1
     I                                              EM044 L1
     I*
     I           UDS
     I                                      187 1920DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DPB01
     I                                      567 5700WPB051
     I                                      517 518 DPB041
     I                                      519 520 DPB042
     I                                      620 626 DEM041
     I                                      627 633 DEM042
     I                                      551 558 DPB021
     I                                      559 566 DPB022
     I                                      601 6030DPB051
     C*---------------------------------------------------------------
     C           KEYDP     KLIST
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C           KEYSS     KLIST
     C                     KFLD           CM13
     C                     KFLD           PB04
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*-----------*
     C*獎金名稱 *
     C*-----------*
     C                     MOVEL*BLANK    DSS02  10
  01-C           *INL2     IFEQ '1'
  01-C           PB04      IFEQ '01'
    C                     MOVEAARA,1     DSS02
  01-C                     END
  01-C           PB04      IFEQ '02'
    C                     MOVEAARA,2     DSS02
  01-C                     END
  01-C           PB04      IFEQ '03'
    C                     MOVEAARA,3     DSS02
  01-C                     END
  01-C           PB04      IFEQ '04'
    C                     MOVEAARA,4     DSS02
  01-C                     END
    C                     MOVELDSS02     SS02
    C**         KEYSS     CHAINSS0                  40
    C** 40                MOVEL*BLANK    SS02
    C                     SETON                     39
  01-C                     END
     C*
     C                     EXSR RTN100
     C*
     CL1 10                EXSR RTN810
     CL2 10                EXSR RTN890
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*-----------*
|    C*公司名稱 *
|    C*-----------*
|    C           DPB01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C*
|    C                     EXSR RTN811
|    C                     EXSR RTN891
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     ADD  1         B
|    C                     ADD  PB06      PT12
|    C                     ADD  PB08      PT13
|    C*                    ADD  PB09      PT14
|    C*                    ADD  PB10      PT15
|    C                     ADD  PB11      PT16
|    C                     ADD  PB12      PT17
|    C*
| 01-C           PB08      IFEQ 0
|   C                     ADD  1         B1
|   C                     ADD  PB06      PT121
|   C                     ADD  PB08      PT131
|   C*                    ADD  PB09      PT141
|   C*                    ADD  PB10      PT151
|   C                     ADD  PB11      PT161
|   C                     ADD  PB12      PT171
| 01*C                     ELSE
|   C                     MOVEL'Y'       A2
|   C                     ADD  1         B2
|   C                     ADD  PB06      PT122
|   C                     ADD  PB08      PT132
|   C*                    ADD  PB09      PT142
|   C*                    ADD  PB10      PT152
|   C                     ADD  PB11      PT162
|   C                     ADD  PB12      PT172
| 01-C                     END
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN810... LEVEL BREAK 1
     C*==============================================================*
03===C           RTN810    BEGSR
|    C*
|    C           KEYDP     CHAINDP0                  40
|    C   40                MOVEL*BLANK    DP02
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
|    C                     WRITEPT1
|   C                     MOVEL'N'       A1
|    C                     WRITEPT2
|    C                     WRITEPT3
|    C*
|    C                     ADD  B         BN
|    C                     ADD  PT12      PT52
|    C                     ADD  PT13      PT53
|    C*                    ADD  PT14      PT54
|    C*                    ADD  PT15      PT55
|    C                     ADD  PT16      PT56
|    C                     ADD  PT17      PT57
|    C*
|    C                     EXSR RTN811
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN811... LEVEL BREAK 1 FIELD CLEAR
     C*==============================================================*
04===C           RTN811    BEGSR
|    C*
|    C                     Z-ADD*ZERO     B
|    C                     Z-ADD*ZERO     PT12
|    C                     Z-ADD*ZERO     PT13
|    C*                    Z-ADD*ZERO     PT14
|    C*                    Z-ADD*ZERO     PT15
|    C                     Z-ADD*ZERO     PT16
|    C                     Z-ADD*ZERO     PT17
|    C*
|    C                     MOVEL*BLANK    A1
|    C                     Z-ADD*ZERO     B1
|    C                     Z-ADD*ZERO     PT121
|    C                     Z-ADD*ZERO     PT131
|    C*                    Z-ADD*ZERO     PT141
|    C*                    Z-ADD*ZERO     PT151
|    C                     Z-ADD*ZERO     PT161
|    C                     Z-ADD*ZERO     PT171
|    C*
|    C                     MOVEL*BLANK    A2
|    C                     Z-ADD*ZERO     B2
|    C                     Z-ADD*ZERO     PT122
|    C                     Z-ADD*ZERO     PT132
|    C*                    Z-ADD*ZERO     PT142
|    C*                    Z-ADD*ZERO     PT152
|    C                     Z-ADD*ZERO     PT162
|    C                     Z-ADD*ZERO     PT172
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK LR
     C*==============================================================*
05===C           RTN890    BEGSR
|    C*
|    C                     WRITEPT5
|    C*
|    C                     EXSR RTN891
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RTN891... LEVEL BREAK LR FIELD CLEAR
     C*==============================================================*
06===C           RTN891    BEGSR
|    C*
|    C                     Z-ADD*ZERO     BN
|    C                     Z-ADD*ZERO     PT52
|    C                     Z-ADD*ZERO     PT53
|    C*                    Z-ADD*ZERO     PT54
|    C*                    Z-ADD*ZERO     PT55
|    C                     Z-ADD*ZERO     PT56
|    C                     Z-ADD*ZERO     PT57
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
07===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
07===C                     ENDSR
**
年終獎金夏季獎金紅利　　其他
