     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYR7132 /CPY FROM  PYR7092
     H*    PROGRAM NAME :年度應稅所得明細表－部門                  *
     H*    AUTHOR       : A1266 HANK                                 *
     H*    CREATE DATE  : 901219                                     *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYPHPF  IP  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYPBLF04IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FPYHDPF  IF  E           K        DISK
     FPYR713P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    B01        12 10 0
     E                    B02        12 10 0
     E                    C01        12 10 0
     E                    C02        12 10 0
     E                    D01        12 10 0
     E                    D02        12 10 0
     E*PH35=工作地點PH34=部門代碼---------------------------------
     IPH0
     I                                              PH35  L2
     I                                              PH341 L1
     I                                              PH342 L1
     I                                              PH343 L1
     I                                              PH344 L1
     I*
     I           UDS
     I                                      125 1270$CPY
     I                                      211 2160DDATE
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I*公司
     I                                      501 502 DEM01
     I*部門
     I                                      503 507 DEM041
     I                                      508 512 DEM042
     I*員工編號
     I                                      513 520 DEM021
     I                                      521 528 DEM022
     I*扣繳年月(YY) IN CHINESE
     I*                                     529 5300DYEAR
     I*扣繳年月(YYYY) IN ENGLISH
     I                                      531 5340WYEAR
     I*(YYYY/MM) IN ENGLISH
     I                                      535 5400SYYMM
     I                                      535 5380SYY
     I                                      539 5400SMM
     I                                      541 5460EYYMM
     I                                      541 5440EYY
     I                                      545 5460EMM
     I*扣繳年月(YY) IN CHINESE
     I                                      600 6020DYEAR
     I*PD1-------------------------------------------------------------
     I            DS
     I                                        1 1200B01
     I                                        1  100PD41
     I                                       11  200PD42
     I                                       21  300PD43
     I                                       31  400PD44
     I                                       41  500PD45
     I                                       51  600PD46
     I                                       61  700PD47
     I                                       71  800PD48
     I                                       81  900PD49
     I                                       91 1000PD4A
     I                                      101 1100PD4B
     I                                      111 1200PD4C
     I            DS
     I                                        1 1200B02
     I                                        1  100PD51
     I                                       11  200PD52
     I                                       21  300PD53
     I                                       31  400PD54
     I                                       41  500PD55
     I                                       51  600PD56
     I                                       61  700PD57
     I                                       71  800PD58
     I                                       81  900PD59
     I                                       91 1000PD5A
     I                                      101 1100PD5B
     I                                      111 1200PD5C
     I*PT1-------------------------------------------------------------
     I            DS
     I                                        1 1200C01
     I                                        1  100PD71
     I                                       11  200PD72
     I                                       21  300PD73
     I                                       31  400PD74
     I                                       41  500PD75
     I                                       51  600PD76
     I                                       61  700PD77
     I                                       71  800PD78
     I                                       81  900PD79
     I                                       91 1000PD7A
     I                                      101 1100PD7B
     I                                      111 1200PD7C
     I            DS
     I                                        1 1200C02
     I                                        1  100PD81
     I                                       11  200PD82
     I                                       21  300PD83
     I                                       31  400PD84
     I                                       41  500PD85
     I                                       51  600PD86
     I                                       61  700PD87
     I                                       71  800PD88
     I                                       81  900PD89
     I                                       91 1000PD8A
     I                                      101 1100PD8B
     I                                      111 1200PD8C
     I*PT0-------------------------------------------------------------
     I            DS
     I                                        1 1200D01
     I                                        1  100DD71
     I                                       11  200DD72
     I                                       21  300DD73
     I                                       31  400DD74
     I                                       41  500DD75
     I                                       51  600DD76
     I                                       61  700DD77
     I                                       71  800DD78
     I                                       81  900DD79
     I                                       91 1000DD7A
     I                                      101 1100DD7B
     I                                      111 1200DD7C
     I            DS
     I                                        1 1200D02
     I                                        1  100DD81
     I                                       11  200DD82
     I                                       21  300DD83
     I                                       31  400DD84
     I                                       41  500DD85
     I                                       51  600DD86
     I                                       61  700DD87
     I                                       71  800DD88
     I                                       81  900DD89
     I                                       91 1000DD8A
     I                                      101 1100DD8B
     I                                      111 1200DD8C
     I*----------------------------------------------------------------
     I            DS
     I                                        1   60PH03
     I                                        5   60PH03M
     I*
     I/COPY PYDDSSRC,PYPMDS01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*PYPMPF
     C           KEYPM     KLIST
     C                     KFLD           WPM01
     C                     KFLD           DEM01            .公司
     C                     MOVEL'01'      WPM01   2
     C*PYDPPF
     C           KEYDP     KLIST
     C                     KFLD           PH341            .部門
     C                     KFLD           PH342
     C                     KFLD           PH343
     C                     KFLD           PH344
     C*PYPBPF
     C           KEYPB     KLIST
     C                     KFLD           DEM01            .公司
     C                     KFLD           WYEAR            .年度
     C                     KFLD           PH35             .工作地點
     C                     KFLD           PH341            .部門
     C                     KFLD           PH342            .部門
     C                     KFLD           PH343            .部門
     C                     KFLD           PH344            .部門
     C*PYHDPF
     C           KEYHD     KLIST
     C                     KFLD           DEM01            .公司
     C                     KFLD           PH02             .員工
     C                     KFLD           PH03             .年月
     C                     KFLD           PH04             .期別
     C                     KFLD           DHD05            .薪資項目
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*
     C                     EXSR R2000                      .DETAIL
     C*
     CL1 10                EXSR R8100                      .部門
     CL2 10                EXSR R8200                      .地點
     CLR 10                EXSR R8900
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R1000 ... INITIAL
     C*==============================================================*
01===C           R1000     BEGSR
|    C*
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C*
|    C           DEM01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C*
|    C           KEYPM     CHAINPM0                  41
| 01-C           *IN41     IFEQ '0'
|   I* . PM318 =所得稅（固定所得稅）
|   C                     MOVELPM318     DHD05     P      .薪資項目
| 01*C                     ELSE
|   C                     MOVEL*BLANK    DHD05   2
| 01-C                     END
|    C*
|    C                     Z-ADD0         B01
|    C                     Z-ADD0         B02
|    C                     Z-ADD0         C01
|    C                     Z-ADD0         C02
|    C                     Z-ADD0         D01
|    C                     Z-ADD0         D02
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
02===C           R2000     BEGSR
|    C*1.0年度每月應稅收入*------------------------------------------
|    C*PH03年月
|    C                     Z-ADDPH03M     WM      20
     C                     ADD  1         WM
     C*去年12月
     C           WM        IFEQ 13
     C                     Z-ADD1         WM
     C                     END
|    C*PH17=應稅加項（薪資）  PH27=應稅加項（獎金)
|    C*PH28=應稅減項（薪資）  PH29=應稅減項（獎金）
|    C           PH17      ADD  PH27      WK01   120
|    C                     SUB  PH28      WK01
|    C                     SUB  PH29      WK01
|    C*
|    C                     ADD  WK01      B01,WM
|    C                     ADD  WK01      C01,WM
|    C                     ADD  WK01      D01,WM
|    C*
|    C                     ADD  WK01      PD4E
|    C                     ADD  WK01      PD7E
|    C                     ADD  WK01      DD7E
|    C*2.0年度每月扣繳稅額*------------------------------------------
|    I* PM318 =所得稅（固定所得稅）
|    C* MOVELPM318>DHD05 .薪資項目
|   C                     MOVELPM318     DHD05     P      .薪資項目
|    C           KEYHD     SETLLHD0
|    C           KEYHD     READEHD0                      48
| 01-C           *IN48     DOWEQ'0'
|   C*HD06=薪資金額
|   C                     Z-ADDHD06      WK02   120
|   C                     ADD  WK02      B02,WM
|   C                     ADD  WK02      C02,WM
|   C                     ADD  WK02      D02,WM
|   C                     ADD  WK02      PD5E
|   C                     ADD  WK02      PD8E
|   C                     ADD  WK02      DD8E
|   C           KEYHD     READEHD0                      48
| 01-C                     END
|    C*加班所得稅扣繳金額
|   C                     MOVEL'57'      DHD05     P      .薪資項目
|    C           KEYHD     SETLLHD0
|    C           KEYHD     READEHD0                      48
| 01-C           *IN48     DOWEQ'0'
|   C*HD06=薪資金額
|   C                     Z-ADDHD06      WK02   120
|   C                     ADD  WK02      B02,WM
|   C                     ADD  WK02      C02,WM
|   C                     ADD  WK02      D02,WM
|   C                     ADD  WK02      PD5E
|   C                     ADD  WK02      PD8E
|   C                     ADD  WK02      DD8E
|   C           KEYHD     READEHD0                      48
| 01-C                     END
     C*
02===C                     ENDSR
     C*==============================================================*
     C*          R8100 ... LEVEL BREAK 1 部門
     C*==============================================================*
03===C           R8100     BEGSR
|    C*1.0獎金．稅額 *-----------------------------------------------
|    C           KEYPB     SETLLPB0
|    C           KEYPB     READEPB0                      46
| 01-C           *IN46     DOWEQ'0'
     C           PB96      IFNE *ZERO
|   C*PB06=獎金／發放金額
|   C                     ADD  PB06      PD4D             部門
|   C                     ADD  PB06      PD4E
|   C                     ADD  PB06      PD7D             公司
|   C                     ADD  PB06      PD7E
|   C                     ADD  PB06      DD7D             公司
|   C                     ADD  PB06      DD7E
|   C*PB08=獎金／扣繳稅額
|   C                     ADD  PB08      PD5D             部門
|   C                     ADD  PB08      PD5E
|   C                     ADD  PB08      PD8D             公司
|   C                     ADD  PB08      PD8E
|   C                     ADD  PB08      DD8D             公司
|   C                     ADD  PB08      DD8E
     C                     END
|   C           KEYPB     READEPB0                      46
| 01-C                     END
|    C*部門名稱*-----------------------------------------------------
|    C           KEYDP     CHAINDP0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    DP02
| 02-C                     END
|    C*部門年度收入淨額
|    C           PD4E      SUB  PD5E      PD6E
|    C*
| 03-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 03-C                     END
|    C*
|    C                     WRITEPD1
|    C                     Z-ADD0         B01
|    C                     Z-ADD0         B02
|    C                     Z-ADD0         PD4D
|    C                     Z-ADD0         PD4E
|    C                     Z-ADD0         PD5D
|    C                     Z-ADD0         PD5E
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          R8200 ... LEVEL BREAK L2 地區
     C*==============================================================*
04===C           R8200     BEGSR
|    C*
|    C           DD7E      SUB  DD8E      DD9E
|    C                     WRITEPT0
|    C                     SETON                     39
|    C                     Z-ADD0         D01
|    C                     Z-ADD0         D02
|    C                     Z-ADD0         DD7D
|    C                     Z-ADD0         DD7E
|    C                     Z-ADD0         DD8D
|    C                     Z-ADD0         DD8E
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR
     C*==============================================================*
05===C           R8900     BEGSR
|    C*
|    C*公司年度收入淨額
|    C           PD7E      SUB  PD8E      PD9E
|    C*
|    C                     WRITEPT1
|    C                     SETON                     39
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
06===C           R8999     BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
06===C                     ENDSR
     C*==============================================================*
