     H****************************************************************
     H*   PROGRAM NAME : PYR7022                                     *
     H*   AUTHER       : A1138 DAVID.                                *
     H*   CREATE DATE  : 81/03/25                                    *
     H*   UPDATE DATE  :                                             *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR7021C                                    *
     H*   PURPOSE      :                                             *
     H*   INDICATORS   :                                             *
     H****************************************************************
     FPYTDPF  IP  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR702P O   E             39     PRINTER
     E*---------------------------------------------------------------
@81C ITD0
@03C I                                              TD11  L1
@25C I*
     I           UDS
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 504 DTD02
     I                                      507 5100WTD01
     I                                      601 6020DTD01
     I*
     I            DS
     I                                        1   4 TD02
     I                                        5  110TD03
     I                                        1  11 TD0203
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*--------------------*
     C* CM03扣繳單位名稱 *
     C*--------------------*
|    C*公司統一由工廠報稅，無論工廠、公司都寫入工廠統編
  01-C           *INL1     IFEQ '1'
    C                     Z-ADD0         SEQNO            行次歸零
    C           TD11      CHAINCM0                  40
    C   40                MOVEL*BLANK    CM03
    C                     MOVELCM03      PCM03H
    C           '01'      CHAINCM0                  40
    C                     MOVELCM04      PCM04H
    C                     SETON                     39
  01-C                     END
     C*
     C                     EXSR RTN100
     C*
     CL1 10                EXSR RTN800
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|    C                     Z-ADDTD01      PTD01H
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     3921
| 01-C                     END
|    C*
|    C                     ADD  1         SEQNO
|    C                     WRITEPD1
|    C                     SETON                     21
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN800... LEVEL BREAK L1, LR AND OVERFLOW
     C*==============================================================*
03===C           RTN800    BEGSR
|    C*
|    C                     WRITEPE1
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
04===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
04===C                     ENDSR
