     H****************************************************************
     H*   PROGRAM NAME : PYR7062                                     *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H****************************************************************
     FPYPCPF  IP  E           K        DISK
     FPYCCPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     F* PYSSPF  IF  E           K        DISK
     FPYR706P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    ARA     5   5 10
     E*---------------------------------------------------------------
     IPC0
     I                                              PC04  L3
     I                                              PC091 L2
     I                                              PC092 L1
     I                                              PC093 L1
     I*
     I           UDS
     I                                      187 1920DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DPB01
     I                                      567 5700WPB03
     I                                      517 518 DPB041
     I                                      519 520 DPB042
     I                                      521 525 DPC091
     I                                      526 530 DPC092
     I                                      551 558 DPB021
     I                                      559 566 DPB022
     I                                      601 6030DPB03
     C*---------------------------------------------------------------
     C           KEYCC     KLIST
     C                     KFLD           PC091
     C                     KFLD           PC092
     C                     KFLD           PC093
     C           KEYSS     KLIST
     C                     KFLD           CM13
     C                     KFLD           PC04
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*-----------*
     C*獎金名稱 *
     C*-----------*
     C                     MOVEL*BLANK    DSS02  10
  01-C           *INL3     IFEQ '1'
  01-C           PC04      IFEQ '01'
    C                     MOVEAARA,1     DSS02
  01-C                     END
  01-C           PC04      IFEQ '02'
    C                     MOVEAARA,2     DSS02
  01-C                     END
  01-C           PC04      IFEQ '03'
    C                     MOVEAARA,3     DSS02
  01-C                     END
  01-C           PC04      IFEQ '04'
    C                     MOVEAARA,4     DSS02
  01-C                     END
    C                     MOVELDSS02     SS02
    C**         KEYSS     CHAINSS0                  40
    C** 40                MOVEL*BLANK    SS02
    C                     SETON                     39
  01-C                     END
     C*
     C                     EXSR RTN100
     C*
     CL1 10                EXSR RTN810
     CL2 10                EXSR RTN840
     CL3 10                EXSR RTN890
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*-----------*
|    C*公司名稱 *
|    C*-----------*
|    C           DPB01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C*
|    C                     EXSR RTN811
|    C                     EXSR RTN841
|    C                     EXSR RTN891
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     ADD  PC06      PT12
|    C                     ADD  PC08      PT13
|    C                     ADD  PC11      PT14    70
|    C                     ADD  PC12      PT15    70
|    C                     ADD  PC13      PT16
|    C                     ADD  PC14      PT17
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN810... LEVEL BREAK 1
     C*==============================================================*
03===C           RTN810    BEGSR
|    C*
|    C           KEYCC     CHAINCC0                  40
|    C   40                MOVEL*BLANK    CC02
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
|    C                     WRITEPT1
|    C*
|    C                     ADD  PT12      PT42
|    C                     ADD  PT13      PT43
|    C                     ADD  PT14      PT44    80
|    C                     ADD  PT15      PT45    80
|    C                     ADD  PT16      PT46
|    C                     ADD  PT17      PT47
|    C*
|    C                     EXSR RTN811
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN811... LEVEL BREAK 1 FIELD CLEAR
     C*==============================================================*
04===C           RTN811    BEGSR
|    C*
|    C                     Z-ADD*ZERO     PT12
|    C                     Z-ADD*ZERO     PT13
|    C                     Z-ADD*ZERO     PT14
|    C                     Z-ADD*ZERO     PT15
|    C                     Z-ADD*ZERO     PT16
|    C                     Z-ADD*ZERO     PT17
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN840... LEVEL BREAK 2
     C*==============================================================*
05===C           RTN840    BEGSR
|    C*
|    C                     WRITEPT4
|    C*
|    C                     ADD  PT42      PT52
|    C                     ADD  PT43      PT53
|    C                     ADD  PT44      PT54    80
|    C                     ADD  PT45      PT55    80
|    C                     ADD  PT46      PT56
|    C                     ADD  PT47      PT57
|    C*
|    C                     EXSR RTN841
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RTN841... LEVEL BREAK 2 FIELD CLEAR
     C*==============================================================*
06===C           RTN841    BEGSR
|    C*
|    C                     Z-ADD*ZERO     PT42
|    C                     Z-ADD*ZERO     PT43
|    C                     Z-ADD*ZERO     PT44
|    C                     Z-ADD*ZERO     PT45
|    C                     Z-ADD*ZERO     PT46
|    C                     Z-ADD*ZERO     PT47
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK LR
     C*==============================================================*
07===C           RTN890    BEGSR
|    C*
|    C                     WRITEPT5
|    C*
|    C                     EXSR RTN891
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          RTN891... LEVEL BREAK LR FIELD CLEAR
     C*==============================================================*
08===C           RTN891    BEGSR
|    C*
|    C                     Z-ADD*ZERO     PT52
|    C                     Z-ADD*ZERO     PT53
|    C                     Z-ADD*ZERO     PT54
|    C                     Z-ADD*ZERO     PT55
|    C                     Z-ADD*ZERO     PT56
|    C                     Z-ADD*ZERO     PT57
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
09===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
09===C                     ENDSR
**
年終獎金夏季獎金紅利　　其他
