     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYR7122                                    *
     H*    PROGRAM NAME :薪資所得銀行不轉存資料表                  *
     H*    AUTHOR       : A1274 EVA                                  *
     H*    CREATE DATE  : 2001/11/07                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYBCPF  IP  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYEMPF  IF  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FPYPYPF  IF  E           K        DISK
     FPYPBLF01IF  E           K        DISK
     FPYPHPF  IF  E           K        DISK
     FPYPMPF  IF  E           K        DISK
     FPYR712P O   E             39     PRINTER
     E*--------------------------------------------------------------
     E                    A1X     1   5 16
     E*--------------------------------------------------------------
     ILDA        UDS
     I*
     I                                      211 2160DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DBC01
     I                                      522 522 DBC03
     I                                      601 6050DBC04
     I                                      531 5360WBC04
     I                                      606 6070DBC05
     I            DS
     I                                        1   7 EM04
     I                                        1   1 EM041
     I                                        2   2 EM042
     I                                        3   3 EM043
     I                                        4   7 EM044
     I            DS
     I                                        1   60WPH03
     I                                        1   40WPH03Y
     I                                        5   60WPH03M
     I/COPY PYDDSSRC,PYPMDS01
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *LIKE     DEFN CM14      DFMT
     C           *LIKE     DEFN CM15      DTYPE
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYEM     KLIST                           *PYEMPF
     C                     KFLD           DBC01
     C                     KFLD           BC02
     C           KEYDP     KLIST                           *PYDPPF
     C                     KFLD           EM041
     C                     KFLD           EM042
     C                     KFLD           EM043
     C                     KFLD           EM044
     C           KEYPY     KLIST                           *PYPYPF
     C                     KFLD           DBC01
     C                     KFLD           BC02
     C           KEYPM     KLIST
     C                     KFLD           PM01
     C                     KFLD           DBC01
     C           KEYPH     KLIST                           *PYPYPF
     C                     KFLD           DBC01
     C                     KFLD           BC02
     C                     KFLD           WPH03
     C                     KFLD           DBC03
     C           KEYPB     KLIST
     C                     KFLD           DBC01
     C                     KFLD           BC02
     C                     KFLD           WBC04
     C                     KFLD           DBC05
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010
    C                     SETON                     10
    C                     MOVEL'Y'       $DATA
  01-C                     END
     C*
     C                     EXSR RTN100
     CLR 10                EXSR RTN110
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010....WRITE HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     IN   *NAMVAR
|    C*
|    C           DBC01     CHAINCM0                  40    *公司名稱
|    C   40                MOVEL*BLANK    CM03
|    C*
|    C                     MOVE DBC03     I       20
|    C                     MOVELA1X,I     PS01             *類別
|    C*
|    C                     WRITEPH1
|    C*-----------------------------------------------------------***
|    C*所得類別為上下期薪資時要找出原始計薪年月的薪資資料
|    C                     MOVEL'01'      PM01
|    C           KEYPM     CHAINPM0                  40
|    C*
|    C                     Z-ADD*ZERO     WPH03   60       計薪年月
|    C                     Z-ADDWBC04     WPH03
|    C*
| 01-C           DBC03     IFEQ '1'                        下期薪
|   C                     SUB  PM203     WPH03M
| 02-C           WPH03M    IFLE *ZERO
|   C                     ADD  12        WPH03M
|   C                     SUB  1         WPH03Y
| 02-C                     END
| 01-C                     END
|    C*-----------------------------------------------------------***
|    C                     Z-ADD*ZERO     PMNY
|    C                     Z-ADD*ZERO     PCOUNT
|    C                     Z-ADD*ZERO     PTOTAL
|    C*-----------------------------------------------------------***
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....WRITE DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*---------------------------------------------------------------
|    C*部門別使用權限控管
|    C                     CALL 'PYSCM1'
|    C                     PARM DBC01     CM101I  2         公司代號
|    C                     PARM EM04      CM102I  7         部門代號
|    C                     PARM           CM103O 14         部門名稱
|    C                     PARM           CM199O  1         存在否？
|    C*存在否？(Y-存在有權利N-存在無權利*BLANK-不存在)
| 01-C           CM199O    IFEQ 'N'
|   C                     GOTO END100
| 01-C                     END
|    C*-------------------------------------------------------------***
|    C                     Z-ADD*ZERO     PMNY
|    C*-------------------------------------------------------------***
|    C*
|    C           KEYEM     CHAINEM0                  40
|    C           KEYDP     CHAINDP0                  40
|    C                     MOVE CM14      DFMT
|    C                     MOVE CM15      DTYPE
|    C*
|    C           KEYPY     CHAINPY0                  40
|    C*
| 02-C           DBC03     IFEQ '1'
|   C           DBC03     OREQ '2'
|   C*
|   C           KEYPH     CHAINPH0                  41
| 03-C           *IN41     IFEQ '0'
|   C                     Z-ADDPH16      PMNY
|   C                     ADD  PH17      PMNY
|   C                     SUB  PH18      PMNY
|   C                     ADD  PH27      PMNY
|   C                     SUB  PH28      PMNY
|   C                     SUB  PH29      PMNY
| 03-C                     END
|   C*
| 02*C                     ELSE
|   C*
|   C           KEYPB     SETLLPB0
|   C           KEYPB     READEPB0                      41
| 04-C           *IN41     DOWEQ'0'
|   C*
| 05-C           PB96      IFNE *ZERO
|   C                     ADD  PB06      PMNY
|   C                     SUB  PB08      PMNY
|   C                     SUB  PB09      PMNY
|   C                     SUB  PB10      PMNY
|   C                     SUB  PB11      PMNY
| 05-C                     END
|   C*
|   C           KEYPB     READEPB0                      41
| 04-C                     END
| 02-C                     END
|    C*
|    C                     EXSR RTN900                     *CHECK OVERFLOW
|    C*
|    C                     WRITEPD1
|    C*
|    C                     ADD  1         PCOUNT
|    C                     ADD  PMNY      PTOTAL
|    C*
02===C           END100    ENDSR
     C*==============================================================*
     C*          RTN110....WRITE    TOTAL OUTPUT (PT1) & FOOTING (PE2)
     C*==============================================================*
03===C           RTN110    BEGSR
|    C*
| 01-C           PTOTAL    IFEQ *ZERO
|   C           PCOUNT    ANDEQ*ZERO
|   C                     GOTO END110
| 01-C                     END
|    C*
|    C                     WRITEPT1
|    C                     WRITEPE2
|    C*
03===C           END110    ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
04===C           RTN899    BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPE9
| 01-C                     END
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN900....OVERFLOW
     C*==============================================================*
05===C           RTN900    BEGSR
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
**
下期薪資所得
上期薪資所得
　　　　
　　　　
公司獎金
