     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYR7102                                    *
     H*    PROGRAM NAME :各類所得扣繳資料表－彙總                  *
     H*    AUTHOR       : A1274 EVA                                  *
     H*    CREATE DATE  : 90/07/26                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYTBPF  IP  E           K        DISK
     FPYDPPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPT#YPF  IF  E           K        DISK
     FPYR710P O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    A01        12 10 0
     E                    A02        12 10 0
     E                    B01        12 10 0
     E                    B02        12 10 0
     E                    C01        12 10 0
     E                    C02        12 10 0
     E*---------------------------------------------------------------
     ITB0
     I                                              TB19  L2
     I                                              TB04  L2
     I                                              TB05  L1
     I*
     I           UDS
     I                                      125 1270$CPY
     I                                      211 2160DDATE
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*公司
     I                                      501 502 DEM01
     I*作帳單位（部門）
     I                                      620 626 DEM041
     I                                      627 633 DEM042
     I*身份證號
     I                                      549 558 DTB051
     I                                      559 568 DTB052
     I*扣繳年月(YY) IN CHINESE
     I*                                     529 5300DYEAR
     I*扣繳年月(YYYY) IN ENGLISH
     I                                      531 5340WYEAR
     I*(YYYY/MM) IN ENGLISH
     I                                      535 5400SYYMM
     I                                      535 5380SYY
     I                                      539 5400SMM
     I                                      541 5460EYYMM
     I                                      541 5440EYY
     I                                      545 5460EMM
     I*扣繳年月(YY) IN CHINESE
     I                                      601 6030DYEAR
     I*所得類別
     I                                      547 548 DTB041
     I                                      569 570 DTB042
     I            DS
     I                                        1 1200A01
     I                                        1  100PD11
     I                                       11  200PD12
     I                                       21  300PD13
     I                                       31  400PD14
     I                                       41  500PD15
     I                                       51  600PD16
     I                                       61  700PD17
     I                                       71  800PD18
     I                                       81  900PD19
     I                                       91 1000PD1A
     I                                      101 1100PD1B
     I                                      111 1200PD1C
     I            DS
     I                                        1 1200A02
     I                                        1  100PD21
     I                                       11  200PD22
     I                                       21  300PD23
     I                                       31  400PD24
     I                                       41  500PD25
     I                                       51  600PD26
     I                                       61  700PD27
     I                                       71  800PD28
     I                                       81  900PD29
     I                                       91 1000PD2A
     I                                      101 1100PD2B
     I                                      111 1200PD2C
     I            DS
     I                                        1 1200B01
     I                                        1  100PD41
     I                                       11  200PD42
     I                                       21  300PD43
     I                                       31  400PD44
     I                                       41  500PD45
     I                                       51  600PD46
     I                                       61  700PD47
     I                                       71  800PD48
     I                                       81  900PD49
     I                                       91 1000PD4A
     I                                      101 1100PD4B
     I                                      111 1200PD4C
     I            DS
     I                                        1 1200B02
     I                                        1  100PD51
     I                                       11  200PD52
     I                                       21  300PD53
     I                                       31  400PD54
     I                                       41  500PD55
     I                                       51  600PD56
     I                                       61  700PD57
     I                                       71  800PD58
     I                                       81  900PD59
     I                                       91 1000PD5A
     I                                      101 1100PD5B
     I                                      111 1200PD5C
     I            DS
     I                                        1 1200C01
     I                                        1  100PD71
     I                                       11  200PD72
     I                                       21  300PD73
     I                                       31  400PD74
     I                                       41  500PD75
     I                                       51  600PD76
     I                                       61  700PD77
     I                                       71  800PD78
     I                                       81  900PD79
     I                                       91 1000PD7A
     I                                      101 1100PD7B
     I                                      111 1200PD7C
     I            DS
     I                                        1 1200C02
     I                                        1  100PD81
     I                                       11  200PD82
     I                                       21  300PD83
     I                                       31  400PD84
     I                                       41  500PD85
     I                                       51  600PD86
     I                                       61  700PD87
     I                                       71  800PD88
     I                                       81  900PD89
     I                                       91 1000PD8A
     I                                      101 1100PD8B
     I                                      111 1200PD8C
     I*作帳單位
     I            DS
     I                                        1   7 TB19
     I                                        1   1 WEM41
     I                                        2   2 WEM42
     I                                        3   3 WEM43
     I                                        4   7 WEM44
     I*所長月份－起
     I            DS
     I                                        1   80TB18
     I                                        1   40TB18Y
     I                                        5   60TB18M
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*PYDPPF
     C           KEYDP     KLIST
     C                     KFLD           WEM41
     C                     KFLD           WEM42
     C                     KFLD           WEM43
     C                     KFLD           WEM44
     C                     MOVEL'TAXTYPE' W#Y01  10
     C                     MOVEL*BLANK    W#Y02  10
     C           KEY#Y     KLIST                           *DETIL FILE
     C                     KFLD           W#Y01
     C                     KFLD           W#Y02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*
     C                     EXSR R2000                      .DETAIL
     C*
     CL1 10                EXSR R8100
     CL2 10                EXSR R8200
     C*
     CLR 10                EXSR R8900
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R1000 ... INITIAL
     C*==============================================================*
01===C           R1000     BEGSR
|    C*
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C*
|    C           DEM01     CHAINCM0                  40
|    C   40                MOVEL*BLANK    CM03
|    C*
|    C           KEYDP     CHAINDP0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    DP02
| 01-C                     END
|    C*
|    C                     Z-ADD*ZERO     A01
|    C                     Z-ADD*ZERO     A02
|    C                     Z-ADD*ZERO     B01
|    C                     Z-ADD*ZERO     B02
|    C                     Z-ADD*ZERO     C01
|    C                     Z-ADD*ZERO     C02
|    C                     Z-ADD*ZERO     PD1E
|    C                     Z-ADD*ZERO     PD2E
|    C*********            Z-ADD*ZERO     PD3E
|    C                     Z-ADD*ZERO     PD4E
|    C                     Z-ADD*ZERO     PD5E
|    C*********            Z-ADD*ZERO     PD6E
|    C                     Z-ADD*ZERO     PD7E
|    C                     Z-ADD*ZERO     PD8E
|    C*********            Z-ADD*ZERO     PD9E
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
02===C           R2000     BEGSR
|    C*
|    C*------------------------------------------------------------***
|    C*部門名稱
|    C           KEYDP     CHAINDP0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    DP02
| 01-C                     END
|    C*------------------------------------------------------------***
|    C*所得類別
|    C                     MOVEL*BLANK    DTB04N
|    C                     MOVEL'TAXTYPE' W#Y01     P
|    C                     MOVELTB04      W#Y02     P
|    C           KEY#Y     CHAIN#Y0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     CALL 'P65'
|   C                     PARM #Y03      P6501I 80
|   C                     PARM 23        P6502I  30
|   C           DTB04N    PARM           P6511O 80
|   C                     PARM           P6512O 80
| 02-C                     END
|    C*------------------------------------------------------------***
|    C*
| 03-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 03-C                     END
|    C*------------------------------------------------------------***
|    C*年度每月應稅收入
|    C                     Z-ADD*ZERO     WM      20
|    C*
|    C                     Z-ADDTB18M     WM      20
|    C*
|    C                     ADD  TB07      A01,WM
|    C                     ADD  TB07      B01,WM
|    C                     ADD  TB07      C01,WM
|    C                     ADD  TB07      PD1E
|    C                     ADD  TB07      PD4E
|    C                     ADD  TB07      PD7E
|    C********             ADD  TB07      PD3E
|    C********             ADD  TB07      PD6E
|    C********             ADD  TB07      PD9E
|    C*------------------------------------------------------------***
|    C*年度每月扣繳稅額
|    C*
|    C                     ADD  TB08      A02,WM
|    C                     ADD  TB08      B02,WM
|    C                     ADD  TB08      C02,WM
|    C*
|    C                     ADD  TB08      PD2E
|    C                     ADD  TB08      PD5E
|    C                     ADD  TB08      PD8E
|    C********             SUB  TB08      PD3E
|    C********             SUB  TB08      PD6E
|    C********             SUB  TB08      PD9E
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          R8100 ... LEVEL BREAK 1         員工
     C*==============================================================*
03===C           R8100     BEGSR
|    C*
|    C*------------------------------------------------------------***
|    C*個人年度收入淨額
|    C*
|    C*年度收入為零者不列印
| 01-C           PD1E      IFEQ *ZERO
|   C                     GOTO TAG
| 01-C                     END
|    C*------------------------------------------------------------***
|    C*
|    C                     WRITEPD1
|    C*
|    C           TAG       TAG
|    C*
|    C                     SETOF                     31
|    C*
|    C                     Z-ADD*ZERO     A01
|    C                     Z-ADD*ZERO     A02
|    C                     Z-ADD*ZERO     PD1E
|    C                     Z-ADD*ZERO     PD2E
|    C*******              Z-ADD*ZERO     PD3E
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          R8200 ... LEVEL BREAK 2
     C*==============================================================*
04===C           R8200     BEGSR
|    C*
|    C*------------------------------------------------------------***
|    C*部門年度收入淨額
|    C*********  PD4E      SUB  PD5E      PD6E
|    C*------------------------------------------------------------***
|    C*
|    C                     WRITEPT1
|    C                     SETON                     39
|    C*
|    C           KEYDP     CHAINDP0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    DP02
| 01-C                     END
|    C*
|    C                     Z-ADD*ZERO     A01
|    C                     Z-ADD*ZERO     A02
|    C                     Z-ADD*ZERO     B01
|    C                     Z-ADD*ZERO     B02
|    C                     Z-ADD*ZERO     PD1E
|    C                     Z-ADD*ZERO     PD2E
|    C*********            Z-ADD*ZERO     PD3E
|    C                     Z-ADD*ZERO     PD4E
|    C                     Z-ADD*ZERO     PD5E
|    C*********            Z-ADD*ZERO     PD6E
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR
     C*==============================================================*
05===C           R8900     BEGSR
|    C*
|    C*------------------------------------------------------------***
|    C*公司年度收入淨額
|    C*********  PD7E      SUB  PD8E      PD9E
|    C*------------------------------------------------------------***
|    C*
|    C                     WRITEPT2
|    C                     SETON                     39
|    C*
|    C                     Z-ADD*ZERO     A01
|    C                     Z-ADD*ZERO     A02
|    C                     Z-ADD*ZERO     B01
|    C                     Z-ADD*ZERO     B02
|    C                     Z-ADD*ZERO     C01
|    C                     Z-ADD*ZERO     C02
|    C                     Z-ADD*ZERO     PD1E
|    C                     Z-ADD*ZERO     PD2E
|    C********             Z-ADD*ZERO     PD3E
|    C                     Z-ADD*ZERO     PD4E
|    C                     Z-ADD*ZERO     PD5E
|    C********             Z-ADD*ZERO     PD6E
|    C                     Z-ADD*ZERO     PD7E
|    C                     Z-ADD*ZERO     PD8E
|    C********             Z-ADD*ZERO     PD9E
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
06===C           R8999     BEGSR
|    C*
| 01-C           $PENV     IFNE '2'
|   C                     MOVEL'N'       $DATA
| 01*C                     ELSE
|   C                     Z-ADD*ZERO     A01
|   C                     Z-ADD*ZERO     A02
|   C                     Z-ADD*ZERO     B01
|   C                     Z-ADD*ZERO     B02
|   C                     Z-ADD*ZERO     C01
|   C                     Z-ADD*ZERO     C02
|   C                     Z-ADD*ZERO     PD1E
|   C                     Z-ADD*ZERO     PD2E
|   C*******              Z-ADD*ZERO     PD3E
|   C                     Z-ADD*ZERO     PD4E
|   C                     Z-ADD*ZERO     PD5E
|   C*******              Z-ADD*ZERO     PD6E
|   C                     Z-ADD*ZERO     PD7E
|   C                     Z-ADD*ZERO     PD8E
|   C*******              Z-ADD*ZERO     PD9E
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
06===C                     ENDSR
     C*==============================================================*
