     H****************************************************************
     H*   PROGRAM NAME : PYR7232                                     *
     H*   AUTHER       : A1137 JOHNSON                               *
     H*   CREATE DATE  : 81/03/25                                    *
     H*   UPDATE DATE  : 90/04/16 A1274 EVA                          *
     H*   SYSTEM       : MIRS                                        *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR3071C                                    *
     H****************************************************************
     FPYTDPF  IP  E           K        DISK
     FPYEMPF  IF  E           K        DISK
     FSYCMPF  IF  E           K        DISK
     FPYR723P O   E             36     PRINTER
     E*--------------------------------------------------------------
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     ILDA        UDS
     I*
     I                                      211 2160DDATE
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      162 1620$EVR
     I*@                                    501 503 DTD02
     I                                      504 5050DTD01
     I                                      531 5340WTD01
     I                                      506 5120DTD031
     I                                      513 5190DTD032
     I                                      521 524 DTD02
     I*
     I            DS
     I                                        1  12 TD09
     I                                        1   1 TD091
     I                                        2   3 TD092
     I                                        4   5 TD093
     I                                        6  12 TD094
     I*
     I            DS
     I                                        1   8 TD17
     I*
     I            DS
     I                                        1   3 CM12
     I*
     I            DS
     I                                        1   4 TD02
     I*
     I            DS
     I                                        1   70TD03
     I*
     I            DS
     I                                        1   2 TD04
     I*
     I            DS
     I                                        1  10 TD05
     I*
     I            DS
     I                                        1  14 TD13
     I*
     I            DS
     I                                        1  10 TD12
     I                                        1  10 TD121
     I*
     I            DS
     I                                        1   60TD15
     I                                        1   40TD151
     I                                        5   60TD152
     I                                        3   40TD1511
     I                                        3   40TD1512
     I                                        5   60TD1521
     I                                        5   60TD1522
     I*
     I            DS
     I                                        1   60TD16
     I                                        1   40TD161
     I                                        5   60TD162
     I                                        3   40TD1611
     I                                        3   40TD1612
     I                                        5   60TD1621
     I                                        5   60TD1622
     I*
     I            DS
     I                                        1   90TD07
     I*
     I            DS
     I                                        1   90TD08
     I*
     I            DS
     I                                        1   90TD07P
   YKI*
   YKI            DS
   YKI                                        1   90TD20P
     I*
     I            DS
     I                                        1   20TD01P
     I*
     I            DS
     I                                        1  62 CM08
     I*
     I            DS
     I                                        1  12 CM10
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C  N10                EXSR RTN010
     C                     EXSR RTN100
     C*
     C*==============================================================*
     C*          RTN010
     C*==============================================================*
01===C           RTN010    BEGSR
|    C           *NAMVAR   DEFN *LDA      LDA
|    C           *NAMVAR   DEFN           PTDA01
|    C                     IN   LDA
|    C                     IN   PTDA01
|    C                     SETON                     10
     C           KEY01     KLIST
     C                     KFLD           TD11
     C                     KFLD           TD12A   8
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....WRITE       PH1
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*公司主檔
|    C*
|    C*          TD11      CHAINCM0                  40    *SYCMPF
|    C           '01'      CHAINCM0                  40    *SYCMPF
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    CM03
|   C                     MOVEL*BLANK    CM08
|   C                     MOVEL*BLANK    CM10
| 01-C                     END
|    C*
|    C*
     C                     MOVELTD12      TD12A
     C           KEY01     CHAINEM0                  40
     C                     MOVELEM02      PEM02
     C           EM041     CAT  EM042     T2      2
     C           T2        CAT  EM043     T3      3
     C           T3        CAT  EM044     PDEPT   7
|    C*
|    C           TD07      SUB  TD08      TD07P
|  YKC                     Z-ADDTD20      TD20P
|    C*
|    C                     CALL 'P65'
|    C                     PARM CM03      P6501I 80
|    C                     PARM 41        P6502I  30
|    C                     PARM           P6511O 80
|    C                     PARM           P6512O 80
|    C*
|    C                     CALL 'P65'
|    C                     PARM TD14      P6501I 80
|    C                     PARM 45        P6502I  30
|    C                     PARM           P6511O 80
|    C                     PARM           P6512O 80
|    C*
|    C                     CALL 'P65'
|    C                     PARM CM08      P6501I
|    C                     PARM 41        P6502I
|    C                     PARM           P6511O
|    C                     PARM           P6512O
|    C*
|    C           TD01      SUB  1911      TD01P
|    C           TD151     SUB  1911      TD151W
|    C           TD161     SUB  1911      TD161W
|    C*
|    C*租賃房屋之稅籍編號
|    C                     MOVEL*BLANK    PTD09
|    C           TD04      IFEQ '51'
|    C                     MOVELTD09      PTD09     P
|    C                     END
|    C*
|    C*所得人代號（或帳號）或外僑護照號碼
|    C           TD04      IFNE '51'
|    C           TD04      ORNE '93'
|    C           TD04      ORNE '9A'
|    C                     SETOF                     31
|    C                     ELSE
|    C                     SETON                     31
|    C                     END
|    C*
|   C                     MOVEL*BLANK    CM03
|   C                     MOVEL*BLANK    CM08
|   C                     MOVEL*BLANK    CM10
|    C                     WRITEPH1
|    C                     OUT  LDA
|    C*
02===C                     ENDSR
