     H****************************************************************
     H*   獂び戈癟м秨祇Τそ⌒舦┮Τ    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : PTSCM2                                     *
     H*    PROGRAM NAME :浪琩琌癸场场Τ舦                *
     H*    AUTHOR       : A1232 EIRC                                 *
     H*    CREATE DATE  : 86/08/05                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     H****************************************************************
     FS#SCPF  IF  E           K        DISK
     E*---------------------------------------------------------------*
     E                    S#01       36  7               场腹
     E*---------------------------------------------------------------*
     I           UDS
     I                                      101 110 $USER
     IS#DA01      DS
     I                                        1  10 ADMIN
     I            DS
     I                                        1 252 S#01
     I                                        1 252 CM202
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           S#DA01
     C*==============================================================*
     C*                    PARM LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           CM201I  4        そ
     C                     PARM           CM201O  1        舦
     C                     PARM           CM202O252        场腹
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYSC     KLIST
     C                     KFLD           $USER            ㄏノ
     C                     KFLD           CM201I           そ
     C                     KFLD           SC03             场
     C           KEYSC1    KLIST
     C                     KFLD           $USER            ㄏノ
     C                     KFLD           CM201I           そ
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     IN   S#DA01
     C*                    MOVEL'N'       CM201O           *礚舦
     C                     MOVEL'Y'       CM201O           *礚舦
     C*恨
  01-C           $USER     IFEQ ADMIN
    C                     MOVEL'Y'       CM201O           *Τ舦
    C                     GOTO ENDPGM
  01-C                     END
     C*场フボ癸そ场场常Τ舦
     C                     MOVEL*BLANK    SC03
     C           KEYSC     CHAINSC0                  40
  02-C           *IN40     IFEQ '0'
    C                     MOVEL'Y'       CM201O           *Τ舦
    C                     GOTO ENDPGM
  02-C                     END
     C           ENDPGM    TAG
     C                     MOVEL*BLANK    S#01
     C                     Z-ADD1         I       20
     C           KEYSC     SETLLSC0
     C           KEYSC1    READESC0                      46
  03-C           *IN46     DOWEQ'0'
    C                     MOVELSC03      S#01,I
    C                     ADD  1         I
    C           KEYSC1    READESC0                      46
  03-C                     END
     C                     MOVELCM202     CM202O
     C*
     C                     SETON                     LR
