     FPYLVPF  UP  E           K        DISK
     C*
     C           *ENTRY    PLIST
     C                     PARM           SDATE   80
  01-C           LV03      IFGE SDATE
    C                     Z-ADD0         LV96
    C                     UPDATLV0
  01-C                     END
