     FPYEMPF  UP  E           K        DISK
     C*
  01-C           EM11      IFEQ 'Y'
    C                     MOVE '*'       EM11
    C                     UPDATEM0
  01-C                     END
