     FPYEMPF  UP  E           K        DISK
     C           EM01      IFEQ 'F1'
     C                     MOVEL'A0'      EM01
     C                     UPDATEM0
     C                     END
     C           EM01      IFEQ 'F3'
     C                     MOVEL'A1'      EM01
     C                     UPDATEM0
     C                     END
