     FPYEMPF  UP  E           K        DISK
     I            DS
     I                                        1   80EM13
     I                                        1   40EM13YY
     I            DS
     I                                        1   80EM14
     I                                        1   40EM14YY
     I            DS
     I                                        1   80EM15
     I                                        1   40EM15YY
     I            DS
     I                                        1   80EM16
     I                                        1   40EM16YY
     I            DS
     I                                        1   80EM17
     I                                        1   40EM17YY
     I            DS
     I                                        1   80EM18
     I                                        1   40EM18YY
     I            DS
     I                                        1   80EM19
     I                                        1   40EM19YY
     I            DS
     I                                        1   80EM20
     I                                        1   40EM20YY
     I            DS
     I                                        1   80EM21
     I                                        1   40EM21YY
     I            DS
     I                                        1   80EM22
     I                                        1   40EM22YY
     C*
  01-C           EM13      IFNE 0
  02-C           EM13YY    IFEQ 88
    C           EM13YY    OREQ 99
    C                     Z-ADD1999      EM13YY
  02-C                     END
  03-C           EM13YY    IFEQ 87
    C           EM13YY    OREQ 98
    C                     Z-ADD1998      EM13YY
  03-C                     END
  04-C           EM13YY    IFEQ 86
    C           EM13YY    OREQ 97
    C                     Z-ADD1997      EM13YY
  04-C                     END
  05-C           EM13YY    IFEQ 85
    C           EM13YY    OREQ 96
    C                     Z-ADD1996      EM13YY
  05-C                     END
  06-C           EM13YY    IFEQ 84
    C           EM13YY    OREQ 95
    C                     Z-ADD1995      EM13YY
  06-C                     END
    C                     SETON                     30
  01-C                     END
     C*
  07-C           EM14      IFNE 0
  08-C           EM14YY    IFEQ 88
    C           EM14YY    OREQ 99
    C                     Z-ADD1999      EM14YY
  08-C                     END
  09-C           EM14YY    IFEQ 87
    C           EM14YY    OREQ 98
    C                     Z-ADD1998      EM14YY
  09-C                     END
  10-C           EM14YY    IFEQ 86
    C           EM14YY    OREQ 97
    C                     Z-ADD1997      EM14YY
  10-C                     END
  11-C           EM14YY    IFEQ 85
    C           EM14YY    OREQ 96
    C                     Z-ADD1996      EM14YY
  11-C                     END
  12-C           EM14YY    IFEQ 84
    C           EM14YY    OREQ 95
    C                     Z-ADD1995      EM14YY
  12-C                     END
    C                     SETON                     30
  07-C                     END
     C*
  13-C           EM15      IFNE 0
  14-C           EM15YY    IFEQ 88
    C           EM15YY    OREQ 99
    C                     Z-ADD1999      EM15YY
  14-C                     END
  15-C           EM15YY    IFEQ 87
    C           EM15YY    OREQ 98
    C                     Z-ADD1998      EM15YY
  15-C                     END
  16-C           EM15YY    IFEQ 86
    C           EM15YY    OREQ 97
    C                     Z-ADD1997      EM15YY
  16-C                     END
  17-C           EM15YY    IFEQ 85
    C           EM15YY    OREQ 96
    C                     Z-ADD1996      EM15YY
  17-C                     END
  18-C           EM15YY    IFEQ 84
    C           EM15YY    OREQ 95
    C                     Z-ADD1995      EM15YY
  18-C                     END
    C                     SETON                     30
  13-C                     END
     C*
  19-C           EM16      IFNE 0
  20-C           EM16YY    IFEQ 88
    C           EM16YY    OREQ 99
    C                     Z-ADD1999      EM16YY
  20-C                     END
  21-C           EM16YY    IFEQ 87
    C           EM16YY    OREQ 98
    C                     Z-ADD1998      EM16YY
  21-C                     END
  22-C           EM16YY    IFEQ 86
    C           EM16YY    OREQ 97
    C                     Z-ADD1997      EM16YY
  22-C                     END
  23-C           EM16YY    IFEQ 85
    C           EM16YY    OREQ 96
    C                     Z-ADD1996      EM16YY
  23-C                     END
  24-C           EM16YY    IFEQ 84
    C           EM16YY    OREQ 95
    C                     Z-ADD1995      EM16YY
  24-C                     END
    C                     SETON                     30
  19-C                     END
     C*留職停薪日
  25-C           EM17      IFNE 0
  26-C           EM17YY    IFEQ 88
    C           EM17YY    OREQ 99
    C                     Z-ADD1999      EM17YY
  26-C                     END
  27-C           EM17YY    IFEQ 87
    C           EM17YY    OREQ 98
    C                     Z-ADD1998      EM17YY
  27-C                     END
  28-C           EM17YY    IFEQ 86
    C           EM17YY    OREQ 97
    C                     Z-ADD1997      EM17YY
  28-C                     END
  29-C           EM17YY    IFEQ 85
    C           EM17YY    OREQ 96
    C                     Z-ADD1996      EM17YY
  29-C                     END
  30-C           EM17YY    IFEQ 84
    C           EM17YY    OREQ 95
    C                     Z-ADD1995      EM17YY
  30-C                     END
    C                     SETON                     30
  25-C                     END
     C*
  31-C           EM18      IFNE 0
  32-C           EM18YY    IFEQ 88
    C           EM18YY    OREQ 99
    C                     Z-ADD1999      EM18YY
  32-C                     END
  33-C           EM18YY    IFEQ 87
    C           EM18YY    OREQ 98
    C                     Z-ADD1998      EM18YY
  33-C                     END
  34-C           EM18YY    IFEQ 86
    C           EM18YY    OREQ 97
    C                     Z-ADD1997      EM18YY
  34-C                     END
  35-C           EM18YY    IFEQ 85
    C           EM18YY    OREQ 96
    C                     Z-ADD1996      EM18YY
  35-C                     END
  36-C           EM18YY    IFEQ 84
    C           EM18YY    OREQ 95
    C                     Z-ADD1995      EM18YY
  36-C                     END
    C                     SETON                     30
  31-C                     END
     C*
  37-C           EM19      IFNE 0
  38-C           EM19YY    IFEQ 88
    C           EM19YY    OREQ 99
    C                     Z-ADD1999      EM19YY
  38-C                     END
  39-C           EM19YY    IFEQ 87
    C           EM19YY    OREQ 98
    C                     Z-ADD1998      EM19YY
  39-C                     END
  40-C           EM19YY    IFEQ 86
    C           EM19YY    OREQ 97
    C                     Z-ADD1997      EM19YY
  40-C                     END
  41-C           EM19YY    IFEQ 85
    C           EM19YY    OREQ 96
    C                     Z-ADD1996      EM19YY
  41-C                     END
  42-C           EM19YY    IFEQ 84
    C           EM19YY    OREQ 95
    C                     Z-ADD1995      EM19YY
  42-C                     END
    C                     SETON                     30
  37-C                     END
     C*
  43-C           EM20      IFNE 0
  44-C           EM20YY    IFEQ 88
    C           EM20YY    OREQ 99
    C                     Z-ADD1999      EM20YY
  44-C                     END
  45-C           EM20YY    IFEQ 87
    C           EM20YY    OREQ 98
    C                     Z-ADD1998      EM20YY
  45-C                     END
  46-C           EM20YY    IFEQ 86
    C           EM20YY    OREQ 97
    C                     Z-ADD1997      EM20YY
  46-C                     END
  47-C           EM20YY    IFEQ 85
    C           EM20YY    OREQ 96
    C                     Z-ADD1996      EM20YY
  47-C                     END
  48-C           EM20YY    IFEQ 84
    C           EM20YY    OREQ 95
    C                     Z-ADD1995      EM20YY
  48-C                     END
    C                     SETON                     30
  43-C                     END
     C*最近調薪日
  49-C           EM21      IFNE 0
  50-C           EM21YY    IFEQ 88
    C           EM21YY    OREQ 99
    C                     Z-ADD1999      EM21YY
  50-C                     END
  51-C           EM21YY    IFEQ 87
    C           EM21YY    OREQ 98
    C                     Z-ADD1998      EM21YY
  51-C                     END
  52-C           EM21YY    IFEQ 86
    C           EM21YY    OREQ 97
    C                     Z-ADD1997      EM21YY
  52-C                     END
  53-C           EM21YY    IFEQ 85
    C           EM21YY    OREQ 96
    C                     Z-ADD1996      EM21YY
  53-C                     END
  54-C           EM21YY    IFEQ 84
    C           EM21YY    OREQ 95
    C                     Z-ADD1995      EM21YY
  54-C                     END
    C                     SETON                     30
  49-C                     END
     C*
  55-C           EM22      IFNE 0
  56-C           EM22YY    IFEQ 88
    C           EM22YY    OREQ 99
    C                     Z-ADD1999      EM22YY
  56-C                     END
  57-C           EM22YY    IFEQ 87
    C           EM22YY    OREQ 98
    C                     Z-ADD1998      EM22YY
  57-C                     END
  58-C           EM22YY    IFEQ 86
    C           EM22YY    OREQ 97
    C                     Z-ADD1997      EM22YY
  58-C                     END
  59-C           EM22YY    IFEQ 85
    C           EM22YY    OREQ 96
    C                     Z-ADD1996      EM22YY
  59-C                     END
  60-C           EM22YY    IFEQ 84
    C           EM22YY    OREQ 95
    C                     Z-ADD1995      EM22YY
  60-C                     END
    C                     SETON                     30
  55-C                     END
     C   30                UPDATEM0
     C                     SETOF                     30
