     H        1   Y
     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYZ101                                     *
     H*    PROGRAM NAME :西祺，康寧-薪資主檔轉檔               *
     H*    AUTHOR       : A1490 TERESA                               *
     H*    CREATE DATE  : 96/04/04                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYZ1PF  IP  E           K        DISK
     FPYPYPF  UF  E           K        DISK
     FPYPDPF  O   E           K        DISK
     F*---------------------------------------------------------------*
     I*
     I           UDS
     I                                      101 110 $USER
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*KEY FOR PYPYPF
     C           KEYPY     KLIST
     C                     KFLD           PY01
     C                     KFLD           PY02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     CLEARPY0
     C                     CLEARPD0
     C*
     C           Z109      IFEQ 20070305
     C           Z101      IFNE 'KN'
     C                     MOVELZ101      PY01             公司編號
     C                     ELSE
     C                     MOVEL'CN'      PY01
     C                     ENDIF
     C                     MOVELZ105      PY02             員工編號
     C           KEYPY     CHAINPY0                  40
     C  N40                Z-ADDZ112      PY03             本薪
     C*
     C  N40                UPDATPY0
     C*
     C                     MOVELPY01      PD01             公司編號
     C                     MOVELZ105      PD02             員工編號
     C           Z113      IFNE 0                          餐費津貼
     C                     MOVEL'01'      PD03
     C                     Z-ADDZ113      PD04
     C                     WRITEPD0
     C                     ENDIF
     C           Z114      IFNE 0                          化妝津貼
     C                     MOVEL'02'      PD03
     C                     Z-ADDZ114      PD04
     C                     WRITEPD0
     C                     ENDIF
     C           Z115      IFNE 0                          職務津貼
     C                     MOVEL'03'      PD03
     C                     Z-ADDZ115      PD04
     C                     WRITEPD0
     C                     ENDIF
     C           Z117      IFNE 0                          組長津貼
     C                     MOVEL'04'      PD03
     C                     Z-ADDZ117      PD04
     C                     WRITEPD0
     C                     ENDIF
     C           Z118      IFNE 0                          特別津貼
     C                     MOVEL'05'      PD03
     C                     Z-ADDZ118      PD04
     C                     WRITEPD0
     C                     ENDIF
     C           Z119      IFNE 0                          助理組長
     C                     MOVEL'13'      PD03
     C                     Z-ADDZ119      PD04
     C                     WRITEPD0
     C                     ENDIF
     C           Z120      IFNE 0                          業績津貼
     C                     MOVEL'14'      PD03
     C                     Z-ADDZ120      PD04
     C                     WRITEPD0
     C                     ENDIF
     C           Z121      IFNE 0                          年終津貼
     C                     MOVEL'16'      PD03
     C                     Z-ADDZ121      PD04
     C                     WRITEPD0
     C                     ENDIF
     C           Z122      IFNE 0                          全勤津貼
     C                     MOVEL'19'      PD03
     C                     Z-ADDZ122      PD04
     C                     WRITEPD0
     C                     ENDIF
     C*
     C                     ENDIF
     C*
