     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYZ201                                     *
     H*    PROGRAM NAME :西祺，康寧-銀行帳號轉檔               *
     H*    AUTHOR       : A1413 CLOUD                                *
     H*    CREATE DATE  : 96/04/04                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYZ2PF  IP  E           K        DISK
     FPYPYPF  UF  E           K        DISK                      A
     F*PYA202D CF  E                    WORKSTN      KINFDS DSPFDS
     F*---------------------------------------------------------------*
     I*/COPY PYDDSSRC,PYPMDS01
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      173 174 $COR
     I                                      201 2080$A8YMD
     I*           DS
     I*                                       1   7 LV13
     I*                                       1   1 LV131
     I*                                       2   2 LV132
     I*                                       3   3 LV133
     I*                                       4   7 LV134
     I*
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*          *LIKE     DEFN CM004O    DFMT
     C*          *LIKE     DEFN CM005O    DTYPE
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*          KEYEM     KLIST                           *PYEMPF
     C*                    KFLD           DLV01
     C*                    KFLD           DLV02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R0100                      *INITIAL
|    C*
|    C                     MOVELZ201      PY01             公司編號
|    C                     MOVELZ202      PY02             員工編號
|    C                     Z-ADD0         PY03             底薪
|    C                     MOVEL'006'     PY04             總行
|    C                     MOVELZ204      PY05             分行
|    C                     MOVELZ205      PY06             存入帳號
     C*
     C                     WRITEPY0
     C*
     C*                    SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     SETON                     10
|    C*
|    C                     READ PY0                      46
|    C           *IN46     DOWEQ'0'
|    C                     DELETPY0
|    C                     READ PY0                      46
|    C                     ENDDO
|    C*
|    C                     Z-ADD$A8YMD    PY97
|    C                     TIME           PY98
|    C                     MOVEL$USER     PY99
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C*
02===C           E1000     ENDSR
