     H        1   Y
     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYZ301                                     *
     H*    PROGRAM NAME :西祺，康寧-人事主檔轉檔               *
     H*    AUTHOR       : A1490 TERESA                               *
     H*    CREATE DATE  : 96/04/04                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYZ3PF  IP  E           K        DISK
     FPYEMPF  O   E           K        DISK
     F*---------------------------------------------------------------*
     I*
     I           UDS
     I                                      101 110 $USER
     I*
     IZ311        DS
     I                                        1   1 Z3111
     I                                        2   2 Z3112
     I                                        3   3 Z3113
     I                                        4   6 Z3114
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     CLEAREM0
     C*
     C                     MOVELZ301      EM01             公司編號
     C                     MOVELZ302      EM02             員工編號
     C                     MOVELZ304      EM03             員工姓名
     C                     MOVELZ305      EM031            英文姓名
     C                     MOVELZ3111     EM041            部門編號
     C                     MOVELZ3112     EM042
     C                     MOVELZ3113     EM043
     C                     MOVELZ3114     EM044
     C           Z310      IFEQ '離職'
     C                     MOVEL'Y'       EM11             離職碼
     C                     ENDIF
     C                     Z-ADDZ313      EM13             到職日
     C                     Z-ADDZ315      EM14             勞保投保
     C                     Z-ADDZ316      EM16             勞保退保
     C                     Z-ADDZ314      EM19             離職日
     C                     MOVELZ325      EM30             血型
     C                     MOVELZ306      EM31             身分證
     C           Z308      IFEQ '男'
     C                     MOVEL'M'       EM32             性別
     C                     ELSE
     C                     MOVEL'F'       EM32
     C                     ENDIF
     C*          Z303      IFEQ '本國'
     C                     MOVEL'L'       EM321            國籍
     C*                    ELSE
     C*                    MOVEL'F'       EM321
     C*                    ENDIF
     C                     Z-ADDZ307      EM33             出生日
     C           Z309      IFEQ '已婚'
     C                     MOVEL'M'       EM34             婚姻
     C                     ELSE
     C                     MOVEL'S'       EM34
     C                     ENDIF
     C                     Z-ADDZ318      EM35             撫養
     C                     MOVELZ327      EM38             通訊地址
     C                     MOVELZ331      EM39             戶籍地址
     C                     MOVELZ328      EM40             通訊電話1
     C                     MOVELZ329      EM401            通訊電話2
     C                     MOVELZ332      EM41             戶籍電話
     C           Z319      IFEQ '固定扣'
     C                     MOVEL'4'       EM101            所得扣繳
     C                     ELSE
     C                     MOVEL'1'       EM101
     C                     ENDIF
     C                     Z-ADDZ320      EM102            扣繳金額
     C                     MOVEL'1'       EM110            同仁分類
     C                     Z-ADD*DATE     EM97             更新日
     C                     TIME           EM98             更新時
     C                     MOVEL$USER     EM99             更新人
     C*
     C                     WRITEEM0
     C*
