     H        1   Y
     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYZ401                                     *
     H*    PROGRAM NAME :西祺，康寧-健保轉檔                   *
     H*    AUTHOR       : A1413 CLOUD                                *
     H*    CREATE DATE  : 96/06/01                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYE2PF  UF  E           K        DISK
     FPYE5PF  UF  E           K        DISK
     FPYE1PF  IF  E           K        DISK
     F*---------------------------------------------------------------*
     I*
     I           UDS
     I                                      101 110 $USER
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*KEY FOR PYE5LF01
     C           KEYE1     KLIST
     C                     KFLD           E101
     C                     KFLD           E102
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*CLEAR E5
     C*          *LOVAL    SETLLPYE5PF
     C*                    READ PYE5PF                   46
     C*          *IN46     DOWEQ*OFF
     C*                    DELETPYE5PF
     C*                    READ PYE5PF                   46
     C*                    ENDDO
     C*CLEAR E5
     C*
     C           *LOVAL    SETLLPYE2PF
     C                     READ PYE2PF                   46
     C           *IN46     DOWEQ*OFF
     C*
     C                     MOVELE201      E101
     C                     MOVELE202      E102
     C           KEYE1     CHAINE10                  40
     C  N40                Z-ADDE103      E203
     C*
     C                     Z-ADD*DATE     E297
     C                     TIME           E298
     C                     MOVEL$USER     E299
     C                     UPDATE20
     C*
     C                     READ PYE2PF                   46
     C                     ENDDO
     C*
     C*
     C           *LOVAL    SETLLPYE5PF
     C                     READ PYE5PF                   46
     C           *IN46     DOWEQ*OFF
     C*
     C                     MOVELE501      E101
     C                     MOVELE502      E102
     C           KEYE1     CHAINE10                  40
     C  N40                Z-ADDE103      E512
     C*
     C                     Z-ADD*DATE     E597
     C                     TIME           E598
     C                     MOVEL$USER     E599
     C                     UPDATE50
     C*
     C                     READ PYE5PF                   46
     C                     ENDDO
     C*
     C                     SETON                     LR
01===C*
