     H        1   Y
     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYZ405                                     *
     H*    PROGRAM NAME :西祺，康寧-獎金轉檔部份               *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 96/05/14                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYEMPF  IP  E           K        DISK
     FPYPDPF  UF  E           K        DISK                      A
     F*---------------------------------------------------------------*
     E                    @A01        6  2
     F*---------------------------------------------------------------*
     I*
     I           UDS
     I                                      101 110 $USER
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYPD     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C                     KFLD           PD03
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C  N10                EXSR R1F00
     C*
  01-C           EM11      IFEQ *BLANK
    C*
     C                     Z-ADD1         II
  02-C           II        DO   3
    C                     MOVEL@A01,II   PD03
    C*
     C                     MOVELEM01      PD01
     C                     MOVELEM02      PD02
    C                     Z-ADD0         PD04
    C           KEYPD     CHAINPD0                  40
    C   40                WRITEPD0
    C*
    C                     ADD  1         II
  02-C                     ENDDO
    C*
  01-C                     END
     C*
     C*==============================================================*
     C*          R1F00 ....搬值給@A01
     C*==============================================================*
01===C           R1F00     BEGSR
|    C*
|    C                     Z-ADD1         II      10
|    C                     SETON                     10
|    C*
|    C                     MOVEL'14'      @A01,1           業績獎金
|    C                     MOVEL'15'      @A01,2           三節獎金
|    C                     MOVEL'16'      @A01,3           年終獎金
|    C*
01===C                     ENDSR
     C*
