     H        1   Y
     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYZ401                                     *
     H*    PROGRAM NAME :西祺，康寧-健保轉檔                   *
     H*    AUTHOR       : A1490 TERESA                               *
     H*    CREATE DATE  : 96/04/09                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYE2PF  IF  E           K        DISK
     FPYE5PF  UF  E           K        DISK                      A
     F*---------------------------------------------------------------*
     I*
     I           UDS
     I                                      101 110 $USER
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*KEY FOR PYE5LF01
     C*          KEYE5     KLIST
     C*                    KFLD           E501
     C*                    KFLD           E502
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*CLEAR E5
     C           *LOVAL    SETLLPYE5PF
     C                     READ PYE5PF                   46
     C           *IN46     DOWEQ*OFF
     C                     DELETPYE5PF
     C                     READ PYE5PF                   46
     C                     ENDDO
     C*CLEAR E5
     C*
     C           *LOVAL    SETLLPYE2PF
     C                     READ PYE2PF                   46
     C           *IN46     DOWEQ*OFF
     C                     CLEARE50
     C*
     C                     MOVELE201      E501
     C                     MOVELE202      E502
     C                     Z-ADDE203      E503
     C                     ADD  E204      E504
     C                     MOVELE206      E506
     C                     MOVELE207      E507
     C                     Z-ADDE208      E508
     C                     MOVELE209      E509
     C                     MOVELE210      E510
     C                     MOVELE211      E511
     C                     MOVELE212      E512
     C                     Z-ADD*DATE     E597
     C                     TIME           E598
     C                     MOVEL$USER     E599
     C                     WRITEE50
     C*
     C                     READ PYE2PF                   46
     C                     ENDDO
     C*
     C                     SETON                     LR
01===C*
