     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYZ801                                     *
     H*    PROGRAM NAME :新增欄位轉檔                              *
     H*    AUTHOR       : A1490 TERESA                               *
     H*    CREATE DATE  : 96/04/20                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     H        1   Y
     FPYL3PF  IF  E           K        DISK
     FPYEMPF  UF  E           K        DISK
     F*---------------------------------------------------------------*
     I           UDS
     I                                      101 110 $USER
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*
     C           KEYEM     KLIST
     C                     KFLD           L301
     C                     KFLD           L302
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*CLEAR ZB
     C*          *LOVAL    SETLLPYZBPF
     C*                    READ PYZBPF                   46
     C*          *IN46     DOWEQ*OFF
     C*                    DELETPYZBPF
     C*                    READ PYZBPF                   46
     C*                    ENDDO
     C*CLEAR ZB
     C*PYEMPF TO PYZ8PF
     C           *LOVAL    SETLLPYL3PF
     C                     READ PYL3PF                   46
     C           *IN46     DOWEQ'0'
     C*
     C                     MOVELL301      EM01             公司編號
     C                     MOVELL302      EM02             員工編號
     C*
     C           KEYEM     CHAINEM0                  40
     C   40                GOTO NEXT1
     C*
     C                     Z-ADDL303      EM14             勞保投保日
     C                     Z-ADDL304      EM23             勞保投保額
     C*
     C                     UPDATEM0
     C*
     C           NEXT1     TAG
     C*
     C                     READ PYL3PF                   46
     C                     ENDDO
     C*
     C                     SETON                     LR
