     H        1   Y
     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYZ501                                     *
     H*    PROGRAM NAME :西祺，康寧-勞保、勞退主檔轉檔         *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 96/04/12                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYZ3PF  IP  E           K        DISK
     FPYL3PF  O   E           K        DISK
     FPYH4PF  O   E           K        DISK
     F*---------------------------------------------------------------*
     I*
     I           UDS
     I                                      101 110 $USER
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C                     CLEARL30
     C                     CLEARH40
     C*
     C           Z314      IFEQ 0
     C*
     C                     MOVELZ301      L301
     C                     MOVELZ302      L302
     C                     Z-ADDZ315      L303
     C                     Z-ADD15840     L304
     C                     MOVEL'A1'      L307
     C*
     C                     Z-ADD*DATE     L397
     C                     TIME           L398
     C                     MOVEL$USER     L399
     C*
     C                     WRITEL30
     C*
     C                     MOVELZ301      H401
     C                     MOVELZ302      H402
     C                     MOVELZ306      H403
     C                     MOVEL'Y'       H404
     C                     MOVEL'1'       H405
     C           Z313      IFGE 20050701
     C                     Z-ADDZ313      H406
     C                     ELSE
     C                     Z-ADD20050701  H406
     C                     ENDIF
     C                     Z-ADD6         H407
     C                     Z-ADD6         H408
     C                     Z-ADD15840     H409
     C                     Z-ADDH406      H414
     C*
     C                     Z-ADD*DATE     L397
     C                     TIME           L398
     C                     MOVEL$USER     L399
     C*
     C                     WRITEH40
     C*
     C                     END
     C*
     C*
     C*          *INZSR    BEGSR
     C*                    Z-ADD0         CNT     10
     C*                    Z-ADD0         CNT2    10
     C*                    MOVEL'996007'  T402    6
     C*                    ENDSR
