     H        1   Y
     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYZ601                                     *
     H*    PROGRAM NAME :新增欄位轉檔                              *
     H*    AUTHOR       : A1490 TERESA                               *
     H*    CREATE DATE  : 96/04/20                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYE8PF  IF  E           K        DISK
     FPYL3PF  IF  E           K        DISK
     FPYH4PF  IF  E           K        DISK
     FPYZ5PF  UF  E                    DISK                      A
     FPYZ6PF  UF  E                    DISK                      A
     FPYZ7PF  UF  E                    DISK                      A
     FPYEMPF  IF  E           K        DISK
     F*---------------------------------------------------------------*
     I*
     I           UDS
     I                                      101 110 $USER
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*KEY FOR PYE8PF TO CHAIN PYEMPF
     C           KEYEM1    KLIST
     C                     KFLD           E801
     C                     KFLD           E802
     C*KEY FOR PYL3PF TO CHAIN PYEMPF
     C           KEYEM2    KLIST
     C                     KFLD           L301
     C                     KFLD           L302
     C*KEY FOR PYH4PF TO CHAIN PYEMPF
     C           KEYEM3    KLIST
     C                     KFLD           H401
     C                     KFLD           H402
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*CLEAR Z5 , Z6 , Z7
     C                     READ PYZ5PF                   46
     C           *IN46     DOWEQ*OFF
     C                     DELETPYZ5PF
     C                     READ PYZ5PF                   46
     C                     ENDDO
     C                     READ PYZ6PF                   46
     C           *IN46     DOWEQ*OFF
     C                     DELETPYZ6PF
     C                     READ PYZ6PF                   46
     C                     ENDDO
     C                     READ PYZ7PF                   46
     C           *IN46     DOWEQ*OFF
     C                     DELETPYZ7PF
     C                     READ PYZ7PF                   46
     C                     ENDDO
     C*CLEAR Z5 , Z6 , Z7
     C*PYE8PF TO PYZ5PF
     C           *LOVAL    SETLLPYE8PF
     C                     READ PYE8PF                   46
     C           *IN46     DOWEQ*OFF
     C*
     C                     CLEARZ50
     C                     MOVELE801      Z501
     C                     MOVELE802      Z502
     C           KEYEM1    CHAINPYEMPF               40
     C  N40                MOVELEM03      Z5021
     C                     Z-ADDE803      Z503
     C                     MOVELE804      Z504
     C                     Z-ADDE805      Z505
     C                     Z-ADDE806      Z506
     C                     MOVELE807      Z507
     C                     MOVELE808      Z508
     C                     WRITEZ50
     C*
     C                     READ PYE8PF                   46
     C                     ENDDO
     C*
     C*PYL3PF TO PYZ6PF
     C           *LOVAL    SETLLPYL3PF
     C                     READ PYL3PF                   46
     C           *IN46     DOWEQ*OFF
     C*
     C                     CLEARZ60
     C                     MOVELL301      Z601
     C                     MOVELL302      Z602
     C           KEYEM2    CHAINPYEMPF               40
     C  N40                MOVELEM03      Z6021
     C                     Z-ADDL303      Z603
     C                     Z-ADDL304      Z604
     C                     MOVELL305      Z605
     C                     MOVELL306      Z606
     C                     MOVELL307      Z607
     C                     Z-ADDL308      Z608
     C                     MOVELL309      Z609
     C                     WRITEZ60
     C*
     C                     READ PYL3PF                   46
     C                     ENDDO
     C*
     C*PYH4PF TO PYZ7PF
     C           *LOVAL    SETLLPYH4PF
     C                     READ PYH4PF                   46
     C           *IN46     DOWEQ*OFF
     C*
     C                     CLEARZ70
     C                     MOVELH401      Z701
     C                     MOVELH402      Z702
     C           KEYEM3    CHAINPYEMPF               40
     C  N40                MOVELEM03      Z7021
     C                     MOVELH403      Z703
     C                     MOVELH404      Z704
     C                     MOVELH405      Z705
     C                     Z-ADDH406      Z706
     C                     Z-ADDH407      Z707
     C                     Z-ADDH408      Z708
     C                     Z-ADDH409      Z709
     C                     Z-ADDH410      Z710
     C                     Z-ADDH411      Z711
     C                     Z-ADDH412      Z712
     C                     Z-ADDH413      Z713
     C                     Z-ADDH414      Z714
     C                     Z-ADDH420      Z720
     C                     Z-ADDH421      Z721
     C                     Z-ADDH422      Z722
     C                     Z-ADDH423      Z723
     C                     Z-ADDH424      Z724
     C                     MOVELH425      Z725
     C                     MOVELH430      Z730
     C                     MOVELH431      Z731
     C                     Z-ADDH432      Z732
     C                     Z-ADDH433      Z733
     C                     Z-ADDH434      Z734
     C                     Z-ADDH435      Z735
     C                     Z-ADDH436      Z736
     C                     Z-ADDH437      Z737
     C                     Z-ADDH438      Z738
     C                     WRITEZ70
     C*
     C                     READ PYH4PF                   46
     C                     ENDDO
     C*
     C                     SETON                     LR
     C*
