     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYZ801                                     *
     H*    PROGRAM NAME :新增欄位轉檔                              *
     H*    AUTHOR       : A1490 TERESA                               *
     H*    CREATE DATE  : 96/04/20                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     H        1   Y
     FPYWDPF  IF  E           K        DISK
     FPYEMPF  IF  E           K        DISK
     FPYSSPF  IF  E           K        DISK
     FPYZBPF  UF  E           K        DISK                      A
     F*---------------------------------------------------------------*
     I           UDS
     I                                      101 110 $USER
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*
     C           KEYEM     KLIST
     C                     KFLD           ZB01
     C                     KFLD           ZB02
     C*
     C           KEYSS     KLIST
     C                     KFLD           SS18
     C                     KFLD           SS01
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*CLEAR ZB
     C           *LOVAL    SETLLPYZBPF
     C                     READ PYZBPF                   46
     C           *IN46     DOWEQ*OFF
     C                     DELETPYZBPF
     C                     READ PYZBPF                   46
     C                     ENDDO
     C*CLEAR ZB
     C*PYEMPF TO PYZ8PF
     C           *LOVAL    SETLLPYWDPF
     C                     READ PYWDPF                   46
     C           *IN46     DOWEQ'0'
     C                     CLEARZB0
     C*
     C                     MOVELWD01      ZB01             公司編號
     C                     MOVELWD02      ZB02             員工編號
     C*
     C           KEYEM     CHAINEM0                  40
     C   40                GOTO NEXT1
     C*
     C                     MOVELEM03      ZB021            員工姓名
     C*
     C                     MOVEL'SC'      SS18
     C                     MOVELWD05      SS01             項目
     C                     MOVELWD05      ZB05             項目
     C                     MOVEL*BLANK    ZB051            項目名稱
     C           KEYSS     CHAINSS0                  40
     C           *IN40     IFEQ '0'
     C                     MOVELSS02      ZB051            項目名稱
     C                     ENDIF
     C                     Z-ADDWD06      ZB06             金額
     C                     Z-ADDWD03      ZB03             年月
     C                     MOVELWD04      ZB04             期別
     C                     WRITEZB0
     C*
     C           NEXT1     TAG
     C*
     C                     READ PYWDPF                   46
     C                     ENDDO
     C*
     C                     SETON                     LR
