     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYZ801                                     *
     H*    PROGRAM NAME :新增欄位轉檔                              *
     H*    AUTHOR       : A1490 TERESA                               *
     H*    CREATE DATE  : 96/04/20                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     H        1   Y
     FPYPYPF  UF  E           K        DISK
     F*---------------------------------------------------------------*
     I           UDS
     I                                      101 110 $USER
     I            DS
     I                                        1  14 PY06
     I                                        1   4 PY61
     I                                        5  14 PY62
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*PYEMPF TO PYZ8PF
     C           *LOVAL    SETLLPYPYPF
     C                     READ PYPYPF                   46
     C           *IN46     DOWEQ'0'
     C*
     C           PY05      IFEQ *BLANK
     C*
     C                     MOVELPY61      PY05             分行
     C                     MOVELPY62      TEMP    9        帳號
     C                     MOVEL*BLANK    PY06             帳號
     C                     MOVELTEMP      PY06             帳號
     C*
     C                     ENDIF
     C*
     C                     UPDATPY0
     C*
     C                     READ PYPYPF                   46
     C                     ENDDO
     C*
     C                     SETON                     LR
