     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYZ801                                     *
     H*    PROGRAM NAME :新增欄位轉檔                              *
     H*    AUTHOR       : A1490 TERESA                               *
     H*    CREATE DATE  : 96/04/20                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     H        1   Y
     FPYZ8PF  UF  E           K        DISK                      A
     FPYEMPF  IF  E           K        DISK
     FPYSSPF  IF  E           K        DISK
     FPYPYPF  IF  E           K        DISK
     FPYPDPF  IF  E           K        DISK
     F*---------------------------------------------------------------*
     I           UDS
     I                                      101 110 $USER
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*KEY FOR PYPYPF TO CHAIN PYEMPF
     C           KEYEM     KLIST
     C                     KFLD           EM01
     C                     KFLD           EM02
     C*KEY FOR PYL3PF TO CHAIN PYEMPF
     C           KEYSS     KLIST
     C                     KFLD           SS18
     C                     KFLD           SS01
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*CLEAR Z8
     C           *LOVAL    SETLLPYZ8PF
     C                     READ PYZ8PF                   46
     C           *IN46     DOWEQ*OFF
     C                     DELETPYZ8PF
     C                     READ PYZ8PF                   46
     C                     ENDDO
     C*CLEAR Z8
     C*PYEMPF TO PYZ8PF
     C           *LOVAL    SETLLPYEMPF
     C                     READ PYEMPF                   46
     C           *IN46     DOWEQ'0'
     C                     CLEARZ80
     C*
     C           EM11      IFEQ 'Y'
     C                     READ PYEMPF                   46
     C                     ITER
     C                     ENDIF
     C*
     C                     MOVELEM01      Z801             公司編號
     C                     MOVELEM02      Z802             員工編號
     C                     MOVELEM03      Z8021            員工姓名
     C           KEYEM     CHAINPY0                  40
     C           *IN40     IFEQ '0'
     C                     MOVEL'00'      Z803             項目
     C                     MOVEL'本薪'  Z8031            項目名稱
     C                     Z-ADDPY03      Z804             金額
     C                     WRITEZ80
     C                     ENDIF
     C*
     C           KEYEM     SETLLPYPDPF
     C           KEYEM     READEPYPDPF                   44
     C           *IN44     DOWEQ'0'
     C                     MOVELPD03      Z803             項目
     C                     MOVEL'SC'      SS18
     C                     MOVELPD03      SS01             項目
     C                     MOVEL*BLANK    Z8031            項目名稱
     C           KEYSS     CHAINSS0                  40
     C           *IN40     IFEQ '0'
     C                     MOVELSS02      Z8031            項目名稱
     C                     ENDIF
     C                     Z-ADDPD04      Z804             金額
     C                     WRITEZ80
     C           KEYEM     READEPYPDPF                   44
     C                     ENDDO
     C*
     C                     READ PYEMPF                   46
     C                     ENDDO
     C*
     C                     SETON                     LR
