     H        1   Y
     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYZ904                                     *
     H*    PROGRAM NAME :西祺，康寧-庫存主檔轉檔               *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 97/02/04                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                          *
     H****************************************************************
     FIMIAPF  IF  E           K        DISK
     FMTMHPF  UF  E           K        DISK
     FMTMQPF  UF  E           K        DISK                      A
     FMTMRWF  IF  E           K        DISK
     F*---------------------------------------------------------------*
     I*
     I           UDS
     I                                      101 110 $USER
     I            DS
     I                                        1   9 MA01
     I                                        1   1 Q
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C           *LOVAL    SETLLIA0
     C                     READ IA0                      46
  01-C           *IN46     DOWEQ'0'
     *
  02-C           IA01      IFNE 'R'
    C*
    C           IA03      CHAINMA0                  40
  03-C           *IN40     IFEQ '0'
    C                     ADD  IA06      MA30
    C           IA03      CHAINWF0                  41
    C                     Z-ADDWF03      MA31
    C                     Z-ADDWF03      MA34
    C  N40                UPDATMA0
     *
     *
  03*C                     ELSE
    C           IA03      CHAINMQ0                  42
     C                     MOVELIA03      MQ01
    C   42                WRITEMQ0
    C  N42                UPDATMQ0
  03-C                     ENDIF
    C*
    C*
  02-C                     ENDIF
    C*
    C                     READ IA0                      46
  01-C                     ENDDO
     C*
     C           *LOVAL    SETLLMA0
     C                     READ MA0                      46
  01-C           *IN46     DOWEQ'0'
  02-C           Q         IFNE 'S'
     C           MA31      MULT MA30      MA26      H
    C                     UPDATMA0
  02-C                     ENDIF
    C                     READ MA0                      46
  01-C                     ENDDO
     C*
     C                     SETON                     LR
     C*
