     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYZ801                                     *
     H*    PROGRAM NAME :新增欄位轉檔                              *
     H*    AUTHOR       : A1490 TERESA                               *
     H*    CREATE DATE  : 96/04/20                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FIMIAPF  IF  E           K        DISK
     FI4      IF  F      17  9AI     6 DISK                           UC
     FS2      IF  F      17  9AI     6 DISK                           UC
     FA1O     IF  F      17  9AI     6 DISK                           UC
     FA1I     IF  F      17  9AI     6 DISK                           UC
     FM1O     IF  F      17  9AI     6 DISK                           UC
     FM1I     IF  F      17  9AI     6 DISK                           UC
     FPYQQPF  UF  E           K        DISK                      A
     F*---------------------------------------------------------------*
     II4      AA
     I                                        1   5 I301
     I                                        6  14 I302
     I                                    P  15  170I303
      *
     IS2      AA
     I                                        1   5 S201
     I                                        6  14 S202
     I                                    P  15  170S203
      *
     IA1O     AA
     I                                        1   5 A101
     I                                        6  14 A102
     I                                    P  15  170A103
      *
     IA1I     AA
     I                                        1   5 A1X1
     I                                        6  14 A1X2
     I                                    P  15  170A1X3
      *
     IM1O     AA
     I                                        1   5 M101
     I                                        6  14 M102
     I                                    P  15  170M103
      *
     IM1I     AA
     I                                        1   5 M1X1
     I                                        6  14 M1X2
     I                                    P  15  170M1X3
      *
     I           UDS
     I                                      101 110 $USER
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*
     C           KEYIA     KLIST
     C                     KFLD           IA02
     C                     KFLD           IA03
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C                     Z-ADD0         I303
     C                     Z-ADD0         S203
     C                     Z-ADD0         A103
     C                     Z-ADD0         A1X3
     C                     Z-ADD0         M103
     C                     Z-ADD0         M1X3
     C*
     C           *LOVAL    SETLLQQ0
     C                     READ QQ0                      46
  01-C           *IN46     DOWEQ'0'
    C                     DELETQQ0
    C                     READ QQ0                      46
  01-C                     ENDDO
     C*PYEMPF TO PYZ8PF
     C           *LOVAL    SETLLIMIAPF
     C                     READ IMIAPF                   46
     C           *IN46     DOWEQ'0'
     C                     CLEARQQ0
     C*採購
     C                     OPEN I4
     C                     READ I4                       45
     C           *IN45     DOWEQ'0'
     C           IA03      IFEQ I302
     C           KEYIA     CHAINQQ0                  40
     C           *IN40     IFEQ '0'
     C           IA06      SUB  I303      QQ03
     C                     UPDATQQ0
     C                     ELSE
     C                     MOVELIA02      QQ01
     C                     MOVELIA03      QQ02
     C                     Z-ADDIA06      QQ03
     C                     WRITEQQ0
     C                     ENDIF
     C                     ENDIF
     C                     READ I4                       45
     C                     ENDDO
     C                     CLOSEI4
     C*銷售
     C                     OPEN S2
     C                     READ S2                       45
     C           *IN45     DOWEQ'0'
     C           IA03      IFEQ S202
     C           KEYIA     CHAINQQ0                  40
     C           *IN40     IFEQ '0'
     C           IA06      ADD  S203      QQ03
     C                     UPDATQQ0
     C                     ELSE
     C                     MOVELIA02      QQ01
     C                     MOVELIA03      QQ02
     C                     Z-ADDIA06      QQ03
     C                     WRITEQQ0
     C                     ENDIF
     C                     ENDIF
     C                     READ S2                       45
     C                     ENDDO
     C                     CLOSES2
     C*調出
     C                     OPEN A1O
     C                     READ A1O                      45
     C           *IN45     DOWEQ'0'
     C           IA03      IFEQ A102
     C           KEYIA     CHAINQQ0                  40
     C           *IN40     IFEQ '0'
     C           IA06      ADD  A103      QQ03
     C                     UPDATQQ0
     C                     ELSE
     C                     MOVELIA02      QQ01
     C                     MOVELIA03      QQ02
     C                     Z-ADDIA06      QQ03
     C                     WRITEQQ0
     C                     ENDIF
     C                     ENDIF
     C                     READ A1O                      45
     C                     ENDDO
     C                     CLOSEA1O
     C*調入
     C                     OPEN A1I
     C                     READ A1I                      45
     C           *IN45     DOWEQ'0'
     C           IA03      IFEQ A1X2
     C           KEYIA     CHAINQQ0                  40
     C           *IN40     IFEQ '0'
     C           IA06      SUB  A1X3      QQ03
     C                     UPDATQQ0
     C                     ELSE
     C                     MOVELIA02      QQ01
     C                     MOVELIA03      QQ02
     C                     Z-ADDIA06      QQ03
     C                     WRITEQQ0
     C                     ENDIF
     C                     ENDIF
     C                     READ A1I                      45
     C                     ENDDO
     C                     CLOSEA1I
     C*出貨
     C                     OPEN M1O
     C                     READ M1O                      45
     C           *IN45     DOWEQ'0'
     C           IA03      IFEQ M102
     C           KEYIA     CHAINQQ0                  40
     C           *IN40     IFEQ '0'
     C           IA06      ADD  M103      QQ03
     C                     UPDATQQ0
     C                     ELSE
     C                     MOVELIA02      QQ01
     C                     MOVELIA03      QQ02
     C                     Z-ADDIA06      QQ03
     C                     WRITEQQ0
     C                     ENDIF
     C                     ENDIF
     C                     READ M1O                      45
     C                     ENDDO
     C                     CLOSEM1O
     C*收貨
     C                     OPEN M1I
     C                     READ M1I                      45
     C           *IN45     DOWEQ'0'
     C           IA03      IFEQ M1X2
     C           KEYIA     CHAINQQ0                  40
     C           *IN40     IFEQ '0'
     C           IA06      SUB  M1X3      QQ03
     C                     UPDATQQ0
     C                     ELSE
     C                     MOVELIA02      QQ01
     C                     MOVELIA03      QQ02
     C                     Z-ADDIA06      QQ03
     C                     WRITEQQ0
     C                     ENDIF
     C                     ENDIF
     C                     READ M1I                      45
     C                     ENDDO
     C                     CLOSEM1I
     C*
     C                     READ IMIAPF                   46
     C                     ENDDO
     C*
     C                     SETON                     LR
