     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM NAME : PYZ904                                     *
     H*    PROGRAM NAME :工讀生資料轉檔                          *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 96/08/21                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資系統                              *
     H****************************************************************
     FPYZ9PF  IF  E           K        DISK
     FPYENPF  UF  E           K        DISK                      A
     FPYPTPF  UF  E           K        DISK                      A
     FPYZ903D CF  E                    WORKSTN
     I*----------------------------------------------------------------
     I*
     ILDA        UDS
     I                                      101 110 $USER
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      140 140 $RMK02
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I*
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*
     C           KEYEN     KLIST
     C                     KFLD           Z901
     C                     KFLD           Z902
     C*
     C           KEYPT     KLIST
     C                     KFLD           Z901
     C                     KFLD           Z906
     C                     KFLD           Z907
     C                     KFLD           Z902
     C*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010                     *INI. RTN.
     C*
  01-C           *IN03     DOWEQ'0'
    C                     EXSR RTN100                     *MAIN
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL ROUTINE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     SETON                     10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100.... MAIN ROUTINE
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     SETON                     97
|    C                     EXFMTDSPC1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO END100
| 01-C                     END
|    C*
|    C                     EXSR RTN110                     *CHK SCREEN1
|    C*
| 02-C           *IN99     IFEQ '0'
|   C           *IN13     ANDEQ'1'
|   C                     EXSR RTN120                     *PROCESS
| 02-C                     END
|    C*
02===C           END100    ENDSR
     C*==============================================================*
     C*          RTN110....CHECK SCREEN1
     C*==============================================================*
03===C           RTN110    BEGSR
|    C*
|    C*
03===C           END110    ENDSR
     C*==============================================================*
     C*          RTN120.... PROCESS
     C*==============================================================*
04===C           RTN120    BEGSR
|    C*
|    C                     SETON                     96
|    C                     WRITEDSPC1
|    C*
     C           *LOVAL    SETLLZ90
     C                     READ Z90                      46
     C           *IN46     DOWEQ'0'
     C*
     C           KEYEN     CHAINEN0                  40
     C                     MOVELZ901      EN01
     C                     MOVELZ902      EN02
     C                     MOVELZ903      EN03
     C                     MOVELZ904      EN04
     C*
     C                     CALL 'P31'
     C                     PARM Z905      P3101I  80
     C                     PARM '1'       P3102I  1
     C                     PARM '1'       P3103I  1
     C                     PARM '2'       P3104I  1
     C                     PARM '1'       P3105I  1
     C                     PARM           P3111O  80
     C*
     C                     Z-ADDP3111O    EN05
     C                     MOVEL*BLANK    EN06
     C                     Z-ADDZ997      EN97
     C                     Z-ADDZ998      EN98
     C                     MOVELZ999      EN99
     C  N40                UPDATEN0
     C   40                WRITEEN0
     C*
     C           KEYPT     CHAINPT0                  41
     C                     MOVELZ901      PT01
     C                     MOVELZ902      PT02
     C                     CALL 'P39'
     C                     PARM Z906      P3901I  60
     C                     PARM '1'       P3902I  1
     C                     PARM '1'       P3903I  1
     C                     PARM '2'       P3904I  1
     C                     PARM '1'       P3905I  1
     C           PT03      PARM           P3911O  60
     C*
     C                     CALL 'P39'
     C                     PARM Z907      P3901I  60
     C                     PARM '1'       P3902I  1
     C                     PARM '1'       P3903I  1
     C                     PARM '2'       P3904I  1
     C                     PARM '1'       P3905I  1
     C           PT04      PARM           P3911O  60
     C                     Z-ADDZ908      PT05
     C                     Z-ADDZ909      PT06
     C                     Z-ADDZ910      PT07
     C                     Z-ADDZ911      PT08
     C                     Z-ADDZ912      PT09
     C                     Z-ADDZ913      PT10
     C                     Z-ADDZ997      PT97
     C                     Z-ADDZ998      PT98
     C                     MOVELZ999      PT99
     C  N41                UPDATPT0
     C   41                WRITEPT0
     C*
     C                     READ Z90                      46
     C                     ENDDO
|    C*
|    C                     SETON                     9399
     C                     MOVEL'UPT2111' ERRID
     C                     MOVEL'PTMF'    ERRF
|    C                     SETOF                     96
|    C*
04===C                     ENDSR
