     H        1   Y
     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYZ101                                     *
     H*    PROGRAM NAME :西祺，康寧-薪資主檔轉檔               *
     H*    AUTHOR       : A1490 TERESA                               *
     H*    CREATE DATE  : 96/04/04                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FPYPYPF  UP  E           K        DISK
     FPYEMPF  IF  E           K        DISK
     F*---------------------------------------------------------------*
     I*
     I           UDS
     I                                      101 110 $USER
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*KEY FOR PYPYPF
     C           KEYPY     KLIST
     C                     KFLD           PY01
     C                     KFLD           PY02
     C           KEYEM     KLIST
     C                     KFLD           PY01
     C                     KFLD           PY02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C           KEYEM     CHAINEM0                  40
     C           *IN40     IFEQ '0'
     C           EM11      IFEQ 'Y'
     C*
     C                     DELETPY0
     C*
     C                     ENDIF
     C                     ENDIF
