     FPYLVPF  UF  E           K        DISK
     C           START     TAG
|   C                     READ LV0                      42
     C  N42                Z-ADD0         LV96
     C  N42                UPDATLV0
     C  N42                GOTO START
     C                     SETON                     LR
