     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : CKA1C0                                     *
     H*    PROGRAM NAME : 銀行基本資料維護                         *
     H*    AUTHOR       : A1149  MAY                                 *
     H*    CREATE DATE  : 1992.09.15                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     F****************************************************************
     FCKHBLF01UF  E           K        DISK                      A
     F*PA#APF  IF  E           K        DISK
     FCKA1C0D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     E                    @A01        5  1               作業權利
     E*                   @A02    9   9  1               原碼
     E*                   @A03    9   9  1               代碼
     I*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710HBSR
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*
 @   I           UDS
     I                                      101 110 $USER
     I                                      209 2160$C8YMD
     I                                      201 2080$A8YMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
     I                                      152 161 $USERN
     I*DEFINE COPY KEY
     I            DS
     I                                        1   7 KHBC
     I                                        1   7 DHB01C
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYHB     KLIST
     C                     KFLD           DHB01            *MAIN FILE
     C           KEYHBC    KLIST
     C                     KFLD           DHB01C           *COPY REC.
     C*          KEY#A     KLIST
     C*                    KFLD           #A01
     C*                    KFLD           #A02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
    C           SCID      CASEQ'SC02'    R2000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     IN   PTDA01
|    C*
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $PFMT     P3104I  1
|    C                     PARM $PTYPE    P3105I  1
|    C           DDATE     PARM           P3101O  80
|    C*
|    C                     MOVE 'SC01'    SCID    4
|    C* FUN AUT
|    C                     MOVE $ADD      @A01,1
|    C                     MOVE $UPD      @A01,2
|    C                     MOVE $DLT      @A01,4
|    C                     MOVE $INQ      @A01,5
|    C*
|    C* SC01 FIELD INITIALIZE *--------------------------------------*
|    C                     Z-ADD1         DOPT
|    C                     MOVE *BLANK    DHB01
|    C                     MOVE *BLANK    DHB01C
|    C*--------------------------------------------------------------*
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN18     IFEQ '1'                        *BROWSE
|   C                     EXSR R1A00
|   C                     GOTO E1000
| 02-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 03-C           *IN99     IFEQ '0'                        *SCR CHK OK
|   C                     EXSR R1C00                      *PRE-SC02
|   C                     MOVEL'SC02'    SCID
| 03-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1A00 ....全頁查詢 (PF18 : CALL SUB-PROGRAM)
     C*==============================================================*
03===C           R1A00     BEGSR
|    C*
|    C* AUT CHECK
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM 'CKI1C0'  S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     99
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C   99                GOTO E1A00
|    C*
|    C* CALL SUB-PROGRAM
|    C                     CALL 'CKI1C0'
|    C           DHB01     PARM DHB01     P120I1  7
|    C                     PARM *BLANK    P120I2 20
|    C                     PARM           @RTNC   2
|    C* RETURN CODE CHECK
| 02-C           @RTNC     IFEQ '03'                       *PF3
|   C                     SETON                     03
| 02-C                     END
|    C*
03===C           E1A00     ENDSR
     C*==============================================================*
     C*          R1B00 ....SCREEN CHECK
     C*==============================================================*
04===C           R1B00     BEGSR
|    C*
|    C* CHK FUN AUT
| 01-C           @A01,DOPT IFNE 'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* DATA CHECK *--------------------------------------------------*
| 02-C           DHB01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
|    C           KEYHB     CHAINHB0                  40
|    C*
| 03-C           DOPT      IFEQ 1                          *ADD
|   C           *IN40     ANDEQ'0'
|   C                     MOVEL'UPT2020' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 03-C                     END
|    C   99                GOTO E1B00
|    C*
| 04-C           DOPT      IFNE 1                          *UPD,DEL,INQ
|   C           *IN40     ANDEQ'1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 04-C                     END
|    C   99                GOTO E1B00
|    C*
| 05-C           DOPT      IFEQ 1                          *ADD
|   C           KHBC      ANDNE*BLANK                     *COPY
|   C           KEYHBC    CHAINHB0                  40
| 06-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0060' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 06-C                     END
| 05-C                     END
|    C   99                GOTO E1B00
|    C*
04===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....INIT 'SC02'
     C*==============================================================*
05===C           R1C00     BEGSR
|    C*
| 01-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 2                          *UPD
|   C                     SETON                     31    *CAN INPUT
| 01*C                     ELSE                            *DEL, INQ
|   C                     SETOF                     31    *INP PROTECT
| 01-C                     END
|    C*
| 02-C           DOPT      IFEQ 1                          *ADD
|   C* COPY ?? *-----------------------------------------------------*
|   C           KHBC      ANDEQ*BLANK                     *NO COPY
|   C*---------------------------------------------------------------*
|   C                     EXSR R1C10
| 02*C                     ELSE                            *U/D/I
|   C                     EXSR R1C20
| 02-C                     END
|    C*
|    C* RELEASE FILE (ADD & INQUIRY)----------------------------------*
| 03-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 5                          *INQ
|   C           *LOVAL    SETLLHB0
| 03-C                     END
|    C*---------------------------------------------------------------*
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R1C10 ....'SC02' FIELD INIT : ADD (NO COPY)
     C*==============================================================*
06===C           R1C10     BEGSR
|    C*
|    C                     MOVEL*BLANKS   DHB02
|    C                     MOVEL*BLANKS   DHB03
|    C                     MOVEL*BLANKS   DHB04
|    C                     MOVEL*BLANKS   DHB05
|    C                     MOVEL*BLANKS   DHB06
|    C                     MOVEL*BLANKS   DHB07
|    C                     MOVEL*BLANKS   DHB08
|    C                     MOVEL*BLANKS   DHB09
|    C                     MOVEL*BLANKS   DHB10
|    C                     Z-ADD0         DHB11
     C*INIT銀行類別
|    C*                    MOVEL*BLANK    DHB12
     C                     Z-ADD1         WI      20
     C*          DHB12     LOKUP@A02,WI                  30*EQ
     C*          *IN30     IFEQ '1'
     C*                    MOVEL@A03,WI   DHB12
     C*                    ELSE
     C*                    MOVE *BLANK    DHB12
     C*                    END
|   C*                    MOVEL*BLANK    #A01
|   C*                    MOVEL*BLANK    #A02
|   C*                    MOVEL*BLANK    D#A03
|   C*                    MOVEL'HB12'    #A01
|   C*                    MOVELDHB12     #A02
     C*          KEY#A     CHAIN#A0                  40
     C*          *IN40     IFEQ '0'
|   C*                    CALL 'P65'
|   C*                    PARM #A03      P6501I 80
|   C*                    PARM 10        P6502I  30
|   C*          D#A03     PARM           P6511O 80
|   C*                    PARM           P6512O 80
| 02-C*                    END
     C*
|    C                     MOVEL*BLANKS   DHB13
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*  R1C20 ....'SC02' FIELD INIT : UPD, DEL, INQ, (ADD & COPY)
     C*==============================================================*
07===C           R1C20     BEGSR
|    C*
|    C                     MOVELHB02      DHB02
|    C                     MOVELHB03      DHB03
|    C                     MOVELHB04      DHB04
|    C                     MOVELHB05      DHB05
|    C                     MOVELHB06      DHB06
|    C                     MOVELHB07      DHB07
|    C                     MOVELHB08      DHB08
|    C                     MOVELHB09      DHB09
|    C                     MOVELHB10      DHB10
|    C                     Z-ADDHB11      DHB11
|    C*                    MOVELHB12      DHB12
|   C*                    MOVEL*BLANK    #A01
|   C*                    MOVEL*BLANK    #A02
|   C*                    MOVEL*BLANK    D#A03
|   C*                    MOVEL'HB12'    #A01
|   C*                    MOVELDHB12     #A02
     C*          KEY#A     CHAIN#A0                  40
     C*          *IN40     IFEQ '0'
|   C*                    CALL 'P65'
|   C*                    PARM #A03      P6501I 80
|   C*                    PARM 10        P6502I  30
|   C*          D#A03     PARM           P6511O 80
|   C*                    PARM           P6512O 80
| 02-C*                    END
|    C*
|    C                     MOVELHB13      DHB13
|    C*
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          R2000 ....ADD DATA
     C*==============================================================*
08===C           R2000     BEGSR
|    C*
|    C                     EXFMTDSPD2
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     HBOL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E2000
| 01-C                     END
|    C*
| 02-C           *IN12     IFEQ '1'
|   C* RELEAS FILE --------------------------------------------------*
|   C           *LOVAL    SETLLHB0
|   C*---------------------------------------------------------------*
|   C                     MOVEL'SC01'    SCID
|   C                     GOTO E2000
| 02-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
|   C                     EXSR R2E00                      .PROMPT
|   C                     GOTO E2000
| 02-C                     END
|    C*
| 03-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 2                          *UPD
|   C                     EXSR R2B00                      *SC02 CHK
| 03-C                     END
|    C*
| 04-C           *IN99     IFEQ '0'                        *CHK OK
|   C                     EXSR R2D00                      *FILE UPD
|   C                     MOVE 'SC01'    SCID
| 04-C                     END
|    C*
08===C           E2000     ENDSR
     C*==============================================================*
     C*          R2B00 ....'SC02' CHECK
     C*==============================================================*
09===C           R2B00     BEGSR
|    C*<< CHECK銀行簡稱>>
| 01-C           DHB02     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO E2B00
|    C*<<CHECK銀行名稱>>
| 02-C           DHB03     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 02-C                     END
|    C   99                GOTO E2B00
|    C*<< CHECK地區別>>
| 03-C           DHB10     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 03-C                     END
|    C   99                GOTO E2B00
     C*<< CHECK託收交易天數>>
     C           DHB11     IFEQ *ZERO
     C           DHB10     IFEQ '1'
     C                     Z-ADD1         DHB11
     C                     ELSE
     C                     Z-ADD5         DHB11
     C                     END
     C                     END
|    C*<< CHECK銀行類別>>
     C*                    MOVEL*BLANK    D#A03
| 05-C*          DHB12     IFEQ *BLANK
|   C*                    MOVEL'UPT0010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6399
|   C*
| 05*C*                    ELSE
|   C*                    MOVEL'HB12'    #A01
|   C*                    MOVELDHB12     #A02
|   C*          KEY#A     CHAIN#A0                  40
| 06-C*          *IN40     IFEQ '1'
|   C*                    MOVEL'UPT2010' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C*                    SETON                     6399
| 06-C*                    END
|    C*  99                GOTO E2B00
     C*
|   C*                    CALL 'P65'
|   C*                    PARM #A03      P6501I 80
|   C*                    PARM 10        P6502I  30
|   C*          D#A03     PARM           P6511O 80
|   C*                    PARM           P6512O 80
|    C*
| 05-C*                    END
|    C*
09===C           E2B00     ENDSR
     C*==============================================================*
     C*          R2D00 ....FILE PROCESS
     C*==============================================================*
10===C           R2D00     BEGSR
|    C*
| 01-C           DOPT      CASEQ1         R2D10
|   C           DOPT      CASEQ2         R2D20
|   C           DOPT      CASEQ4         R2D30
| 01-C                     END
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          R2D10 ....FILE PROCESS : ADD
     C*==============================================================*
11===C           R2D10     BEGSR
|    C*
|    C                     EXSR R2D11
|    C                     WRITEHB0
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          R2D11 ....SCREEN FIELD TO FILE
     C*==============================================================*
12===C           R2D11     BEGSR
|    C*
|    C                     MOVE DHB01     HB01
|    C                     MOVE DHB02     HB02
|    C                     MOVE DHB03     HB03
|    C                     MOVE DHB04     HB04
|    C                     MOVE DHB05     HB05
|    C                     MOVE DHB06     HB06
|    C                     MOVE DHB07     HB07
|    C                     MOVE DHB08     HB08
|    C                     MOVE DHB09     HB09
|    C                     MOVE DHB10     HB10
|    C                     Z-ADDDHB11     HB11
|    C                     MOVE *BLANK    HB12
|    C                     MOVE DHB13     HB13
|    C                     TIME           HB97
|    C                     Z-ADD$A8YMD    HB98
|    C                     MOVE $USER     HB99
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          R2D20 ....FILE PROCESS : UPD
     C*==============================================================*
13===C           R2D20     BEGSR
|    C*
|    C                     EXSR R2D11
|    C                     UPDATHB0
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          R2D30 ....FILE PROCESS
     C*==============================================================*
14===C           R2D30     BEGSR
|    C*
|    C                     DELETHB0
|    C*
14===C                     ENDSR
     C*==============================================================*
     C*          R2E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
05===C           R2E00     BEGSR
|    C*
|    C           HBSR      DIV  256       #LIN             *LINE
|    C                     MVR            HBOL             *COLUMN
|    C*銀行類別
| 01-C*          #LIN      IFEQ 15
|   C*          HBOL      ANDGE13
|   C*          HBOL      ANDLE13
|   C*                    CALL 'CKS010'
|   C*                    PARM 'HB12'    S0101I 10
|   C*          DHB12     PARM DHB12     S0102I 10
|   C*          D#A03     PARM           S010O  18
     C*                    MOVEL*BLANK    S0101I
     C*                    MOVEL*BLANK    S0102I
     C*                    MOVEL*BLANK    S010O
| 01-C*                    END
|    C*
     C                     ENDSR
     C*==============================================================*
     C*      **
     C*      012  5678
     C*      **
     C*      ACC  BBDA
