     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM NAME :帳戶存提轉作業                            *
     H*    AUTHOR       : A1150                                      *
     H*    CREATE DATE  : 92/09/25                                   *
     H*    UPDATE DATE  : 1992.10.21                                 *
     H*    SYSTEM       :                                            *
     F****************************************************************
     FCKHALF11UF  E           K        DISK                      A
     FCKHDLF01UF  E           K        DISK
     FCKHBLF01IF  E           K        DISK
     FCKHALF01IF  E           K        DISK
     FGLAFPF  IF  E           K        DISK
     FPT#XPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FGLAHLF01UF  E           K        DISK                      A
     FCKA170D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     E                    @A01        5  1               作業權利
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*
     I*LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      209 2160$C8YMD
     I                                      201 2080$A8YMD
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I            DS
     I                                        1  14 HA16
     I                                        9  14 HA16$
     I            DS
     I                                        1 256 #X03
     I                                        1   1 #X101
     I                                        2   2 #X102
     I                                        5  10 #X104
     I                                       17  240#X106
     I                                       25  320#X107
     I*DEFINE COPY SOURCE
     I*/COPY PTRPGSRC,PT#XDS01
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C           *LIKE     DEFN HA01      DHA01$
     C           *LIKE     DEFN HD03      WHD03
     C           *LIKE     DEFN HA15      DHA15$
     C           *LIKE     DEFN HA01      HA01$
     C           *LIKE     DEFN HA10      W10A
     C           *LIKE     DEFN HA10      W10B
     C           *LIKE     DEFN HA16      W16A
     C           *LIKE     DEFN HA16      W16B
     C           *LIKE     DEFN HD08      HD08A
     C           *LIKE     DEFN HD08      HD08B
     C           *LIKE     DEFN #A01      W#A01
     C           *LIKE     DEFN #A02      W#A02
     C*
     C           *LIKE     DEFN HA02      #B001I
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYHA     KLIST                           *票號
     C                     KFLD           HA01$
     C                     KFLD           DHA02
     C                     KFLD           DHA03
     C           KEYHA1    KLIST                           *MAIN FILE
     C                     KFLD           DHA02
     C                     KFLD           DHA15$
     C                     KFLD           DHA31
     C           KEYHA2    KLIST                           *
     C                     KFLD           DHA02
     C                     KFLD           DHA15$
     C                     KFLD           DHA31
     C                     KFLD           DHA01$
     C           KEYHA3    KLIST                           *SAVE FILE
     C                     KFLD           DHA02
     C                     KFLD           DHA15$
     C           KEYHD     KLIST
     C                     KFLD           DHA02
     C                     KFLD           HA16$   6
     C           KEYHB     KLIST
     C                     KFLD           WHD03
     C           KEY#X     KLIST
     C                     KFLD           WTMP3   2
     C                     KFLD           DHA02
     C           KEY#A     KLIST
     C                     KFLD           W#A01
     C                     KFLD           W#A02
     C           KEYAF     KLIST
     C                     KFLD           AH01               公司別
     C                     KFLD           AH04               會計科目
     C           KEYAH     KLIST
     C                     KFLD           DHA02              公司別
     C                     KFLD           WHA51   9          傳票號碼
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
    C           SCID      CASEQ'SC02'    R2000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     IN   PTDA01
|    C*
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $PFMT     P3104I  1
|    C                     PARM $PTYPE    P3105I  1
|    C           DDATE     PARM           P3101O  80
|    C*
|    C                     MOVEL'SC01'    SCID    4
|    C* FUN AUT
|    C                     MOVE $ADD      @A01,1
|    C                     MOVE $UPD      @A01,2
|    C                     MOVE $DLT      @A01,4
|    C                     MOVE $INQ      @A01,5
|    C*
|    C* SC01 FIELD INITIALIZE *--------------------------------------*
|    C                     Z-ADD1         DOPT
|    C*公司檔
|    C                     MOVEL*BLANK    DHA02N
|    C                     MOVEL$COR      DHA02
|    C                     CALL 'CKS#B0'
|    C                     PARM DHA02     #B001I
|    C           DHA02N    PARM           #B002O 12
|    C                     PARM           #B003O 32
|    C                     PARM           #B098O 50
|    C                     PARM           #B099O  1
|    C*
|    C                     MOVEL'CK'      WTMP3
|    C           KEY#X     CHAIN#X0                  40
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM #X101     P3104I  1
|    C                     PARM #X102     P3105I  1
|    C           DHA15     PARM           P3101O  80
|    C*
|    C                     Z-ADD0         DHA31
|    C                     MOVEL'3'       DHA01
|    C*--------------------------------------------------------------*
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C* N99                SETON                     88
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN18     IFEQ '1'                        *BROWSE
|   C                     EXSR R1A00
|   C                     GOTO E1000
| 02-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 03-C           *IN99     IFEQ '0'                        *SCR CHK OK
|   C                     EXSR R1C00                      *PRE-SC02
|   C                     MOVEL'SC02'    SCID
| 03-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1A00 ....全頁查詢 (PF18 : CALL SUB-PROGRAM)
     C*==============================================================*
03===C           R1A00     BEGSR
|    C*
|    C* AUT CHECK
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM 'CKA170'  S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     99
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C   99                GOTO E1A00
|    C*
|    C* CALL SUB-PROGRAM
|    C                     CALL 'CKI170'
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C           DHA02     PARM DHA02     P000I1  2
|    C           DHA15     PARM DHA15     P000I2  70
|    C           DHA31     PARM DHA31     P000I3  40
|    C           DHA01     PARM DHA01     P000I4  1
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C                     PARM           @RTNC   2
|    C* RETURN CODE CHECK
| 02-C           @RTNC     IFEQ '03'                       *PF3
|   C                     SETON                     03
| 02-C                     END
|    C*
|    C*
03===C           E1A00     ENDSR
     C*==============================================================*
     C*          R1B00 .... 'SC01' SCREEN CHECK
     C*==============================================================*
04===C           R1B00     BEGSR
|    C* CHK FUN AUT
| 01-C           @A01,DOPT IFNE 'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 01-C                     END
|    C   99                GOTO E1B00
|    C* DATA CHECK *--------------------------------------------------*
|    C*公司檔
|    C                     MOVEL*BLANK    DHA02N
| 02-C           DHA02     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'CKS#B0'
|    C                     PARM DHA02     #B001I
|    C           DHA02N    PARM           #B002O 12
|    C                     PARM           #B003O 32
|    C                     PARM           #B098O 50
|    C                     PARM           #B099O  1
| 03-C           #B099O    IFNE 'Y'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                       6099
| 03-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*<<基本參數>>
|    C                     Z-ADDDHA15     WA01    80
|    C                     MOVEL'CK'      WTMP3
|    C           KEY#X     CHAIN#X0                  40
|    C*
|    C*<<處理日期>>
|    C                     CALL 'P30'
|    C                     PARM WA01      P3001I  80
|    C                     PARM #X101     P3002I  1
|    C                     PARM #X102     P3003I  1
|    C                     PARM           P3011O  1
| 04-C           P3011O    IFNE 'Y'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 04-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'P31'
|    C                     PARM DHA15     P3101I  80
|    C                     PARM #X101     P3102I  1
|    C                     PARM #X102     P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           DHA15$    PARM           P3101O  80
|    C*
| 05-C           DOPT      IFNE 1
|   C           DHA31     ANDEQ0
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                       6299
| 05-C                     END
|    C   99                GOTO E1B00
|    C*<<修改，刪除，查詢>>
| 06-C           DOPT      IFNE 1
|   C*
| 07-C           DHA01     IFNE '3'
|   C           DHA01     ANDNE'4'
|   C           DHA01     ANDNE'9'
|   C           DHA01     ANDNE*BLANKS
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                       6499
| 07-C                     END
|   C   99                GOTO E1B00
|   C*
|   C           KEYHA1    CHAINHA1                  40
| 08-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6061
|   C                     SETON                     62
|   C                     SETON                       99
| 08-C                     END
|   C   99                GOTO E1B00
| 06-C                     END
|    C*<<新增>>
| 09-C           DOPT      IFEQ 1
|   C                     Z-ADD*ZERO     DHA31
| 10-C           DHA01     IFNE '3'
|   C           DHA01     ANDNE'4'
|   C           DHA01     ANDNE'9'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                       7299
| 10-C                     END
| 09-C                     END
|    C   99                GOTO E1B00
|    C*修改／刪除
| 11-C           DOPT      IFEQ 2
|   C           DOPT      OREQ 4
| 12-C           HA23      IFEQ '10'
|    C           KEYAH     CHAINAH0                  40
|   C*－已產生傳票已過帳
| 13-C           AH18      IFEQ 'V'
|   C                     MOVEL'UCK0025' ERRID
|   C                     MOVEL'CKMF'    ERRF
|   C                     SETON                     606199
| 13-C                     END
| 12-C                     ELSE
| 12-C           HA51      IFNE *BLANK
|   C                     MOVEL'UCK0001' ERRID
|   C                     MOVEL'CKMF'    ERRF
|   C                     SETON                     606199
| 12-C                     END
| 12-C                     END
| 11-C                     END
|   C   99                GOTO E1B00
|   C*
|    C*轉帳者，不可修改資料
| 14-C           DOPT      IFEQ 2
| 15-C           HA01      IFEQ '5'
|   C           HA01      OREQ '6'
|   C                     MOVEL'UCK0019' ERRID
|   C                     MOVEL'CKMF'    ERRF
|   C                     SETON                     606199
| 15-C                     END
| 14-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*ＦＲＯＭ　ＡＰ，不可修改，刪除資料
| 14-C           DOPT      IFEQ 2
| 14-C           DOPT      OREQ 4
| 15-C           HA01      IFEQ '4'
| 15-C           HA23      ANDEQ'10'
|   C                     MOVEL'UCK0024' ERRID
|   C                     MOVEL'CKMF'    ERRF
|   C                     SETON                     606199
| 15-C                     END
| 14-C                     END
|    C   99                GOTO E1B00
|    C*
04===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....INIT 'SC02'
     C*==============================================================*
05===C           R1C00     BEGSR
|    C*<<新增>>
| 01-C           DOPT      IFEQ 1                          *ADD
|   C*
|   C*---存款時，可鍵入票號
|   C*   代表廠商拿現金來，換回支票．  SETON 33
|   C*
| 02-C           DHA01     IFEQ '3'
|   C                     SETON                     3233  *CAN INPUT
|   C                     SETOF                     31    *NO INPUT
| 02-C                     END
|   C*
| 03-C           DHA01     IFEQ '4'
|   C                     SETON                     31    *CAN INPUT
|   C                     SETOF                     3233  *NO INPUT
| 03-C                     END
|   C*
| 04-C           DHA01     IFEQ '9'
|   C                     SETON                     313233*CAN INPUT
| 04-C                     END
| 01-C                     END
|    C*<<修改>>
| 05-C           DOPT      IFEQ 2                          *UPD
|   C*
|   C           KEYHA1    CHAINHA1                  40
|   C                     MOVE HA01      DHA01
| 06-C           DHA01     IFEQ '3'
|   C                     SETON                     3233  *CAN INPUT
|   C                     SETOF                     31    *NO INPUT
| 06-C                     END
|   C*
| 07-C           DHA01     IFEQ '4'
|   C                     SETON                     31    *CAN INPUT
|   C                     SETOF                     3233  *NO INPUT
| 07-C                     END
|   C*
| 08-C           DHA01     IFEQ '5'
|   C           DHA01     OREQ '6'
|   C                     MOVEL'9'       DHA01
|   C                     SETON                     313233*CAN INPUT
| 08-C                     END
|   C*
| 05-C                     END
|    C*<<刪除＆查詢>>
| 09-C           DOPT      IFEQ 4                          *DEL
|   C           DOPT      OREQ 5                          *INQ
|   C           KEYHA1    CHAINHA1                  40
|   C                     MOVE HA01      DHA01
|   C*
|   C                     SETOF                     313233*NO INPUT
| 10-C           DHA01     IFEQ '5'
|   C           DHA01     OREQ '6'
|   C                     MOVEL'9'       DHA01
| 10-C                     END
|   C*
|   C*
| 09-C                     END
|    C*
|    C*<< WRITE SCREEN 2 DATA >>
| 11-C           DOPT      IFEQ 1                          *ADD
|   C                     EXSR R1C10
| 11*C                     ELSE                            *U/D/I
|   C                     EXSR R1C20
| 11-C                     END
|    C*
|    C* RELEASE FILE (ADD & INQUIRY)----------------------------------*
| 12-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 5                          *INQ
|   C           *LOVAL    SETLLHA1
| 12-C                     END
|    C*---------------------------------------------------------------*
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R1C10 ....'SC02' FIELD INIT : ADD
     C*==============================================================*
06===C           R1C10     BEGSR
|    C*
|    C                     MOVEL*BLANK    DH16A
|    C                     MOVEL*BLANK    HD02A
|    C                     MOVEL*BLANK    HD03A
|    C                     MOVEL*BLANK    HB03A
|    C                     Z-ADD0         DH10A
|    C                     MOVEL*BLANK    HD06A
|    C                     Z-ADD*ZERO     DH34A
|    C                     MOVEL*BLANK    DH32A
|    C                     MOVEL*BLANK    DH23A
|    C                     MOVEL*BLANK    DH23AC
|    C                     MOVEL*BLANK    DH26A
|    C                     MOVEL*BLANK    DH27A
|    C                     MOVEL*BLANK    DH28A
|    C                     MOVEL*BLANK    DHA51            傳票號碼
|    C*
| 01-C           DHA01     IFEQ '4'
|   C           DHA01     OREQ '9'
|   C                     MOVEL'N'       DH26A
|   C                     MOVEL'Y'       DH27A
|   C                     MOVEL'Y'       DH28A
| 01-C                     END
|    C*
|    C                     MOVEL*BLANK    DH16B
|    C                     MOVEL*BLANK    HD02B
|    C                     MOVEL*BLANK    HD03B
|    C                     MOVEL*BLANK    HB03B
|    C                     Z-ADD0         DH10B
|    C                     MOVEL*BLANK    HD06B
|    C                     Z-ADD*ZERO     DH34B
|    C                     MOVEL*BLANK    DH32B
|    C                     MOVEL*BLANK    DH23B
|    C                     MOVEL*BLANK    DH23BC
|    C                     MOVEL*BLANK    DH26B
|    C                     MOVEL*BLANK    DH27B
|    C                     MOVEL*BLANK    DH28B
|    C*
| 02-C           DHA01     IFEQ '3'
|   C           DHA01     OREQ '9'
|   C                     MOVEL'N'       DH26B
|   C                     MOVEL'Y'       DH27B
|   C                     MOVEL'Y'       DH28B
| 02-C                     END
|    C*
|    C                     MOVEL*BLANK    DHA03
|    C*
|    C                     Z-ADD0         W10A
|    C                     Z-ADD0         W10B
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*  R1C20 ....'SC02' FIELD INIT : UPD, DEL, INQ
     C*==============================================================*
07===C           R1C20     BEGSR
|    C*
|    C                     MOVELHA51      DHA51            *傳票號碼
|    C                     MOVELHA51      WHA51            *傳票號碼
| 01-C           DHA01     IFEQ '3'                        *存入
|   C                     MOVEL*BLANK    DH16A
|   C                     MOVEL*BLANK    HD02A
|   C                     MOVEL*BLANK    HD03A
|   C                     MOVEL*BLANK    HB03A
|   C                     Z-ADD0         DH10A
|   C                     MOVEL*BLANK    HD06A
|   C                     Z-ADD*ZERO     DH34A
|   C                     MOVEL*BLANK    DH32A
|   C                     MOVEL*BLANK    DH23A
|   C                     MOVEL*BLANK    DH23AC
|   C                     MOVEL*BLANK    DH26A
|   C                     MOVEL*BLANK    DH27A
|   C                     MOVEL*BLANK    DH28A
|   C                     EXSR R1C21
| 01-C                     END
|    C*
| 02-C           DHA01     IFEQ '4'                        *提出
|   C                     MOVEL*BLANK    DH16B
|   C                     MOVEL*BLANK    HD02B
|   C                     MOVEL*BLANK    HD03B
|   C                     MOVEL*BLANK    HB03B
|   C                     Z-ADD0         DH10B
|   C                     MOVEL*BLANK    HD06A
|   C                     Z-ADD*ZERO     DH34B
|   C                     MOVEL*BLANK    DH32B
|   C                     MOVEL*BLANK    DH23B
|   C                     MOVEL*BLANK    DH23BC
|   C                     MOVEL*BLANK    DH26B
|   C                     MOVEL*BLANK    DH27B
|   C                     MOVEL*BLANK    DH28B
|   C                     EXSR R1C22
| 02-C                     END
|    C*
| 03-C           DHA01     IFEQ '9'
|   C                     MOVEL'5'       DHA01$
|   C           KEYHA2    CHAINHA1                  40
|   C  N40                EXSR R1C21                      *轉存
|   C*
|   C                     MOVEL'6'       DHA01$
|   C           KEYHA2    CHAINHA1                  40
|   C  N40                EXSR R1C22                      *轉提
|   C*
| 03-C                     END
|    C*
|    C                     MOVELHA03      DHA03
07===C                     ENDSR
     C*==============================================================*
     C*  R1C21 ....'SC02' 存入
     C*==============================================================*
08===C           R1C21     BEGSR
|    C*CKHAPF
|    C                     MOVE HA16      DH16B
|    C                     MOVELHA16      W16B             KEEP舊帳戶
|    C                     Z-ADDHA10      DH10B
|    C                     Z-ADDHA10      W10B             KEEP舊金額
|    C                     MOVELHA23      DH23B
|    C                     MOVELHA26      DH26B
|    C                     MOVELHA27      DH27B
|    C                     MOVELHA28      DH28B
|    C                     MOVELHA32      DH32B
|    C                     Z-ADDHA34      DH34B
|    C*PT#YPF
|    C                     MOVEL*BLANK    W#A01
|    C                     MOVEL*BLANK    W#A01
|    C                     MOVEL*BLANK    DH23BC
|    C                     MOVEL'CKUSED'  W#A01
|    C                     MOVELDH23B     W#A02
|    C           KEY#A     CHAIN#A0                  40    *NF
|    C  N40                MOVEL#A03      DH23BC
|    C*CKHDPF
|    C                     MOVEL*BLANK    HD02B
|    C                     MOVEL*BLANK    HD03B
|    C                     MOVEL*BLANK    HD06B
|    C                     MOVELDH16B     HA16$
|    C           KEYHD     CHAINHD0                  40
|    C           *LOVAL    SETLLHD0
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELHD02      HD02B
|   C                     MOVELHD03      HD03B
|   C                     MOVELHD06      HD06B
| 01-C                     END
|    C*CKHBPF
|    C                     MOVEL*BLANK    HB03B
|    C                     MOVELHD03B     WHD03
|    C           KEYHB     CHAINHB0                  40
|    C  N40                MOVELHB03      HB03B
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*  R1C22 ....  'SC02' 提出
     C*==============================================================*
09===C           R1C22     BEGSR
|    C*CKHAPF
|    C                     MOVE HA16      DH16A
|    C                     MOVELHA16      W16A             KEEP舊帳戶
|    C                     Z-ADDHA10      DH10A
|    C                     Z-ADDHA10      W10A             KEEP舊金額
|    C                     MOVELHA23      DH23A
|    C                     MOVELHA26      DH26A
|    C                     MOVELHA27      DH27A
|    C                     MOVELHA28      DH28A
|    C                     MOVELHA32      DH32A
|    C                     Z-ADDHA34      DH34A
|    C*PT#YPF
|    C                     MOVEL*BLANK    W#A01
|    C                     MOVEL*BLANK    W#A01
|    C                     MOVEL*BLANK    DH23AC
|    C                     MOVEL'CKUSED'  W#A01
|    C                     MOVELDH23A     W#A02
|    C           KEY#A     CHAIN#A0                  40    *NF
|    C  N40                MOVEL#A03      DH23AC
|    C*CKHDPF
|    C                     MOVEL*BLANK    HD02A
|    C                     MOVEL*BLANK    HD03A
|    C                     MOVEL*BLANK    HD06A
|    C                     MOVELDH16A     HA16$
|    C           KEYHD     CHAINHD0                  40
|    C           *LOVAL    SETLLHD0
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELHD02      HD02A
|   C                     MOVELHD03      HD03A
|   C                     MOVELHD06      HD06A
| 01-C                     END
|    C*CKHBPF
|    C                     MOVEL*BLANK    HB03A
|    C                     MOVELHD03A     WHD03
|    C           KEYHB     CHAINHB0                  40
|    C  N40                MOVELHB03      HB03A
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          R2000 .... 'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
10===C           R2000     BEGSR
|    C*
|    C                     EXFMTDSPD2
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E2000
| 01-C                     END
|    C*
| 02-C           *IN12     IFEQ '1'                        *PREVIOUS
|   C* RELEAS FILE --------------------------------------------------*
|   C           *LOVAL    SETLLHA1
|   C           *LOVAL    SETLLHD0
|   C*---------------------------------------------------------------*
|   C                     MOVEL'SC01'    SCID
|   C                     GOTO E2000
| 02-C                     END
|    C*
| 03-C           *IN04     IFEQ '1'
|   C                     EXSR R2E00                      .PROMPT
|   C                     GOTO E2000
| 03-C                     END
|    C*
| 04-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 2                          *UPD
|   C                     EXSR R2B00                      *SC02 CHK
| 04-C                     END
|    C*
| 05-C           *IN05     IFEQ '1'                        *CHECK ONLY
|   C                     GOTO E2000
| 05-C                     END
|    C*
| 06-C           *IN99     IFEQ '0'                        *CHK OK
|   C                     EXSR R2D00                      *FILE UPD
|   C                     MOVE 'SC01'    SCID
|   C*存檔後將 CURSOR停在序號欄
| 06-C                     END
|    C*
10===C           E2000     ENDSR
     C*==============================================================*
     C*          R2B00 ....'SC02' CHECK
     C*==============================================================*
11===C           R2B00     BEGSR
|    C*<<提出＆轉帳DOPT = 4 OR 9 >>
| 01-C           DHA01     IFNE '3'
|   C                     EXSR R2B10
| 01-C                     END
|    C   99                GOTO E2B00
|    C*
|    C*<<存入＆轉帳 DOPT = 3 OR 9 >>
| 02-C           DHA01     IFNE '4'
|   C                     EXSR R2B20
| 02-C                     END
|    C   99                GOTO E2B00
|    C*
|    C*<<轉帳時, CHECK存入帳號＆提出帳號是否相同>>
| 03-C           DHA01     IFEQ '9'
|   C           DH16A     ANDEQDH16B
|   C                     MOVEL'UCK0005' ERRID
|   C                     MOVEL'CKMF'    ERRF
|   C                     SETON                     617199
| 03-C                     END
|    C   99                GOTO E2B00
|    C*
|    C*<<轉帳時, CHECK存入金額＆提出金額是否相同>>
| 04-C           DHA01     IFEQ '9'
|   C           DH10A     ANDNEDH10B
|   C                     MOVEL'UCK0020' ERRID
|   C                     MOVEL'CKMF'    ERRF
|   C                     SETON                     627299
| 04-C                     END
|    C   99                GOTO E2B00
|    C*
11===C           E2B00     ENDSR
     C*==============================================================*
     C*          R2B10 ....'SC02' CHECK
     C*==============================================================*
12===C           R2B10     BEGSR
|    C*提出帳號
| 01-C           DH16A     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 01-C                     END
|    C   99                GOTO E2B10
|    C*
|    C                     MOVEL*BLANKS   HD02A
|    C                     MOVEL*BLANKS   HD03A
|    C                     MOVEL*BLANKS   HD06A
|    C                     MOVEL*BLANKS   HD08A
|    C                     MOVELDH16A     HA16$
|    C           KEYHD     CHAINHD0                  40
|    C           *LOVAL    SETLLHD0
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 02-C                     END
|    C   99                GOTO E2B10
|    C*
|    C                     MOVELHD02      HD02A
|    C                     MOVELHD03      HD03A
|    C                     MOVELHD06      HD06A
|    C                     MOVELHD03A     WHD03
|    C                     MOVELHD03      HA16$
|    C*---記錄存入帳號之會計科目
|    C                     MOVELHD08      HD08A
|    C*提出銀行
|    C                     MOVEL*BLANK    HB03A
|    C           KEYHB     CHAINHB0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     MOVELHB03      HB03A
| 03-C                     END
|    C   99                GOTO E2B10
|    C*提出台幣金額
| 04-C           DH10A     IFEQ 0
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 04-C                     END
|    C   99                GOTO E2B10
|    C*提出原幣金額
| 05-C           HD06A     IFEQ 'NTD'
|   C           DH34A     ANDEQ0
|   C                     Z-ADDDH10A     DH34A
| 05-C                     END
|    C*
| 06-C           DH34A     IFEQ 0
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 06-C                     END
|    C   99                GOTO E2B10
|    C*提出來源用途
| 07-C           DH23A     IFNE *BLANK
|   C                     MOVEL*BLANK    W#A01
|   C                     MOVEL*BLANK    W#A01
|   C                     MOVEL*BLANK    DH23AC
|   C                     MOVEL'CKUSED'  W#A01
|   C                     MOVELDH23A     W#A02
|   C           KEY#A     CHAIN#A0                  40    *NF
| 08-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 08-C                     END
| 07-C                     END
|    C   99                GOTO E2B10
|    C*
12===C           E2B10     ENDSR
     C*==============================================================*
     C*          R2B20 ....'SC02' CHECK
     C*==============================================================*
13===C           R2B20     BEGSR
|    C*存入帳號
| 01-C           DH16B     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7199
| 01-C                     END
|    C   99                GOTO E2B20
|    C*
|    C                     MOVEL*BLANK    HD02B
|    C                     MOVEL*BLANK    HD03B
|    C                     MOVEL*BLANK    HD06B
|    C                     MOVEL*BLANKS   HD08B
|    C                     MOVELDH16B     HA16$
|    C           KEYHD     CHAINHD0                  40
|    C           *LOVAL    SETLLHD0
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7199
| 02-C                     END
|    C   99                GOTO E2B20
|    C*
|    C                     MOVELHD02      HD02B
|    C                     MOVELHD03      HD03B
|    C                     MOVELHD06      HD06B
|    C                     MOVELHD03B     WHD03
|    C                     MOVELHD03      HA16$
|    C*---記錄存入帳號之會計科目
|    C                     MOVELHD08      HD08B
|    C*存入銀行
|    C                     MOVEL*BLANK    HB03B
|    C           KEYHB     CHAINHB0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     MOVELHB03      HB03B
| 03-C                     END
|    C   99                GOTO E2B20
|    C*存入台幣金額
| 04-C           DH10B     IFEQ 0
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7299
| 04-C                     END
|    C   99                GOTO E2B20
|    C*存入原幣金額
| 05-C           HD06B     IFEQ 'NTD'
|   C           DH34B     ANDEQ0
|   C                     Z-ADDDH10B     DH34B
| 05-C                     END
|    C*
| 06-C           DH34B     IFEQ 0
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7399
| 06-C                     END
|    C   99                GOTO E2B20
|    C*存入來源用途
| 07-C           DH23B     IFNE *BLANK
|   C                     MOVEL*BLANK    W#A01
|   C                     MOVEL*BLANK    W#A01
|   C                     MOVEL*BLANK    DH23BC
|   C                     MOVEL'CKUSED'  W#A01
|   C                     MOVELDH23B     W#A02
|   C           KEY#A     CHAIN#A0                  40    *NF
| 08-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7499
| 08-C                     END
| 07-C                     END
|    C   99                GOTO E2B20
|    C*
|    C*---存入票號檢核
|    C                     MOVEL'1'       HA01$
| 09-C           DHA03     IFNE *BLANKS
|   C           KEYHA     CHAINHA0                  40
| 10-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7599
| 10*C                     ELSE
| 11-C           HA17      IFNE '6'
|   C                     MOVEL'UCK0021' ERRID
|   C                     MOVEL'CKMF'    ERRF
|   C                     SETON                     7599
| 11-C                     END
| 10-C                     END
| 09-C                     END
|    C   99                GOTO E2B20
|    C*
13===C           E2B20     ENDSR
     C*==============================================================*
     C*          R2D00 ....FILE PROCESS
     C*==============================================================*
14===C           R2D00     BEGSR
|    C*
| 01-C           DOPT      CASEQ1         R2D10
|   C           DOPT      CASEQ2         R2D20
|   C           DOPT      CASEQ4         R2D30
| 01-C                     END
|    C*
14===C                     ENDSR
     C*==============================================================*
     C*          R2D10 ....FILE PROCESS : ADD
     C*==============================================================*
15===C           R2D10     BEGSR
|    C*編序號
|    C           KEYHA3    SETGTHA1
|    C           KEYHA3    REDPEHA1                      45
| 01-C           *IN45     IFEQ '1'
|   C                     Z-ADD1         HA31
|   C                     Z-ADD1         DHA31
| 01*C                     ELSE
|   C                     ADD  1         HA31
|   C                     Z-ADDHA31      DHA31
| 01-C                     END
|    C*＜存入＞
| 02-C           DHA01     IFEQ '3'
|   C                     EXSR R2D13                      帳戶+HD0
|   C                     MOVELDHA01     HA01             存提 HA1
|   C                     EXSR R2D11
|   C                     WRITEHA1
| 02-C                     END
|    C*＜提出＞
| 03-C           DHA01     IFEQ '4'
|   C                     EXSR R2D14                      帳戶-HD0
|   C                     MOVELDHA01     HA01             存提 HA1
|   C                     EXSR R2D12
|   C                     WRITEHA1
| 03-C                     END
|    C*＜轉帳＞
| 04-C           DHA01     IFEQ '9'
|   C*--轉存
|   C                     EXSR R2D13                      帳戶+HD0
|   C                     MOVEL'5'       DHA01$           存提 HA1
|   C           KEYHA2    CHAINHA1                  40
|   C                     MOVEL'5'       HA01
|   C                     EXSR R2D11
|   C*--產生轉帳傳票
|   C                     MOVEL*BLANKS   S002O1
|   C                     MOVELHA02      AH01              公司別
|   C                     Z-ADD*ZEROS    AH03              傳票項次
|   C                     MOVELHA15      AH10              傳票日期
|   C* ---取得傳票號碼
|   C                     CALL 'GLS002'
|   C                     PARM AH01      S002I1  2
|   C                     PARM AH10      S002I2  80
|   C                     PARM 'F'       S002I3  1
|   C           AH02      PARM           S002O1  9         傳票號碼
|   C                     MOVELAH02      HA51
|   C                     WRITEHA1
|   C*  ----先寫入借方會計科目
|   C                     Z-ADD1         AH03
|   C                     MOVEL*BLANKS   AH04
|   C                     MOVELHD08B     AH04              會計科目
|   C                     MOVEL*BLANKS   AH07
|   C                     MOVELDH16B     AH07              銀行帳號
|   C                     Z-ADDHA10      AH12
|   C                     Z-ADD*ZEROS    AH13
|   C*摘要
|   C                     MOVEL*BLANKS   AH16
|   C                     MOVELHB03B     AH16
|   C                     EXSR R2D17                       摘要
|   C                     WRITEAH0
|   C*--轉提
|   C                     EXSR R2D14                      帳戶-HD0
|   C                     MOVEL'6'       DHA01$           存提 HA1
|   C           KEYHA2    CHAINHA1                  40
|   C                     MOVEL'6'       HA01
|   C                     EXSR R2D12
|   C                     MOVELAH02      HA51
|   C                     WRITEHA1
|   C*  ----後寫入貸方會計科目
|   C                     Z-ADD2         AH03
|   C                     MOVEL*BLANKS   AH04
|   C                     MOVELHD08A     AH04              會計科目
|   C                     MOVEL*BLANKS   AH07
|   C                     MOVELDH16A     AH07              銀行帳號
|   C                     Z-ADD*ZEROS    AH12
|   C                     Z-ADDHA10      AH13
|   C*摘要
|   C                     MOVEL*BLANKS   AH16
|   C                     MOVELHB03A     AH16
|   C                     EXSR R2D17
|   C                     WRITEAH0
| 04-C                     END
|    C*
15===C                     ENDSR
     C*==============================================================*
     C*          R2D11 ....存入SCREEN TO FILE
     C*==============================================================*
16===C           R2D11     BEGSR
|    C*
|    C                     MOVELDHA02     HA02
|    C                     MOVELDHA03     HA03
|    C                     Z-ADDDH10B     HA10
|    C*
|    C                     CALL 'P31'
|    C                     PARM DHA15     P3101I  80
|    C                     PARM #X101     P3102I  1
|    C                     PARM #X102     P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           HA15      PARM           P3101O  80
|    C*
|   C                     MOVELDHA51     HA51
|    C                     MOVE HD02      HA16
|    C                     MOVELDH23B     HA23
|    C                     MOVELDH26B     HA26
|    C                     MOVELDH27B     HA27
|    C                     MOVELDH28B     HA28
|    C                     MOVELDH32B     HA32
|    C                     Z-ADDDH34B     HA34
|    C*
| 01-C           DOPT      IFEQ 1
| 02-C           HA34      IFNE *ZERO
|   C           HA10      DIV  HA34      HA19
| 02*C                     ELSE
|   C                     Z-ADD1         HA19
| 02-C                     END
|   C                     Z-ADD19        HA20
|   C                     MOVEL*BLANKS   HA51
|   C                     MOVEL*BLANKS   HA52
|   C                     Z-ADD*ZERO     HA53
|   C                     Z-ADD*ZERO     HA54
|   C                     Z-ADD*ZERO     HA55
|   C                     Z-ADD*ZERO     HA56
|   C                     MOVEL*BLANKS   HA57
|   C                     MOVEL*BLANKS   HA58
|   C                     MOVEL*BLANKS   HA59
|   C                     MOVEL*BLANKS   HA60
|    C*
| 04-C           DHA01     IFEQ '9'
|   C                     MOVEL'Y'       HA61
| 01-C                     ELSE
|   C                     MOVEL*BLANK    HA61
| 01-C                     END
|    C*
| 01-C                     END
|    C*
|    C                     TIME           HA97
|    C                     Z-ADD$A8YMD    HA98
|    C                     MOVEL$USER     HA99
|    C*
16===C                     ENDSR
     C*==============================================================*
     C*          R2D12 ....提出SCREEN TO FILE
     C*==============================================================*
17===C           R2D12     BEGSR
|    C*
|    C                     MOVELDHA02     HA02
|    C                     MOVELDHA03     HA03
|    C                     Z-ADDDH10A     HA10
|    C*
|    C                     CALL 'P31'
|    C                     PARM DHA15     P3101I  80
|    C                     PARM #X101     P3102I  1
|    C                     PARM #X102     P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           HA15      PARM           P3101O  80
|    C*
|    C                     MOVE HD02      HA16
|    C                     MOVELDH23A     HA23
|    C                     MOVELDH26A     HA26
|    C                     MOVELDH27A     HA27
|    C                     MOVELDH28A     HA28
|    C                     MOVELDH32A     HA32
|    C                     Z-ADDDH34A     HA34
|    C*
| 01-C           DOPT      IFEQ 1
| 02-C           HA34      IFNE *ZERO
|   C           HA10      DIV  HA34      HA19
| 02*C                     ELSE
|   C                     Z-ADD1         HA19
| 02-C                     END
|   C                     Z-ADD19        HA20
|   C                     MOVEL*BLANKS   HA51
|   C                     MOVEL*BLANKS   HA52
|   C                     Z-ADD*ZERO     HA53
|   C                     Z-ADD*ZERO     HA54
|   C                     Z-ADD*ZERO     HA55
|   C                     Z-ADD*ZERO     HA56
|   C                     MOVEL*BLANKS   HA57
|   C                     MOVEL*BLANKS   HA58
|   C                     MOVEL*BLANKS   HA59
|   C                     MOVEL*BLANKS   HA60
|    C*
| 04-C           DHA01     IFEQ '9'
|   C                     MOVEL'Y'       HA61
| 01-C                     ELSE
|   C                     MOVEL*BLANK    HA61
| 01-C                     END
|    C*
| 01-C                     END
|    C*
|    C                     TIME           HA97
|    C                     Z-ADD$A8YMD    HA98
|    C                     MOVEL$USER     HA99
|    C*
17===C                     ENDSR
     C*==============================================================*
     C*          R2D13 ....存入+HD0
     C*==============================================================*
18===C           R2D13     BEGSR
|    C*
|    C                     MOVELDH16B     HA16$
|    C           KEYHD     CHAINHD0                  40
| 01-C           *IN40     IFEQ '0'
| 02-C           HD05      IFEQ '9'                        *透支帳戶
|   C                     SUB  DH10B     HD07
| 02*C                     ELSE                            *一般帳戶
|   C                     ADD  DH10B     HD07
| 02-C                     END
|   C                     TIME           HD97
|   C                     Z-ADD$A8YMD    HD98
|   C                     MOVEL$USER     HD99
|   C                     UPDATHD0
| 01-C                     END
|    C*
18===C                     ENDSR
     C*==============================================================*
     C*          R2D14 ....提出-HD0
     C*==============================================================*
19===C           R2D14     BEGSR
|    C*
|    C                     MOVELDH16A     HA16$
|    C           KEYHD     CHAINHD0                  40
| 01-C           *IN40     IFEQ '0'
| 02-C           HD05      IFEQ '9'                        *透支帳戶
|   C                     ADD  DH10A     HD07
| 02*C                     ELSE                            *一般帳戶
|   C                     SUB  DH10A     HD07
| 02-C                     END
|   C                     TIME           HD97
|   C                     Z-ADD$A8YMD    HD98
|   C                     MOVEL$USER     HD99
|   C                     UPDATHD0
| 01-C                     END
|    C*
19===C                     ENDSR
     C*==============================================================*
     C*          R2D15 ....存入-HD0 （反向）
     C*==============================================================*
20===C           R2D15     BEGSR
|    C*
|    C                     MOVE W16B      HA16$
|    C           KEYHD     CHAINHD0                  40
| 01-C           *IN40     IFEQ '0'
| 02-C           HD05      IFEQ '9'                        *透支帳戶
|   C                     ADD  W10B      HD07
| 02*C                     ELSE                            *一般帳戶
|   C                     SUB  W10B      HD07
| 02-C                     END
|   C                     TIME           HD97
|   C                     Z-ADD$A8YMD    HD98
|   C                     MOVEL$USER     HD99
|   C                     UPDATHD0
| 01-C                     END
|    C*
20===C                     ENDSR
     C*==============================================================*
     C*          R2D16 ....提出+HD0 （反向）
     C*==============================================================*
21===C           R2D16     BEGSR
|    C*
|    C                     MOVE W16A      HA16$
|    C           KEYHD     CHAINHD0                  40
| 01-C           *IN40     IFEQ '0'
| 02-C           HD05      IFEQ '9'                        *透支帳戶
|   C                     SUB  W10A      HD07
| 02*C                     ELSE                            *一般帳戶
|   C                     ADD  W10A      HD07
| 02-C                     END
|   C                     TIME           HD97
|   C                     Z-ADD$A8YMD    HD98
|   C                     MOVEL$USER     HD99
|   C                     UPDATHD0
| 01-C                     END
|    C*
21===C                     ENDSR
     C*==============================================================*
     C*          R2D17 ....產生轉帳傳票
     C*  ----------------------------------------------------------
     C*          傳票格式：CR. 存入帳號會計科目     HD08A
     C*                        DR. 提出帳號會計科目   HD08B
     C*==============================================================*
22===C           R2D17     BEGSR
|    C*----------------------------------------------------
|    C* 未清除之欄位，含AH01,AH02,AH03,AH04,AH07,AH10,  |
|    C*----------------------------------------------------
|    C                     MOVEL*BLANKS   AH05
|    C                     MOVEL*BLANKS   AH05A
|    C                     MOVEL*BLANKS   AH06
|    C                     MOVEL*BLANKS   AH06A
|    C                     MOVEL*BLANKS   AH07A
|    C                     MOVEL*BLANKS   AH08
|    C                     MOVEL*BLANKS   AH08A
|    C                     Z-ADD*ZEROS    AH09
|    C                     MOVEL*BLANKS   AH09A
|    C*                    Z-ADD*ZEROS    AH12
|    C*                    Z-ADD*ZEROS    AH13
|    C                     Z-ADD*ZEROS    AH14
|    C                     MOVEL*BLANKS   AH14A
|    C                     MOVEL*BLANKS   AH15
|    C                     MOVEL*BLANKS   AH15A
|    C*                    MOVEL*BLANKS   AH16
|    C                     MOVEL'CK'      AH17
|    C                     MOVEL*BLANKS   AH18
|    C                     MOVEL*BLANKS   AH19
|    C                     MOVEL*BLANKS   AH20
|    C                     Z-ADD*ZEROS    AH21
|    C                     MOVEL*BLANKS   AH22
|    C                     MOVEL*BLANKS   AH23
|    C                     MOVEL*BLANKS   AH24
|    C                     Z-ADD$A8YMD    AH25
|    C                     MOVEL$USER     AH26
|    C*----------------------------------
|    C* CHAIN 會計科目檔GLAFPF        |
|    C*---------------------------------------------
|    C* AH05A,AH06A,AH07A,AH08A,AH09A,AH14A,AH15A  |
|    C*---------------------------------------------
|    C           KEYAF     CHAINAF0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELAF11      AH05A
|   C                     MOVELAF12      AH06A
|   C                     MOVELAF13      AH07A
|   C                     MOVELAF14      AH08A
|   C                     MOVELAF15      AH09A
|   C                     MOVELAF16      AH14A
|   C                     MOVELAF17      AH15A
| 01-C                     END
|    C*
|    C                     TIME           AH97
|    C                     Z-ADD$A8YMD    AH98
|    C                     MOVEL$USER     AH99
|    C*
22===C                     ENDSR
     C*==============================================================*
     C*          R2D20 ....FILE PROCESS : UPD
     C*==============================================================*
23===C           R2D20     BEGSR
|    C                     Z-ADDDHA31     HA31
|    C*＜存入＞
| 01-C           DHA01     IFEQ '3'
|   C                     EXSR R2D15                      帳戶-HD0
|   C                     EXSR R2D13                      帳戶+HD0
|   C                     MOVEL'3'       DHA01$           存提 HA1
|   C           KEYHA2    CHAINHA1                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVELDHA01     HA01
|   C                     EXSR R2D11
|   C                     UPDATHA1
| 02-C                     END
| 01-C                     END
|    C*＜提出＞
| 03-C           DHA01     IFEQ '4'
|   C                     EXSR R2D16                      帳戶+HD0
|   C                     EXSR R2D14                      帳戶-HD0
|   C                     MOVEL'4'       DHA01$           存提 HA1
|   C           KEYHA2    CHAINHA1                  40
| 04-C           *IN40     IFEQ '0'
|   C                     MOVELDHA01     HA01
|   C                     EXSR R2D12
|   C                     UPDATHA1
| 04-C                     END
| 03-C                     END
|    C*＜轉帳＞
| 05-C           DHA01     IFEQ '9'
|   C*--轉存
|   C                     MOVEL'5'       DHA01$
|   C           KEYHA2    CHAINHA1                  41
|   C                     EXSR R2D15                      帳戶-HD0
|   C                     EXSR R2D13                      帳戶+HD0
| 06-C           *IN41     IFEQ '0'
|   C                     MOVEL'5'       HA01             存提 HA1
|   C                     EXSR R2D11
|   C                     UPDATHA1
| 06-C                     END
|   C*--轉提
|   C                     MOVEL'6'       DHA01$
|   C           KEYHA2    CHAINHA1                  41
|   C                     EXSR R2D16                      帳戶+HD0
|   C                     EXSR R2D14                      帳戶-HD0
| 07-C           *IN41     IFEQ '0'
|   C                     MOVEL'6'       HA01             存提 HA1
|   C                     EXSR R2D11
|   C                     UPDATHA1
| 07-C                     END
|   C*
| 05-C                     END
|    C*
23===C                     ENDSR
     C*==============================================================*
     C*          R2D30 ....FILE PROCESS..DLT
     C*==============================================================*
24===C           R2D30     BEGSR
|    C*＜存入＞
| 01-C           DHA01     IFEQ '3'
|   C                     EXSR R2D15                      帳戶-HD0
|   C                     MOVEL'3'       DHA01$           存提 HA1
|   C           KEYHA2    CHAINHA1                  40
|   C  N40                DELETHA1
| 01-C                     END
|    C*＜提出＞
| 02-C           DHA01     IFEQ '4'
|   C                     EXSR R2D16                      帳戶+HD0
|   C                     MOVEL'4'       DHA01$           存提 HA1
|   C           KEYHA2    CHAINHA1                  40
|   C  N40                DELETHA1
| 02-C                     END
|    C*＜轉帳＞
| 03-C           DHA01     IFEQ '9'
|   C*--轉存
|   C                     MOVEL'5'       DHA01$
|   C           KEYHA2    CHAINHA1                  41
|   C                     EXSR R2D15                      帳戶-HD0
|   C  N40                DELETHA1                        存提 HA1
|   C*--轉提
|   C                     MOVEL'6'       DHA01$
|   C                     EXSR R2D16                      帳戶+HD0
|   C           KEYHA2    CHAINHA1                  40    存提 HA1
|   C  N40                DELETHA1
|   C*
| 03-C                     END
|    C*
|    C*刪除資料->將該張傳票作廢
|    C           KEYAH     SETLLAH0
|    C           KEYAH     READEAH0                      46
| 04-C           *IN46     DOWEQ'0'
|   C                     MOVEL'V'       AH20
|   C                     TIME           AH97
|   C                     Z-ADD$A8YMD    AH98
|   C                     MOVEL$USER     AH99
|   C                     UPDATAH0
|   C           KEYAH     READEAH0                      46
| 04-C                     END
|    C*
24===C                     ENDSR
     C*==============================================================*
     C*          R2E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
25===C           R2E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*提出帳號
| 01-C           #LIN      IFEQ 10
|   C           #COL      ANDGE17
|   C           #COL      ANDLE22
|   C                     CALL 'CKI1D0'
|   C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|   C                     PARM DHA02     P130I1  2
|   C           DH16A     PARM DH16A     P130I2  6
|   C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|   C                     PARM           @RTNC   2
| 01-C                     END
|    C*提出來源用途
| 02-C           #LIN      IFEQ 12
|   C           #COL      ANDGE17
|   C           #COL      ANDLE18
|   C                     MOVEL*BLANKS   S0101I
|   C                     MOVEL*BLANKS   S0102I
|   C                     CALL 'WDS012'
|   C                     PARM 'CKUSED'  S01I    8
|   C           DH23A     PARM DH23A     S0102I 10
| 02-C                     END
|    C*存入帳號
| 03-C           #LIN      IFEQ 15
|   C           #COL      ANDGE17
|   C           #COL      ANDLE22
|   C                     CALL 'CKI1D0'
|   C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|   C                     PARM DHA02     P130I1  2
|   C           DH16B     PARM DH16B     P130I2  6
|   C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|   C                     PARM           @RTNC   2
| 03-C                     END
|    C*存入來源用途
| 04-C           #LIN      IFEQ 17
|   C           #COL      ANDGE17
|   C           #COL      ANDLE18
|   C                     MOVEL*BLANKS   S0101I
|   C                     MOVEL*BLANKS   S0102I
|   C                     CALL 'WDS012'
|   C                     PARM 'CKUSED'  S01I    8
|   C           DH23B     PARM DH23B     S0102I 10
| 04-C                     END
|    C*
25===C                     ENDSR
