     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : CKB3301                                    *
     H*    PROGRAM NAME :票據資料批次列印傳票作業                  *
     H*    AUTHOR       : A1162 IVORY                                *
     H*    CREATE DATE  : 1994/01/27                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :票據系統                                  *
     H****************************************************************
     FCKB330D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      50105080W01S
     I                                      50905160W01E
     I                                      517 517 D02
     I                                      518 526 D03S
     I                                      527 535 D03E
     I                                      536 536 D04
     I                                      53705430D01S
     I                                      54405500D01E
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN10     PARM *IN10     IN10    1
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   10                EXSR R0200                      *INIT MSG.
     C  N10                EXSR R0100                      *INIT VALUE
     C*
     C                     MOVEL*BLANK    @PRT    1        *PRINT
  01-C           *IN03     DOUEQ'1'
    C           @PRT      OREQ 'Y'
    C                     EXSR R1000                      *SCRN
  01-C                     END
     C*
     C   03                MOVEL'1'       *INLR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ... SCREEN INIT VALUE SET
     C*==============================================================*
01===CSR         R0100     BEGSR
|    C*
|    C                     MOVEL'1'       *IN10
|    C                     MOVEL'1'       *IN27
|    C*
|    C                     IN   PTDA01
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $PFMT     P3104I  1
|    C                     PARM $PTYPE    P3105I  1
|    C           DDATE     PARM           P3101O  80
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     Z-ADD*ZERO     CKFLD   80
|    C                     Z-ADD*ZERO     D01S
|    C                     Z-ADD*ZERO     D01E
|    C                     MOVEL'1'       D02
|    C                     MOVEL*BLANK    D03S
|    C                     MOVEL*BLANK    D03E
|    C                     MOVEL'1'       D04
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ... INITIAL VALUE
     C*==============================================================*
02===CSR         R0200     BEGSR
|    C*
|    C                     MOVEL'1'       *IN27            報表格式MESSAGE
|    C                     MOVEL'1'       *IN99                           GE
|    C*
| 01-C           $PENV     IFEQ '0'                        INQUIRY
|   C                     MOVEL'UPT2142' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C*
| 02-C           $PENV     IFEQ '1'                        ON-LINE
|   C                     MOVEL'UPT2140' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|    C*
| 03-C           $PENV     IFEQ '2'                        BATCH
|   C                     MOVEL'UPT2110' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          R0300 ... DATE CHECK  (CALL 'P30')
     C*==============================================================*
02===CSR         R0300     BEGSR
|    C*
|    C                     CALL 'P30'
|    C                     PARM CKFLD     P3001I  80
|    C                     PARM $PFMT     P3002I  1
|    C                     PARM $PTYPE    P3003I  1
|    C                     PARM           P3011O  1
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0400 ... DATE TRANS  (CALL 'P31')
     C*==============================================================*
02===CSR         R0400     BEGSR
|    C*
|    C                     CALL 'P31'
|    C                     PARM CKFLD     P3101I  80
|    C                     PARM $PFMT     P3102I  1
|    C                     PARM $PTYPE    P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C                     PARM           P3111O  80
|    C*
|    C*
01===C                     ENDSR
     C*===============================================================*
     C*          R1000 ... SCREEN MAIN PROCESS
     C*===============================================================*
03===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 01-C           *IN04     IFEQ '1'
|    C                     EXSR R1E00                      .CHECK      ?
|   C                     GOTO E1000
| 01-C                     END
|    C*
|    C                     EXSR R1B00                      .CHECK      ?
|    C*
| 03-C           *IN14     IFEQ '1'
|   C           *IN99     ANDEQ'0'
|   C                     MOVEL'0'       *IN27
|   C                     MOVEL'1'       *IN28            .執行中
|   C                     WRITEDSPD1
|   C                     MOVEL'0'       *IN28
|   C*
|   C                     OUT  LDA
|   C                     MOVEL'Y'       @PRT
| 03-C                     END
|    C*
03===C           E1000     ENDSR
     C*===============================================================*
     C*          R1B00 ... CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
04===C           R1B00     BEGSR
|    C*
|    C*+<<DATA CHECK>>+++++++++++++++++++++++++++++++++++++++++++++++++
|    C*傳票日期　起
| 01-C           D01S      IFEQ *ZERO
|   C                     Z-ADD19120101  W01S
     C                     ELSE
     C                     Z-ADDD01S      CKFLD
     C                     EXSR R0300
     C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
     C                     SETON                     6099
     C                     ELSE
     C                     Z-ADDD01S      CKFLD
     C                     EXSR R0400
     C                     Z-ADDP3111O    W01S
| 01-C                     END
| 01-C                     END
|    C   99                GOTO E1B00
|    C*傳票日期　迄
| 02-C           D01E      IFEQ *ZERO
|   C                     Z-ADD99991231  W01E
     C                     ELSE
     C                     Z-ADDD01E      CKFLD
     C                     EXSR R0300
     C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
     C                     SETON                     6199
     C                     ELSE
     C                     Z-ADDD01E      CKFLD
     C                     EXSR R0400
     C                     Z-ADDP3111O    W01E
| 01-C                     END
| 01-C                     END
|    C   99                GOTO E1B00
|    C*傳票日期RANGE
| 03-C           W01S      IFGT W01E
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     MOVEL'1'       *IN60
|   C                     MOVEL'1'       *IN61
|   C                     MOVEL'1'       *IN99
| 03-C                     END
|    C   99                GOTO E1B00
     C*
|    C*傳票號碼　起
| 01-C           D03S      IFEQ *BLANK
|   C                     MOVEL*LOVAL    D03S
| 01-C                     END
|    C*傳票號碼　迄
| 02-C           D03E      IFEQ *BLANK
|   C                     MOVEL*HIVAL    D03E
| 02-C                     END
|    C*傳票號碼RANGE
| 03-C           D03S      IFGT D03E
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     MOVEL'1'       *IN62
|   C                     MOVEL'1'       *IN99
| 03-C                     END
|    C   99                GOTO E1B00
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* CHK FUN AUT
| 04-C           $PENV     IFNE '2'
|   C           $INQ      ANDNE'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     MOVEL'1'       *IN99
| 04-C                     END
|    C   99                GOTO E1B00
|    C*
04===CSR         E1B00     ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
     C           R1E00     BEGSR
     C*
     C           #CSR      DIV  256       #LIN             *LINE
     C                     MVR            #COL             *COLUMN
     C*印表機
     C           #LIN      IFEQ 20
     C           #COL      ANDGE36
     C           #COL      ANDLE37
     C                     CALL 'P64I'
     C           $PRTCD    PARM $PRTCD    P64II1  2
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
