     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : CKR4D0                                     *
     H*    PROGRAM NAME :銀行帳戶資料列印                          *
     H*    AUTHOR       : A1149   MAY                                *
     H*    CREATE DATE  : 1992.09.24                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :基本資料系統                              *
     H****************************************************************
     FCKHDLF01IP  E           K        DISK
     FCKHBLF01IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FCKR4D0P O   E             39     PRINTER
     E*---------------------------------------------------------------
     I* KEY BREAK DEFINE
     IHD0
     I                                              HD01  L1
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*
     I* LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      209 2160$C8YMD
     I                                      201 2080$A8YMD
     I                                      219 219 $PENV
     I                                      220 229 $PRTNM
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DHD01F
     I                                      505 506 DHD01T
     I                                      509 514 DHD04F
     I                                      515 520 DHD04T
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C           *LIKE     DEFN HD01      #B001I
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEYHB     KLIST
     C                     KFLD           HD03
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*+ LEVEL BREAK INIT PROCESS +++++++++++++++++++++++++++++++++++
     C   L1                EXSR R7100
     C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     C*
     C                     EXSR R2000
     C*
     C*+ LEVEL BREAK PROCESS ++++++++++++++++++++++++++++++++++++++++
     CL1 10                EXSR R8100
     CLR 10                EXSR R8900
     C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R1000 ... INITIAL PROCESS
     C*==============================================================*
01===C           R1000     BEGSR
  01-C*
    C                     SETON                     1039
|    C                     IN   PTDA01
|    C*
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $PFMT     P3104I  1
|    C                     PARM $PTYPE    P3105I  1
|    C           PDATE     PARM           P3101O  80
|    C*
  01-C*GET表頭公司別++++++++++++++++++++++++++++++++++++++++++++++++
     C                     CALL 'CKS#B0'
     C                     PARM HD01      #B001I
     C                     PARM           #B002O 16
     C           P#B03     PARM           #B003O 34
     C                     PARM           #B098O 50
     C                     PARM           #B099O  1
  01-C*
     C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
01===C           R2000     BEGSR
|    C*
  01-C*+<<DATA SET>>+++++++++++++++++++++++++++++++++++++++++++++++++++
     C                     MOVE *BLANKS   PHB02
|    C*
     C           KEYHB     CHAINHB0                  40
     C           *IN40     IFEQ '0'
     C                     MOVELHB02      PHB02
     C                     END
|    C*
     C                     MOVE *BLANKS   P#A03
     C                     MOVE *BLANKS   #A01
     C                     MOVEL*BLANKS   #A02
|    C*
     C                     MOVEL'ACCTYPE' #A01
     C                     MOVELHD05      #A02
     C           KEY#A     CHAIN#A0                  40
     C           *IN40     IFEQ '0'
     C                     CALL 'P65'
     C                     PARM #A03      P6501I 80
     C                     PARM 10        P6502I  30
     C           P#A03     PARM           P6511O 80
     C                     PARM           P6512O 80
     C                     END
|    C*
     C                     CALL 'P65'
     C                     PARM HD10      P6501I 80
     C                     PARM 29        P6502I  30
     C           PHD10     PARM           P6511O 80
     C                     PARM           P6512O 80
  01-C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  02-C           *IN39     IFEQ '1'
    C                     WRITEPH1
    C                     SETOF                     39
  02-C                     END
|    C*
     C                     WRITEPD1
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R7100 ... LEVEL BREAK 1 :INIT PROCESS
     C*==============================================================*
01===C           R7100     BEGSR
     C*
  01-C*GET表頭公司別++++++++++++++++++++++++++++++++++++++++++++++++
     C                     CALL 'CKS#B0'
     C                     PARM HD01      #B001I
     C                     PARM           #B002O 16
     C           P#B03     PARM           #B003O 34
     C                     PARM           #B098O 50
     C                     PARM           #B099O  1
  01-C*
     C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     C* << IF THIS KEY BREAK SKIP PAGE THEN SETON >>------------------
     C                     SETON                     39
     C*---------------------------------------------------------------
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R8100 ... LEVEL BREAK 1
     C*==============================================================*
01===C           R8100     BEGSR
     C*
     C  NLR                WRITEPT1
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR -- HAS DATA
     C*==============================================================*
01===C           R8900     BEGSR
     C*
     C                     WRITEPT1
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR -- NO DATA
     C*==============================================================*
01===C           R8999     BEGSR
     C*
     C                     MOVELDHD01F    HD01
     C                     EXSR R1000
     C*
     C                     WRITEPH1
     C*
     C                     WRITEPE9
     C*
     C                     ENDSR
