     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : CKR4C03                                    *
     H*    PROGRAM NAME :信封                                      *
     H*    AUTHOR       : A1150                                      *
     H*    CREATE DATE  : 81/10/07                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     H****************************************************************
     FCKHAPF  IP  E           K        DISK
     FCKHFLF04IF  E           K        DISK
     FCKR4C2P O   E             39     PRINTER
     E*---------------------------------------------------------------
     I* KEY BREAK DEFINE
     IHA0
     I                                              HA04  L1
     I                                              HA02  L1
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*
     I* LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      201 2080$A8YMD
     I                                      138 138 $INQ
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DHA02F
     I                                      505 506 DHA02T
     I                                      508 509 DHA23
     I                                      510 5170DHA06F
     I                                      518 5250DHA06T
     I*                                     526 530 DHA04F
     I*                                     532 536 DHA04T
     I                                      537 537 WKIND
     I                                      538 547 DHA04F
     I                                      548 557 DHA04T
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*
     C           *LIKE     DEFN HA02      #B001I
     C           *LIKE     DEFN HA02      #C001I
     C           *LIKE     DEFN HA04      #C002I
     C           *LIKE     DEFN HA02      #D001I
     C           *LIKE     DEFN HA04      #D002I
     C           *LIKE     DEFN HA02      #E001I
     C           *LIKE     DEFN HA13      #E002I
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYHF     KLIST
     C                     KFLD           HF03
     C                     KFLD           HF02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*+ LEVEL BREAK INIT PROCESS +++++++++++++++++++++++++++++++++++
     C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     C   L1                EXSR R7100
     C*+ LEVEL BREAK PROCESS ++++++++++++++++++++++++++++++++++++++++
     CL1 10                EXSR R8100
     C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R1000 ... INITIAL PROCESS
     C*==============================================================*
     C           R1000     BEGSR
     C*
     C                     SETON                     10
     C                     Z-ADD0         PNO
     C*
     C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
     C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     C                     ENDSR
     C*==============================================================*
     C*          R7100 ... LEVEL BREAK 1 :INIT PROCESS
     C*==============================================================*
     C           R7100     BEGSR
     C*
     C                     SETON                     39
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R8100 ... LEVEL BREAK 1 :INIT PROCESS
     C*==============================================================*
     C           R8100     BEGSR
     C*
     C                     SETOF                     39
     C*
     C                     ADD  1         PNO
     C*GET廠商++++++++++++++++++++++++++++++++++++++++++++++++
     C                     MOVEL*BLANK    W#D04  42
     C                     MOVEL*BLANK    W#D05  62
     C                     MOVEL*BLANK    P#D04
     C                     MOVEL*BLANK    P#D05S
     C                     MOVEL*BLANK    P#D05E
     C*廠商檔
     C           KEYHF     CHAINCKHFLF04             40
     C           *IN40     IFEQ '0'
     C                     MOVELHF77      W#D04
     C                     ELSE
     C                     CALL 'CKS#D0'
     C                     PARM HA02      #D001I
     C                     PARM HA04      #D002I
     C                     PARM           #D003O 10
     C           W#D04     PARM           #D004O 42
     C           W#D05     PARM           #D005O 62
     C                     PARM           #D098O 50
     C                     PARM           #D099O  1
     C                     END
     C*
     C                     CALL 'P65'
     C                     PARM W#D04     P6501I 80
     C                     PARM 32        P6502I  30
     C           P#D04     PARM           P6511O 80
     C                     PARM           P6512O 80
     C*
     C                     CALL 'P65'
     C                     PARM W#D05     P6501I 80
     C                     PARM 32        P6502I  30
     C           P#D05S    PARM           P6511O 80
     C           P#D05E    PARM           P6512O 80
     C*
     C                     WRITEPD2
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR -- NO DATA
     C*==============================================================*
     C           R8999     BEGSR
     C*
     C                     WRITEPE2
     C*
     C                     ENDSR
