     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     A*    PROGRAM-ID   : CKR4H0                                     *
     A*    PROGRAM NAME :支票登記簿                                *
     A*    AUTHOR       : A1149   MAY                                *
     A*    CREATE DATE  : 1993.11.22                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :票據系統                                  *
     H****************************************************************
     FPT#XPF  IF  E           K        DISK
     FCKR4H0F IP  E           K        DISK
     FCKR4H0P O   E             39     PRINTER
     E*---------------------------------------------------------------
     I* KEY BREAK DEFINE
     ICKR4H0R
     I                                              HA06  L1
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*
     I* LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      209 2160$C8YMD
     I                                      201 2080$A8YMD
     I                                      219 219 $PENV
     I                                      220 229 $PRTNM
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 5060DHA06F
     I                                      508 5130DHA06T
     I                                      515 5220WHA06F
     I                                      523 5300WHA06T
     I                                      531 5380WHF72
     I                                      539 5420DHF73S
     I                                      543 5460DHF73E
     I                                      547 5520DHF72
     I                                      553 554 DHF02F
     I                                      555 556 DHF02T
     I/COPY QRPGSRC,PT#XDS01
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEY#X     KLIST
     C                     KFLD           D#X03   2
     C                     KFLD           DHF02   2
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*+ LEVEL BREAK INIT PROCESS +++++++++++++++++++++++++++++++++++
     C   L1                EXSR R7100
     C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     C*
     C                     EXSR R2000
     C*
     C*+ LEVEL BREAK PROCESS ++++++++++++++++++++++++++++++++++++++++
     C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R1000 ... INITIAL PROCESS
     C*==============================================================*
01===C           R1000     BEGSR
  01-C*
    C                     SETON                     103931
|    C                     IN   PTDA01
|    C*
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $PFMT     P3104I  1
|    C                     PARM $PTYPE    P3105I  1
|    C           PDATE     PARM           P3101O  80
|    C*
     C                     MOVEL'CK'      D#X03
     C                     MOVELDHF02F    DHF02            *MAY UPD
     C           KEY#X     CHAIN#X0                  40
  01-C*
  01-C*GET表頭公司別++++++++++++++++++++++++++++++++++++++++++++++++
     C                     CALL 'CKS#B0'
     C                     PARM DHF02F    #B001I  2
     C                     PARM           #B002O 16
     C           P#B03     PARM           #B003O 34
     C                     PARM           #B098O 50
     C                     PARM           #B099O  1
  01-C*
     C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
01===C           R2000     BEGSR
|    C*
  01-C*+<<DATA SET>>+++++++++++++++++++++++++++++++++++++++++++++++++++
     C                     CALL 'P31'
     C                     PARM HA06      P3101I  80
     C                     PARM '2'       P3102I  1
     C                     PARM '1'       P3103I  1
     C                     PARM #X101     P3104I  1
     C                     PARM #X102     P3105I  1
     C           WHA06     PARM           P3101O  80
|    C*
     C                     CALL 'P31'
     C                     PARM HA07      P3101I  80
     C                     PARM '2'       P3102I  1
     C                     PARM '1'       P3103I  1
     C                     PARM #X101     P3104I  1
     C                     PARM #X102     P3105I  1
     C           WHA07     PARM           P3101O  80
     C*
     C*                    MOVE HA16      WHA16
     C*廠商檔
     C                     MOVELHF77      #D003O
     C           #D003O    IFEQ *BLANK
     C                     CALL 'CKS#D0'
     C                     PARM 'R1'      #D001I  2
     C                     PARM HA04      #D002I 10
     C                     PARM           #D003O 18
     C                     PARM           #D004O 42
     C                     PARM           #D005O 62
     C                     PARM           #D098O 50
     C                     PARM           #D099O  1
     C                     END
     C*廠商簡稱
     C                     CALL 'P65'
     C                     PARM #D003O    P6501I 80
     C                     PARM 10        P6502I  30
     C           HA04N     PARM           P6511O 80
     C                     PARM           P6512O 80
|    C*
  01-C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  02-C           *IN39     IFEQ '1'
    C                     WRITEPH1
    C                     SETOF                     39
  02-C                     END
|    C*
     C                     WRITEPD1
    C                     SETOF                     31
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R7100 ... LEVEL BREAK 1 :INIT PROCESS
     C*==============================================================*
01===C           R7100     BEGSR
     C*
  01-C*GET表頭公司別++++++++++++++++++++++++++++++++++++++++++++++++
  01-C*
     C                     SETON                     31
     C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR -- NO DATA
     C*==============================================================*
01===C           R8999     BEGSR
     C*
     C                     EXSR R1000
     C*
     C                     WRITEPH1
     C*
     C                     WRITEPE9
     C*
     C                     ENDSR
