     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     A*    PROGRAM-ID   : CKR4H0                                     *
     A*    PROGRAM NAME :支票登記簿                                *
     A*    AUTHOR       : A1149   MAY                                *
     A*    CREATE DATE  : 1993.11.22                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :票據系統                                  *
     H****************************************************************
     FPT#XPF  IF  E           K        DISK
     FCKR4H0D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      209 2160$C8YMD
     I                                      201 2080$A8YMD
     I                                      219 219 $PENV
     I                                      217 218 $PRTCD
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 5060DHA06F
     I                                      508 5130DHA06T
     I                                      515 5220WHA06F
     I                                      523 5300WHA06T
     I                                      531 5380WHF72
     I                                      539 5420DHF73S
     I                                      543 5460DHF73E
     I                                      547 5520DHF72
     I                                      553 554 DHF02F
     I                                      555 556 DHF02T
     I/COPY QRPGSRC,PT#XDS01
     C*=============================================================
     C*
     C           *LIKE     DEFN DHF02     #B001I
     C*=============================================================
     C*          KEY LIST
     C*=========================================================
     C           KEY#X     KLIST
     C                     KFLD           D#X03   2
     C                     KFLD           DHA02   2
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN10     PARM *IN10     IN10    1
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   10                EXSR R0200                      *INIT MSG.
     C  N10                EXSR R0100                      *INIT VALUE
     C*
     C                     MOVEL*BLANK    @PRT    1        *PRINT
  01-C           *IN03     DOUEQ'1'
    C           @PRT      OREQ 'Y'
    C                     EXSR R1000                      *SCRN
  01-C                     END
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===CSR         R0100     BEGSR
|    C*
|    C                     SETON                     1027
|    C                     IN   PTDA01
|    C*
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $PFMT     P3104I  1
|    C                     PARM $PTYPE    P3105I  1
|    C           DDATE     PARM           P3101O  80
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C                     Z-ADD*ZEROS    DHA06F
|    C                     Z-ADD*ZEROS    DHA06T
|    C                     Z-ADD*ZEROS    DHF72
|    C                     Z-ADD*ZEROS    DHF73S
|    C                     Z-ADD*ZEROS    DHF73E
|    C*
     C                     MOVEL$COR      DHF02
|    C*
     C*公司檔
     C                     CALL 'CKS#B0'
     C                     PARM DHF02     #B001I
     C           DHF02N    PARM           #B002O 16
     C                     PARM           #B003O 34
     C                     PARM           #B098O 50
     C                     PARM           #B099O  1
     C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ....INITIAL VALUE
     C*==============================================================*
02===CSR         R0200     BEGSR
|    C*
|    C                     SETON                     2799  報表格式MESSAGE
|    C*
| 01-C           $PENV     IFEQ '1'                        ON-LINE
|   C                     MOVEL'UPT2140' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C*
| 02-C           $PENV     IFEQ '2'                        BATCH
|   C                     MOVEL'UPT2110' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|    C*
02===C                     ENDSR
     C*===============================================================*
     C*          R1000  ...SCREEN MAIN PROCESS
     C*===============================================================*
03===C           R1000     BEGSR
|    C*
|    C* N99                SETON                     88
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
|   C                     EXSR R1E00                      .PROMPT
|   C                     GOTO E1000
| 02-C                     END
|    C*
|    C                     EXSR R1B00                      .CHECK      ?
|    C*
| 03-C           *IN99     IFEQ *ZERO
|   C                     SETOF                     27
|   C                     SETON                     28    .執行中
|   C                     WRITEDSPD1
|   C                     SETOF                     28
|   C*
|   C                     OUT  LDA
|   C                     MOVEL'Y'       @PRT
| 03-C                     END
|    C*
03===C           E1000     ENDSR
     C*===============================================================*
     C*          R1B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
04===C           R1B00     BEGSR
|    C*
|    C                     MOVE *BLANK    #X01
|    C                     MOVE *BLANK    #X02
|    C                     MOVEL'01'      #X01
| 01-C           DHF02     IFNE *BLANK
|   C                     MOVELDHF02     #X02
| 01*C                     ELSE
|   C                     MOVEL$COR      #X02
| 01-C                     END
|    C           KEY#X     CHAIN#X0                  40
|    C*
|    C*+<<DATA CHECK>>+++++++++++++++++++++++++++++++++++++++++++++++++
|    C                     MOVE *BLANK    DHF02N
|    C* CHK 公司別
| 03*C           DHF02     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C   99                GOTO E1B00
     C*
     C                     CALL 'CKS#B0'
     C                     PARM DHF02     #B001I
     C           DHF02N    PARM           #B002O 16
     C                     PARM           #B003O 34
     C                     PARM           #B098O 50
     C                     PARM           #B099O  1
     C           #B099O    IFNE 'Y'
     C                     MOVEL'UPT2010' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                     6199
     C                     END
     C   99                GOTO E1B00
     C*
     C                     MOVELDHF02     DHF02F
     C                     MOVELDHF02     DHF02T
|    C* CHK 收票日起
|    C                     Z-ADD0         WDATE   80
| 01-C           DHA06F    IFEQ *ZEROS
|   C                     Z-ADD0         DHA06F
|   C                     Z-ADD0         WHA06F  80
| 01*C                     ELSE
|   C                     Z-ADDDHA06F    WDATE
|   C                     CALL 'P30'
|   C                     PARM WDATE     P3001I  80
|   C                     PARM #X101     P3002I  1
|   C                     PARM #X102     P3003I  1
|   C                     PARM           P3011O  1
|   C*
| 02-C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 02-C                     END
|   C   99                GOTO E1B00
|   C*<DATE SCREEN-->FILE>
|   C                     CALL 'P31'
|   C                     PARM DHA06F    P3101I  80
|   C                     PARM #X101     P3102I  1
|   C                     PARM #X102     P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           WHA06F    PARM           P3101O  80
| 01-C                     END
|    C* CHK 收票日迄
|    C                     Z-ADD0         WDATE   80
| 03-C           DHA06T    IFEQ *ZEROS
|   C*                    Z-ADD9999999   DHA06T
|   C                     Z-ADD99999999  WHA06T  80
| 03*C                     ELSE
|   C                     Z-ADDDHA06T    WDATE
|   C                     CALL 'P30'
|   C                     PARM WDATE     P3001I  80
|   C                     PARM #X101     P3002I  1
|   C                     PARM #X102     P3003I  1
|   C                     PARM           P3011O  1
|   C*
| 04-C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 04-C                     END
|   C   99                GOTO E1B00
|   C*<DATE SCREEN-->FILE>
|   C                     CALL 'P31'
|   C                     PARM DHA06T    P3101I  80
|   C                     PARM #X101     P3102I  1
|   C                     PARM #X102     P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           WHA06T    PARM           P3101O  80
| 03-C                     END
|    C* CHK 收票日起迄
| 05-C           WHA06F    IFGT WHA06T
|   C                     MOVEL'UPT0041' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     616299
| 05-C                     END
|    C   99                GOTO E1B00
|    C* CHK 列印日
|    C                     Z-ADD0         WDATE   80
| 06-C           DHF72     IFEQ *ZEROS
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
|   C   99                GOTO E1B00
| 06*C                     ELSE
|   C                     Z-ADDDHF72     WDATE
|   C                     CALL 'P30'
|   C                     PARM WDATE     P3001I  80
|   C                     PARM #X101     P3002I  1
|   C                     PARM #X102     P3003I  1
|   C                     PARM           P3011O  1
|   C*
| 07-C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 07-C                     END
|   C*<DATE SCREEN-->FILE>
|   C                     CALL 'P31'
|   C                     PARM DHF72     P3101I  80
|   C                     PARM #X101     P3102I  1
|   C                     PARM #X102     P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           WHF72     PARM           P3101O  80
| 06-C                     END
|    C* CHK 序號起迄
     C           DHF73S    IFEQ *ZEROS
     C                     Z-ADD1         DHF73S
     C                     END
     C*
     C           DHF73E    IFEQ *ZEROS
     C                     Z-ADD9999      DHF73E
     C                     END
     C*
| 08-C           DHF73S    IFGT DHF73E
|   C                     MOVEL'UPT0041' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     646499
| 08-C                     END
|    C   99                GOTO E1B00
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* CHK FUN AUT
| 09-C           $PENV     IFNE '2'
|   C           $INQ      ANDNE'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 09-C                     END
|    C   99                GOTO E1B00
|    C*
04===CSR         E1B00     ENDSR
     C*
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
05===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*印表機
| 01-C           #LIN      IFEQ 20
|   C           #COL      ANDGE35
|   C           #COL      ANDLE36
|   C                     CALL 'P64I'
|   C           $PRTCD    PARM $PRTCD    P64II1  2
| 01-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
