     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : CKS#B0                                     *
     H*    PROGRAM NAME :票據系統介面副程式－公司檔                *
     H*    AUTHOR       : A1062   JEANNY                             *
     H*    CREATE DATE  : 82/02/15                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     H****************************************************************
     FPA#BPF  IF  E           K        DISK
     C*==============================================================*
     C*                    PARM LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           #B001I  2         公司代號
     C                     PARM           #B002O 16         公司名稱
     C                     PARM           #B003O 34         代碼說明
     C                     PARM           #B098O 50         備用欄
     C                     PARM           #B099O  1         存在否？
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEY#B     KLIST
     C                     KFLD           #B001I
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     MOVEL*BLANKS   #B002O
     C                     MOVEL*BLANKS   #B003O
     C                     MOVEL*BLANKS   #B098O
     C                     MOVEL*BLANKS   #B099O
     C*
     C           KEY#B     CHAIN#B0                  40    *NF
     C           *IN40     IFEQ '0'
     C                     MOVEL#B03      #B002O
     C                     MOVEL#B02      #B003O
     C                     MOVEL*BLANKS   #B098O
     C                     MOVEL'Y'       #B099O
     C                     END
     C*
     C                     SETON                     LR
