     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : CKS#C0                                     *
     H*    PROGRAM NAME :票據系統介面副程式－客戶檔                *
     H*    AUTHOR       : A1062   JEANNY                             *
     H*    CREATE DATE  : 82/02/15                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     H****************************************************************
     FMTMEPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     C*==============================================================*
     C*                    PARM LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           #C001I  2         公司代號
     C                     PARM           #C002I 10         客戶代號
     C                     PARM           #C003O 10         客戶簡稱
     C                     PARM           #C004O 42         客戶名稱
     C                     PARM           #C005O 10         業務人員
     C                     PARM           #C098O 50         備用欄
     C                     PARM           #C099O  1         存在否？
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN ME01      WME01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYME     KLIST
     C                     KFLD           WME01
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     MOVEL*BLANKS   #C003O
     C                     MOVEL*BLANKS   #C004O
     C                     MOVEL*BLANKS   #C005O
     C                     MOVEL*BLANKS   #C098O
     C                     MOVEL*BLANKS   #C099O
     C*
     C                     MOVEL#C002I    WME01
     C           KEYME     CHAINME0                  40    *NF
     C           *IN40     IFEQ '0'
     C*客戶簡稱
     C                     CALL 'P65'
     C                     PARM ME04      P6501I 80
     C                     PARM 10        P6502I  30
     C           #C003O    PARM           P6511O 80
     C                     PARM           P6512O 80
     C*客戶名稱
     C                     CALL 'P65'
     C                     PARM ME03      P6501I 80
     C                     PARM 42        P6502I  30
     C           #C004O    PARM           P6511O 80
     C                     PARM           P6512O 80
     C*業務員
     C                     MOVELME15      #C005O
     C                     MOVEL'Y'       #C099O
     C                     END
     C*
     C           ME15      CHAINMC0                  40    *NF
     C           *IN40     IFEQ '0'
     C                     MOVELMC03      #C098O           業務員組別
     C                     END
     C*
     C                     SETON                     LR
