     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : PTA#C0                                     *
     H*    PROGRAM NAME :客戶基本資料轉檔                          *
     H*    AUTHOR       : A1062     JEANNY                           *
     H*    CREATE DATE  : 82/02/24                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     F****************************************************************
     FXXXXXXXXIF  E           K        DISK
     FPT#CPF  O   E           K        DISK                      A
     FPT#FPF  O   E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      201 2080$A8YMD
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C           *LOVAL    SETLLXXXXXXXX
     C                     READ XXXXXXXX                 46
     C           *IN46     DOWEQ'0'
     C*PT#CPF
     C                     CALL P65
     C                     PARM XXXXXX    P6501I 80
     C                     PARM XXXXXX    P6502I  3
     C                     PARM           P6501O 80
     C           XXXXXX    PARM           P6502O 80
     C*
     C                     MOVELXXXXXX    #C01
     C                     MOVELXXXXXX    #C02
     C                     MOVELXXXXXX    #C03
     C                     MOVELXXXXXX    #C04
     C                     MOVELXXXXXX    #C05
     C                     MOVELXXXXXX    #C06
     C                     MOVELXXXXXX    #C07
     C                     MOVELXXXXXX    #C08
     C                     MOVELXXXXXX    #C09
     C                     MOVELXXXXXX    #C10
     C                     MOVELXXXXXX    #C11
     C                     MOVELXXXXXX    #C12
     C                     MOVELXXXXXX    #C13
     C                     MOVELXXXXXX    #C21
     C                     MOVELXXXXXX    #C22
     C                     MOVELXXXXXX    #C23
     C                     Z-ADD24        #C24
     C                     MOVELXXXXXX    #C90
     C                     TIME           #C97
     C                     Z-ADD$A8YMD    #C98
     C                     MOVEL$USER     #C99
     C                     WRITE#C0
     C*PT#FPF
     C                     MOVELXXXXXX    #F01
     C                     MOVELXXXXXX    #F02
     C                     Z-ADDXXXXXX    #F03
     C                     Z-ADDXXXXXX    #F04
     C                     Z-ADDXXXXXX    #F05
     C                     Z-ADDXXXXXX    #F06
     C                     TIME           #F97
     C                     Z-ADD$A8YMD    #F98
     C                     MOVEL$USER     #F99
     C                     WRITE#F0
     C*LOOP
     C                     READ XXXXXXXX                 46
     C                     END
     C*
     C                     SETON                     LR
