     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : PTA#E0                                     *
     H*    PROGRAM NAME :員工基本資料轉檔                          *
     H*    AUTHOR       : A1062     JEANNY                           *
     H*    CREATE DATE  : 82/02/24                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     F****************************************************************
     FXXXXXXXXIF  E           K        DISK
     FPT#EPF  O   E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      201 2080$A8YMD
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C           *LOVAL    SETLLXXXXXXXX
     C                     READ XXXXXXXX                 46
     C           *IN46     DOWEQ'0'
     C*PT#EPF
     C                     CALL P65
     C                     PARM XXXXXX    P6501I 80
     C                     PARM XXXXXX    P6502I  3
     C                     PARM           P6501O 80
     C           XXXXXX    PARM           P6502O 80
     C*
     C                     MOVELXXXXXX    #E01
     C                     MOVELXXXXXX    #E02
     C                     MOVELXXXXXX    #E03
     C                     MOVELXXXXXX    #E04
     C                     MOVELXXXXXX    #E05
     C                     MOVELXXXXXX    #E06
     C                     MOVELXXXXXX    #E07
     C                     Z-ADDXXXXXX    #E08
     C                     MOVELXXXXXX    #E09
     C                     MOVELXXXXXX    #E10
     C                     MOVELXXXXXX    #E11
     C                     MOVELXXXXXX    #E12
     C                     MOVELXXXXXX    #E13
     C                     MOVELXXXXXX    #E14
     C                     MOVELXXXXXX    #E90
     C                     TIME           #E97
     C                     Z-ADD$A8YMD    #E98
     C                     MOVEL$USER     #E99
     C                     WRITE#E0
     C*LOOP
     C                     READ XXXXXXXX                 46
     C                     END
     C*
     C                     SETON                     LR
