     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : PTA#D0                                     *
     H*    PROGRAM NAME :客戶基本資料轉檔                          *
     H*    AUTHOR       : A1062     JEANNY                           *
     H*    CREATE DATE  : 82/02/24                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     F****************************************************************
     FXXXXXXXXIF  E           K        DISK
     FPT#DPF  O   E           K        DISK                      A
     FPT#GPF  O   E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      201 2080$A8YMD
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C           *LOVAL    SETLLXXXXXXXX
     C                     READ XXXXXXXX                 46
     C           *IN46     DOWEQ'0'
     C*PT#DPF
     C                     CALL P65
     C                     PARM XXXXXX    P6501I 80
     C                     PARM XXXXXX    P6502I  3
     C                     PARM           P6501O 80
     C           XXXXXX    PARM           P6502O 80
     C*
     C                     MOVELXXXXXX    #D01
     C                     MOVELXXXXXX    #D02
     C                     MOVELXXXXXX    #D03
     C                     MOVELXXXXXX    #D04
     C                     MOVELXXXXXX    #D05
     C                     MOVELXXXXXX    #D06
     C                     MOVELXXXXXX    #D07
     C                     MOVELXXXXXX    #D08
     C                     MOVELXXXXXX    #D09
     C                     MOVELXXXXXX    #D10
     C                     MOVELXXXXXX    #D11
     C                     MOVELXXXXXX    #D12
     C                     MOVELXXXXXX    #D13
     C                     MOVELXXXXXX    #D90
     C                     TIME           #D97
     C                     Z-ADD$A8YMD    #D98
     C                     MOVEL$USER     #D99
     C                     WRITE#D0
     C*PT#GPF
     C                     MOVELXXXXXX    #G01
     C                     MOVELXXXXXX    #G02
     C                     Z-ADDXXXXXX    #G03
     C                     Z-ADDXXXXXX    #G04
     C                     Z-ADDXXXXXX    #G05
     C                     Z-ADDXXXXXX    #G06
     C                     TIME           #G97
     C                     Z-ADD$A8YMD    #G98
     C                     MOVEL$USER     #G99
     C                     WRITE#G0
     C*LOOP
     C                     READ XXXXXXXX                 46
     C                     END
     C*
     C                     SETON                     LR
