     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : CKS#D0                                     *
     H*    PROGRAM NAME :票據系統介面副程式－廠商檔                *
     H*    AUTHOR       : A1062   JEANNY                             *
     H*    CREATE DATE  : 82/02/15                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     H****************************************************************
     FMTMBPF  IF  E           K        DISK
     C*==============================================================*
     C*                    PARM LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           #D001I  2         公司代號
     C                     PARM           #D002I 10         廠商代號
     C                     PARM           #D003O 18         廠商簡稱
     C                     PARM           #D004O 42         廠商名稱
     C                     PARM           #D005O 62         廠商地址
     C                     PARM           #D098O 50         備用欄
     C                     PARM           #D099O  1         存在否？
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN MB01      WMB01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYMB     KLIST
     C                     KFLD           WMB01
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     MOVEL*BLANKS   #D003O
     C                     MOVEL*BLANKS   #D004O
     C                     MOVEL*BLANKS   #D005O
     C                     MOVEL*BLANKS   #D098O
     C                     MOVEL*BLANKS   #D099O
     C*
     C                     MOVEL#D002I    WMB01
     C           KEYMB     CHAINMB0                  40    *NF
     C           *IN40     IFEQ '0'
     C*廠商簡稱
     C*                    CALL 'P65'
     C*                    PARM MB03      P6501I 80
     C*                    PARM 10        P6502I  30
     C*          #D003O    PARM           P6511O 80
     C*                    PARM           P6512O 80
     C*
     C                     MOVELMB03      #D003O
     C                     MOVELMB02      #D004O
     C                     MOVELMB06      #D005O
     C                     MOVEL*BLANKS   #D098O
     C                     MOVEL'Y'       #D099O
     C                     END
     C*
     C                     SETON                     LR
