     FGLAHLF99IF  E           K        DISK
     FGLABPF  IF  E           K        DISK
     FGAWF04  UF  E           K        DISK                      A
      *
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYAH     KLIST
     C                     KFLD           DAH01   2
     C                     KFLD           DAH10   80
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     IN   PTDA01
     C           *LOVAL    SETLLAB0
     C                     READ AB0                      46
     C           *IN46     DOWEQ'0'
     C                     EXSR R1000
     C                     READ AB0                      46
     C                     END
     C*
     C           *LOVAL    SETLLAH0
     C                     READ AH0                      46
     C           *IN46     DOWEQ'0'
     C                     MOVELAH01      DAH01
     C                     Z-ADDAH10      DAH10
     C                     EXSR R2000
     C           KEYAH     SETGTAH0
     C                     READ AH0                      46
     C                     END
     C*
     C*
     C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     C                     SETON                     LR
     C*==============================================================*
     C*          R1000 ... GLABPF
     C*==============================================================*
     C           R1000     BEGSR
     C*
     C                     MOVELAB01      WF0401
     C                     MOVELAB02      WF0402
     C                     Z-ADD0         WF0403
     C                     Z-ADDAB03      WF0404
     C                     WRITEGLWF04R
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R2000 ... GLAHLF99
     C*==============================================================*
     C           R2000     BEGSR
     C*
     C           KEYAH     CHAINGLWF04R              40
     C                     MOVE AH02      WAH02   30
     C           *IN40     IFEQ '0'
     C           WAH02     IFEQ WF0404
     C                     DELETGLWF04R
     C                     ELSE
     C                     UPDATGLWF04R
     C                     END
     C                     ELSE
     C                     MOVELAH01      WF0401
     C                     MOVELAH10      WF0402
     C                     Z-ADDWAH02     WF0403
     C                     Z-ADD0         WF0404
     C                     WRITEGLWF04R
     C                     END
      *
     C                     ENDSR
