      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : GAR3041                                       *
      * AUTHER       : MERCURY                                       *
      * CREATE DATE  : 83/03/03                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :總帳系統                                     *
      * REMARK       :報表格式列印                                 *
      ****************************************************************
     FGLARPF  IP  E           K        DISK
     FGLASLF01IF  E           K        DISK
     FPT#BPF  IF  E           K        DISK
     F                                              KINFDS #FRCDF
     FGAR304P O   E             39     PRINTER
     E                    ARR1    7   7  2
     E                    ARR2    1   7 80
     IAR0
     I                                              AR03  L1
     I                                              AR02  L2
     I                                              AR01  L2
     I#FRCDF      DS
     I                                     *RECORD  RCDF
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      501 505 $WRHUS
     I                                      598 5990$PRTID
     I                                      601 602 DAR01S
     I                                      603 604 DAR01E
     I                                      605 606 DAR02S
     I                                      607 608 DAR02E
     I                                      609 611 DAR03S
     I                                      612 614 DAR03E
     I*
     C*================================================================
     C*                    KLIST
     C*================================================================
     C           KEYAS     KLIST
     C                     KFLD           AR01
     C                     KFLD           AR02
     C                     KFLD           AR03
     C*================================================================
     C*                    MAIN ROUTINE
     C*================================================================
  01-C           *IN10     IFEQ '0'                        *SET INIT
    C                     EXSR RTN010
  01*C                     ELSE
  02-C           *INL2     IFEQ '1'
    C                     WRITEPE1
    C                     EXSR RTN010
  02-C                     END
  01-C                     END
     C                     EXSR RTN100
     CL1 10                SETOF                     31
     CL1 10                SETON                     20
     CL2 10                SETOF                     31
     CLR                   EXSR RTN990
     C*================================================================
     C*          RTN010....SET INIT
     C*================================================================
01===C           RTN010    BEGSR
|    C*
     C                     MOVEL*BLANK    DESC
     C                     Z-ADD1         I       10
     C           AR02      LOKUPARR1,I                   40
     C           *IN40     IFEQ '1'
     C                     MOVELARR2,I    DESC
     C                     END
|    C********
|    C*公司
|    C********
|    C           AR01      CHAIN#B0                  40
|    C   40                MOVE *BLANK    #B02
|    C*
|    C                     WRITEPH1
|    C                     SETON                     10
01===C                     ENDSR
     C*================================================================
     C*          RTN100....PROC DATA
     C*================================================================
02===C           RTN100    BEGSR
|    C*
|    C           KEYAS     SETLLAS0
|    C           KEYAS     READEAS0                      46
| 01-C           *IN46     DOWEQ'0'
| 02-C           AS05      IFGT 0
|   C                     MOVE '+'       AS05P
| 02*C                     ELSE
| 03-C           AS05      IFLT 0
|   C                     MOVE '-'       AS05P
| 03*C                     ELSE
|   C                     MOVE *BLANK    AS05P
| 03-C                     END
| 02-C                     END
|   C   39                EXSR RTN900                     *PROC SKIP
|   C                     WRITEPD1
|   C                     SETOF                     20
|   C                     SETON                     31
|   C           KEYAS     READEAS0                      46
| 01-C                     END
|    C*
|    C*
02===C                     ENDSR
     C*==============================================================*
  ERRC*          RTN990....END
     C*==============================================================*
03===C           RTN990    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE3
| 01-C                     END
|    C                     WRITEPE2
|    C*
03===C                     ENDSR
     C*================================================================
     C*          RTN900....PROC SKIP
     C*================================================================
04===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     31
|    C*
04===C                     ENDSR
**
10112021304050
**
@S -空行   @R -基數   @- -虛線  @C -說明

@S -空行   @T -資產總額   @- -虛線   @C -說明
@S -空行   @T -負債權益   @- -虛線   @C -說明
@S -空行   @R -基數   @- -虛線   @= -雙虛線   @C -說明
@S -空行   @- -虛線   @= -雙虛線   @C -說明

