      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : GAR3021                                       *
      * AUTHER       : MERCURY                                       *
      * CREATE DATE  : 83/01/31                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :總帳系統                                     *
      * REMARK       :公司結構列印                                 *
      ****************************************************************
     FGLAWPF  IP  E           K        DISK
     FGLAXPF  IF  E           K        DISK
     FPT#BPF  IF  E           K        DISK
     F                                              KINFDS #FRCDF
     FGAR302P O   E             39     PRINTER
     IAW0
     I                                              AW01  L1
     I#FRCDF      DS
     I                                     *RECORD  RCDF
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      501 505 $WRHUS
     I                                      598 5990$PRTID
     I                                      601 602 DAW01S
     I                                      603 604 DAW01E
     I                                      605 616 #B02A
     I                                      617 628 #B02B
     I*
     C*================================================================
     C*                    KLIST
     C*================================================================
     C*================================================================
     C*                    MAIN ROUTINE
     C*================================================================
  01-C           *IN10     IFEQ '0'                        *SET INIT
    C                     EXSR RTN010
  01-C                     END
     C                     EXSR RTN100
     CL1 10                SETOF                     30
     CL1 10                SETON                     20
     CLR                   EXSR RTN990
     C*================================================================
     C*          RTN010....SET INIT
     C*================================================================
01===C           RTN010    BEGSR
|    C*
|    C********
|    C*公司別
|    C********
|    C           AW01      CHAIN#B0                  40
|    C   40                MOVE *BLANK    #B02
|    C                     WRITEPH1
|    C                     SETON                     10
01===C                     ENDSR
     C*================================================================
     C*          RTN100....PROC DATA
     C*================================================================
02===C           RTN100    BEGSR
|    C*
|    C           AW01      CHAIN#B0                  40
|    C  N40                MOVE #B02      #B02A
|    C   40                MOVE *BLANK    #B02A
|    C           AW01      SETLLAX0
|    C           AW01      READEAX0                      46
| 01-C           *IN46     DOWEQ'0'
|   C           AX02      CHAIN#B0                  40
|   C  N40                MOVE #B02      #B02B
|   C   40                MOVE *BLANK    #B02B
|   C*
|   C   39                EXSR RTN900                     *PROC SKIP
|   C                     WRITEPD1
|   C                     SETOF                     20
|   C                     SETON                     30
|   C           AW01      READEAX0                      46
| 01-C                     END
|    C*
|    C*
02===C                     ENDSR
     C*==============================================================*
  ERRC*          RTN990....END
     C*==============================================================*
04===C           RTN990    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE3
| 01-C                     END
|    C                     WRITEPE2
|    C*
04===C                     ENDSR
     C*================================================================
     C*          RTN900....PROC SKIP
     C*================================================================
03===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     SETOF                     20
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     30
|    C*
03===C                     ENDSR
