      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : GAR3031                                       *
      * AUTHER       : MERCURY                                       *
      * CREATE DATE  : 83/01/25                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :總帳系統                                     *
      * REMARK       :成本中心結構列印                             *
      ****************************************************************
     FGLAYPF  IP  E           K        DISK
     FGLAZPF  IF  E           K        DISK
     FPT#APF  IF  E           K        DISK
     FPT#BPF  IF  E           K        DISK
     F                                              KINFDS #FRCDF
     FGAR303P O   E             39     PRINTER
     IAY0
     I                                              AY02  L1
     I                                              AY01  L2
     I#FRCDF      DS
     I                                     *RECORD  RCDF
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      501 505 $WRHUS
     I                                      598 5990$PRTID
     I                                      601 602 DAY01S
     I                                      603 614 DAY01E
     I                                      605 611 DAY02S
     I                                      612 617 DAY02E
     I                                      618 631 #A02A
     I                                      632 645 #A02B
     I*
     C*================================================================
     C*                    KLIST
     C*================================================================
     C           KEYAZ     KLIST
     C                     KFLD           AY01
     C                     KFLD           AY02
     C*================================================================
     C*                    MAIN ROUTINE
     C*================================================================
  01-C           *IN10     IFEQ '0'                        *SET INIT
    C                     EXSR RTN010
  01*C                     ELSE
  02-C           *INL2     IFEQ '1'
    C                     WRITEPE1
    C                     EXSR RTN010
  02-C                     END
  01-C                     END
     C                     EXSR RTN100
     CL1 10                SETOF                     30
     CL1 10                SETON                     20
     CL2 10                SETOF                     3020
     CLR                   EXSR RTN990
     C*================================================================
     C*          RTN010....SET INIT
     C*================================================================
01===C           RTN010    BEGSR
|    C*
|    C********
|    C*公司別
|    C********
|    C           AY01      CHAIN#B0                  40
|    C   40                MOVE *BLANK    #B02
|    C                     WRITEPH1
|    C                     SETON                     10
01===C                     ENDSR
     C*================================================================
     C*          RTN100....PROC DATA
     C*================================================================
02===C           RTN100    BEGSR
|    C*
|    C           AY02      CHAIN#A0                  40
|    C  N40                MOVE #A02      #A02A
|    C   40                MOVE *BLANK    #A02A
|    C           KEYAZ     SETLLAZ0
|    C           KEYAZ     READEAZ0                      46
| 01-C           *IN46     DOWEQ'0'
|   C           AZ03      CHAIN#A0                  40
|   C  N40                MOVE #A02      #A02B
|   C   40                MOVE *BLANK    #A02B
|   C*
|   C   39                EXSR RTN900                     *PROC SKIP
|   C                     WRITEPD1
|   C                     SETOF                     20
|   C                     SETON                     30
|   C           KEYAZ     READEAZ0                      46
| 01-C                     END
|    C*
|    C*
02===C                     ENDSR
     C*==============================================================*
  ERRC*          RTN990....END
     C*==============================================================*
04===C           RTN990    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE3
| 01-C                     END
|    C                     WRITEPE2
|    C*
04===C                     ENDSR
     C*================================================================
     C*          RTN900....PROC SKIP
     C*================================================================
03===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     SETOF                     20
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     30
|    C*
03===C                     ENDSR
