     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : GLA310                                     *
     H*    PROGRAM NAME : 常用傳票設定                             *
     H*    AUTHOR       : A1087  JOYCE                               *
     H*    CREATE DATE  : 1992.10.30                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       : 泛太總帳                                 *
     F****************************************************************
     FGLA310D CF  E                    WORKSTN
     F                                        RRN   KSFILE SFLSR
     F                                        RRNC  KSFILE SFLSRC
     F                                        RRND  KSFILE SFLSRD
     C           1         CHAINSFLSRC               40
     C           *IN40     DSPLY
     C           1         CHAINSFLSRD               40
     C           *IN40     DSPLY
     C                     SETON                     LR
     C           R999      BEGSR
     C                     WRITESFLSR
     C                     EXFMTSFLCR
     C                     WRITESFLSRC
     C                     EXFMTSFLCRC
     C                     WRITESFLSRD
     C                     EXFMTSFLCRD
     C                     ENDSR
