     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : GLA360                                     *
     H*    PROGRAM NAME : 會計期間設定                             *
     H*    AUTHOR       : A1139 JANE                                 *
     H*    CREATE DATE  : NOV 02,92'                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       : 泛太總帳                                 *
     F****************************************************************
     FGLACPF  UF  E           K        DISK                      A
     FPT#BPF  IF  E           K        DISK
     FGLAKPF  IF  E           K        DISK
     FGLA360D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     E                    @A01        5  1               作業權利
     E*CHECK日期(A01-A14)--FOR CALL P30
     E                    SDA        14  7 0
     E*螢幕上之日期值
     E*拷貝時�虷~度�虴‘H�郱s增之年度�苭X現在螢幕上
     E                    S1         14  7 0
     E*(SCREEN-->FILE)
     E                    FILE       14  8 0
     E*(WORK-ARRAY)
     E                    WK         14  8 0
     E*(PPP-ARRAY)-FOR UOTPUT FIELD
     E                    PPP        13  7 0
     E*---------------------------------------------------------------*
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I*                                     211 2160DDATE
     I*DEFINE COPY KEY
     I            DS
     I                                        1   5 KACC
     I                                        1   2 DAC01C
     I                                        3   50DAC02C
     I*(SCREEN-->FILE)FOR UPDATE
     I            DS
     I                                        1 1120FILE
     I                                        1   80F01
     I                                        9  160F02
     I                                       17  240F03
     I                                       25  320F04
     I                                       33  400F05
     I                                       41  480F06
     I                                       49  560F07
     I                                       57  640F08
     I                                       65  720F09
     I                                       73  800F10
     I                                       81  880F11
     I                                       89  960F12
     I                                       97 1040F13
     I                                      105 1120F14
     I*DATE CHECK
     I            DS
     I                                        1  980SDA
     I                                        1   70A01
     I                                        8  140A02
     I                                       15  210A03
     I                                       22  280A04
     I                                       29  350A05
     I                                       36  420A06
     I                                       43  490A07
     I                                       50  560A08
     I                                       57  630A09
     I                                       64  700A10
     I                                       71  770A11
     I                                       78  840A12
     I                                       85  910A13
     I                                       92  980A14
     I            DS
     I                                        1   70W1
     I                                        1   30W2
     I                                        6   70W3
     I*螢幕上之日期
     I            DS
     I                                        1  980S1
     I                                        1   70D01S
     I                                        8  140D01E
     I                                       15  210D02E
     I                                       22  280D03E
     I                                       29  350D04E
     I                                       36  420D05E
     I                                       43  490D06E
     I                                       50  560D07E
     I                                       57  630D08E
     I                                       64  700D09E
     I                                       71  770D10E
     I                                       78  840D11E
     I                                       85  910D12E
     I                                       92  980D13E
     I*WORK ARRAY
     I            DS
     I                                        1 1120WK
     I                                        1   80W01S
     I                                        9  160W01E
     I                                       17  240W02E
     I                                       25  320W03E
     I                                       33  400W04E
     I                                       41  480W05E
     I                                       49  560W06E
     I                                       57  640W07E
     I                                       65  720W08E
     I                                       73  800W09E
     I                                       81  880W10E
     I                                       89  960W11E
     I                                       97 1040W12E
     I                                      105 1120W13E
     I*(ADD)-年度
     I            DS
     I                                        1   80YAC02
     I                                        1   40AC023
     I*(ADD & COPY)-年度
     I            DS
     I                                        1   80YAC02C
     I                                        1   40AC023C
     I* FOR UPDATE FILE-年度
     I            DS
     I                                        1   80XAC02
     I                                        1   40FAC02
     I*上一期迄是下一期起
     I            DS
     I                                        1  910PPP
     I                                        1   70D02S
     I                                        8  140D03S
     I                                       15  210D04S
     I                                       22  280D05S
     I                                       29  350D06S
     I                                       36  420D07S
     I                                       43  490D08S
     I                                       50  560D09S
     I                                       57  630D10S
     I                                       64  700D11S
     I                                       71  770D12S
     I                                       78  840D13S
     I                                       85  910D14S
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYAC     KLIST                           *MAIN FILE
     C                     KFLD           DAC01
     C                     KFLD           AC023
     C           KEYACC    KLIST                           *COPY REC.
     C                     KFLD           DAC01C
     C                     KFLD           AC023C
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
    C           SCID      CASEQ'SC02'    R2000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     MOVE 'SC01'    SCID    4
|    C*
     C                     IN   PTDA01
     C*
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
     C                     CALL 'P31'
     C                     PARM $A8YMD    P3101I  80
     C                     PARM '2'       P3102I  1
     C                     PARM '1'       P3103I  1
     C                     PARM $PFMT     P3104I  1
     C                     PARM $PTYPE    P3105I  1
     C           DDATE     PARM           P3101O  80
     C*
|    C* FUN AUT
|    C                     MOVE $ADD      @A01,1
|    C                     MOVE $UPD      @A01,2
|    C                     MOVE $DLT      @A01,4
|    C                     MOVE $INQ      @A01,5
|    C*
|    C* SC01 FIELD INITIALIZE *--------------------------------------*
|    C                     Z-ADD1         DOPT
|    C                     MOVEL*BLANK    DAC01
|    C                     Z-ADD0         DAC02
|    C                     MOVEL*BLANK    DAC01C
|    C                     Z-ADD0         DAC02C
|    C*--------------------------------------------------------------*
|    C                     Z-ADD0         PPP
|    C                     Z-ADD0         W1
|    C                     Z-ADD0         S1
|    C                     Z-ADD0         YAC02
|    C                     Z-ADD0         YAC02C
|    C                     Z-ADD0         XAC02
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E1000
| 01-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 02-C           *IN99     IFEQ '0'                        *SCR CHK OK
|   C                     EXSR R1C00                      *PRE-SC02
|   C                     MOVEL'SC02'    SCID
| 02-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1B00 .... 'SC01' SCREEN CHECK
     C*==============================================================*
03===C           R1B00     BEGSR
|    C*
|    C* CHK FUN AUT
| 01-C           @A01,DOPT IFNE 'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* DATA CHECK *--------------------------------------------------*
| 02-C           DAC01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*公司類別須もＥＱ1
| 03-C           DOPT      IFEQ 1
|   C           DAC01     CHAIN#B0                  40
| 04-C           *IN40     IFEQ '1'
|   C           #B12      ORNE '1'
|   C                     MOVEL'UGL0004' ERRID
|   C                     MOVEL'GLMF'    ERRF
|   C                     SETON                     6099
| 04-C                     END
|   C   99                GOTO E1B00
|   C*必存在GLAKPF中
|   C           DAC01     CHAINAK0                  41
| 05-C           *IN41     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 05-C                     END
|   C   99                GOTO E1B00
| 03-C                     END
|    C*
|    C*----------------------------------------------------------------
|    C*DATE TRANSFER
| 06-C           AK09      IFEQ '1'
|   C           AK11      ANDEQ'1'
|   C           AK09      OREQ '2'
|   C           AK11      ANDEQ'2'
|   C           DAC02     MULT 10000     TAC02   80
| 06*C                     ELSE
|   C                     Z-ADDDAC02     TAC02
| 06-C                     END
|    C                     CALL 'P31'
|    C                     PARM TAC02     P3101I  80
|    C                     PARM AK11      P3102I  1
|    C                     PARM AK09      P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           YAC02     PARM           P3111O  80
|    C*----------------------------------------------------------------
|    C           KEYAC     CHAINAC0                  40
|    C*
| 07-C           DOPT      IFEQ 1                          *ADD
|   C           *IN40     ANDEQ'0'
|   C                     MOVEL'UPT2020' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606199
| 07-C                     END
|    C   99                GOTO E1B00
|    C*
| 08-C           DOPT      IFNE 1                          *UPD,DEL,INQ
|   C           *IN40     ANDEQ'1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606199
| 08-C                     END
|    C   99                GOTO E1B00
|    C*
| 09-C           DOPT      IFEQ 1                          *ADD
|   C           DAC01C    ANDNE*BLANK                     *COPY
|   C           DOPT      OREQ 1
|   C           DAC02C    ANDNE0
|   C*----------------------------------------------------------------
|   C*DATE TRANSFER
|   C*依日期格式
|   C           DAC01C    CHAINAK0                  41
| 10-C           AK09      IFEQ '1'
|   C           AK11      ANDEQ'1'
|   C           AK09      OREQ '2'
|   C           AK11      ANDEQ'2'
|   C           DAC02C    MULT 10000     TAC02   80
| 10*C                     ELSE
|   C                     Z-ADDDAC02C    TAC02
| 10-C                     END
|   C*
|   C                     CALL 'P31'
|   C                     PARM TAC02     P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           YAC02C    PARM           P3111O  80
|   C*----------------------------------------------------------------
|   C           KEYACC    CHAINAC0                  40
| 11-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0060' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     626399
| 11-C                     END
| 09-C                     END
|    C   99                GOTO E1B00
|    C*
|    C           DAC01     CHAINAK0                  41
|    C*
03===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....INIT 'SC02'
     C*==============================================================*
04===C           R1C00     BEGSR
|    C*
| 01-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 2                          *UPD
|   C                     SETON                     31    *UL
| 02-C           AK10      IFEQ '1'
|   C                     SETOF                     32    *ND
| 02*C                     ELSE
|   C                     SETON                     32    *DISPLAY
| 02-C                     END
| 01*C                     ELSE                            *DEL, INQ
|   C                     SETOF                     31
| 03-C           AK10      IFEQ '1'
|   C                     SETOF                     32    *ND
| 03*C                     ELSE
|   C                     SETON                     32    *DISPLAY
| 03-C                     END
| 01-C                     END
|    C*
| 04-C           DOPT      IFEQ 1                          *ADD
|   C           DAC01C    ANDEQ*BLANK                     *NO COPY
|   C           DOPT      OREQ 1                          *ADD
|   C           DAC02C    ANDEQ0
|   C                     EXSR R1C10
| 04*C                     ELSE                            *U/D/I
|   C                     EXSR R1C20
| 04-C                     END
|    C*
|    C* RELEASE FILE (ADD & INQUIRY)----------------------------------*
| 05-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 5                          *INQ
|   C           *LOVAL    SETLLAC0
| 05-C                     END
|    C*---------------------------------------------------------------*
04===C                     ENDSR
     C*==============================================================*
     C*          R1C10 ....'SC02' FIELD INIT : ADD (NO COPY)
     C*==============================================================*
05===C           R1C10     BEGSR
|    C*
|    C                     Z-ADD0         S1
|    C                     Z-ADD0         PPP
|    C                     MOVEL*BLANK    DAC03
|    C                     MOVEL*BLANK    DAC04
|    C                     MOVEL*BLANK    DAC05
|    C                     MOVEL*BLANK    DAC06
|    C                     MOVEL*BLANK    DAC07
|    C                     MOVEL*BLANK    DAC08
|    C                     MOVEL*BLANK    DAC09
|    C                     MOVEL*BLANK    DAC10
|    C                     MOVEL*BLANK    DAC11
|    C                     MOVEL*BLANK    DAC12
|    C                     MOVEL*BLANK    DAC13
|    C                     MOVEL*BLANK    DAC14
|    C                     MOVEL*BLANK    DAC15
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*  R1C20 ....'SC02' FIELD INIT : UPD, DEL, INQ, (ADD & COPY)
     C*==============================================================*
06===C           R1C20     BEGSR
|    C*
|    C*(OPT ='2' '4' '5'時，帶代出檔案之日期）
|    C*將檔案之資料放入WORK-ARRAY(WK)
|    C                     Z-ADDAC03A     W01S
|    C                     Z-ADDAC03B     W01E
|    C                     MOVELAC03      DAC03
|    C                     Z-ADDAC04B     W02E
|    C                     MOVELAC04      DAC04
|    C                     Z-ADDAC05B     W03E
|    C                     MOVELAC05      DAC05
|    C                     Z-ADDAC06B     W04E
|    C                     MOVELAC06      DAC06
|    C                     Z-ADDAC07B     W05E
|    C                     MOVELAC07      DAC07
|    C                     Z-ADDAC08B     W06E
|    C                     MOVELAC08      DAC08
|    C                     Z-ADDAC09B     W07E
|    C                     MOVELAC09      DAC09
|    C                     Z-ADDAC10B     W08E
|    C                     MOVELAC10      DAC10
|    C                     Z-ADDAC11B     W09E
|    C                     MOVELAC11      DAC11
|    C                     Z-ADDAC12B     W10E
|    C                     MOVELAC12      DAC12
|    C                     Z-ADDAC13B     W11E
|    C                     MOVELAC13      DAC13
|    C                     Z-ADDAC14B     W12E
|    C                     MOVELAC14      DAC14
|    C                     Z-ADDAC15B     W13E
|    C                     MOVELAC15      DAC15
|    C*CALL P31(FILE-->SCREEN)
| 01-C           AK10      IFEQ '1'                        *12期
|   C                     MOVEL'Y'       DAC15
|   C                     Z-ADD13        XX
| 01*C                     ELSE
|   C                     Z-ADD14        XX
|   C                     Z-ADD0         D13E
|   C                     MOVEL*BLANK    DAC15
| 01-C                     END
|    C*
|    C                     Z-ADD0         FS      20
| 02-C                     DO   XX        FS
|   C                     CALL 'P31'
|   C                     PARM WK,FS     P3101I  80
|   C                     PARM '2'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM AK11      P3104I  1
|   C                     PARM AK09      P3105I  1
|   C           S1,FS     PARM           P3101O  80
| 02-C                     END
|    C****
|    C*@進行拷貝時必將�虷~度�迡壎N成�郱s增時之年度��
|    C*
| 03-C           DOPT      IFEQ 1                          *ADD & COPY
|   C                     Z-ADD0         PPP              *CLR OUT-FIELDS
| 04-C                     DO   XX        I       20
|   C                     Z-ADDS1,I      W1
|   C*
|   C*依日期格式替代年度
| 05-C           AK09      IFEQ '1'
|   C           AK11      ANDEQ'1'
|   C           AK09      OREQ '2'
|   C           AK11      ANDEQ'2'
|   C                     Z-ADDDAC02     W2
| 05*C                     ELSE
|   C                     Z-ADDDAC02     W3
| 05-C                     END
|   C*
|   C                     Z-ADDW1        S1,I
| 04-C                     END
| 03-C                     END
|    C*
|    C*MOVE TO OUTPUT FIELDS
|    C                     Z-ADDD01E      D02S
|    C                     Z-ADDD02E      D03S
|    C                     Z-ADDD03E      D04S
|    C                     Z-ADDD04E      D05S
|    C                     Z-ADDD05E      D06S
|    C                     Z-ADDD06E      D07S
|    C                     Z-ADDD07E      D08S
|    C                     Z-ADDD08E      D09S
|    C                     Z-ADDD09E      D10S
|    C                     Z-ADDD10E      D11S
|    C                     Z-ADDD11E      D12S
|    C                     Z-ADDD12E      D13S
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R2000 .... 'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
07===C           R2000     BEGSR
|    C*
|    C                     EXFMTDSPD2
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E2000
| 01-C                     END
|    C*
| 02-C           *IN12     IFEQ '1'                        *PREVIOUS
|   C* RELEAS FILE --------------------------------------------------*
|   C           *LOVAL    SETLLAC0
|   C*---------------------------------------------------------------*
|   C*                    Z-ADD0         PPP
|   C*                    Z-ADD0         S1
|   C                     MOVEL'SC01'    SCID
|   C                     GOTO E2000
| 02-C                     END
|    C*
| 03-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 2                          *UPD
|   C                     EXSR R2B00                      *SC02 CHK
| 03-C                     END
|    C*
| 04-C           *IN99     IFEQ '0'                        *CHK OK
|   C                     EXSR R2D00                      *FILE UPD
|   C                     MOVE 'SC01'    SCID
| 04-C                     END
|    C*
07===C           E2000     ENDSR
     C*==============================================================*
     C*          R2B00 ....'SC02' CHECK
     C*==============================================================*
08===C           R2B00     BEGSR
|    C*CALL P30 (SCREEN CHECK)
|    C*將螢幕日期放入ARRAY
|    C                     Z-ADDD01S      A01
|    C                     Z-ADDD01E      A02
|    C                     Z-ADDD02E      A03
|    C                     Z-ADDD03E      A04
|    C                     Z-ADDD04E      A05
|    C                     Z-ADDD05E      A06
|    C                     Z-ADDD06E      A07
|    C                     Z-ADDD07E      A08
|    C                     Z-ADDD08E      A09
|    C                     Z-ADDD09E      A10
|    C                     Z-ADDD10E      A11
|    C                     Z-ADDD11E      A12
|    C                     Z-ADDD12E      A13
|    C                     Z-ADDD13E      A14
|    C*
|    C                     Z-ADD0         K       20
|    C                     Z-ADD1         S       20
|    C                     Z-ADD2         K2      20
| 01-C           AK10      IFEQ '1'
|   C                     Z-ADD13        XX      20
| 01*C                     ELSE
|   C                     Z-ADD14        XX
| 01-C                     END
|    C*
| 02-C                     DO   XX        K
| 03-C           SDA,K     IFEQ 0
|   C           K         ADD  59        IN      20
|   C                     MOVE '1'       *IN,IN
|   C                     SETON                       99
|   C                     MOVEL'UPT0010' ERRID            *不可空白
|   C                     MOVEL'PTMF'    ERRF
| 03*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM SDA,K     P3001I  80
|   C                     PARM AK11      P3002I  1
|   C                     PARM AK09      P3003I  1
|   C                     PARM           P3011O  1
| 04-C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID            *日期錯誤
|   C                     MOVEL'PTMF'    ERRF
|   C           K         ADD  59        IN      20
|   C                     MOVE '1'       *IN,IN
|   C                     SETON                       99
| 04*C                     ELSE                            *CHECK OK!
| 05-C           K         IFLE 2
|   C*
|   C                     Z-ADD0         C01S    80
|   C                     Z-ADD0         C01E    80
|   C                     CALL 'P31'
|   C                     PARM D01S      P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           C01S      PARM           P3111O  80
|   C                     CALL 'P31'
|   C                     PARM D01E      P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           C01E      PARM           P3111O  80
| 06-C           C01S      IFGT C01E
|   C                     MOVEL'UPT1011' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606199
| 06*C                     ELSE
|   C                     Z-ADDD01E      D02S
| 06-C                     END
|   C*日期起迄值CHECK2
| 05*C                     ELSE
|   C                     CALL 'P31'
|   C                     PARM SDA,K     P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           C01S      PARM           P3111O  80
|   C                     CALL 'P31'
|   C                     PARM PPP,S     P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           C01E      PARM           P3111O  80
| 07-C           C01E      IFGT C01S
|   C                     MOVEL'UPT1011' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C           S         ADD  61        IN      20
|   C                     MOVE '1'       *IN,IN
|   C                     SETON                         99
| 07*C                     ELSE
|   C*上一期數之日期迄即是下一期數之日期起
|   C                     Z-ADDSDA,K     PPP,K2           *迄－＞起
|   C                     ADD  1         K2
|   C*                    ADD  1         K3
|   C                     ADD  1         S
| 07-C                     END
| 05-C                     END
| 04-C                     END
| 03-C                     END
| 02-C  N99                END
|    C   99                GOTO E2B00
|    C*
08===C           E2B00     ENDSR
     C*==============================================================*
     C*          R2D00 ....FILE PROCESS
     C*==============================================================*
09===C           R2D00     BEGSR
|    C*
| 01-C           DOPT      CASEQ1         R2D10
|   C           DOPT      CASEQ2         R2D20
|   C           DOPT      CASEQ4         R2D30
| 01-C                     END
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          R2D10 ....FILE PROCESS : ADD
     C*==============================================================*
10===C           R2D10     BEGSR
|    C*
|    C                     EXSR R2D11
|    C                     WRITEAC0
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          R2D11 ....SCREEN FIELD TO FILE
     C*==============================================================*
11===C           R2D11     BEGSR
|    C*@CALL P31(SCREEN--->FILE)
|    C*
| 01-C                     DO   XX        J       20
|   C                     CALL 'P31'
|   C                     PARM S1,J      P3101I  80       *AFTER DATE
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           FILE,J    PARM           P3111O  80
| 01-C                     END
|    C*
|    C                     MOVELDAC01     AC01
|    C*DATE TRANSFER
| 02-C           AK09      IFEQ '1'
|   C           AK11      ANDEQ'1'
|   C           AK09      OREQ '2'
|   C           AK11      ANDEQ'2'
|   C           DAC02     MULT 10000     TAC02   80
| 02*C                     ELSE
|   C                     Z-ADDDAC02     TAC02
| 02-C                     END
|    C                     CALL 'P31'
|    C                     PARM TAC02     P3101I  80
|    C                     PARM AK11      P3102I  1
|    C                     PARM AK09      P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           XAC02     PARM           P3111O  80
|    C                     Z-ADDFAC02     AC02
|    C*
|    C*MOVE FILE,X TO FILE
|    C                     Z-ADDF01       AC03A
|    C                     Z-ADDF02       AC03B
|    C                     Z-ADDF03       AC04B
|    C                     Z-ADDF04       AC05B
|    C                     Z-ADDF05       AC06B
|    C                     Z-ADDF06       AC07B
|    C                     Z-ADDF07       AC08B
|    C                     Z-ADDF08       AC09B
|    C                     Z-ADDF09       AC10B
|    C                     Z-ADDF10       AC11B
|    C                     Z-ADDF11       AC12B
|    C                     Z-ADDF12       AC13B
|    C                     Z-ADDF13       AC14B
| 03-C           XX        IFEQ 13
|   C                     Z-ADD0         AC15B
| 03*C                     ELSE
|   C                     Z-ADDF14       AC15B
| 03-C                     END
|    C*
| 04-C           DOPT      IFEQ 1
| 05-C           AK10      IFEQ '1'
|   C                     MOVEL'Y'       AC15
| 05*C                     ELSE
|   C                     MOVEL*BLANK    AC15
| 05-C                     END
| 04-C                     END
|    C*
|    C                     TIME           AC97
|    C                     Z-ADD$A8YMD    AC98
|    C                     MOVEL$USER     AC99
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          R2D20 ....FILE PROCESS : UPD
     C*==============================================================*
12===C           R2D20     BEGSR
|    C*
|    C                     EXSR R2D11
|    C                     UPDATAC0
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          R2D30 ....FILE PROCESS
     C*==============================================================*
13===C           R2D30     BEGSR
|    C*
|    C                     DELETAC0
|    C*
13===C                     ENDSR
     C*==============================================================*
