     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : GLA490                                     *
     H*    PROGRAM NAME :沖帳組合資料拷貝                          *
     H*    AUTHOR       : A1152 ANGY                                 *
     H*    CREATE DATE  : 81/10/30                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       : 泛太總帳                                 *
     F****************************************************************
     FGLAEPF  UF  E           K        DISK                      A
     FPT#BPF  IF  E           K        DISK
     FGLA490D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     E*                   @A01        5  1               作業權利
     E*---------------------------------------------------------------*
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I*WORK LOCAL DATA AREA
     I                                      501 502 WAE02F
     I                                      503 504 WAE02T
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*
     C           *LIKE     DEFN AE01      WAE01
     C           *LIKE     DEFN AE02      WAE02
     C           *LIKE     DEFN AE03      WAE03
     C           *LIKE     DEFN AE04      WAE04
     C           *LIKE     DEFN AE05      WAE05
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYAEF    KLIST                           *SETLL AE0
     C                     KFLD           DAE01F
     C                     KFLD           WAE02F
     C           KEYWAE    KLIST                           *NEXT REC SETLL
     C                     KFLD           WAE01
     C                     KFLD           WAE02
     C           KEYAET    KLIST                           *CHAIN AE0
     C                     KFLD           DAE01T
     C                     KFLD           AE02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     MOVE 'SC01'    SCID    4
|    C*
     C                     IN   PTDA01
     C*
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
     C                     CALL 'P31'
     C                     PARM $A8YMD    P3101I  80
     C                     PARM '2'       P3102I  1
     C                     PARM '1'       P3103I  1
     C                     PARM $PFMT     P3104I  1
     C                     PARM $PTYPE    P3105I  1
     C           DDATE     PARM           P3101O  80
     C*
     C* SC01 FIELD INITIALIZE *--------------------------------------*
     C*                    Z-ADD$C8YMD    DATE
|    C                     Z-ADD1         DOPT
|    C                     MOVEL*BLANK    DAE01F
|    C                     MOVEL*BLANK    DAE02F
|    C                     MOVEL*BLANK    DAE02T
|    C                     MOVEL*BLANK    DAE01T
|    C*--------------------------------------------------------------*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E1000
| 01-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 03-C           *IN99     IFEQ '0'                        *SCR CHK OK
|   C                     EXSR R1C00                      *拷貝選擇
| 03-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1B00 .... 'SC01' SCREEN CHECK
     C*==============================================================*
04===C           R1B00     BEGSR
|    C*
|    C* DATA CHECK *--------------------------------------------------*
|    C*
     C           DAE01F    IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 03-C                     END
|    C   99                GOTO E1B00
     C*
     C           DAE01F    CHAIN#B0                  40
     C           *IN40     IFEQ '1'
     C           #B12      ORNE '1'
|   C                     MOVEL'UGL0004' ERRID
|   C                     MOVEL'GLMF'    ERRF
|   C                     SETON                     6099
| 03-C                     END
|    C   99                GOTO E1B00
|    C*
     C*
     C           DAE02F    IFEQ *BLANK
     C                     MOVEL*LOVAL    WAE02F
     C                     ELSE
     C                     MOVELDAE02F    WAE02F
     C                     END
     C*
     C           DAE02T    IFEQ *BLANK
     C                     MOVE *ALL'9'   DAE02T
     C                     MOVEL*HIVAL    WAE02T
     C                     ELSE
     C                     MOVELDAE02T    WAE02T
     C                     END
     C*
|    C           WAE02F    IFGT WAE02T
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 03-C                     END
|    C   99                GOTO E1B00
     C*
     C           DAE01T    IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 03-C                     END
|    C   99                GOTO E1B00
     C*
     C           DAE01T    CHAIN#B0                  40
     C           *IN40     IFEQ '1'
     C           #B12      ORNE '1'
|   C                     MOVEL'UGL0004' ERRID
|   C                     MOVEL'GLMF'    ERRF
|   C                     SETON                     6299
| 03-C                     END
|    C   99                GOTO E1B00
|    C*
04===C           E1B00     ENDSR
     C*
     C*==============================================================*
     C*          R1C00 ....拷貝選擇
     C*==============================================================*
05===C           R1C00     BEGSR
|    C*
| 01-C           *IN14     IFEQ '1'                        拷貝作業
     C*
|   C           DOPT      CASEQ1         R1C10
|   C           DOPT      CASEQ2         R1C20
| 01*C           DOPT      CASEQ3         R1C30
|   C                     END
     C*
|   C                     MOVEL'UPT2142' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
     C*
| 01-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R1C10 ....不存在WRITE,存在　放棄拷貝
     C*==============================================================*
06===C           R1C10     BEGSR
|    C*
     C           KEYAEF    SETLLAE0
     C           DAE01F    READEAE0                      46
     C           *IN46     DOWEQ'0'
     C           AE02      ANDLEWAE02T
     C*
     C                     EXSR R1C11                      .KEEP DATA
     C*<至公司別是否存在>
|    C           KEYAET    CHAINAE0                  40
|    C           *IN40     IFEQ '1'
|    C                     EXSR R1D00                      拷貝
     C                     WRITEAE0
     C                     END
     C*<從自公司別NEXT REC FIND>
     C           KEYWAE    SETGTAE0
     C           WAE01     READEAE0                      46
     C                     END
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R1C11 ....KEEP DATA
     C*==============================================================*
06===C           R1C11     BEGSR
|    C*
|    C                     MOVELAE01      WAE01
|    C                     MOVELAE02      WAE02
|    C                     MOVELAE03      WAE03
|    C                     Z-ADDAE04      WAE04
|    C                     MOVELAE05      WAE05
     C*
     C                     ENDSR
     C*==============================================================*
     C*  R1C20 ....不存在WRITE,存在　覆蓋－無須確認
     C*==============================================================*
07===C           R1C20     BEGSR
|    C*
     C           KEYAEF    SETLLAE0
     C           DAE01F    READEAE0                      46
     C           *IN46     DOWEQ'0'
     C           AE02      ANDLEWAE02T
     C*
     C                     EXSR R1C11                      .KEEP DATA
     C*<至公司別是否存在>
|    C           KEYAET    CHAINAE0                  40
|    C           *IN40     IFEQ '1'
|    C                     EXSR R1D00                      拷貝
     C                     WRITEAE0
     C                     ELSE
     C                     EXSR R1D00                      拷貝
     C                     UPDATAE0
     C                     END
     C*<從自公司別NEXT REC FIND>
     C           KEYWAE    SETGTAE0
     C           WAE01     READEAE0                      46
     C                     END
     C*
07===C                     ENDSR
     C*==============================================================*
     C*  R1C30 ....不存在WRITE,存在　覆蓋－逐筆確認
     C*==============================================================*
07===C           R1C30     BEGSR
|    C*
     C           KEYAEF    SETLLAE0
     C           DAE01F    READEAE0                      46
     C           *IN46     DOWEQ'0'
     C           AE02      ANDLEWAE02T
     C*
     C                     EXSR R1C11                      .KEEP DATA
     C*<至公司別是否存在>
|    C           KEYAET    CHAINAE0                  40
|    C           *IN40     IFEQ '1'
     C                     EXSR R1D00                      拷貝
     C                     WRITEAE0
     C                     ELSE
     C                     EXSR R1C31                      逐筆確認
     C                     END
     C*<從自公司別NEXT REC FIND>
     C           KEYWAE    SETGTAE0
     C           WAE01     READEAE0                      46
     C                     END
     C*
07===C                     ENDSR
     C*==============================================================*
     C*          R1C31 ....逐筆確認是否拷貝PROCESS
     C*==============================================================*
12===C           R1C31     BEGSR
|    C*
     C                     MOVEL' '       COVE
     C                     MOVELAE02      DAE02
     C                     MOVELAE03      DAE03
|    C                     EXFMTDSPD2
     C           COVE      IFEQ 'Y'
     C                     EXSR R1D00                      拷貝
     C                     UPDATAE0
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R1D00 ....拷貝PROCESS
     C*==============================================================*
12===C           R1D00     BEGSR
|    C*
|    C                     MOVELDAE01T    AE01
|    C                     MOVELWAE02     AE02
|    C                     MOVELWAE03     AE03
|    C                     Z-ADDWAE04     AE04
|    C                     MOVELWAE05     AE05
|    C                     TIME           AE97
|    C                     Z-ADD$A8YMD    AE98
|    C                     MOVEL$USER     AE99
|    C*
12===C                     ENDSR
     C*==============================================================*
