     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : GLA660                                     *
     H*    PROGRAM NAME : 預算分攤比率碼維護                       *
     H*    AUTHOR       : A1139 JANE                                 *
     H*    CREATE DATE  : DEC 08,92'                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       : 泛太總帳                                 *
     F****************************************************************
     FGLA6PF  UF  E           K        DISK                      A
     FPT#BPF  IF  E           K        DISK
     FGLAKPF  IF  E           K        DISK
     FGLA660D CF  E                    WORKSTN
     E*---------------------------------------------------------------*
     E                    @A01        5  1               作業權利
     E*比率
     E                    @R01       13  7 4
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     I*DSPFDS      DS
     I*                                    B 370 3710#CSR
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I*DEFINE COPY KEY
     I            DS
     I                                        1   3 KA6C
     I                                        1   2 DA601C
     I                                        3   3 DA602C
     I*
     I            DS
     I                                        1  91 @R01
     I                                        1   74DA6041
     I                                        8  144DA6042
     I                                       15  214DA6043
     I                                       22  284DA6044
     I                                       29  354DA6045
     I                                       36  424DA6046
     I                                       43  494DA6047
     I                                       50  564DA6048
     I                                       57  634DA6049
     I                                       64  704DA604A
     I                                       71  774DA604B
     I                                       78  844DA604C
     I                                       85  914DA604D
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYA6     KLIST                           *MAIN FILE
     C                     KFLD           DA601
     C                     KFLD           DA602
     C           KEYA6C    KLIST                           *COPY REC.
     C                     KFLD           DA601C
     C                     KFLD           DA602C
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
    C           SCID      CASEQ'SC02'    R2000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     IN   PTDA01
|    C*
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $PFMT     P3104I  1
|    C                     PARM $PTYPE    P3105I  1
|    C           DDATE     PARM           P3101O  80
|    C                     MOVE 'SC01'    SCID    4
|    C* FUN AUT
|    C                     MOVE $ADD      @A01,1
|    C                     MOVE $UPD      @A01,2
|    C                     MOVE $DLT      @A01,4
|    C                     MOVE $INQ      @A01,5
|    C*
|    C* SC01 FIELD INITIALIZE *--------------------------------------*
|    C                     Z-ADD1         DOPT
|    C                     MOVEL*BLANK    DA601
|    C                     MOVEL*BLANK    DA602
|    C                     MOVEL*BLANK    DA601C
|    C                     MOVEL*BLANK    DA602C
|    C*--------------------------------------------------------------*
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*                    Z-ADD*ZERO     #LIN
|    C*                    Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN18     IFEQ '1'                        *BROWSE
|   C                     EXSR R1A00
|   C                     GOTO E1000
| 02-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 03-C           *IN99     IFEQ '0'                        *SCR CHK OK
|   C                     EXSR R1C00                      *PRE-SC02
|   C                     MOVEL'SC02'    SCID
| 03-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1A00 ....全頁查詢 (PF18 : CALL SUB-PROGRAM)
     C*==============================================================*
03===C           R1A00     BEGSR
|    C*
|    C* AUT CHECK
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM 'GLI660'  S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     99
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C   99                GOTO E1A00
|    C*
|    C* CALL SUB-PROGRAM
|    C                     CALL 'GLI660'
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C           DA601     PARM DA601     P660I1  2
|    C           DA602     PARM DA602     P660I2  1
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C                     PARM           @RTNC   2
|    C* RETURN CODE CHECK
| 02-C           @RTNC     IFEQ '03'                       *PF3
|   C                     SETON                     03
| 02-C                     END
|    C*
03===C           E1A00     ENDSR
     C*==============================================================*
     C*          R1B00 .... 'SC01' SCREEN CHECK
     C*==============================================================*
04===C           R1B00     BEGSR
|    C*
|    C* CHK FUN AUT
| 01-C           @A01,DOPT IFNE 'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* DATA CHECK *--------------------------------------------------*
| 02-C           DA601     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
| 03-C           DOPT      IFEQ 1
|   C*
|   C*公司類別須もＥＱ1
|   C           DA601     CHAIN#B0                  40
| 04-C           *IN40     IFEQ '1'
|   C           #B12      ORNE '1'
|   C                     MOVEL'UGL0004' ERRID
|   C                     MOVEL'GLMF'    ERRF
|   C                     SETON                     6099
| 04-C                     END
|   C   99                GOTO E1B00
|   C*
|   C           DA601     CHAINAK0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 05-C                     END
|   C   99                GOTO E1B00
| 03-C                     END
|    C*
| 06-C           DA602     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 06-C                     END
|    C   99                GOTO E1B00
|    C*
|    C           KEYA6     CHAINA60                  40
|    C*
| 07-C           DOPT      IFEQ 1                          *ADD
|   C           *IN40     ANDEQ'0'
|   C                     MOVEL'UPT2020' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606199
| 07-C                     END
|    C   99                GOTO E1B00
|    C*
| 08-C           DOPT      IFNE 1                          *UPD,DEL,INQ
|   C           *IN40     ANDEQ'1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     606199
| 08-C                     END
|    C   99                GOTO E1B00
|    C*
| 09-C           DOPT      IFEQ 1                          *ADD
|   C           KA6C      ANDNE*BLANK                     *COPY
|   C           KEYA6C    CHAINA60                  40
| 10-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0060' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     626399
| 10-C                     END
| 09-C                     END
|    C   99                GOTO E1B00
|    C*
04===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....INIT 'SC02'
     C*==============================================================*
05===C           R1C00     BEGSR
|    C*
| 01-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 2                          *UPD
|   C                     SETON                     31    *CAN INPUT
| 01*C                     ELSE                            *DEL, INQ
|   C                     SETOF                     31    *INP PROTECT
| 01-C                     END
|    C*十二月制：十三期間ND PR
|   C           DA601     CHAINAK0                  40
| 02-C           AK10      IFEQ '1'                        *ADD
|   C                     SETOF                     32    *INP PROTECT
| 02*C                     ELSE                            *DEL, INQ
|   C                     SETON                     32    *CAN INP
| 02-C                     END
|    C*
| 03-C           DOPT      IFEQ 1                          *ADD
|   C           KA6C      ANDEQ*BLANK                     *NO COPY
|   C                     EXSR R1C10
| 03*C                     ELSE                            *U/D/I
|   C                     EXSR R1C10
|   C                     EXSR R1C20
| 03-C                     END
|    C*
|    C* RELEASE FILE (ADD & INQUIRY)----------------------------------*
| 04-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 5                          *INQ
|   C           *LOVAL    SETLLA60
| 04-C                     END
|    C*---------------------------------------------------------------*
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R1C10 ....'SC02' FIELD INIT : ADD (NO COPY)
     C*==============================================================*
06===C           R1C10     BEGSR
|    C*
|    C                     MOVEL*BLANKS   DA603
|    C                     Z-ADD0         @R01
|    C                     Z-ADD0         TOTAL
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*  R1C20 ....'SC02' FIELD INIT : UPD, DEL, INQ, (ADD & COPY)
     C*==============================================================*
07===C           R1C20     BEGSR
|    C*
|    C*FILE-->SCREEN
|    C                     MOVELA603      DA603
|    C                     Z-ADDA6041     DA6041
|    C                     Z-ADDA6042     DA6042
|    C                     Z-ADDA6043     DA6043
|    C                     Z-ADDA6044     DA6044
|    C                     Z-ADDA6045     DA6045
|    C                     Z-ADDA6046     DA6046
|    C                     Z-ADDA6047     DA6047
|    C                     Z-ADDA6048     DA6048
|    C                     Z-ADDA6049     DA6049
|    C                     Z-ADDA604A     DA604A
|    C                     Z-ADDA604B     DA604B
|    C                     Z-ADDA604C     DA604C
|    C*AK10='1'表十二個月
|    C           DA601     CHAINAK0                  40
| 01-C           *IN40     IFEQ '0'
| 02-C           AK10      IFEQ '1'
|   C                     Z-ADD0         DA604D
| 02*C                     ELSE
|   C                     Z-ADDA604D     DA604D
| 02-C                     END
| 01-C                     END
|    C*
|    C*合計
|    C                     Z-ADD0         P       20
| 03-C                     DO   13        P
|   C                     ADD  @R01,P    TOTAL
| 03-C                     END
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          R2000 .... 'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
08===C           R2000     BEGSR
|    C*
|    C                     EXFMTDSPD2
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E2000
| 01-C                     END
|    C*
| 02-C           *IN12     IFEQ '1'                        *PREVIOUS
|   C* RELEAS FILE --------------------------------------------------*
|   C           *LOVAL    SETLLA60
|   C*---------------------------------------------------------------*
|   C                     MOVEL'SC01'    SCID
|   C                     GOTO E2000
| 02-C                     END
|    C*
| 03-C           DOPT      IFEQ 1                          *ADD
|   C           DOPT      OREQ 2                          *UPD
|   C                     EXSR R2B00                      *SC02 CHK
| 03-C                     END
|    C*
| 04-C           *IN05     IFEQ '1'                        *CHECK ONLY
|   C                     GOTO E2000
| 04-C                     END
|    C*
| 05-C           *IN99     IFEQ '0'                        *CHK OK
|   C                     EXSR R2D00                      *FILE UPD
|   C                     MOVE 'SC01'    SCID
| 05-C                     END
|    C*
08===C           E2000     ENDSR
     C*==============================================================*
     C*          R2B00 ....'SC02' CHECK
     C*==============================================================*
09===C           R2B00     BEGSR
|    C*
|    C                     Z-ADD0         TOTAL
|    C*合計
|    C                     Z-ADD0         P       20
| 01-C                     DO   13        P
|   C                     ADD  @R01,P    TOTAL
| 01-C                     END
|    C*
| 02-C           TOTAL     IFNE 100
|   C                     MOVEL'UGL0035' ERRID
|   C                     MOVEL'GLMF'    ERRF
|   C                     SETON                       99
| 02-C                     END
|    C   99                GOTO E2B00
|    C*
09===C           E2B00     ENDSR
     C*==============================================================*
     C*          R2D00 ....FILE PROCESS
     C*==============================================================*
10===C           R2D00     BEGSR
|    C*
| 01-C           DOPT      CASEQ1         R2D10
|   C           DOPT      CASEQ2         R2D20
|   C           DOPT      CASEQ4         R2D30
| 01-C                     END
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          R2D10 ....FILE PROCESS : ADD
     C*==============================================================*
11===C           R2D10     BEGSR
|    C*
|    C                     EXSR R2D11
|    C                     WRITEA60
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          R2D11 ....SCREEN FIELD TO FILE
     C*==============================================================*
12===C           R2D11     BEGSR
|    C*
|    C                     MOVELDA601     A601
|    C                     MOVELDA602     A602
|    C                     MOVELDA603     A603
|    C                     Z-ADDDA6041    A6041
|    C                     Z-ADDDA6042    A6042
|    C                     Z-ADDDA6043    A6043
|    C                     Z-ADDDA6044    A6044
|    C                     Z-ADDDA6045    A6045
|    C                     Z-ADDDA6046    A6046
|    C                     Z-ADDDA6047    A6047
|    C                     Z-ADDDA6048    A6048
|    C                     Z-ADDDA6049    A6049
|    C                     Z-ADDDA604A    A604A
|    C                     Z-ADDDA604B    A604B
|    C                     Z-ADDDA604C    A604C
|    C                     Z-ADDDA604D    A604D
|    C*
|    C                     TIME           A697
|    C                     Z-ADD$A8YMD    A698
|    C                     MOVEL$USER     A699
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          R2D20 ....FILE PROCESS : UPD
     C*==============================================================*
13===C           R2D20     BEGSR
|    C*
|    C                     EXSR R2D11
|    C                     UPDATA60
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          R2D30 ....FILE PROCESS
     C*==============================================================*
14===C           R2D30     BEGSR
|    C*
|    C                     DELETA60
|    C*
14===C                     ENDSR
     C*==============================================================*
