     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : GLR1N0                                     *
     H*    PROGRAM NAME :傳票核對表　　　                          *
     H*    AUTHOR       : TINA                                       *
     H*    CREATE DATE  : 83/07/25                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     H****************************************************************
     FGLAKPF  IF  E           K        DISK
     FPT#YPF  IF  E           K        DISK
     FGLR1N0D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     ICHKPGM      DS
     I                                        1   2 WAK01
     I                                        3  22 WPARM1
     I                                       23  32 WPARM2
     I                                       33  33 WCHK
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DA701
     I                                      503 514 DA705F
     I                                      515 526 DA705T
     I                                      527 535 DA702F
     I                                      536 544 DA702T
     I                                      550 550 CKA705
     I                                      551 551 DSEL
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYAK     KLIST
     C                     KFLD           DA701            *公司別
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN10     PARM *IN10     IN10    1
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   10                EXSR R0200                      *INIT MSG.
     C  N10                EXSR R0100                      *INIT VALUE
     C*
     C                     MOVEL*BLANK    @PRT    1        *PRINT
  01-C           *IN03     DOUEQ'1'
    C           @PRT      OREQ 'Y'
    C                     EXSR R1000                      *SCRN
  01-C                     END
|    C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===CSR         R0100     BEGSR
|    C*
|    C                     SETON                     1027
|    C*
|    C                     IN   PTDA01
|    C*
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $PFMT     P3104I  1
|    C                     PARM $PTYPE    P3105I  1
|    C           DDATE     PARM           P3101O  80
|    C*
|    C                     MOVEL*BLANK    DA701
|    C                     MOVEL*BLANK    DA702F
|    C                     MOVEL*BLANK    DA702T
|    C                     MOVEL*BLANK    DA705F
|    C                     MOVEL*BLANK    DA705T
|    C                     MOVEL'A'       DSEL
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*經手人HIGH LIGHT
|    C                     MOVEL'A705'    #Y01
|    C           #Y01      CHAIN#Y0                  45
| 02-C           *IN45     IFEQ '0'
|   C                     MOVEL'1'       CKA705  1
|   C                     SETOF                     50
| 02*C                     ELSE
|   C                     MOVEL'0'       CKA705
|   C                     SETON                     50
| 02-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ....INITIAL VALUE
     C*==============================================================*
02===CSR         R0200     BEGSR
|    C*
|    C                     SETON                     2799  報表格式MESSAGE
|    C*
| 01-C           $PENV     IFEQ '0'                        INQUIRY
|   C                     MOVEL'UPT2142' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C*
| 02-C           $PENV     IFEQ '1'                        ON-LINE
|   C                     MOVEL'UPT2140' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|    C*
| 03-C           $PENV     IFEQ '2'                        BATCH
|   C                     MOVEL'UPT2110' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C*
02===C                     ENDSR
     C*===============================================================*
     C*          R1000  ...SCREEN MAIN PROCESS
     C*===============================================================*
03===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
|   C                     EXSR R1E00                      .PROMPT
|   C                     GOTO E1000
| 02-C                     END
|    C*
|    C                     EXSR R1B00                      .CHECK      ?
|    C*
| 03-C           *IN14     IFEQ '1'
|   C           *IN99     ANDEQ*ZERO
|   C                     SETOF                     27
|   C                     SETON                     28    .執行中
|   C                     WRITEDSPD1
|   C                     SETOF                     28
|   C*
|   C                     OUT  LDA
|   C                     MOVEL'Y'       @PRT
| 03-C                     END
|    C*
03===C           E1000     ENDSR
     C*===============================================================*
     C*          R1B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
04===C           R1B00     BEGSR
|    C*
|    C*+<<DATA CHECK>>+++++++++++++++++++++++++++++++++++++++++++++++++
|    C*公司別------
| 01-C           DA701     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
|    C           KEYAK     CHAINAK0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 02-C                     END
|    C   99                GOTO E1B00
|    C*經手人----------
| 03-C           DA705F    IFEQ *BLANK
|   C                     MOVEL*LOVAL    DA705F
| 03-C                     END
|    C*
| 04-C           DA705T    IFEQ *BLANK
|   C                     MOVEL*HIVAL    DA705T
| 04-C                     END
|    C*
| 05-C           DA705F    IFGT DA705T
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                       6299
| 05-C                     END
|    C   99                GOTO E1B00
|    C*傳票號碼----------
| 06-C           DA702F    IFEQ *BLANK
|   C                     MOVEL*LOVAL    DA702F
| 06-C                     END
|    C*
| 07-C           DA702T    IFEQ *BLANK
|   C                     MOVEL*HIVAL    DA702T
| 07-C                     END
|    C*
| 08-C           DA702F    IFGT DA702T
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                       6699
| 08-C                     END
|    C   99                GOTO E1B00
|    C*列印內容------
| 01-C           DA701     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* CHK FUN AUT
| 09-C           $PENV     IFNE '2'
|   C           $INQ      ANDNE'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 09-C                     END
|    C   99                GOTO E1B00
|    C*
04===CSR         E1B00     ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
05===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C                     MOVE '1'       WCHK
|    C*經手人
| 01-C           CKA705    IFEQ '1'
|   C                     MOVE DA701     WAK01
| 02-C           #LIN      IFEQ 7
|   C           #COL      ANDGE39
|   C           #COL      ANDLE50
|   C                     MOVE DA705F    WPARM1
|   C                     MOVE *BLANK    WPARM2
|   C                     CALL #Y02
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C                     PARM           DESC   20
| 03-C           TORN      IFEQ 'Y'
|   C                     MOVELWPARM1    DA705F
| 03-C                     END
| 02-C                     END
| 04-C           #LIN      IFEQ 7
|   C           #COL      ANDGE55
|   C           #COL      ANDLE66
|   C                     MOVE DA705F    WPARM1
|   C                     MOVE *BLANK    WPARM2
|   C                     CALL #Y02
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C                     PARM           DESC
| 05-C           TORN      IFEQ 'Y'
|   C                     MOVELWPARM1    DA705T
| 05-C                     END
| 04-C                     END
| 01-C                     END
|    C*印表機
| 06-C           #LIN      IFEQ 17
|   C           #COL      ANDGE39
|   C           #COL      ANDLE40
|   C                     CALL 'P64I'
|   C           $PRTCD    PARM $PRTCD    P64II1  2
| 06-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
