     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : GLR2M0                                     *
     H*    PROGRAM NAME : 明細帳列印－科目                         *
     H*    AUTHOR       : A1087  JOYCE                               *
     H*    CREATE DATE  : 1992.11.26                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       : 泛太總帳                                 *
     H****************************************************************
     FGLAAPF  IF  E           K        DISK
     FGLAFPF  IF  E           K        DISK
     FGLAKPF  IF  E           K        DISK
     FPT#BPF  IF  E           K        DISK
     FGLR2M0D CF  E                    WORKSTN      KINFDS DSPFDS
     E*
     E*排序
     E                    W01         5  1 0
     E                    W011        5  1 0D            *SORT
     E*輸入欄位代碼
     E                    W02         5  2
     E*輸入欄位名稱
     E                    W03         5 20
     E*檢核程式名稱
     E                    W04         5 10
     E*輸入欄位內容－起
     E                    W05         4 20
     E*輸入欄位內容－訖
     E                    W06         4 20
     E*小計碼－螢幕
     E                    W07         5  1
     E*小計碼－ＢＹ排序
     E                    W08         5  1
     E*傳入參數名稱
     E                    W09         7 10
     E*輸入欄位之控制碼
     E                    W10         7  1
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DAH01
     I                                      503 510 DAH04
     I                                      511 520 DAH26F
     I                                      521 530 DAH26T
     I                                      531 5370DAH10S
     I                                      538 5440DAH10E
     I                                      545 5520DAH10F
     I                                      553 5600DAH10T
     I                                      561 5670DAH25S
     I                                      568 5740DAH25E
     I                                      575 5820DAH25F
     I                                      583 5900DAH25T
     I**
     I                                      592 671 W05
     I                                      592 611 DAH05S
     I                                      612 631 DAH06S
     I                                      632 651 DAH07S
     I                                      652 671 DAH08S
     I                                      672 6790DAH09F
     I**
     I                                      680 759 W06
     I                                      680 699 DAH05E
     I                                      700 719 DAH06E
     I                                      720 739 DAH07E
     I                                      740 759 DAH08E
     I                                      760 7670DAH09T
     I**
     I                                      768 7720W01
     I                                      768 7680DS1
     I                                      769 7690DS2
     I                                      770 7700DS3
     I                                      771 7710DS4
     I                                      772 7720DS5
     I**
     I                                      773 777 W08
     I                                      778 778 DK
     I                                      779 779 DJ
     I                                      780 7922WDJS
     I                                      793 8052WDJE
     I                                      806 8182WCJS
     I                                      819 8312WCJE
     I                                      852 901 W04
     I*檢核程式之參數
     ICHKPGM      DS
     I                                        1   2 WAK01
     I                                        3  22 WPARM1
     I                                       23  32 WPARM2
     I                                       33  33 WCHK
     I            DS
     I                                        1   5 W07
     I                                        1   1 DL1
     I                                        2   2 DL2
     I                                        3   3 DL3
     I                                        4   4 DL4
     I                                        5   5 DL5
     I            DS
     I                                        1 100 W03
     I                                        1  20 DAA031
     I                                       21  40 DAA032
     I                                       41  60 DAA033
     I                                       61  80 DAA034
     I                                       81 100 DAA035
     I            DS
     I                                        1   50WAF19
     I                                        1   10AF191
     I                                        2   20AF192
     I                                        3   30AF193
     I                                        4   40AF194
     I                                        5   50AF195
     I            DS
     I                                        1   5 WAF20
     I                                        1   1 AF201
     I                                        2   2 AF202
     I                                        3   3 AF203
     I                                        4   4 AF204
     I                                        5   5 AF205
     I            DS
     I                                        1   7 W10
     I                                        1   7 AF18
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN10     PARM *IN10     IN10    1
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYAF     KLIST
     C                     KFLD           DAH01
     C                     KFLD           DAH04
     C           KEYAA     KLIST
     C                     KFLD           DAH01
     C                     KFLD           W02,WI
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   10                EXSR R0200                      *INIT MSG.
     C  N10                EXSR R0100                      *INIT VALUE
     C*
     C                     MOVEL*BLANK    @PRT    1        *PRINT
     C*
  01-C           *IN03     DOUEQ'1'
    C           @PRT      OREQ 'Y'
  02-C           SCID      CASEQ'SC01'    R1000
    C           SCID      CASEQ'SC02'    R2000
  02-C                     END
  01-C                     END
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===CSR         R0100     BEGSR
|    C*
|    C                     SETON                     1027
|    C*
|    C                     IN   PTDA01
|    C*
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $PFMT     P3104I  1
|    C                     PARM $PTYPE    P3105I  1
|    C           DDATE     PARM           P3101O  80
|    C*
|    C                     MOVE 'SC01'    SCID    4
|    C                     MOVE *BLANK    DAH01
|    C                     MOVE *BLANK    DAH04
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ....INITIAL VALUE
     C*==============================================================*
02===CSR         R0200     BEGSR
|    C*
|    C                     SETON                     2799  報表格式MESSAGE
|    C*
| 01-C           $PENV     IFEQ '0'                        INQUIRY
|   C                     MOVEL'UPT2142' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C*
| 02-C           $PENV     IFEQ '1'                        ON-LINE
|   C                     MOVEL'UPT2140' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|    C*
| 03-C           $PENV     IFEQ '2'                        BATCH
|   C                     MOVEL'UPT2110' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C*
02===C                     ENDSR
     C*===============================================================*
     C*          R1000  ...SCREEN MAIN PROCESS
     C*===============================================================*
03===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
|   C                     EXSR R1E00                      .PROMPT
|   C                     GOTO E1000
| 02-C                     END
|    C*
|    C                     EXSR R1B00                      .CHECK      ?
|    C*
| 03-C           *IN99     IFEQ '0'
|   C                     EXSR R1C00
|   C                     MOVE 'SC02'    SCID
| 03-C                     END
|    C*
03===C           E1000     ENDSR
     C*===============================================================*
     C*          R1B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
04===C           R1B00     BEGSR
|    C*
|    C*+<<DATA CHECK>>+++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
| 01-C           DAH01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO E1B00
|    C**
|    C* CHK 公司別須存在公司檔(PT#BPF)
|    C**
|    C           DAH01     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C   99                GOTO E1B00
|    C**
|    C* CHK 公司別須存在總帳控制檔(GLAKPF)
|    C**
|    C           DAH01     CHAINAK0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 03-C                     END
|    C   99                GOTO E1B00
|    C***
|    C* CHK會計科目
|    C***
|    C                     MOVE *BLANK    DAF03
| 04-C           DAH04     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 04*C                     ELSE
|   C           KEYAF     CHAINAF0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 05-C                     END
| 04-C                     END
|    C   99                GOTO E1B00
|    C*
|    C                     MOVELAF03      DAF03
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C* CHK FUN AUT
| 06-C           $PENV     IFNE '2'
|   C           $INQ      ANDNE'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 06-C                     END
|    C   99                GOTO E1B00
|    C*
04===CSR         E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....INIT 'SC02'
     C*==============================================================*
05===C           R1C00     BEGSR
|    C*
|    C                     MOVE *BLANK    DAH26
|    C                     Z-ADD0         DAH10S
|    C* CHG日期(FILE->SCREEN)
| 01-C           AK12      IFNE 0
|   C                     Z-ADDAK12      P3101I
| 01*C                     ELSE
|   C                     MOVE *HIVAL    P3101I
| 01-C                     END
|    C*
|    C                     CALL 'P31'
|    C                     PARM           P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM AK11      P3104I  1
|    C                     PARM AK09      P3105I  1
|    C           DAH10E    PARM           P3101O  80
|    C*
|    C                     Z-ADD0         DAH25S
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM AK11      P3104I  1
|    C                     PARM AK09      P3105I  1
|    C           DAH25E    PARM           P3101O  80
|    C*
|    C                     MOVE AF11      W02,1          51
|    C                     MOVE AF12      W02,2          52
|    C                     MOVE AF13      W02,3          53
|    C                     MOVE AF14      W02,4          54
|    C                     MOVE AF15      W02,5          55
|    C                     MOVE *BLANKS   W03
|    C                     MOVE *BLANKS   W04
|    C                     MOVE '0'       WCHK
|    C*
| 02-C                     DO   4         WI      30
|   C           55        ADD  WI        IN
|   C                     MOVE '1'       *IN,IN
| 02-C                     END
|    C*
| 03-C                     DO   5         WI      30
|   C* KEYAA=DAH01+W02,WI
| 04-C           W02,WI    IFNE *BLANKS
|   C           KEYAA     CHAINAA0                  40
|   C                     MOVE AA03      W03,WI
|   C                     MOVE AA04      W04,WI
|   C                     MOVE AA05      W09,WI
|   C*
|   C* 無檢核程式時，該說明不要HIGH LIGHT
|   C*
| 05-C           WI        IFLE 4
| 06-C           AA04      IFNE *BLANK
|   C           55        ADD  WI        IN
|   C                     MOVE '0'       *IN,IN
| 06-C                     END
| 05-C                     END
| 04-C                     END
| 03-C                     END
|    C*
|    C                     MOVE *BLANKS   W05
|    C                     MOVE *ALL'9'   W06
|    C                     Z-ADD0         DAH09S
|    C                     Z-ADD9999999   DAH09E
|    C                     MOVE '3'       DK
|    C                     MOVE '3'       DJ
|    C*
|    C* GET排序控制碼
|    C                     Z-ADDAF19      WAF19
|    C                     Z-ADDAF191     DS1
|    C                     Z-ADDAF192     DS2
|    C                     Z-ADDAF193     DS3
|    C                     Z-ADDAF194     DS4
|    C                     Z-ADDAF195     DS5
|    C**
|    C                     Z-ADDW01       W011
|    C                     SORTAW011
|    C                     Z-ADDW011,1    W01S    30
|    C                     EXSR R1C10
|    C* GET小計控制碼
|    C                     MOVE AF20      WAF20
|    C                     MOVE AF201     DL1
|    C                     MOVE AF202     DL2
|    C                     MOVE AF203     DL3
|    C                     MOVE AF204     DL4
|    C                     MOVE AF205     DL5
|    C*
05===CSR                   ENDSR
     C*==============================================================*
     C*          R1C10 ....GET 排序控制碼
     C*==============================================================*
06===C           R1C10     BEGSR
|    C*
| 01-C           W01S      IFLT 5
|   C                     SETON                     31
|   C                     Z-ADD0         I       30
| 02-C           *IN31     DOWEQ'1'
|   C                     ADD  1         I
| 03-C           W01,I     IFEQ 0
|   C           W10,I     ANDEQ'V'
|   C                     ADD  1         W01S
|   C                     Z-ADDW01S      W01,I
| 03-C                     END
| 04-C           W01S      IFGE 5
|   C           I         ORGE 5
|   C                     SETOF                     31
| 04-C                     END
| 02-C                     END
|   C*
| 05-C           W01S      IFLT 5
|   C                     SETON                     31
|   C                     Z-ADD0         I       30
| 06-C           *IN31     DOWEQ'1'
|   C                     ADD  1         I
| 07-C           W01,I     IFEQ 0
|   C           W02,I     ANDNE*BLANK
|   C                     ADD  1         W01S
|   C                     Z-ADDW01S      W01,I
| 07-C                     END
| 08-C           W01S      IFGE 5
|   C           I         ORGE 5
|   C                     SETOF                     31
| 08-C                     END
| 06-C                     END
| 05-C                     END
|   C*
| 09-C           W01S      IFLT 5
|   C                     SETON                     31
|   C                     Z-ADD0         I       30
| 10-C           *IN31     DOWEQ'1'
|   C                     ADD  1         I
| 11-C           W01,I     IFEQ 0
|   C                     ADD  1         W01S
|   C                     Z-ADDW01S      W01,I
| 11-C                     END
| 12-C           W01S      IFGE 5
|   C           I         ORGE 5
|   C                     SETOF                     31
| 12-C                     END
| 10-C                     END
| 09-C                     END
| 01-C                     END
|    C*
06===CSR                   ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
07===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*科目
| 01-C           #LIN      IFEQ 5
|   C           #COL      ANDGE13
|   C           #COL      ANDLE20
|   C                     CALL 'GLI410'
|   C                     PARM DAH01     P410I1  2
|   C           DAH04     PARM DAH04     P410I2  8
|   C                     PARM           @RTNC   2
| 01-C                     END
|    C*
07===C                     ENDSR
     C*===============================================================*
     C*          R2000  ...SCREEN MAIN PROCESS
     C*===============================================================*
08===C           R2000     BEGSR
|    C*
|    C                     EXFMTDSPD2
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E2000
| 01-C                     END
|    C*
| 02-C           *IN12     IFEQ '1'
|   C                     MOVE 'SC01'    SCID
|   C                     GOTO E2000
| 02-C                     END
|    C*
| 03-C           *IN04     IFEQ '1'
|   C                     EXSR R2E00                      .PROMPT
|   C                     GOTO E2000
| 03-C                     END
|    C*
|    C                     EXSR R2B00                      .CHECK      ?
|    C*
| 04-C           *IN99     IFEQ '0'
|   C           *IN14     ANDEQ'1'
|   C                     SETOF                     27
|   C                     SETON                     28    .執行中
|   C                     WRITEDSPD2
|   C                     SETOF                     28
|   C*
|   C                     OUT  LDA
|   C                     MOVEL'Y'       @PRT
| 04-C                     END
|    C*
08===C           E2000     ENDSR
     C*==============================================================*
     C*          R2B00 ....CHECK SCREEN FIELDS
     C*==============================================================*
09===CSR         R2B00     BEGSR
|    C*
|    C* CHK日期
| 01-C           DAH10S    IFEQ 0
|   C                     Z-ADD0         DAH10F
| 01*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM DAH10S    P3001I  80
|   C                     PARM AK11      P3002I  1
|   C                     PARM AK09      P3003I  1
|   C                     PARM           P3001O  1
| 02-C           P3001O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 02-C                     END
| 03-C           *IN99     IFEQ '0'
|   C                     CALL 'P31'
|   C                     PARM DAH10S    P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           DAH10F    PARM           P3101O  80
| 03-C                     END
| 01-C                     END
|    C   99                GOTO E2B00
|    C*
|    C* CHK日期
|    C                     CALL 'P30'
|    C                     PARM DAH10E    P3001I  80
|    C                     PARM AK11      P3002I  1
|    C                     PARM AK09      P3003I  1
|    C                     PARM           P3001O  1
| 04-C           P3001O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 04-C                     END
| 05-C           *IN99     IFEQ '0'
|   C                     CALL 'P31'
|   C                     PARM DAH10E    P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           DAH10T    PARM           P3101O  80
| 05-C                     END
|    C   99                GOTO E2B00
|    C*
|    C* CHK日期起迄
| 06-C           DAH10F    IFGT DAH10T
|   C                     MOVEL'UPT0041' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     626399
| 06-C                     END
|    C   99                GOTO E2B00
|    C*
|    C* CHK日期
| 07-C           DAH25S    IFEQ 0
|   C                     Z-ADD0         DAH25F
| 07*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM DAH25S    P3001I  80
|   C                     PARM AK11      P3002I  1
|   C                     PARM AK09      P3003I  1
|   C                     PARM           P3001O  1
| 08-C           P3001O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7899
| 08-C                     END
| 09-C           *IN99     IFEQ '0'
|   C                     CALL 'P31'
|   C                     PARM DAH25S    P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           DAH25F    PARM           P3101O  80
| 09-C                     END
| 07-C                     END
|    C   99                GOTO E2B00
|    C*
|    C* CHK日期
|    C                     CALL 'P30'
|    C                     PARM DAH25E    P3001I  80
|    C                     PARM AK11      P3002I  1
|    C                     PARM AK09      P3003I  1
|    C                     PARM           P3001O  1
| 10-C           P3001O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7999
| 10-C                     END
| 11-C           *IN99     IFEQ '0'
|   C                     CALL 'P31'
|   C                     PARM DAH25E    P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           DAH25T    PARM           P3101O  80
| 11-C                     END
|    C   99                GOTO E2B00
|    C*
|    C* CHK日期起迄
| 12-C           DAH25F    IFGT DAH25T
|   C                     MOVEL'UPT0041' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     787999
| 12-C                     END
|    C   99                GOTO E2B00
|    C*
| 13-C           DAH05S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DAH05S
| 13-C                     END
|    C*
| 14-C           DAH05S    IFGT DAH05E
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 14-C                     END
|    C   99                GOTO E2B00
|    C*
| 15-C           DAH06S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DAH06S
| 15-C                     END
|    C*
| 16-C           DAH06S    IFGT DAH06E
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 16-C                     END
|    C   99                GOTO E2B00
|    C*
| 17-C           DAH07S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DAH07S
| 17-C                     END
|    C*
| 18-C           DAH07S    IFGT DAH07E
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6699
| 18-C                     END
|    C   99                GOTO E2B00
|    C*
| 19-C           DAH08S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DAH08S
| 19-C                     END
|    C*
| 20-C           DAH08S    IFGT DAH08E
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6799
| 20-C                     END
|    C   99                GOTO E2B00
|    C*
|    C*排序不得重覆
| 21-C                     DO   4         WI
|   C           WI        ADD  1         WJ      10
|   C           W01,WI    LOKUPW01,WJ                   30
| 22-C           *IN30     IFEQ '1'
|   C           WJ        ADD  70        IN      20
|   C                     MOVE '1'       *IN,IN
|   C                     SETON                     99
|   C                     MOVEL'UGL0003' ERRID
|   C                     MOVEL'GLMF'    ERRF
| 22-C                     END
| 21-C  N99                END
|    C   99                GOTO E2B00
|    C*
|    C                     MOVEA*BLANKS   W08
| 23-C                     DO   5         WI
|   C                     Z-ADDW01,WI    WJ
|   C                     MOVE W07,WI    W08,WJ
| 23-C                     END
|    C* 選擇借貸別
|    C                     Z-ADD0         WDJS
|    C                     Z-ADD*ALL'9'   WDJE
|    C                     Z-ADD0         WCJS
|    C                     Z-ADD*ALL'9'   WCJE
| 24-C           AF06      IFEQ '1'
| 25-C           DJ        IFEQ '1'
|   C                     Z-ADD.01       WDJS
|   C                     Z-ADD*ALL'9'   WDJE
| 25*C                     ELSE
| 26-C           DJ        IFEQ '2'
|   C                     Z-ADD0         WDJS
|   C                     Z-ADD0         WDJE
| 26-C                     END
| 25-C                     END
| 24-C                     END
| 27-C           AF06      IFEQ '2'
| 28-C           DJ        IFEQ '1'
|   C                     Z-ADD.01       WCJS
|   C                     Z-ADD*ALL'9'   WCJE
| 28*C                     ELSE
| 29-C           DJ        IFEQ '2'
|   C                     Z-ADD0         WCJS
|   C                     Z-ADD0         WCJE
| 29-C                     END
| 28-C                     END
| 27-C                     END
|    C*
|    C                     Z-ADDDAH09S    DAH09F
|    C                     Z-ADDDAH09E    DAH09T
|    C* 選擇製票者
| 30-C           DAH26     IFEQ *BLANKS
|   C                     MOVE *LOVAL    DAH26F
|   C                     MOVE *HIVAL    DAH26T
| 30*C                     ELSE
|   C                     MOVE DAH26     DAH26F
|   C                     MOVE DAH26     DAH26T
| 30-C                     END
|    C*
09===C           E2B00     ENDSR
     C*==============================================================*
     C*          R2E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
10===C           R2E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*
|    C                     MOVE '1'       WCHK
|    C                     MOVE DAH01     WAK01
|    C*輸入欄位１（起）
| 01-C           #LIN      IFEQ 9
|   C           #COL      ANDGE24
|   C           #COL      ANDLE43
| 02-C           W04,1     IFNE *BLANK
|   C                     MOVE W05,1     WPARM1
|   C                     MOVE W09,1     WPARM2
|   C                     CALL W04,1
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C                     PARM           DESC   20
| 03-C           TORN      IFEQ 'Y'
|   C                     MOVE WPARM1    W05,1
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C*輸入欄位１（迄）
| 04-C           #LIN      IFEQ 9
|   C           #COL      ANDGE47
|   C           #COL      ANDLE66
| 05-C           W04,1     IFNE *BLANK
|   C                     MOVE W06,1     WPARM1
|   C                     MOVE W09,1     WPARM2
|   C                     CALL W04,1
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C                     PARM           DESC   20
| 06-C           TORN      IFEQ 'Y'
|   C                     MOVE WPARM1    W06,1
| 06-C                     END
| 05-C                     END
| 04-C                     END
|    C*輸入欄位２（起）
| 07-C           #LIN      IFEQ 10
|   C           #COL      ANDGE24
|   C           #COL      ANDLE43
| 08-C           W04,2     IFNE *BLANK
|   C                     MOVE W05,2     WPARM1
|   C                     MOVE W09,2     WPARM2
|   C                     CALL W04,2
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C                     PARM           DESC   20
| 09-C           TORN      IFEQ 'Y'
|   C                     MOVE WPARM1    W05,2
| 09-C                     END
| 08-C                     END
| 07-C                     END
|    C*輸入欄位２（迄）
| 10-C           #LIN      IFEQ 10
|   C           #COL      ANDGE47
|   C           #COL      ANDLE66
| 11-C           W04,2     IFNE *BLANK
|   C                     MOVE W06,2     WPARM1
|   C                     MOVE W09,2     WPARM2
|   C                     CALL W04,2
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C                     PARM           DESC   20
| 12-C           TORN      IFEQ 'Y'
|   C                     MOVE WPARM1    W06,2
| 12-C                     END
| 11-C                     END
| 10-C                     END
|    C*輸入欄位３（起）
| 13-C           #LIN      IFEQ 11
|   C           #COL      ANDGE24
|   C           #COL      ANDLE43
| 14-C           W04,3     IFNE *BLANK
|   C                     MOVE W05,3     WPARM1
|   C                     MOVE W09,3     WPARM2
|   C                     CALL W04,3
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C                     PARM           DESC   20
| 15-C           TORN      IFEQ 'Y'
|   C                     MOVE WPARM1    W05,3
| 15-C                     END
| 14-C                     END
| 13-C                     END
|    C*輸入欄位３（迄）
| 16-C           #LIN      IFEQ 11
|   C           #COL      ANDGE47
|   C           #COL      ANDLE66
| 17-C           W04,3     IFNE *BLANK
|   C                     MOVE W06,3     WPARM1
|   C                     MOVE W09,3     WPARM2
|   C                     CALL W04,3
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C                     PARM           DESC   20
| 18-C           TORN      IFEQ 'Y'
|   C                     MOVE *BLANK    W06,3
|   C                     MOVE WPARM1    W06,3
| 18-C                     END
| 17-C                     END
| 16-C                     END
|    C*輸入欄位４（起）
| 19-C           #LIN      IFEQ 12
|   C           #COL      ANDGE24
|   C           #COL      ANDLE43
| 20-C           W04,4     IFNE *BLANK
|   C                     MOVE W05,4     WPARM1
|   C                     MOVE W09,4     WPARM2
|   C                     CALL W04,4
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C                     PARM           DESC   20
| 21-C           TORN      IFEQ 'Y'
|   C                     MOVE *BLANK    W05,4
|   C                     MOVE WPARM1    W05,4
| 21-C                     END
| 20-C                     END
| 19-C                     END
|    C*輸入欄位４（迄）
| 22-C           #LIN      IFEQ 12
|   C           #COL      ANDGE47
|   C           #COL      ANDLE66
| 23-C           W04,4     IFNE *BLANK
|   C                     MOVE W06,4     WPARM1
|   C                     MOVE W09,4     WPARM2
|   C                     CALL W04,4
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C                     PARM           DESC   20
| 24-C           TORN      IFEQ 'Y'
|   C                     MOVE *BLANK    W06,4
|   C                     MOVE WPARM1    W06,4
| 24-C                     END
| 23-C                     END
| 22-C                     END
|    C*印表機
| 25-C           #LIN      IFEQ 19
|   C           #COL      ANDGE40
|   C           #COL      ANDLE41
|   C                     CALL 'P64I'
|   C           $PRTCD    PARM $PRTCD    P64II1  2
| 25-C                     END
|    C*
10===C                     ENDSR
