     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : GLR2N0                                     *
     H*    PROGRAM NAME : 明細帳列印－區間                         *
     H*    AUTHOR       : A1087  JOYCE                               *
     H*    CREATE DATE  : 1992.11.30                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       : 泛太總帳                                 *
     H****************************************************************
     FGLAKPF  IF  E           K        DISK
     FPT#BPF  IF  E           K        DISK
     FGLR2N0D CF  E                    WORKSTN      KINFDS DSPFDS
     E*
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DAH01
     I                                      503 510 DAH04S
     I                                      511 520 DAH26F
     I                                      521 530 DAH26T
     I                                      531 5370DAH10S
     I                                      538 5440DAH10E
     I                                      545 5520DAH10F
     I                                      553 5600DAH10T
     I                                      561 5670DAH25S
     I                                      568 5740DAH25E
     I                                      575 5820DAH25F
     I                                      583 5900DAH25T
     I                                      591 598 DAH04E
     I**
     I                                      599 599 DK
     I                                      600 600 DJ
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN10     PARM *IN10     IN10    1
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   10                EXSR R0200                      *INIT MSG.
     C  N10                EXSR R0100                      *INIT VALUE
     C*
     C                     MOVEL*BLANK    @PRT    1        *PRINT
     C*
  01-C           *IN03     DOUEQ'1'
    C           @PRT      OREQ 'Y'
    C                     EXSR R1000
  01-C                     END
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===CSR         R0100     BEGSR
|    C*
|    C                     SETON                     1027
|    C*
|    C                     IN   PTDA01
|    C*
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $PFMT     P3104I  1
|    C                     PARM $PTYPE    P3105I  1
|    C           DDATE     PARM           P3101O  80
|    C*
|    C                     MOVE *BLANK    DAH01
|    C                     MOVE *BLANK    DAH04S
|    C                     MOVE *ALL'9'   DAH04E
|    C                     Z-ADD*ZEROS    DAH10S
|    C                     Z-ADD*ALL'9'   DAH10E
|    C                     Z-ADD*ZEROS    DAH25S
|    C                     Z-ADD*ALL'9'   DAH25E
|    C                     MOVE *BLANK    DAH26
|    C                     MOVE '3'       DK
|    C                     MOVE '3'       DJ
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ....INITIAL VALUE
     C*==============================================================*
02===CSR         R0200     BEGSR
|    C*
|    C                     SETON                     2799  報表格式MESSAGE
|    C*
| 01-C           $PENV     IFEQ '0'                        INQUIRY
|   C                     MOVEL'UPT2142' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C*
| 02-C           $PENV     IFEQ '1'                        ON-LINE
|   C                     MOVEL'UPT2140' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|    C*
| 03-C           $PENV     IFEQ '2'                        BATCH
|   C                     MOVEL'UPT2110' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C*
02===C                     ENDSR
     C*===============================================================*
     C*          R1000  ...SCREEN MAIN PROCESS
     C*===============================================================*
03===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
|   C                     EXSR R1E00                      .PROMPT
|   C                     GOTO E1000
| 02-C                     END
|    C*
|    C                     EXSR R1B00                      .CHECK      ?
|    C*
| 03-C           *IN99     IFEQ '0'
|   C           *IN14     ANDEQ'1'
|   C                     SETOF                     27
|   C                     SETON                     28    .執行中
|   C                     WRITEDSPD1
|   C                     SETOF                     28
|   C*
|   C                     OUT  LDA
|   C                     MOVEL'Y'       @PRT
| 03-C                     END
|    C*
03===C           E1000     ENDSR
     C*===============================================================*
     C*          R1B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
04===C           R1B00     BEGSR
|    C*
|    C*+<<DATA CHECK>>+++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
| 01-C           DAH01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO E1B00
|    C**
|    C* CHK 公司別須存在公司檔(PT#BPF)
|    C**
|    C           DAH01     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C   99                GOTO E1B00
|    C**
|    C* CHK 公司別須存在總帳控制檔(GLAKPF)
|    C**
|    C           DAH01     CHAINAK0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 03-C                     END
|    C   99                GOTO E1B00
|    C***
|    C* CHK會計科目起迄
|    C***
| 04-C           DAH04S    IFGT DAH04E
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     616299
| 04-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* CHK日期
|    C*
| 05-C           DAH10S    IFEQ 0
|   C                     Z-ADD0         DAH10F
| 05*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM DAH10S    P3001I  80
|   C                     PARM AK11      P3002I  1
|   C                     PARM AK09      P3003I  1
|   C                     PARM           P3001O  1
| 06-C           P3001O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 06-C                     END
| 07-C           *IN99     IFEQ '0'
|   C                     CALL 'P31'
|   C                     PARM DAH10S    P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           DAH10F    PARM           P3101O  80
| 07-C                     END
| 05-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* CHK日期
| 08-C           DAH10E    IFEQ 9999999
|   C                     Z-ADD99999999  DAH10T
| 08*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM DAH10E    P3001I  80
|   C                     PARM AK11      P3002I  1
|   C                     PARM AK09      P3003I  1
|   C                     PARM           P3001O  1
| 09-C           P3001O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 09-C                     END
| 10-C           *IN99     IFEQ '0'
|   C                     CALL 'P31'
|   C                     PARM DAH10E    P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           DAH10T    PARM           P3101O  80
| 10-C                     END
| 08-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* CHK日期起迄
| 11-C           DAH10F    IFGT DAH10T
|   C                     MOVEL'UPT0041' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     636499
| 11-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* CHK日期
| 12-C           DAH25S    IFEQ 0
|   C                     Z-ADD0         DAH25F
| 12*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM DAH25S    P3001I  80
|   C                     PARM AK11      P3002I  1
|   C                     PARM AK09      P3003I  1
|   C                     PARM           P3001O  1
| 13-C           P3001O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 13-C                     END
| 14-C           *IN99     IFEQ '0'
|   C                     CALL 'P31'
|   C                     PARM DAH25S    P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           DAH25F    PARM           P3101O  80
| 14-C                     END
| 12-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* CHK日期
| 15-C           DAH25E    IFEQ 9999999
|   C                     Z-ADD99999999  DAH25T
| 15*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM DAH25E    P3001I  80
|   C                     PARM AK11      P3002I  1
|   C                     PARM AK09      P3003I  1
|   C                     PARM           P3001O  1
| 16-C           P3001O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6699
| 16-C                     END
| 17-C           *IN99     IFEQ '0'
|   C                     CALL 'P31'
|   C                     PARM DAH25E    P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           DAH25T    PARM           P3101O  80
| 17-C                     END
| 15-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* CHK日期起迄
| 18-C           DAH25F    IFGT DAH25T
|   C                     MOVEL'UPT0041' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     656699
| 18-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* 選擇製票者
|    C*
| 19-C           DAH26     IFEQ *BLANKS
|   C                     MOVE *LOVAL    DAH26F
|   C                     MOVE *HIVAL    DAH26T
| 19*C                     ELSE
|   C                     MOVE DAH26     DAH26F
|   C                     MOVE DAH26     DAH26T
| 19-C                     END
|    C*
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C* CHK FUN AUT
| 20-C           $PENV     IFNE '2'
|   C           $INQ      ANDNE'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 20-C                     END
|    C   99                GOTO E1B00
|    C*
04===CSR         E1B00     ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
05===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*科目
| 01-C           #LIN      IFEQ 7
|   C           #COL      ANDGE39
|   C           #COL      ANDLE46
|   C                     CALL 'GLI410'
|   C                     PARM DAH01     P410I1  2
|   C           DAH04S    PARM DAH04S    P410I2  8
|   C                     PARM           @RTNC   2
| 01-C                     END
|    C*科目
| 02-C           #LIN      IFEQ 7
|   C           #COL      ANDGE51
|   C           #COL      ANDLE58
|   C                     CALL 'GLI410'
|   C                     PARM DAH01     P410I1  2
|   C           DAH04E    PARM DAH04E    P410I2  8
|   C                     PARM           @RTNC   2
| 02-C                     END
|    C*印表機
| 03-C           #LIN      IFEQ 17
|   C           #COL      ANDGE39
|   C           #COL      ANDLE40
|   C                     CALL 'P64I'
|   C           $PRTCD    PARM $PRTCD    P64II1  2
| 03-C                     END
|    C*
05===C                     ENDSR
