     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : GLR2O0                                     *
     H*    PROGRAM NAME : 沖帳明細表                               *
     H*    AUTHOR       : A1087  JOYCE                               *
     H*    CREATE DATE  : 1992.12.01                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       : 泛太總帳                                 *
     H****************************************************************
     FGLALLF02IP  E           K        DISK
     FGLAFPF  IF  E           K        DISK
     FGLAEPF  IF  E           K        DISK
     FGLAMPF  IF  E           K        DISK
     FGLWF09  O   E           K        DISK
     E*
     E                    WA01        5 20
     E*排序
     E                    W01         5  1 0
     E                    W011        5  1 0D            *SORT
     E*輸入欄位代碼
     E                    W02         5  2
     E*輸入欄位之控制碼
     E                    W10         7  1
     I*
     IAL0
     I                                              AL02  L1
     I           UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DAL01
     I                                      503 510 DAL02S
     I                                      511 518 DAL02E
     I                                      519 5250DAK12
     I                                      526 5330DAK12F
     I                                      534 534 DOP
     I            DS
     I                                        1   50WAF19
     I                                        1   10AF191
     I                                        2   20AF192
     I                                        3   30AF193
     I                                        4   40AF194
     I                                        5   50AF195
     I            DS
     I                                        1   50W01
     I                                        1   10A
     I                                        2   20B
     I                                        3   30C
     I                                        4   40D
     I                                        5   50E
     I            DS
     I                                        1   7 W10
     I                                        1   7 AF18
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYAE     KLIST
     C                     KFLD           DAL01
     C                     KFLD           AF10
     C           KEYAF     KLIST
     C                     KFLD           AL01
     C                     KFLD           AL02
     C           KEYAM     KLIST
     C                     KFLD           AL01
     C                     KFLD           AL02
     C                     KFLD           AL04
     C                     KFLD           AL05
     C                     KFLD           AL06
     C                     KFLD           AL07
     C                     KFLD           AL08
     C                     KFLD           AL03
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C   L1                EXSR R0100
     C*
     C                     MOVE AL04      WA01,A
     C                     MOVE AL05      WA01,B
     C                     MOVE AL06      WA01,C
     C                     MOVE AL07      WA01,D
     C                     MOVE *BLANKS   WA01,E
  01-C           AL08      IFNE 0
    C                     CALL 'P56'                      *P56(GET'/')
    C                     PARM AL08      P5601I  80
    C                     PARM           P5601O 10
    C                     MOVELP5601O    WA01,E
  01-C                     END
     C*
     C                     MOVE AL02      WF0901
     C                     MOVE WA01,1    WF0902
     C                     MOVE WA01,2    WF0903
     C                     MOVE WA01,3    WF0904
     C                     MOVE WA01,4    WF0905
     C                     MOVE WA01,5    WF0906
     C                     MOVE AL03      WF0907
     C                     Z-ADDAL09      WF0908
     C                     Z-ADDAL11      WF0909
     C*
     C           KEYAM     SETLLAM0                      42
  02-C           *IN42     IFEQ '0'
    C                     Z-ADD0         WF0911
    C                     MOVE *BLANK    WF0910
    C                     Z-ADD0         WF0912
    C                     WRITEGLWF09R
  02*C                     ELSE
    C                     SETOF                     59
    C           KEYAM     READEAM0                      44
  03-C           *IN44     DOWEQ'0'
  04-C           AM10      IFLE DAK12F
    C                     SETON                     59
    C                     MOVE AM09      WF0910
    C                     Z-ADDAM11      WF0911
    C                     Z-ADDAM10      WF0912
    C                     WRITEGLWF09R
  04-C                     END
    C           KEYAM     READEAM0                      44
  03-C                     END
  05-C           *IN59     IFEQ '0'
    C                     Z-ADD0         WF0911
    C                     MOVE *BLANK    WF0910
    C                     Z-ADD0         WF0912
    C                     WRITEGLWF09R
  05-C                     END
  02-C                     END
     C*
     CLR                   RETRN
     C*==============================================================*
     C*          R0100 ....GET 排序控制碼
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C           KEYAF     CHAINAF0                  40
|    C           KEYAE     CHAINAE0                  40
|    C*
|    C                     MOVE AF11      W02,1
|    C                     MOVE AF12      W02,2
|    C                     MOVE AF13      W02,3
|    C                     MOVE AF14      W02,4
|    C                     MOVE AF15      W02,5
|    C*
|    C                     Z-ADDAE04      WAF19
|    C                     Z-ADDAF191     A
|    C                     Z-ADDAF192     B
|    C                     Z-ADDAF193     C
|    C                     Z-ADDAF194     D
|    C                     Z-ADDAF195     E
|    C*
|    C                     Z-ADDW01       W011
|    C                     SORTAW011
|    C                     Z-ADDW011,1    W01S    30
|    C                     EXSR R1C10
|    C*
01===CSR                   ENDSR
     C*==============================================================*
     C*          R1C10 ....GET 排序控制碼
     C*==============================================================*
02===C           R1C10     BEGSR
|    C*
| 01-C           W01S      IFLT 5
|   C                     SETON                     31
|   C                     Z-ADD0         I       30
| 02-C           *IN31     DOWEQ'1'
|   C                     ADD  1         I
| 03-C           W01,I     IFEQ 0
|   C           W10,I     ANDEQ'V'
|   C                     ADD  1         W01S
|   C                     Z-ADDW01S      W01,I
| 03-C                     END
| 04-C           W01S      IFGE 5
|   C           I         ORGE 5
|   C                     SETOF                     31
| 04-C                     END
| 02-C                     END
|   C*
| 05-C           W01S      IFLT 5
|   C                     SETON                     31
|   C                     Z-ADD0         I       30
| 06-C           *IN31     DOWEQ'1'
|   C                     ADD  1         I
| 07-C           W01,I     IFEQ 0
|   C           W02,I     ANDNE*BLANK
|   C                     ADD  1         W01S
|   C                     Z-ADDW01S      W01,I
| 07-C                     END
| 08-C           W01S      IFGE 5
|   C           I         ORGE 5
|   C                     SETOF                     31
| 08-C                     END
| 06-C                     END
| 05-C                     END
|   C*
| 09-C           W01S      IFLT 5
|   C                     SETON                     31
|   C                     Z-ADD0         I       30
| 10-C           *IN31     DOWEQ'1'
|   C                     ADD  1         I
| 11-C           W01,I     IFEQ 0
|   C                     ADD  1         W01S
|   C                     Z-ADDW01S      W01,I
| 11-C                     END
| 12-C           W01S      IFGE 5
|   C           I         ORGE 5
|   C                     SETOF                     31
| 12-C                     END
| 10-C                     END
| 09-C                     END
| 01-C                     END
|    C*
02===CSR                   ENDSR
