     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : GLR2T01                                    *
     A*    PROGRAM NAME : 比較損益表－成本中心                     *
     A*    AUTHOR       :  A1149   HUANG-SHU.MEI                     *
     A*    CREATE DATE  :  1992.12.21                                *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 泛太總帳                                 *
     A****************************************************************
     FPT#APF  IF  E           K        DISK
     FPT#BPF  IF  E           K        DISK
     FGLAKPF  IF  E           K        DISK
     FGLAXPF  IF  E           K        DISK
     FGLAILF05IF  E           K        DISK
     F            AI0                               KRENAMEAILF05
     FGLAILF06IF  E           K        DISK
     F            AI0                               KRENAMEAILF06
     FGLASLF02IF  E           K        DISK
     F            AS0                               KRENAMEASLF02
     FGLASLF03IF  E           K        DISK
     F            AS0                               KRENAMEASLF03
     FGLWF14  UF  E           K        DISK                      A
     FGLWF15  UF  E           K        DISK                      A
     FGLWF16  UF  E           K        DISK                      A
     FGLR2T0P1O   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    @@         13 13 2
     E                    @W1    10  10  2
     E*---------------------------------------------------------------*
     I*
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     IGLDA01      DS
     I                                        1  16 DA01
     I*
     ILDA        UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I* SCREEN INPUT FIELD  ++++++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DAI01
     I                                      503 5050DYEAR
     I                                      506 5070DMMS
     I                                      508 5090DMME
     I                                      510 512 DAR03
     I* PROGRAM CALCULATION FIELD  +++++++++++++++++++++++++++++++++++
     I                                      513 513 #B12
     I* OPEN QUERY FILE SELECT $XXXXX FIELD  +++++++++++++++++++++++++
     I                                      514 515 $AI01S
     I                                      516 517 $AI01E
     I                                      518 5210$YEAR
     I                                      522 522 $AR05
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C           *NAMVAR   DEFN           GLDA01
     C           *NAMVAR   DEFN *LDA      LDA
     C           *LIKE     DEFN AS02      WAR02            *KEY(30)
     C           *LIKE     DEFN AS04      WAS04
     C           *LIKE     DEFN AI02      WAI02
     C           *LIKE     DEFN AI04      WAI04
     C           *LIKE     DEFN AI01      WAI01
     C           *LIKE     DEFN AI04      @AI04
     C           *LIKE     DEFN AI02      @AI02
     C           *LIKE     DEFN AI10      WCASH1           *金額一
     C           *LIKE     DEFN AI10      WCASH2           *金額二
     C           *LIKE     DEFN AI10      WCASH3           *金額三
     C           *LIKE     DEFN AI10      WCASH4           *金額四
     C           *LIKE     DEFN AI10      WCASH5           *金額五
     C           *LIKE     DEFN AI10      WCASH6           *金額六
     C           *LIKE     DEFN AI10      WCASH7           *金額七
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYAF     KLIST
     C                     KFLD           WAI01            *公司別
     C                     KFLD           AI03             *會計科目
     C           KEY#B     KLIST
     C                     KFLD           DAI01            *公司別
     C           KEYAS     KLIST
     C                     KFLD           DAI01            *公司別
     C                     KFLD           WAR02            *報表類別
     C                     KFLD           DAR03            *報表代碼
     C           KEYAX     KLIST
     C                     KFLD           DAI01            *公司別S
     C                     KFLD           AI01             *公司別F
     C           KEYAI5    KLIST
     C                     KFLD           @AI04
     C                     KFLD           @AI02
     C                     KFLD           AS06
     C           KEYAI$    KLIST
     C                     KFLD           @AI04
     C                     KFLD           @AI02
     C           KEY14     KLIST
     C                     KFLD           WF1502
     C                     KFLD           WAS04
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     SETON                     39
     C                     EXSR R0100                      .INIT-HEAD
     C*
     C                     EXSR R1000                      .WORK-FILE
     C                     EXSR R2000                      .GLWF16
     C                     EXSR R3000                      .PRINTING
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ... HEADING INITIAL
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     IN   PTDA01
|    C*
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $PFMT     P3104I  1
|    C                     PARM $PTYPE    P3105I  1
|    C           PDATE     PARM           P3101O  80
|    C****************************
|    C*公司別屬虛擬            *
|    C*須CHECK公司結構明細檔 *
|    C****************************
| 01-C           #B12      IFEQ '1'
|   C                     MOVELDAI01     WAI01
| 01*C                     ELSE
|   C           DAI01     CHAINAX0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVELAX02      WAI01
| 02-C                     END
| 01-C                     END
|    C**************
|    C*<<公司別 >>
|    C                     MOVEL*BLANKS   P#B16
|    C           KEY#B     CHAIN#B0                  40
| 03-C           *IN40     IFEQ '0'
| 04-C           $AR05     IFEQ '1'
|   C                     MOVEL#B16      P#B16
| 04*C                     ELSE
|   C                     MOVEL#B17      P#B16
| 04-C                     END
| 03-C                     END
|    C**************
|    C*<< *DTAARA >>
|    C                     Z-ADD*ZERO     P006O2
|    C                     CALL 'GLS006'
|    C                     PARM WAI01     P006I1  2
|    C                     PARM $YEAR     P006I2  40
|    C                     PARM DMME      P006I3  20
|    C                     PARM 'F'       P006I4  1
|    C                     PARM           P006O1  80
|    C                     PARM           P006O2  80
|    C                     PARM           P006O3  1
|    C                     PARM           P006O4  1
|    C*
| 05-C           P006O4    IFNE 'Y'
|   C                     IN   GLDA01
| 06-C           $AR05     IFEQ '1'
|   C                     MOVELDA01      PDA01
| 06*C                     ELSE
|   C                     MOVE DA01      PDA01
| 06-C                     END
| 05-C                     END
|    C**********************
|    C*<<會計期間起迄日 >>
|    C           WAI01     CHAINAK0                  40
| 07-C           *IN40     IFEQ '0'
|   C                     CALL 'P31'
|   C                     PARM P006O2    P3101I  80
|   C                     PARM '2'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM AK11      P3104I  1
|   C                     PARM AK09      P3105I  1
|   C           PMME      PARM           P3101O  80
|   C*
|   C                     Z-ADD*ZERO     P006O1
|   C                     CALL 'GLS006'
|   C                     PARM WAI01     P006I1  2
|   C                     PARM $YEAR     P006I2  40
|   C                     PARM DMMS      P006I3  20
|   C                     PARM 'F'       P006I4  1
|   C                     PARM           P006O1  80
|   C                     PARM           P006O2  80
|   C                     PARM           P006O3  1
|   C                     PARM           P006O4  1
|   C*
|   C                     CALL 'P31'
|   C                     PARM P006O1    P3101I  80
|   C                     PARM '2'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM AK11      P3104I  1
|   C                     PARM AK09      P3105I  1
|   C           PMMS      PARM           P3101O  80
| 07-C                     END
|    C*
|    C*************************
|    C*<<報表格式－報表代碼>>
|    C                     MOVEL'10'      WAR02
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ... GLASLF02  DETAIL
     C*==============================================================*
02===C           R1000     BEGSR
|    C**************************
|    C* 逐筆讀取GLASLF02,    *
|    C* 只取AS06為會計科目,*
|    C* 存入GLWF14.          *
|    C**************************
|    C           *LOVAL    SETLLAILF06
|    C                     READ AILF06                   46
|    C                     MOVELAI04      WAI04
|    C                     Z-ADD1         WF1502
|    C                     Z-ADD*ZERO     WF1503
| 01-C           *IN46     DOWEQ'0'
|   C*****************************
|   C* 新增一筆至工作檔GLWF15  *
|   C*****************************
|   C                     EXSR R1A00
|   C                     WRITEGLWF15R
|   C*
|   C           KEYAS     SETLLASLF02
|   C           KEYAS     READEASLF02                   42
| 02-C           *IN42     DOWEQ'0'                        .EOF
|   C                     EXSR R1B00
|   C                     EXSR R1D00
|   C   40                WRITEGLWF14R
|   C  N40                UPDATGLWF14R
|   C*
|   C           KEYAS     READEASLF02                   42
| 02-C                     END
|   C*************************
|   C* WAI04用來紀錄讀過之 *
|   C*  成本中心.          *
|   C*************************
|   C           WAI04     SETGTAILF06
|   C                     READ AILF06                   46
|   C                     MOVELAI04      WAI04
| 01-C                     END
|    C**************************
|    C* 逐筆讀取GLASLF03,    *
|    C* 只取AS06為@------  *
|    C* 存入GLWF14.          *
|    C**************************
|    C                     Z-ADD1         WF1502
| 03-C           WF1502    DOWLETPAGE
|   C*
|   C           KEYAS     SETLLASLF03
|   C           KEYAS     READEASLF03                   42
|   C*
| 04-C           *IN42     DOWEQ'0'                        .EOF
|   C*
|   C                     EXSR R1C00                      .DETAIL
|   C                     EXSR R1D00
|   C   40                WRITEGLWF14R
|   C  N40                UPDATGLWF14R
|   C*
|   C           KEYAS     READEASLF03                   42
| 04-C                     END
|   C*
|   C                     ADD  1         WF1502
| 03-C                     END
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... GLWF16計算總金額
     C*==============================================================*
03===C           R2000     BEGSR
|    C*
|    C                     Z-ADD*ZERO     WF1602
|    C                     Z-ADD*ZERO     WF1603
|    C           *LOVAL    SETLLGLWF14R
|    C                     READ GLWF14R                  46
| 01-C           *IN46     DOWEQ'0'
|   C           WF1402    CHAINGLWF16R              40
| 02-C           *IN40     IFEQ '0'
|   C                     ADD  WF1405    WF1602
|   C                     ADD  WF1406    WF1602
|   C                     ADD  WF1407    WF1602
|   C                     ADD  WF1408    WF1602
|   C                     ADD  WF1409    WF1602
|   C                     ADD  WF1410    WF1602
|   C                     ADD  WF1411    WF1602
|   C                     UPDATGLWF16R
|   C*
| 02*C                     ELSE
|   C                     Z-ADD*ZERO     WF1602
|   C                     MOVELWF1402    WF1601
|   C                     ADD  WF1405    WF1602
|   C                     ADD  WF1406    WF1602
|   C                     ADD  WF1407    WF1602
|   C                     ADD  WF1408    WF1602
|   C                     ADD  WF1409    WF1602
|   C                     ADD  WF1410    WF1602
|   C                     ADD  WF1411    WF1602
|   C                     WRITEGLWF16R
| 02-C                     END
|   C*
|   C                     READ GLWF14R                  46
| 01-C                     END
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          R3000 ... PRINTING MAIN PROCESS
     C*==============================================================*
04===C           R3000     BEGSR
|    C****************
|    C* 比較損益表 *
|    C****************
|    C           *LOVAL    SETLLGLWF14R
|    C           *LOVAL    SETLLGLWF16R
|    C                     READ GLWF14R                  42
|    C                     Z-ADDWF1401    W1401   30
|    C*
| 01-C           *IN42     DOWEQ'0'                        .EOF
|   C*
| 02-C           WF1401    IFNE W1401
|   C                     EXSR R8900
|   C                     SETON                       39
|   C                     Z-ADDWF1401    W1401
| 02-C                     END
|   C* FIRST RECORD
| 03-C           *IN10     IFEQ '0'
|   C                     SETON                     10
| 03-C                     END
|   C*
| 04-C           *IN39     IFEQ '1'
|   C                     EXSR R3A00
|   C                     WRITEPH1
|   C                     SETOF                     39
| 04-C                     END
|   C*
| 05-C           WF1404    IFEQ '@-      '
|   C                     WRITEPD2
| 05*C                     ELSE
|   C*
| 06-C           WF1404    IFEQ '@S      '
|   C                     WRITEPD3
| 06*C                     ELSE
|   C*
|   C                     MOVELWF1404    P1404
|   C******************************
|   C* 判斷合計碼是否為*BLANKS  *
|   C* 再決定31是否SETON      *
|   C* 控制EDTCDE OR EDTCWRD    *
|   C******************************
|   C           WF1402    SETLLGLWF16R
|   C           WF1402    READEGLWF16R                  43
| 07-C           *IN43     IFEQ '1'
|   C                     Z-ADD*ZERO     P1602
| 07*C                     ELSE
|   C                     Z-ADDWF1602    P1602
| 07-C                     END
|   C*
|   C                     Z-ADDWF1405    P1405
|   C                     Z-ADDWF1406    P1406
|   C                     Z-ADDWF1407    P1407
|   C                     Z-ADDWF1408    P1408
|   C                     Z-ADDWF1409    P1409
|   C                     Z-ADDWF1410    P1410
|   C                     Z-ADDWF1411    P1411
|   C                     SETON                     31
|   C*
|   C*************************
|   C* 判斷合計碼是否為Ｖ  *
|   C* 再決定31是否SETOF *
|   C*************************
| 08-C           WF1403    IFEQ 'V'
|   C                     Z-ADDP1602     P1602@
|   C                     Z-ADDP1405     P1405@
|   C                     Z-ADDP1406     P1406@
|   C                     Z-ADDP1407     P1407@
|   C                     Z-ADDP1408     P1408@
|   C                     Z-ADDP1409     P1409@
|   C                     Z-ADDP1410     P1410@
|   C                     Z-ADDP1411     P1411@
|   C                     SETOF                     31
| 08-C                     END
|   C******
|   C**********************
|   C* 判斷值是否為負數 *
|   C* 再決定( ,) SETON *
|   C**********************
|   C                     SETOF                     121314
|   C                     SETOF                     151617
|   C                     SETOF                     1819
| 09-C           P1602     IFLT *ZERO
|   C                     SETON                     12
| 09-C                     END
|   C*
| 10-C           P1405     IFLT *ZERO
|   C                     SETON                     13
| 10-C                     END
|   C*
| 11-C           P1406     IFLT *ZERO
|   C                     SETON                     14
| 11-C                     END
|   C*
| 12-C           P1407     IFLT *ZERO
|   C                     SETON                     15
| 12-C                     END
|   C*
| 13-C           P1408     IFLT *ZERO
|   C                     SETON                     16
| 13-C                     END
|   C*
| 14-C           P1409     IFLT *ZERO
|   C                     SETON                     17
| 14-C                     END
|   C*
| 15-C           P1410     IFLT *ZERO
|   C                     SETON                     18
| 15-C                     END
|   C*
| 16-C           P1411     IFLT *ZERO
|   C                     SETON                     19
| 16-C                     END
|   C*
|   C                     SETOF                     232425
|   C                     SETOF                     262728
|   C                     SETOF                     29
| 17-C*          P1501     IFEQ *BLANKS
|   C*          P1502     ANDEQ*BLANKS
|   C*                    SETON                     23
| 17-C*                    END
|   C*
| 18-C           P1502     IFEQ *BLANKS
|   C           P1406     ANDEQ*ZERO
|   C                     SETON                     24
| 18-C                     END
|   C*
| 19-C           P1503     IFEQ *BLANKS
|   C           P1407     ANDEQ*ZERO
|   C                     SETON                     25
| 19-C                     END
|   C*
| 20-C           P1504     IFEQ *BLANKS
|   C           P1408     ANDEQ*ZERO
|   C                     SETON                     26
| 20-C                     END
|   C*
| 21-C           P1505     IFEQ *BLANKS
|   C           P1409     ANDEQ*ZERO
|   C                     SETON                     27
| 21-C                     END
|   C*
| 22-C           P1506     IFEQ *BLANKS
|   C           P1410     ANDEQ*ZERO
|   C                     SETON                     28
| 22-C                     END
|   C*
| 23-C           P1507     IFEQ *BLANKS
|   C           P1411     ANDEQ*ZERO
|   C                     SETON                     29
| 23-C                     END
|   C*
|   C************************
|   C*值全為零者．不列印  *
|   C************************
| 24-C           WF1403    IFEQ *BLANKS
| 25-C           P1602     IFNE *ZERO
|   C           P1405     ORNE *ZERO
|   C           P1406     ORNE *ZERO
|   C           P1407     ORNE *ZERO
|   C           P1408     ORNE *ZERO
|   C           P1409     ORNE *ZERO
|   C           P1410     ORNE *ZERO
|   C           P1411     ORNE *ZERO
|   C                     WRITEPD1
| 25-C                     END
|   C*
| 24*C                     ELSE
| 26-C           WF1403    IFEQ 'C'
|   C                     WRITEPD1@
| 26*C                     ELSE
|   C                     WRITEPD1
| 26-C                     END
| 24-C                     END
| 06-C                     END
| 05-C                     END
|   C*
|   C                     READ GLWF14R                  42
| 01-C                     END
|    C*************
|    C* GLR2T0P....
| 27-C           *IN10     IFEQ '1'                        .HAS DATA
|   C                     EXSR R8900                       .LR TOTAL
| 27*C                     ELSE                            .NO DATA
|   C                     EXSR R8999                       .LR NO DATA
| 27-C                     END
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R1A00 ... 新增一筆至工作檔GLWF15（註０）
     C*==============================================================*
05===C           R1A00     BEGSR
|    C**************************
|    C* WF1501=>成本中心     *
|    C* WF1502=>頁次         *
|    C* WF1503=>該頁之第幾筆 *
|    C**************************
|    C                     MOVELAI04      WF1501
| 01-C           WF1503    IFEQ 7
|   C                     ADD  1         WF1502
|   C                     Z-ADD1         WF1503
| 01*C                     ELSE
|   C                     ADD  1         WF1503
| 01-C                     END
|    C*
|    C                     Z-ADDWF1502    TPAGE   30
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R1B00 ... DETAIL ( GLAILF05)
     C*==============================================================*
06===C           R1B00     BEGSR
|    C*
|    C                     MOVELAI04      @AI04
|    C                     MOVELAI02      @AI02
|    C*****************
|    C* 年度餘額檔  *
|    C*****************
|    C           KEYAI5    SETLLAILF05
|    C           KEYAI$    READEAILF05                   45
| 01-C           *IN45     DOWEQ'0'
|   C           AI03      ANDLEAS07
|   C                     SETON                         77
|   C***********************
|   C* DAI01公司別屬虛擬 *
|   C***********************
| 02-C           #B12      IFEQ '2'
|   C           KEYAX     SETLLAX0                      42
|   C  N42                GOTO TAG#1
| 02*C                     ELSE
| 03-C           AI01      IFNE DAI01
|   C                     GOTO TAG#1
| 03-C                     END
| 02-C                     END
|   C******************
|   C* 計算金額1-7  *
|   C******************
|   C                     EXSR R1B10                      *註一
|   C*
|   C           TAG#1     TAG
|   C           KEYAI$    READEAILF05                   45
| 01-C                     END
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R1C00 ... GLASLF03 DETAIL
     C*==============================================================*
07===C           R1C00     BEGSR
|    C**
|    C           2         SUBSTAS06      @AS06   2
|    C           @AS06     LOKUP@W1                      49
| 01-C           *IN49     IFEQ '1'                        * @0-@9
|   C           4         SUBSTAS06:2    W1402S  4
|   C           4         SUBSTAS07:2    W1402E  4
|   C**************
|   C*   GLWF14   *
|   C**************
|   C                     MOVELW1402S    WAS04
|   C           KEY14     SETLLGLWF14R
|   C           WF1502    READEGLWF14R                  46
| 02-C           *IN46     DOWEQ'0'
|   C           WF1402    ANDLEW1402E
|   C******************
|   C*計算金額 1-7  *
|   C******************
|   C                     ADD  WF1405    WCASH1
|   C                     ADD  WF1406    WCASH2
|   C                     ADD  WF1407    WCASH3
|   C                     ADD  WF1408    WCASH4
|   C                     ADD  WF1409    WCASH5
|   C                     ADD  WF1410    WCASH6
|   C                     ADD  WF1411    WCASH7
|   C**************
|   C           WF1502    READEGLWF14R                  46
| 02-C                     END
| 01-C                     END
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          R1D00 ... 新增／更新一筆至工作檔GLWF14 (註一)
     C*                     SCREEN => FILE. GLWF14
     C*==============================================================*
08===C           R1D00     BEGSR
|    C***************************
|    C* WAS04為KEY14之KFLD  *
|    C***************************
|    C                     MOVELAS04      WAS04
|    C*****************************
|    C* AS06前二碼為@-.@S.@C.   *
|    C*  新增一筆至GLWF14       *
|    C*****************************
|    C           KEY14     CHAINGLWF14R              40
|    C           2         SUBSTAS06      @AS06   2
| 01-C           @AS06     IFEQ '@S'
|   C           @AS06     OREQ '@-'
|   C                     MOVEL*BLANKS   WF1402
|   C                     MOVEL*BLANKS   WF1403
|   C                     MOVEL*BLANKS   WF1404
|   C                     Z-ADDWF1502    WF1401
|   C                     MOVELAS04      WF1402
|   C                     MOVEL*BLANKS   WF1403
|   C                     MOVELAS06      WF1404
|   C                     Z-ADD*ZERO     WF1405
|   C                     Z-ADD*ZERO     WF1406
|   C                     Z-ADD*ZERO     WF1407
|   C                     Z-ADD*ZERO     WF1408
|   C                     Z-ADD*ZERO     WF1409
|   C                     Z-ADD*ZERO     WF1410
|   C                     Z-ADD*ZERO     WF1411
| 01*C                     ELSE
|   C*
| 02-C           @AS06     IFEQ '@C'
|   C                     MOVEL*BLANKS   WF1402
|   C                     MOVEL*BLANKS   WF1403
|   C                     MOVEL*BLANKS   WF1404
|   C                     Z-ADDWF1502    WF1401
|   C                     MOVELAS04      WF1402
|   C                     MOVEL'C'       WF1403
|   C                     MOVELAS10      WF1404
|   C                     Z-ADD*ZERO     WF1405
|   C                     Z-ADD*ZERO     WF1406
|   C                     Z-ADD*ZERO     WF1407
|   C                     Z-ADD*ZERO     WF1408
|   C                     Z-ADD*ZERO     WF1409
|   C                     Z-ADD*ZERO     WF1410
|   C                     Z-ADD*ZERO     WF1411
|   C*******************************
|   C* AS06前二碼不為@-.@S.@C.   *
|   C*  新增／更新一筆至GLWF14   *
|   C*******************************
| 02*C                     ELSE
| 03-C           *IN40     IFEQ '0'
|   C                     MULT AS05      WCASH1
|   C                     MULT AS05      WCASH2
|   C                     MULT AS05      WCASH3
|   C                     MULT AS05      WCASH4
|   C                     MULT AS05      WCASH5
|   C                     MULT AS05      WCASH6
|   C                     MULT AS05      WCASH7
|   C                     ADD  WCASH1    WF1405
|   C                     ADD  WCASH2    WF1406
|   C                     ADD  WCASH3    WF1407
|   C                     ADD  WCASH4    WF1408
|   C                     ADD  WCASH5    WF1409
|   C                     ADD  WCASH6    WF1410
|   C                     ADD  WCASH7    WF1411
| 03*C                     ELSE
|   C*
|   C                     MOVEL*BLANKS   WF1402
|   C                     MOVEL*BLANKS   WF1403
|   C                     MOVEL*BLANKS   WF1404
|   C*
|   C                     Z-ADDWF1502    WF1401
|   C                     MOVELAS04      WF1402
|   C                     MOVELAS08      WF1403
|   C                     MOVELAS10      WF1404
|   C                     MULT AS05      WCASH1
|   C                     MULT AS05      WCASH2
|   C                     MULT AS05      WCASH3
|   C                     MULT AS05      WCASH4
|   C                     MULT AS05      WCASH5
|   C                     MULT AS05      WCASH6
|   C                     MULT AS05      WCASH7
|   C                     Z-ADDWCASH1    WF1405
|   C                     Z-ADDWCASH2    WF1406
|   C                     Z-ADDWCASH3    WF1407
|   C                     Z-ADDWCASH4    WF1408
|   C                     Z-ADDWCASH5    WF1409
|   C                     Z-ADDWCASH6    WF1410
|   C                     Z-ADDWCASH7    WF1411
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C*
|    C                     Z-ADD*ZERO     WCASH1
|    C                     Z-ADD*ZERO     WCASH2
|    C                     Z-ADD*ZERO     WCASH3
|    C                     Z-ADD*ZERO     WCASH4
|    C                     Z-ADD*ZERO     WCASH5
|    C                     Z-ADD*ZERO     WCASH6
|    C                     Z-ADD*ZERO     WCASH7
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          R1B10 ... 計算本期金額（註二）
     C*==============================================================*
09===C           R1B10     BEGSR
|    C*
|    C                     MOVEA*ZERO     @@
|    C                     Z-ADD*ZERO     D      132
|    C                     Z-ADD*ZERO     WCASH  132
|    C*
|    C                     Z-ADDAI11      @@,1             *第一期
|    C                     Z-ADDAI12      @@,2             *第二期
|    C                     Z-ADDAI13      @@,3
|    C                     Z-ADDAI14      @@,4
|    C                     Z-ADDAI15      @@,5
|    C                     Z-ADDAI16      @@,6
|    C                     Z-ADDAI17      @@,7
|    C                     Z-ADDAI18      @@,8
|    C                     Z-ADDAI19      @@,9
|    C                     Z-ADDAI20      @@,10
|    C                     Z-ADDAI21      @@,11
|    C                     Z-ADDAI22      @@,12
|    C                     Z-ADDAI23      @@,13
|    C*********************
|    C* 本期金額 WCASH  *
|    C*********************
| 01-C           DMMS      DO   DMME      I       20
|   C                     ADD  @@,I      WCASH
| 01-C                     END
|    C*
| 02-C           WF1503    IFEQ 1
|   C                     ADD  WCASH     WCASH1
| 02-C                     END
|    C*
| 03-C           WF1503    IFEQ 2
|   C                     ADD  WCASH     WCASH2
| 03-C                     END
|    C*
| 04-C           WF1503    IFEQ 3
|   C                     ADD  WCASH     WCASH3
| 04-C                     END
|    C*
| 05-C           WF1503    IFEQ 4
|   C                     ADD  WCASH     WCASH4
| 05-C                     END
|    C*
| 06-C           WF1503    IFEQ 5
|   C                     ADD  WCASH     WCASH5
| 06-C                     END
|    C*
| 07-C           WF1503    IFEQ 6
|   C                     ADD  WCASH     WCASH6
| 07-C                     END
|    C*
| 08-C           WF1503    IFEQ 7
|   C                     ADD  WCASH     WCASH7
| 08-C                     END
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          R3A00 ... GET REPORT HEADING DATA
     C*==============================================================*
10===C           R3A00     BEGSR
|    C*
|    C                     MOVEL*BLANKS   P1501
|    C                     MOVEL*BLANKS   P1501A
|    C                     MOVEL*BLANKS   P1502
|    C                     MOVEL*BLANKS   P1502A
|    C                     MOVEL*BLANKS   P1503
|    C                     MOVEL*BLANKS   P1503A
|    C                     MOVEL*BLANKS   P1504
|    C                     MOVEL*BLANKS   P1504A
|    C                     MOVEL*BLANKS   P1505
|    C                     MOVEL*BLANKS   P1505A
|    C                     MOVEL*BLANKS   P1506
|    C                     MOVEL*BLANKS   P1506A
|    C                     MOVEL*BLANKS   P1507
|    C                     MOVEL*BLANKS   P1507A
|    C*
|    C                     Z-ADDTPAGE     PAGEN2
|    C           WF1401    SETLLGLWF15R
|    C           WF1401    READEGLWF15R                  46
| 01-C           *IN46     DOWEQ'0'
|   C                     Z-ADDWF1401    PAGEN1
|   C*
|   C           WF1501    CHAIN#A0                  40
|   C  N40                MOVEL#A02      W#A02  14
|   C   40                MOVEL*BLANKS   W#A02
|   C*
| 02-C           WF1503    IFEQ 1
|   C                     MOVELWF1501    P1501
|   C                     MOVELW#A02     P1501A
| 02-C                     END
|   C*
| 03-C           WF1503    IFEQ 2
|   C                     MOVELWF1501    P1502
|   C                     MOVELW#A02     P1502A
| 03-C                     END
|   C*
| 04-C           WF1503    IFEQ 3
|   C                     MOVELWF1501    P1503
|   C                     MOVELW#A02     P1503A
| 04-C                     END
|   C*
| 05-C           WF1503    IFEQ 4
|   C                     MOVELWF1501    P1504
|   C                     MOVELW#A02     P1504A
| 05-C                     END
|   C*
| 06-C           WF1503    IFEQ 5
|   C                     MOVELWF1501    P1505
|   C                     MOVELW#A02     P1505A
| 06-C                     END
|   C*
| 07-C           WF1503    IFEQ 6
|   C                     MOVELWF1501    P1506
|   C                     MOVELW#A02     P1506A
| 07-C                     END
|   C*
| 08-C           WF1503    IFEQ 7
|   C                     MOVELWF1501    P1507
|   C                     MOVELW#A02     P1507A
| 08-C                     END
|   C*
|   C           WF1401    READEGLWF15R                  46
| 01-C                     END
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR -- HAS DATA
     C*==============================================================*
11===C           R8900     BEGSR
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* << TOTAL LINE DATA PREPARE >>
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C                     CALL 'GLS008'
|    C                     PARM 'GLR2T0P1'P008I1 10
|    C                     PARM $AR05     P008I2  1
|    C           PSIGN1    PARM           P008O1198
|    C           PSIGN2    PARM           P008O2198
|    C*
|    C                     WRITEPT1
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR -- NO DATA
     C*==============================================================*
12===C           R8999     BEGSR
|    C*
|    C                     EXSR R0100
|    C*
|    C                     WRITEPH1
|    C*
|    C                     WRITEPE9
|    C*
12===C                     ENDSR
     C*==============================================================*
** @W1
@0@1@2@3@4@5@6@7@8@9
