     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : GLR2A01                                    *
     A*    PROGRAM NAME : 分類帳                                   *
     A*    AUTHOR       :  A1149    MAY                              *
     A*    CREATE DATE  :  1992.11.13                                *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 泛太總帳                                 *
     A****************************************************************
     FGLWF02  O   E                    DISK
     FGLA3PF  IF  E           K        DISK
     FGLAFPF  IF  E           K        DISK
     FGLAHLF01IF  E           K        DISK
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      211 2160$C6YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I*DEFINE DATA STRUCTURE
     I            DS
     I                                        1   5 A304
     I                                        1   1 A304#1
     I                                        2   2 A304#2
     I                                        3   3 A304#3
     I                                        4   4 A304#4
     I                                        5   5 A304#5
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYAF     KLIST
     C                     KFLD           AH01
     C                     KFLD           AH04
     C           KEYA3     KLIST
     C                     KFLD           AH01
     C                     KFLD           AF22
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C                     MOVEL*BLANKS   WAH04   8
     C           *LOVAL    SETLLAH0
     C                     READ AH0                      46
     C*
  01-C           *IN46     DOWEQ'0'
    C*
  02-C           AH04      IFNE WAH04
    C           KEYAF     CHAINAF0                  40
  03-C           *IN40     IFEQ '0'
    C*
    C           KEYA3     CHAINA30                  40
  04-C           *IN40     IFEQ '1'
    C                     MOVEL*BLANKS   A304
  04-C                     END
    C*
  03-C                     END
    C                     MOVELAH04      WAH04
  02-C                     END
    C*
    C                     EXSR R1000
    C                     WRITEGLWF02R
    C*
    C                     READ AH0                      46
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R1000 .... ADD DATA TO WORKFILE (GLWF02)
     C*==============================================================*
01===CSR         R1000     BEGSR
|    C*
|    C                     MOVELAH01      W0201
|    C                     MOVELAH04      W0202
|    C*
| 05-C           A304#1    IFEQ 'V'
|   C                     MOVELAH05      W0203
|   C                     MOVELAH05A     W0203A
| 05*C                     ELSE
|   C                     MOVEL*BLANK    W0203
|   C                     MOVEL*BLANK    W0203A
| 05-C                     END
|    C*
| 06-C           A304#2    IFEQ 'V'
|   C                     MOVELAH06      W0204
|   C                     MOVELAH06A     W0204A
| 06*C                     ELSE
|   C                     MOVEL*BLANK    W0204
|   C                     MOVEL*BLANK    W0204A
| 06-C                     END
|    C*
| 07-C           A304#3    IFEQ 'V'
|   C                     MOVELAH07      W0205
|   C                     MOVELAH07A     W0205A
| 07*C                     ELSE
|   C                     MOVEL*BLANK    W0205
|   C                     MOVEL*BLANK    W0205A
| 07-C                     END
|    C*
| 08-C           A304#4    IFEQ 'V'
|   C                     MOVELAH08      W0206
|   C                     MOVELAH08A     W0206A
| 08*C                     ELSE
|   C                     MOVEL*BLANK    W0206
|   C                     MOVEL*BLANK    W0206A
| 08-C                     END
|    C*
| 09-C           A304#5    IFEQ 'V'
|   C                     MOVELAH09      W0207
|   C                     MOVELAH09A     W0207A
| 09*C                     ELSE
|   C                     MOVEL*BLANK    W0207
|   C                     MOVEL*BLANK    W0207A
| 09-C                     END
|    C*
|    C                     Z-ADDAH10      W0208
|    C                     MOVELAH02      W0209
|    C                     Z-ADDAH12      W0210
|    C                     MOVELAH13      W0211
|    C                     MOVELAH16      W0212
|    C                     MOVELAF22      W0213
|    C                     MOVELAF06      W0214
|    C*******              Z-ADDAF07      W0215
|    C                     MOVELAF03      W0216
|    C                     Z-ADDAH03      W0217
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
01===C                     ENDSR
     C*==============================================================*
