     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : GLR2M0                                     *
     H*    PROGRAM NAME : 明細帳列印－科目                         *
     H*    AUTHOR       : A1087  JOYCE                               *
     H*    CREATE DATE  : 1992.11.27                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       : 泛太總帳                                 *
     H****************************************************************
     FGLAHLF02IP  E           K        DISK
     FGLWF10  O   E           K        DISK
     E*
     E                    WA01        5 20
     I* A - E = 為螢幕上所輸入之排序
     I           UDS
     I                                      768 7680A
     I                                      769 7690B
     I                                      770 7700C
     I                                      771 7710D
     I                                      772 7720E
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C                     MOVE AH05      WA01,A
     C                     MOVE AH06      WA01,B
     C                     MOVE AH07      WA01,C
     C                     MOVE AH08      WA01,D
     C                     MOVE *BLANKS   WA01,E
  01-C           AH09      IFNE 0
    C                     CALL 'P56'                      *P56(GET'/')
    C                     PARM AH09      P5601I  80
    C                     PARM           P5601O 10
    C                     MOVELP5601O    WA01,E
  01-C                     END
     C*
     C                     MOVE AH04      WF1001
     C                     MOVE WA01,1    WF1002
     C                     MOVE WA01,2    WF1003
     C                     MOVE WA01,3    WF1004
     C                     MOVE WA01,4    WF1005
     C                     MOVE WA01,5    WF1006
     C                     MOVE AH02      WF1007
     C                     Z-ADDAH12      WF1008
     C                     Z-ADDAH13      WF1009
     C                     MOVE AH16      WF1010
     C                     WRITEGLWF10R
     C*
     CLR                   RETRN
