     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : GLR6H012                                   *
     H*    PROGRAM NAME : 年度資金預算明細表－公司彙總             *
     H*    AUTHOR       : A1150                                      *
     H*    CREATE DATE  : 82/01/06                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       : 泛太總帳                                 *
     H****************************************************************
     FGLAKPF  IF  E           K        DISK
     FPT#BPF  IF  E           K        DISK
     FGLADPF  IF  E           K        DISK
     FGLACPF  IF  E           K        DISK
     FGLA2PF  IF  E           K        DISK
     FGLR6H1P O   E             39     PRINTER
     E*
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DA201
     I                                      503 5050DA202
     I                                      506 5070DA203
     I                                      508 515 DA204F
     I                                      516 523 DA204T
     I                                      524 524 DOP
     I*
     I            DS
     I                                        1   80WAC03A
     I I            0                         3   60PAC03A
     I            DS
     I                                        1   80WAC03B
     I I            0                         3   60PAC03B
     I            DS
     I                                        1   80WAC04B
     I I            0                         3   60PAC04B
     I            DS
     I                                        1   80WAC05B
     I I            0                         3   60PAC05B
     I            DS
     I                                        1   80WAC06B
     I I            0                         3   60PAC06B
     I            DS
     I                                        1   80WAC07B
     I I            0                         3   60PAC07B
     I            DS
     I                                        1   80WAC08B
     I I            0                         3   60PAC08B
     I            DS
     I                                        1   80WAC09B
     I I            0                         3   60PAC09B
     I            DS
     I                                        1   80WAC10B
     I I            0                         3   60PAC10B
     I            DS
     I                                        1   80WAC11B
     I I            0                         3   60PAC11B
     I            DS
     I                                        1   80WAC12B
     I I            0                         3   60PAC12B
     I            DS
     I                                        1   80WAC13B
     I I            0                         3   60PAC13B
     I            DS
     I                                        1   80WAC14B
     I I            0                         3   60PAC14B
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C           *LIKE     DEFN A204      WA204
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYSA2    KLIST
     C                     KFLD           DA201
     C                     KFLD           WA202
     C                     KFLD           DA203
     C                     KFLD           DA204F
     C           KEYEA2    KLIST
     C                     KFLD           DA201
     C                     KFLD           WA202
     C                     KFLD           DA203
     C           KEYAD     KLIST
     C                     KFLD           AD01
     C                     KFLD           AD02
     C           KEYAC     KLIST
     C                     KFLD           AC01
     C                     KFLD           AC02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RI100                      *INITIAL
     C                     EXSR R2100                      *SUB-TOT
     C*
     C           KEYSA2    SETLLA20
     C           KEYEA2    READEA20                      44
  01-C           *IN44     DOWEQ'0'
    C           A204      ANDLEDA204T
    C*
    C*----------------------------------------------------------------
    C  N10                SETON                         59*HAVE DATA
    C  N10                MOVELA204      WA204
    C  N10                EXSR R0100
    C  N10                SETON                         10
    C*----------------------------------------------------------------
  02-C           A204      IFNE WA204
    C                     EXSR R2000                      *PRINT
    C                     EXSR R2100                      *CLR SUB-TOT
    C                     MOVELA204      WA204
  02-C                     END
    C*
    C                     EXSR R1000                      *DETAIL
    C*
    C           KEYEA2    READEA20                      44
  01-C                     END
     C*
  03-C           *IN59     IFEQ '1'
    C                     EXSR R2000                      *PRINT
    C                     EXSR R2100                      *CLR SUB-TOT
    C                     EXSR R3000                      *印合計
  03*C                     ELSE
    C*NO DATA
    C                     EXSR R0100
    C                     WRITEPE9
  03-C                     END
     C*
     C                     SETON                         LR
     C*==============================================================*
     C*          RI100 ....INIT VALUE SET
     C*==============================================================*
01===CSR         RI100     BEGSR
|    C*INITIAL VALUES
|    C*
|    C                     Z-ADD0         INP     80
|    C                     Z-ADD0         OUT     80
|    C                     Z-ADD0         RESL    80
|    C                     Z-ADD0         TEMP1   64
|    C                     Z-ADD0         TEMP2   64
|    C                     SETOF                         59
|    C*轉換年度
|    C*年制為１－西元年，日期格式＝１　ＹＹＭＭＤＤ
|    C*年制為２－中國年，日期格式＝２　ＹＹＹＹＭＭＤＤ
|    C           DA201     CHAINAK0                  40
|    C           DA202     MULT 10000     P3101I
|    C                     CALL 'P31'
|    C                     PARM           P3101I  80
|    C                     PARM AK09      P3102I  1
|    C                     PARM AK09      P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C                     PARM           P3101O  80
|    C           P3101O    DIV  10000     WA202   40
|    C*會計年度月數
|    C                     SETOF                     30
| 05-C           AK10      IFEQ '2'
|   C                     SETON                     30
| 05-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0100 ....PRINT HEADING
     C*==============================================================*
02===CSR         R0100     BEGSR
|    C*---------------------------------------------------------------
|    C                     IN   PTDA01
|    C*
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $PFMT     P3104I  1
|    C                     PARM $PTYPE    P3105I  1
|    C           PDATE     PARM           P3101O  80
|    C*---------------------------------------------------------------
|    C*CHAIN PT#BPF
|    C           DA201     CHAIN#B0                  40
|    C   40                MOVEL*BLANK    #B16
|    C*---------------------------------------------------------------
|    C                     MOVELDA201     AC01
|    C                     Z-ADDWA202     AC02
|    C           KEYAC     CHAINAC0                  40
| 01-C           *IN40     IFEQ '0'
|   C*AC03A
|   C                     Z-ADDAC03A     INP
|   C*****************
|   C*日期格式轉換 FILE->SCREEN
|   C*****************
|   C                     CALL 'P31'
|   C                     PARM INP       P3101I  80
|   C                     PARM '2'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM AK09      P3104I  1
|   C                     PARM AK09      P3105I  1
|   C           OUT       PARM           P3101O  80
|   C                     Z-ADDOUT       WAC03A
|   C*AC03B
|   C                     Z-ADDAC03B     INP
|   C                     EXSR R0200
|   C                     Z-ADDOUT       WAC03B
|   C*AC04B
|   C                     Z-ADDAC04B     INP
|   C                     EXSR R0200
|   C                     Z-ADDOUT       WAC04B
|   C*AC05B
|   C                     Z-ADDAC05B     INP
|   C                     EXSR R0200
|   C                     Z-ADDOUT       WAC05B
|   C*AC06B
|   C                     Z-ADDAC06B     INP
|   C                     EXSR R0200
|   C                     Z-ADDOUT       WAC06B
|   C*AC07B
|   C                     Z-ADDAC07B     INP
|   C                     EXSR R0200
|   C                     Z-ADDOUT       WAC07B
|   C*AC08B
|   C                     Z-ADDAC08B     INP
|   C                     EXSR R0200
|   C                     Z-ADDOUT       WAC08B
|   C*AC09B
|   C                     Z-ADDAC09B     INP
|   C                     EXSR R0200
|   C                     Z-ADDOUT       WAC09B
|   C*AC10B
|   C                     Z-ADDAC10B     INP
|   C                     EXSR R0200
|   C                     Z-ADDOUT       WAC10B
|   C*AC11B
|   C                     Z-ADDAC11B     INP
|   C                     EXSR R0200
|   C                     Z-ADDOUT       WAC11B
|   C*AC12B
|   C                     Z-ADDAC12B     INP
|   C                     EXSR R0200
|   C                     Z-ADDOUT       WAC12B
|   C*AC13B
|   C                     Z-ADDAC13B     INP
|   C                     EXSR R0200
|   C                     Z-ADDOUT       WAC13B
|   C*AC14B
|   C                     Z-ADDAC14B     INP
|   C                     EXSR R0200
|   C                     Z-ADDOUT       WAC14B
|   C*
| 01-C                     END
|    C*
|    C                     WRITEPH1
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          R0200 ....CALL 'P37'已知日期之後一天
     C*==============================================================*
03===CSR         R0200     BEGSR
|    C*
|    C                     CALL 'P37'
|    C                     PARM INP       P3701I  80
|    C                     PARM '2'       P3702I  1
|    C                     PARM '1'       P3703I  1
|    C                     PARM 1         P3704I  40
|    C                     PARM           P3701O  80
|    C*
|    C                     Z-ADDP3701O    P3101I
|    C*****************
|    C*日期格式轉換 FILE->SCREEN
|    C*****************
|    C                     CALL 'P31'
|    C                     PARM           P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM AK09      P3104I  1
|    C                     PARM AK09      P3105I  1
|    C           OUT       PARM           P3101O  80
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....DETAIL
     C*==============================================================*
04===C           R1000     BEGSR
|    C*會計科目不同時列印一筆
|    C                     ADD  A207      TA207
|    C                     ADD  A208      TA208
|    C                     ADD  A209      TA209
|    C                     ADD  A210      TA210
|    C                     ADD  A211      TA211
|    C                     ADD  A212      TA212
|    C                     ADD  A206      TA206
|    C                     ADD  A213      TA213
|    C                     ADD  A214      TA214
|    C                     ADD  A215      TA215
|    C                     ADD  A216      TA216
|    C                     ADD  A217      TA217
|    C                     ADD  A218      TA218
|    C                     ADD  A219      TA219
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R2000 ....PRINT DETAIL
     C*==============================================================*
05===C           R2000     BEGSR
|    C***
|    C*代碼說明
|    C***
|    C                     MOVELWA204     TA204
|    C                     MOVELDA201     AD01
|    C                     MOVELWA204     AD02
|    C           KEYAD     CHAINAD0                  40
|    C   40                MOVEL*BLANK    AD03
|    C*
| 01-C           TA206     IFNE 0
|   C*AU07
|   C           TA207     DIV  TA206     TEMP1
|   C           TEMP1     MULT 100       R01       H
|   C*AU08
|   C           TA208     DIV  TA206     TEMP1
|   C           TEMP1     MULT 100       R02       H
|   C*AU09
|   C           TA209     DIV  TA206     TEMP1
|   C           TEMP1     MULT 100       R03       H
|   C*AU10
|   C           TA210     DIV  TA206     TEMP1
|   C           TEMP1     MULT 100       R04       H
|   C*AU11
|   C           TA211     DIV  TA206     TEMP1
|   C           TEMP1     MULT 100       R05       H
|   C*AU12
|   C           TA212     DIV  TA206     TEMP1
|   C           TEMP1     MULT 100       R06       H
|   C*AU13
|   C           TA213     DIV  TA206     TEMP1
|   C           TEMP1     MULT 100       R08       H
|   C*AU14
|   C           TA214     DIV  TA206     TEMP1
|   C           TEMP1     MULT 100       R09       H
|   C*AU15
|   C           TA215     DIV  TA206     TEMP1
|   C           TEMP1     MULT 100       R10       H
|   C*AU16
|   C           TA216     DIV  TA206     TEMP1
|   C           TEMP1     MULT 100       R11       H
|   C*AU17
|   C           TA217     DIV  TA206     TEMP1
|   C           TEMP1     MULT 100       R12       H
|   C*AU18
|   C           TA218     DIV  TA206     TEMP1
|   C           TEMP1     MULT 100       R13       H
|   C*AU19
|   C           TA219     DIV  TA206     TEMP1
|   C           TEMP1     MULT 100       R14       H
|   C*
| 01*C                     ELSE
|   C                     Z-ADD0         R01
|   C                     Z-ADD0         R02
|   C                     Z-ADD0         R03
|   C                     Z-ADD0         R04
|   C                     Z-ADD0         R05
|   C                     Z-ADD0         R06
|   C                     Z-ADD0         R08
|   C                     Z-ADD0         R09
|   C                     Z-ADD0         R10
|   C                     Z-ADD0         R11
|   C                     Z-ADD0         R12
|   C                     Z-ADD0         R13
|   C                     Z-ADD0         R14
| 01-C                     END
|    C*ADD TO TOTAL
|    C                     ADD  TA207     T01
|    C                     ADD  TA208     T02
|    C                     ADD  TA209     T03
|    C                     ADD  TA210     T04
|    C                     ADD  TA211     T05
|    C                     ADD  TA212     T06
|    C                     ADD  TA206     T07
|    C                     ADD  TA213     T08
|    C                     ADD  TA214     T09
|    C                     ADD  TA215     T10
|    C                     ADD  TA216     T11
|    C                     ADD  TA217     T12
|    C                     ADD  TA218     T13
|    C                     ADD  TA219     T14
|    C*
|    C                     EXSR R9000
|    C                     WRITEPD1
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R2100 ....CLEAR SUBTOT
     C*==============================================================*
06===C           R2100     BEGSR
|    C*
|    C                     Z-ADD0         TA206
|    C                     Z-ADD0         TA207
|    C                     Z-ADD0         TA208
|    C                     Z-ADD0         TA209
|    C                     Z-ADD0         TA210
|    C                     Z-ADD0         TA211
|    C                     Z-ADD0         TA212
|    C                     Z-ADD0         TA213
|    C                     Z-ADD0         TA214
|    C                     Z-ADD0         TA215
|    C                     Z-ADD0         TA216
|    C                     Z-ADD0         TA217
|    C                     Z-ADD0         TA218
|    C                     Z-ADD0         TA219
|    C*
06===C                     ENDSR
     C*===============================================================*
     C*          R3000  ...PRINT TOTAL
     C*===============================================================*
07===C           R3000     BEGSR
|    C*
| 01-C           T07       IFNE 0
|   C*
|   C           T01       DIV  T07       TEMP2
|   C           TEMP2     MULT 100       TR01      H
|   C           T02       DIV  T07       TEMP2
|   C           TEMP2     MULT 100       TR02      H
|   C           T03       DIV  T07       TEMP2
|   C           TEMP2     MULT 100       TR03      H
|   C           T04       DIV  T07       TEMP2
|   C           TEMP2     MULT 100       TR04      H
|   C           T05       DIV  T07       TEMP2
|   C           TEMP2     MULT 100       TR05      H
|   C           T06       DIV  T07       TEMP2
|   C           TEMP2     MULT 100       TR06      H
|   C           T08       DIV  T07       TEMP2
|   C           TEMP2     MULT 100       TR08      H
|   C           T09       DIV  T07       TEMP2
|   C           TEMP2     MULT 100       TR09      H
|   C           T10       DIV  T07       TEMP2
|   C           TEMP2     MULT 100       TR10      H
|   C           T11       DIV  T07       TEMP2
|   C           TEMP2     MULT 100       TR11      H
|   C           T12       DIV  T07       TEMP2
|   C           TEMP2     MULT 100       TR12      H
|   C           T13       DIV  T07       TEMP2
|   C           TEMP2     MULT 100       TR13      H
|   C           T14       DIV  T07       TEMP2
|   C           TEMP2     MULT 100       TR14      H
|   C*
| 01-C                     END
|    C*
|    C                     EXSR R9000
|    C                     WRITEPT1
|    C*CLEAR TOTAL FIELDS
|    C                     Z-ADD0         T01
|    C                     Z-ADD0         T02
|    C                     Z-ADD0         T03
|    C                     Z-ADD0         T04
|    C                     Z-ADD0         T05
|    C                     Z-ADD0         T06
|    C                     Z-ADD0         T07
|    C                     Z-ADD0         T08
|    C                     Z-ADD0         T09
|    C                     Z-ADD0         T10
|    C                     Z-ADD0         T11
|    C                     Z-ADD0         T12
|    C                     Z-ADD0         T13
|    C                     Z-ADD0         T14
|    C                     Z-ADD0         TR01
|    C                     Z-ADD0         TR02
|    C                     Z-ADD0         TR03
|    C                     Z-ADD0         TR04
|    C                     Z-ADD0         TR05
|    C                     Z-ADD0         TR06
|    C                     Z-ADD0         TR08
|    C                     Z-ADD0         TR09
|    C                     Z-ADD0         TR10
|    C                     Z-ADD0         TR11
|    C                     Z-ADD0         TR12
|    C                     Z-ADD0         TR13
|    C                     Z-ADD0         TR14
|    C*
07===C           E1000     ENDSR
     C*===============================================================*
     C*          R9000  ...OVERFLOW
     C*===============================================================*
08===C           R9000     BEGSR
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
08===C                     ENDSR
