     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : GLR6D01                                    *
     A*    PROGRAM NAME : 資產負債表－預算比較                     *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    CREATE DATE  : 1993.01.04                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 泛太總帳                                 *
     A****************************************************************
     FPT#BPF  IF  E           K        DISK
     FGLAFLF03IF  E           K        DISK
     F            AF0                               KRENAMEAFL3
     FGLAXPF  IF  E           K        DISK
     FGLAILF02IF  E           K        DISK
     FGLASLF02IF  E           K        DISK
     F            AS0                               KRENAMEASLF02
     FGLASLF03IF  E           K        DISK
     F            AS0                               KRENAMEASLF03
     FGLWF11  UF  E           K        DISK                      A
     FGLWF12  UF  E           K        DISK                      A
     FGLAULF03IF  E           K        DISK
     FGLR6D0P1O   E             39     PRINTER
     E*---------------------------------------------------------------
     E*科目餘額
     E                    WAI1       13 13 2
     E                    WAU1       13 13 2
     E                    @W1    10  10  2
     E*---------------------------------------------------------------*
     I*
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     IGLDA01      DS
     I                                        1  16 DA01
     I*
     ILDA        UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I* SCREEN INPUT FIELD  ++++++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DAI01
     I                                      503 5050DYEAR
     I                                      506 5070DMM
     I                                      508 5090DAU03
     I                                      518 520 DAR03
     I                                      521 522 DAI01S
     I                                      523 524 DAI01E
     I                                      525 525 DAR05
     I                                      526 5290DAI02
     I                                      530 530 #B12
     I                                      541 548 WAK05
     I                                      549 549 WEND
     I                                      550 550 WCLO
     I            DS
     I                                        1 169 WAI1
     I                                        1  132AI11
     I                                       14  262AI12
     I                                       27  392AI13
     I                                       40  522AI14
     I                                       53  652AI15
     I                                       66  782AI16
     I                                       79  912AI17
     I                                       92 1042AI18
     I                                      105 1172AI19
     I                                      118 1302AI20
     I                                      131 1432AI21
     I                                      144 1562AI22
     I                                      157 1692AI23
     I            DS
     I                                        1 169 WAU1
     I                                        1  132AU07
     I                                       14  262AU08
     I                                       27  392AU09
     I                                       40  522AU10
     I                                       53  652AU11
     I                                       66  782AU12
     I                                       79  912AU13
     I                                       92 1042AU14
     I                                      105 1172AU15
     I                                      118 1302AU16
     I                                      131 1432AU17
     I                                      144 1562AU18
     I                                      157 1692AU19
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C           *NAMVAR   DEFN           GLDA01
     C           *NAMVAR   DEFN *LDA      LDA
     C           *LIKE     DEFN AI01      WAI01
     C           *LIKE     DEFN AS04      WAS04            *BREAK
     C           *LIKE     DEFN AS06      WAS06
     C           *LIKE     DEFN AS08      WAS08
     C           *LIKE     DEFN AS10      WAS10
     C           *LIKE     DEFN AS02      WAR02            *KEY
     C           *LIKE     DEFN AI10      WCASH1           *小計金額1
     C           *LIKE     DEFN AI10      WCASH2           *小計金額2
     C           *LIKE     DEFN AI10      WCH1             *小計金額1
     C           *LIKE     DEFN AI10      WCH2             *小計金額2
     C           *LIKE     DEFN AI10      WCASH3           *本期金額
     C           *LIKE     DEFN WF1101    WF111A
     C           *LIKE     DEFN WF1101    WF111B
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEY#B     KLIST
     C                     KFLD           DAI01            *公司別
     C           KEYAS     KLIST
     C                     KFLD           DAI01            *公司別
     C                     KFLD           WAR02            *報表類別
     C                     KFLD           DAR03            *報表代碼
     C           KEYAX     KLIST
     C                     KFLD           DAI01            *公司別S
     C                     KFLD           AI01             *公司別F
     C           KEYAX1    KLIST
     C                     KFLD           DAI01            *公司別S
     C                     KFLD           AU01             *公司別F
     C           KEYAF     KLIST
     C                     KFLD           WAI01            *公司別
     C                     KFLD           AF02
     C           KEYAU1    KLIST
     C                     KFLD           DAI02
     C                     KFLD           DAU03
     C                     KFLD           AS06
     C           KEYAU2    KLIST
     C                     KFLD           DAI02
     C                     KFLD           DAU03
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      .INIT-HEAD
     C*
     C* (資產)
     C                     MOVEL'20'      WAR02
     C                     EXSR R1000                      .WROK-FILE
     C* (負債權益)
     C                     MOVEL'21'      WAR02
     C                     EXSR R1000                      .WROK-FILE
     C*
     C                     EXSR R8000                      .PRINT
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ... HEADING INITIAL
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     IN   PTDA01
|    C                     IN   GLDA01
|    C*
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $PFMT     P3104I  1
|    C                     PARM $PTYPE    P3105I  1
|    C           PDATE     PARM           P3101O  80
|    C**
| 01-C           #B12      IFEQ '1'
|   C                     MOVELDAI01     WAI01
| 01*C                     ELSE
|   C****************************
|   C*公司別屬虛擬            *
|   C*須CHECK公司結構明細檔 *
|   C****************************
|   C           DAI01     CHAINAX0                  40
|   C  N40                MOVELAX02      WAI01
| 01-C                     END
|    C**************
|    C*<<公司別 >>
|    C                     MOVEL*BLANKS   P#B16
|    C           KEY#B     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '0'
| 03-C           DAR05     IFEQ '1'
|   C                     MOVEL#B16      P#B16
| 03*C                     ELSE
|   C                     MOVEL#B17      P#B16
| 03-C                     END
| 02-C                     END
|    C*******************
|    C* GET會計期間迄日
|    C                     CALL 'GLS006'
|    C                     PARM WAI01     P006I1  2
|    C                     PARM DYEAR     P006I2  40
|    C                     PARM DMM       P006I3  20
|    C                     PARM 'S'       P006I4  1
|    C                     PARM           P006O1  80
|    C           DYMDE     PARM           P006O2  80
|    C                     PARM           P006O3  1
|    C                     PARM           P006O4  1
|    C*
| 04-C           P006O4    IFNE 'Y'
| 05-C           DAR05     IFEQ '1'
|   C                     MOVELDA01      PDA01
| 05*C                     ELSE
|   C                     MOVE DA01      PDA01
| 05-C                     END
| 04-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ... GET DATA TO WORK FILE
     C*==============================================================*
02===C           R1000     BEGSR
|    C**************************
|    C* 逐筆讀取GLASLF02,    *
|    C* 只取AS06為會計科目,*
|    C* 存入GLWF11.          *
|    C**************************
|    C                     Z-ADD*ZERO     WCASH1
|    C                     Z-ADD*ZERO     WCASH2
|    C*
|    C           KEYAS     SETLLASLF02
|    C           KEYAS     READEASLF02                   42
|    C   42                MOVEL*BLANK    WAS04
|    C  N42                MOVELAS04      WAS04
|    C                     MOVELAS06      WAS06
|    C                     MOVELAS08      WAS08
|    C                     MOVELAS10      WAS10
| 01-C           *IN42     DOWEQ'0'                        .EOF
|   C*
| 02-C           AS04      IFNE WAS04
|   C                     EXSR R2100                      *註一
|   C*
| 03-C           WAR02     IFEQ '20'
|   C                     WRITEGLWF11R
| 03*C                     ELSE
|   C                     WRITEGLWF12R
| 03-C                     END
|   C*
|   C                     MOVELAS04      WAS04
|   C                     MOVELAS06      WAS06
|   C                     MOVELAS08      WAS08
|   C                     MOVELAS10      WAS10
| 02-C                     END
|   C*
|   C                     EXSR R2A00                      .DETAIL
|   C*
|   C           KEYAS     READEASLF02                   42
| 01-C                     END
|    C* WRITE最後一筆
| 04-C           WAS04     IFNE *BLANKS
|   C                     EXSR R2100
|   C*
| 05-C           WAR02     IFEQ '20'
|   C                     WRITEGLWF11R
| 05*C                     ELSE
|   C                     WRITEGLWF12R
| 05-C                     END
|   C*
| 04-C                     END
|    C**************************
|    C* 逐筆讀取GLASLF03,    *
|    C* 只取AS06為@------  *
|    C* 存入GLWF11.          *
|    C**************************
|    C                     Z-ADD*ZERO     WCASH1           *實際金額
|    C                     Z-ADD*ZERO     WCASH2           *預算金額
|    C*
|    C           KEYAS     SETLLASLF03
|    C           KEYAS     READEASLF03                   42
|    C   42                MOVEL*BLANK    WAS04
|    C  N42                MOVELAS04      WAS04
|    C                     MOVELAS06      WAS06
|    C                     MOVELAS08      WAS08
|    C                     MOVELAS10      WAS10
|    C*
| 06-C           *IN42     DOWEQ'0'                        .EOF
|   C**********************
|   C*計算基數@T=@BASE1 *
|   C**********************
|   C           2         SUBSTAS06:1    @AS06   2
| 07-C           @AS06     IFEQ '@T'
|   C           4         SUBSTAS06:3    KEY03   4
|   C*
| 08-C           WAR02     IFEQ '20'
|   C                     Z-ADD*ZERO     @BASE1 132
|   C                     Z-ADD*ZERO     @BASE3 132
|   C           KEY03     CHAINGLWF11R              40
|   C  N40                ADD  WF1104    @BASE1
|   C  N40                ADD  WF1105    @BASE3
|   C                     MOVELKEY03     @LINE1  4
| 08*C                     ELSE
|   C                     Z-ADD*ZERO     @BASE2 132
|   C                     Z-ADD*ZERO     @BASE4 132
|   C           KEY03     CHAINGLWF12R              40
|   C  N40                ADD  WF1104    @BASE2
|   C  N40                ADD  WF1105    @BASE4
|   C                     MOVELKEY03     @LINE2  4
| 08-C                     END
|   C****************************
|   C* @T此筆資料不存入GLWF11 *
|   C****************************
|   C                     GOTO TAG#3
| 07-C                     END
|   C****************************
|   C*
| 09-C           AS04      IFNE WAS04
| 10-C           WAR02     IFEQ '20'
|   C           WAS04     CHAINGLWF11R              40
| 10*C                     ELSE
|   C           WAS04     CHAINGLWF12R              40
| 10-C                     END
|   C*
|   C                     EXSR R2100
|   C*
|   C           2         SUBSTWAS06:1   #AS06   2
| 11-C           #AS06     IFNE '@T'
| 12-C           WAR02     IFEQ '20'
|   C   40                WRITEGLWF11R
|   C  N40                UPDATGLWF11R
| 12*C                     ELSE
|   C   40                WRITEGLWF12R
|   C  N40                UPDATGLWF12R
| 12-C                     END
| 11-C                     END
|   C                     MOVELAS04      WAS04
|   C                     MOVELAS06      WAS06
|   C                     MOVELAS08      WAS08
|   C                     MOVELAS10      WAS10
|   C                     Z-ADD*ZERO     WCASH1           *實際金額
|   C                     Z-ADD*ZERO     WCASH2           *預算金額
| 09-C                     END
|   C*
|   C                     EXSR R2B00                      .DETAIL
|   C           TAG#3     TAG
|   C           KEYAS     READEASLF03                   42
| 06-C                     END
|    C* WRITE最後一筆
| 13-C           WAS04     IFNE *BLANKS
|   C                     EXSR R2100
|   C*
| 14-C           WAR02     IFEQ '20'
|   C                     WRITEGLWF11R
| 14*C                     ELSE
|   C                     WRITEGLWF12R
| 14-C                     END
| 13-C                     END
|    C**************************************
|    C* WHEN @T此筆之AS04=*ZERO時,     *
|    C*為GLASLF03第一筆讀入之DATA,     *
|    C* SOMETIMES須重新計算基數@T=@BASE1 *
|    C**************************************
| 15-C           WAR02     IFEQ '20'
|   C           @BASE1    ANDEQ*ZERO
|   C           @BASE3    ANDEQ*ZERO
|   C           WAR02     OREQ '21'
|   C           @BASE2    ANDEQ*ZERO
|   C           @BASE4    ANDEQ*ZERO
|   C*
|   C           KEYAS     SETLLASLF03
|   C           KEYAS     READEASLF03                   42
|   C*
| 16-C           *IN42     DOWEQ'0'                        .EOF
|   C           2         SUBSTAS06:1    @AS06   2
|   C*
| 17-C           @AS06     IFEQ '@T'
|   C           4         SUBSTAS06:3    KEY03   4
| 18-C           WAR02     IFEQ '20'
|   C           KEY03     CHAINGLWF11R              40
|   C  N40                ADD  WF1104    @BASE1
|   C  N40                ADD  WF1105    @BASE3
|   C                     MOVELKEY03     @LINE1
| 18*C                     ELSE
|   C           KEY03     CHAINGLWF12R              40
|   C  N40                ADD  WF1104    @BASE2
|   C  N40                ADD  WF1105    @BASE4
|   C                     MOVELKEY03     @LINE2
| 18-C                     END
|   C*
| 17-C                     END                             .@R
|   C           KEYAS     READEASLF03                   42
| 16-C                     END                             .*IN42
| 15-C                     END                             .@BASE1
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          R2A00 ... GLASLF02 DETAIL
     C*==============================================================*
03===C           R2A00     BEGSR
|    C*****************
|    C* 會計科目檔  *
|    C*****************
|    C           AS06      SETLLAFL3
|    C                     READ AFL3                     46
| 01-C           *IN46     DOWEQ'0'
|   C           AF02      ANDLEAS07
|   C*
|   C*** 會計科目為彙總且不為本期損益
| 02-C***        AF08      IFEQ '2'
|   C***        AF02      ANDNEWAK05
|   C***                  GOTO TAG#1
| 02-C***                  END
|   C*****************
|   C* 年度餘額檔  *
|   C*****************
|   C                     Z-ADD*ZEROS    WCH1
|   C           AF02      SETLLAI0
|   C           AF02      READEAI0                      44
|   C   44                GOTO TAG#2
| 03-C           *IN44     DOWEQ'0'
|   C***********************
|   C* AI01公司別屬虛擬 *
|   C***********************
| 04-C           #B12      IFEQ '2'
|   C           KEYAX     SETLLAX0                      42
|   C  N42                GOTO TAG#1
| 04-C                     END
|   C*
|   C**************************
|   C*計算＝實際金額 WCASH1 *
|   C**************************
|   C                     EXSR R2200                      *
|   C                     ADD  WCASH3    WCH1             *實際金額
|   C*
|   C           AF02      READEAI0                      44
| 03-C                     END
|   C*
|   C           TAG#2     TAG
|   C**************************
|   C** GET上期未年結之金額
| 05-C           WCLO      IFEQ 'N'
|   C                     Z-ADD0         P009O1
|   C                     CALL 'GLS009'
|   C                     PARM WAI01     P009I1  2
|   C                     PARM AF02      P009I2  8
|   C                     PARM DAI02     P009I3  40
|   C                     PARM 'F'       P009I4  1
|   C                     PARM           P009O1 132       *上期金額
|   C                     ADD  P009O1    WCH1
| 05-C                     END
|   C*
|   C                     MULT AS05      WCH1
|   C                     ADD  WCH1      WCASH1           *實際金額
|   C*
|   C           TAG#1     TAG
|   C*******************
|   C* 讀下一會計科目
|   C           AF02      SETGTAFL3
|   C*
|   C                     READ AFL3                     46
| 01-C                     END
|    C*****************
|    C* 預算明細檔  *
|    C*****************
|    C                     Z-ADD*ZEROS    WCH2
|    C           KEYAU1    SETLLAU0
|    C           KEYAU2    READEAU0                      44
|    C   44                GOTO E2A00
| 06-C           *IN44     DOWEQ'0'
|   C           AU04      ANDLEAS07
|   C***********************
|   C* AU01公司別屬虛擬 *
|   C***********************
| 07-C           #B12      IFEQ '2'
|   C           KEYAX1    SETLLAX0                      42
|   C  N42                GOTO TAG#4
| 07*C                     ELSE
| 08-C           AU01      IFNE DAI01
|   C                     GOTO TAG#4
| 08-C                     END
| 07-C                     END
|   C*
|   C**************************
|   C*計算＝預算金額 WCASH2 *
|   C**************************
|   C                     EXSR R2300                      *
|   C                     ADD  WCASH3    WCH2             *預算金額
|   C*
|   C           TAG#4     TAG
|   C           KEYAU2    READEAU0                      44
| 06-C                     END
|    C*
|    C                     MULT AS05      WCH2
|    C                     ADD  WCH2      WCASH2           *預算金額
|    C*
03===C           E2A00     ENDSR
     C*==============================================================*
     C*          R2B00 ... GLASLF03 DETAIL
     C*==============================================================*
04===C           R2B00     BEGSR
|    C**
|    C           2         SUBSTAS06      @AS06   2
|    C           @AS06     LOKUP@W1                      49
| 01-C           *IN49     IFEQ '1'                        * @0-@9
|   C           4         SUBSTAS06:2    WF301S  4
|   C           4         SUBSTAS07:2    WF301E  4
|   C********************
|   C*  GLWF11 | GLWF12 *
|   C********************
| 02-C           WAR02     IFEQ '20'
|   C           WF301S    SETLLGLWF11R
|   C                     READ GLWF11R                  46
| 02*C                     ELSE
|   C           WF301S    SETLLGLWF12R
|   C                     READ GLWF12R                  46
| 02-C                     END
|   C*
| 03-C           *IN46     DOWEQ'0'
|   C           WF1101    ANDLEWF301E
|   C**************************
|   C*計算＝實際金額 WCASH1 *
|   C**************************
|   C                     MULT AS05      WF1104
|   C                     ADD  WF1104    WCASH1
|   C**************************
|   C*計算＝預算金額 WCASH2 *
|   C**************************
|   C                     MULT AS05      WF1105
|   C                     ADD  WF1105    WCASH2
|   C*
| 04-C           WAR02     IFEQ '20'
|   C                     READ GLWF11R                  46
| 04*C                     ELSE
|   C                     READ GLWF12R                  46
| 04-C                     END
| 03-C                     END
| 01-C                     END
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R2100 ... 新增／更新一筆至工作檔GLWF11 (註一)
     C*                     SCREEN => FILE. GLWF11
     C*==============================================================*
05===C           R2100     BEGSR
|    C**************************
|    C* AS06前二碼為@-.@S.@C *
|    C*  新增一筆至GLWF11    *
|    C**************************
|    C           2         SUBSTWAS06     @AS06   2
| 01-C           @AS06     IFEQ '@S'
|   C           @AS06     OREQ '@-'
|   C           @AS06     OREQ '@C'
|   C                     MOVEL*BLANKS   WF1101
|   C                     MOVELWAS04     WF1101
|   C                     MOVEL*BLANKS   WF1102
|   C                     MOVEL*BLANKS   WF1103
| 02-C           @AS06     IFEQ '@C'
|   C                     MOVEL'C'       WF1102
|   C                     MOVELWAS10     WF1103
| 02*C                     ELSE
|   C                     MOVELWAS06     WF1103
| 02-C                     END
|   C                     Z-ADD*ZERO     WF1104
|   C                     Z-ADD*ZERO     WF1105
|   C*******************************
|   C* AS06前二碼不為@-.@S.@C    *
|   C*  新增／更新一筆至GLWF03   *
|   C*******************************
| 01*C                     ELSE
| 03-C           WAR02     IFEQ '20'
|   C           WAS04     CHAINGLWF11R              40
| 03*C                     ELSE
|   C           WAS04     CHAINGLWF12R              40
| 03-C                     END
| 04-C           *IN40     IFEQ '0'
|   C                     ADD  WCASH1    WF1104
|   C                     ADD  WCASH2    WF1105
| 04*C                     ELSE
|   C*
|   C                     MOVEL*BLANKS   WF1101
|   C                     MOVELWAS04     WF1101
|   C                     MOVEL*BLANKS   WF1102
|   C                     MOVELWAS08     WF1102
|   C                     MOVEL*BLANKS   WF1103
|   C                     MOVELWAS10     WF1103
|   C                     Z-ADDWCASH1    WF1104
|   C                     Z-ADDWCASH2    WF1105
| 04-C                     END
| 01-C                     END
|    C*
|    C                     Z-ADD*ZERO     WCASH1           *實際金額
|    C                     Z-ADD*ZERO     WCASH2           *預算金額
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R2200 ... 計算實際金額
     C*==============================================================*
06===C           R2200     BEGSR
|    C*
|    C                     Z-ADDAI10      WCASH3
|    C*
|    C                     Z-ADD1         J       20
| 01-C                     DO   DMM       J
|   C                     ADD  WAI1,J    WCASH3
| 01-C                     END
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R2300 ... 計算預算金額
     C*==============================================================*
07===C           R2300     BEGSR
|    C*
|    C                     Z-ADDDMM       J       20
|    C                     Z-ADDWAU1,J    WCASH3
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          R8000 ... PRINTING MAIN PROCESS
     C*==============================================================*
08===C           R8000     BEGSR
|    C*
|    C                     SETON                     39
|    C                     SETOF                     1082
|    C****************
|    C* 資產負債表 *
|    C****************
|    C           *LOVAL    SETLLGLWF11R
|    C           *LOVAL    SETLLGLWF12R
|    C                     SETOF                     4243
|    C                     SETOF                     8081
|    C*
| 01-C           *IN42     DOWEQ'0'                        .EOF(資產)
|   C           *IN43     OREQ '0'                        .EOF(負債)
|   C*
|   C                     MOVE *BLANKS   WPD01A  1
|   C                     MOVE *BLANKS   WPD01B  1
| 02-C           *IN39     IFEQ '1'
|   C                     WRITEPH01
|   C                     SETOF                     39
| 02-C                     END
|   C***************
|   C* 資產工作檔
|   C           #BEG1     TAG
|   C  N80                READ GLWF11R                  42
|   C   42                SETOF                     3070
| 03-C           *IN42     IFEQ '0'
|   C           *IN80     ANDEQ'0'
|   C                     SETOF                     3070
|   C                     MOVE WF1101    WF111A
|   C*
| 04-C           WF1103    IFEQ '@-      '
|   C                     SETON                     70
| 04*C                     ELSE
| 05-C           WF1103    IFNE '@S      '
|   C*
|   C                     SETON                     30
|   C                     SETOF                     323334
|   C                     SETOF                     747576
|   C                     SETOF                     787960
|   C                     SETOF                     727761
|   C*
| 06-C           WF1102    IFEQ 'C'
|   C                     MOVELWF1103    P113A
|   C                     MOVE 'C'       WPD01A
|   C                     Z-ADD*ZERO     P114A1
|   C                     Z-ADD*ZERO     P114AB
|   C                     Z-ADD*ZERO     P115A1
|   C                     Z-ADD*ZERO     P115AB
|   C                     Z-ADD*ZERO     P145A1
| 06*C                     ELSE
|   C*
| 07-C           WF1102    IFEQ *BLANK
| 08-C           WF1104    IFEQ 0
|   C           WF1105    ANDEQ0
|   C                     GOTO #BEG1
| 08-C                     END
| 07-C                     END
|   C********
|   C* 實際
|   C                     MOVELWF1103    P113A
|   C                     Z-ADDWF1104    P114A1    H
|   C                     Z-ADDWF1104    P114A2    H
| 09-C           WF1102    IFNE *BLANK
|   C                     SETON                     337579
| 09-C                     END
| 10-C           WF1104    IFLT *ZERO
|   C                     SETON                     32
| 10-C                     END
|   C*
| 11-C           *IN82     IFEQ '0'
| 12-C           @BASE1    IFEQ *ZERO
|   C                     SETON                     72
| 12*C                     ELSE
|   C           WF1104    DIV  @BASE1    WP04B   85
|   C           WP04B     MULT 100       P114AB    H
| 13-C           P114AB    IFLT *ZERO
|   C                     SETON                     34
| 13-C                     END
| 12-C                     END
| 11*C                     ELSE
|   C                     Z-ADD*ZERO     P114AB
| 11-C                     END
|   C********
|   C* 預算
|   C                     Z-ADDWF1105    P115A1    H
|   C                     Z-ADDWF1105    P115A2    H
| 14-C           WF1105    IFLT *ZERO
|   C                     SETON                     74
| 14-C                     END
|   C*
| 15-C           *IN82     IFEQ '0'
| 16-C           @BASE3    IFEQ *ZERO
|   C                     SETON                     77
| 16*C                     ELSE
|   C           WF1105    DIV  @BASE3    WP04B   85
|   C           WP04B     MULT 100       P115AB    H
| 17-C           P115AB    IFLT *ZERO
|   C                     SETON                     76
| 17-C                     END
| 16-C                     END
| 15*C                     ELSE
|   C                     Z-ADD*ZERO     P115AB
| 15-C                     END
|   C*************
|   C* 差異金額
|   C           P114A1    SUB  P115A1    P145A1
|   C           P114A1    SUB  P115A1    P145A2
| 18-C           P145A1    IFLT *ZERO
|   C                     SETON                     78
| 18-C                     END
|   C*
| 19-C           *IN82     IFEQ '0'
| 20-C           WF1105    IFEQ *ZERO
|   C                     SETON                     61
| 20*C                     ELSE
|   C           P145A1    DIV  P115A1    WP04B   85
|   C           WP04B     MULT 100       P145AB    H
| 21-C           P145AB    IFLT *ZERO
|   C                     SETON                     60
| 21-C                     END
| 20-C                     END
| 19*C                     ELSE
|   C                     Z-ADD*ZERO     P145AB
| 19-C                     END
|   C*
| 06-C                     END
| 05-C                     END
| 04-C                     END
|   C*
| 03-C                     END
|   C*
|   C* 負債工作檔
|   C           #BEG2     TAG
|   C  N81                READ GLWF12R                  43
|   C   43                SETOF                     3171
| 22-C           *IN43     IFEQ '0'
|   C           *IN81     ANDEQ'0'
|   C                     SETOF                     3171
|   C                     MOVE WF1101    WF111B
|   C*
| 23-C           WF1103    IFEQ '@-      '
|   C                     SETON                     71
| 23*C                     ELSE
| 24-C           WF1103    IFNE '@S      '
|   C*
|   C                     SETON                     31
|   C                     SETOF                     353637
|   C                     SETOF                     626364
|   C                     SETOF                     666768
|   C                     SETOF                     736569
| 25-C           WF1102    IFEQ 'C'
|   C                     MOVELWF1103    P113B
|   C                     MOVE 'C'       WPD01B
|   C                     Z-ADD*ZERO     P114B1
|   C                     Z-ADD*ZERO     P114BB
|   C                     Z-ADD*ZERO     P115B1
|   C                     Z-ADD*ZERO     P115BB
|   C                     Z-ADD*ZERO     P145B1
| 25*C                     ELSE
|   C*
| 26-C           WF1102    IFEQ *BLANK
|   C           WF1104    ANDEQ0
|   C           WF1105    ANDEQ0
|   C                     GOTO #BEG2
| 26-C                     END
|   C********
|   C* 實際
|   C                     MOVELWF1103    P113B
|   C                     Z-ADDWF1104    P114B1    H
|   C                     Z-ADDWF1104    P114B2    H
| 27-C           WF1102    IFNE *BLANK
|   C                     SETON                     366367
| 27-C                     END
| 28-C           WF1104    IFLT *ZERO
|   C                     SETON                     35
| 28-C                     END
|   C*
| 29-C           *IN82     IFEQ '0'
| 30-C           @BASE2    IFEQ *ZERO
|   C                     SETON                     73
| 30*C                     ELSE
|   C           WF1104    DIV  @BASE2    WP04B   85
|   C           WP04B     MULT 100       P114BB    H
| 31-C           P114BB    IFLT *ZERO
|   C                     SETON                     37
| 31-C                     END
| 30-C                     END
| 29*C                     ELSE
|   C                     Z-ADD*ZERO     P114BB
| 29-C                     END
|   C********
|   C* 預算
|   C                     Z-ADDWF1105    P115B1    H
|   C                     Z-ADDWF1105    P115B2    H
| 32-C           WF1105    IFLT *ZERO
|   C                     SETON                     62
| 32-C                     END
|   C*
| 33-C           *IN82     IFEQ '0'
| 34-C           @BASE4    IFEQ *ZERO
|   C                     SETON                     65
| 34*C                     ELSE
|   C           WF1105    DIV  @BASE4    WP04B   85
|   C           WP04B     MULT 100       P115BB    H
| 35-C           P115BB    IFLT *ZERO
|   C                     SETON                     64
| 35-C                     END
| 34-C                     END
| 33*C                     ELSE
|   C                     Z-ADD*ZERO     P115BB
| 33-C                     END
|   C*************
|   C* 差異金額
|   C           P114B1    SUB  P115B1    P145B1
|   C           P114B1    SUB  P115B1    P145B2
| 36-C           P145B1    IFLT *ZERO
|   C                     SETON                     66
| 36-C                     END
|   C*
| 37-C           *IN82     IFEQ '0'
| 38-C           WF1105    IFEQ *ZERO
|   C                     SETON                     69
| 38*C                     ELSE
|   C           P145B1    DIV  P115B1    WP04B   85
|   C           WP04B     MULT 100       P145BB    H
| 39-C           P145BB    IFLT *ZERO
|   C                     SETON                     68
| 39-C                     END
| 38-C                     END
| 37*C                     ELSE
|   C                     Z-ADD*ZERO     P145BB
| 37-C                     END
|   C*
| 25-C                     END
| 24-C                     END
| 23-C                     END
|   C*
| 22-C                     END
|   C*************
|   C* WRITE PD01
| 40-C           *IN42     IFEQ '0'
|   C           *IN43     OREQ '0'
| 41-C           WF111A    IFEQ @LINE1
|   C           WF111B    ANDEQ@LINE2
|   C           WF111A    OREQ @LINE1
|   C           *IN43     ANDEQ'1'
|   C           WF111B    OREQ @LINE2
|   C           *IN42     ANDEQ'1'
|   C                     SETOF                     8081
|   C                     WRITEPT01
| 42-C           WPD01A    IFEQ 'C'
|   C                     WRITEPD01A@
| 42*C                     ELSE
|   C                     WRITEPD01A
| 42-C                     END
| 43-C           WPD01B    IFEQ 'C'
|   C                     WRITEPD01B@
| 43*C                     ELSE
|   C                     WRITEPD01B
| 43-C                     END
|   C                     WRITEPT01
|   C                     SETON                     82
|   C*
| 41*C                     ELSE
| 44-C           WF111A    IFEQ @LINE1
|   C           WF111B    OREQ @LINE2
|   C*
| 45-C           WF111A    IFEQ @LINE1
| 46-C           *IN43     IFEQ '0'
|   C                     SETON                     80
| 46*C                     ELSE
|   C                     SETOF                     80
| 46-C                     END
| 45-C                     END
|   C*
| 47-C           WF111B    IFEQ @LINE2
| 48-C           *IN42     IFEQ '0'
|   C                     SETON                     81
| 48*C                     ELSE
|   C                     SETOF                     81
| 48-C                     END
| 47-C                     END
|   C*
| 44-C                     END
| 49-C           WPD01A    IFEQ 'C'
|   C                     WRITEPD01A@
| 49*C                     ELSE
|   C                     WRITEPD01A
| 49-C                     END
| 50-C           WPD01B    IFEQ 'C'
|   C                     WRITEPD01B@
| 50*C                     ELSE
|   C                     WRITEPD01B
| 50-C                     END
| 41-C                     END
| 40-C                     END
|   C*
|   C  N42N10
|   CORN43N10             SETON                     10
|   C*************************************
| 01-C                     END
|    C*************
|    C* GLR6D0P....
| 51-C           *IN10     IFEQ '1'                        .HAS DATA
|   C                     EXSR R8900                       .LR TOTAL
| 51*C                     ELSE                            .NO DATA
|   C                     EXSR R8999                       .LR NO DATA
| 51-C                     END
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR -- HAS DATA
     C*==============================================================*
09===C           R8900     BEGSR
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* << TOTAL LINE DATA PREPARE >>
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C                     CALL 'GLS008'
|    C                     PARM 'GLR6D0P1'P008I1 10
|    C                     PARM DAR05     P008I2  1
|    C           PSIGN1    PARM           P008O1198
|    C           PSIGN2    PARM           P008O2198
|    C*
|    C                     WRITEPT02
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR -- NO DATA
     C*==============================================================*
10===C           R8999     BEGSR
|    C*
|    C                     EXSR R0100
|    C*
|    C                     WRITEPH01
|    C*
|    C                     WRITEPE01
|    C*
10===C                     ENDSR
     C*==============================================================*
** @W1
@0@1@2@3@4@5@6@7@8@9
