     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : GLR6991                                    *
     H*    PROGRAM NAME : 修繕費ＹＴＤ報表                         *
     H*    AUTHOR       : TINA                                       *
     H*    CREATE DATE  : 1994.12.21                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       : 泛太總帳                                 *
     H****************************************************************
     FGLAHLF01IF  E           K        DISK
     FGLAWF01 UF  E           K        DISK                      A
     E*
     I           UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DAH01S
     I                                      560 561 DAH01E
     I                                      503 5090DAH10
     I                                      511 5180DAH10S
     I                                      517 5180DD
     I                                      521 5280DAH10E
     I*會計年度起日
     I                                      550 5570DAC03A
     I                                      530 535 DAH05S
     I                                      540 545 DAH05E
     I*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF0101
     C                     KFLD           WF0102
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C                     EXSR RTN100                     *GLAHLF
     C                     SETON                     LR
      *==============================================================*
      *          RTN100    GLAHLF01
      *==============================================================*
01===C           RTN100    BEGSR
|    C*
|    C                     READ AH0                      46
| 01-C           *IN46     DOWEQ'0'
|   C                     MOVELAH05      WF0101
|   C                     MOVELAH06      WF0102
|   C           KEYWF     CHAINGLWF01R              45
| 02-C           AH10      IFGE DAH10S
|   C           AH10      ANDLEDAH10E
| 03-C           *IN45     IFEQ '1'
|   C                     Z-ADDAH12      WF0103
|   C                     Z-ADDAH13      WF0104
|   C                     Z-ADDAH12      WF0105
|   C                     Z-ADDAH13      WF0106
|   C                     WRITEGLWF01R
| 03*C                     ELSE
|   C                     ADD  AH12      WF0103
|   C                     ADD  AH13      WF0104
|   C                     ADD  AH12      WF0105
|   C                     ADD  AH13      WF0106
|   C                     UPDATGLWF01R
| 03-C                     END
| 02*C                     ELSE
| 04-C           *IN45     IFEQ '1'
|   C                     Z-ADDAH12      WF0105
|   C                     Z-ADDAH13      WF0106
|   C                     WRITEGLWF01R
| 04*C                     ELSE
|   C                     ADD  AH12      WF0105
|   C                     ADD  AH13      WF0106
|   C                     UPDATGLWF01R
| 04-C                     END
| 02-C                     END
      *
|   C                     Z-ADD0         WF0103
|   C                     Z-ADD0         WF0104
|   C                     Z-ADD0         WF0105
|   C                     Z-ADD0         WF0106
|   C                     READ AH0                      46
| 01-C                     END
|    C*
01===C                     ENDSR
