     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : GLR6G0                                     *
     A*    PROGRAM NAME : 現金流量表－預算比較                     *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    CREATE DATE  : 1993.01.11                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 泛太總帳                                 *
     A****************************************************************
     FPT#APF  IF  E           K        DISK
     FPT#BPF  IF  E           K        DISK
     FGLAKPF  IF  E           K        DISK
     FGLARPF  IF  E           K        DISK
     FGLAXPF  IF  E           K        DISK
     FGLR6G0D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I* SCREEN INPUT FIELD  ++++++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DAH01
     I                                      503 508 DAH05
     I                                      509 5110DYEAR
     I                                      512 5130DMMS
     I                                      514 5150DMME
     I                                      516 5170DAU03
     I                                      518 520 DAR03
     I**
     I                                      521 522 DAH01S
     I                                      523 524 DAH01E
     I                                      525 525 DAR05
     I                                      526 5290DAI02
     I                                      530 530 #B12
     I                                      531 531 W#A10
     I                                      572 5790WAH10S
     I                                      580 5870WAH10E
     I                                      588 5940DAH10S
     I                                      595 6010DAH10E
     I                                      602 621 DAH05S
     I                                      622 641 DAH05E
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C           *NAMVAR   DEFN *LDA      LDA
     C           *LIKE     DEFN AR02      WAR02
     C           *LIKE     DEFN DAH01     WAH01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYAR     KLIST
     C                     KFLD           DAH01
     C                     KFLD           WAR02
     C                     KFLD           DAR03
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN10     PARM *IN10     IN10    1
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   10                EXSR R0200                      *INIT MSG.
     C  N10                EXSR R0100                      *INIT VALUE
     C*
     C                     MOVEL*BLANK    @PRT    1        *PRINT
  01-C           *IN03     DOUEQ'1'
    C           @PRT      OREQ 'Y'
    C                     EXSR R1000                      *SCRN
  01-C                     END
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===CSR         R0100     BEGSR
|    C*
|    C                     SETON                     1027
|    C*
|    C                     IN   PTDA01
|    C*
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $PFMT     P3104I  1
|    C                     PARM $PTYPE    P3105I  1
|    C           DDATE     PARM           P3101O  80
|    C*
|    C                     MOVEL*BLANK    DAH01
|    C                     MOVEL*BLANK    DAH05
|    C                     Z-ADD*ZERO     DYEAR
|    C                     Z-ADD*ZERO     DMMS
|    C                     Z-ADD*ZERO     DMME
|    C                     Z-ADD*ZERO     DAU03
|    C                     MOVEL*BLANK    DAR03
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ....INITIAL VALUE
     C*==============================================================*
02===CSR         R0200     BEGSR
|    C*
|    C                     SETON                     2799  報表格式MESSAGE
|    C*
| 01-C           $PENV     IFEQ '0'                        INQUIRY
|   C                     MOVEL'UPT2142' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C*
| 02-C           $PENV     IFEQ '1'                        ON-LINE
|   C                     MOVEL'UPT2140' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|    C*
| 03-C           $PENV     IFEQ '2'                        BATCH
|   C                     MOVEL'UPT2110' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C*
02===C                     ENDSR
     C*===============================================================*
     C*          R1000  ...SCREEN MAIN PROCESS
     C*===============================================================*
03===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
|   C                     EXSR R1E00                      .PROMPT
|   C                     GOTO E1000
| 02-C                     END
|    C*
|    C                     EXSR R1B00                      .CHECK      ?
|    C*
| 03-C           *IN14     IFEQ '1'
|   C           *IN99     ANDEQ'0'
|   C                     SETOF                     27
|   C                     SETON                     28    .執行中
|   C                     WRITEDSPD1
|   C                     SETOF                     28
|   C*
|   C                     OUT  LDA
|   C                     MOVEL'Y'       @PRT
| 03-C                     END
|    C*
03===C           E1000     ENDSR
     C*===============================================================*
     C*          R1B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
04===C           R1B00     BEGSR
|    C*+<<DATA CHECK>>+++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C*公司別
| 01-C           DAH01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
|    C           DAH01     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
| 03-C           #B12      IFEQ '1'
|   C                     MOVELDAH01     WAH01
|   C                     MOVELDAH01     DAH01S
|   C                     MOVELDAH01     DAH01E
| 03*C                     ELSE
|   C****************************
|   C*公司別屬虛擬            *
|   C*須CHECK公司結構明細檔 *
|   C****************************
|   C           DAH01     CHAINAX0                  40
| 04-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 04-C                     END
|   C   99                GOTO E1B00
|   C*
|   C                     MOVELAX02      WAH01
|   C                     MOVEL*LOVAL    DAH01S
|   C                     MOVEL*HIVAL    DAH01E
|   C*
| 03-C                     END
|    C***************
|    C* CHK成本中心
| 05-C           DAH05     IFNE *BLANK
|   C           DAH05     CHAIN#A0                  40
|   C  N40                MOVEL#A10      W#A10
| 06-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 06-C                     END
| 05*C                     ELSE
|   C                     MOVEL*BLANK    W#A10
| 05-C                     END
|    C   99                GOTO E1B00
|    C*
|    C           WAH01     CHAINAK0                  40
|    C*****************
|    C*會計年度須輸入
| 07-C           DYEAR     IFEQ *ZERO
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 07-C                     END
|    C   99                GOTO E1B00
|    C*****************
|    C*會計期間須輸入
| 08-C           DMMS      IFEQ *ZERO
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 08-C                     END
|    C   99                GOTO E1B00
|    C*
| 09-C           DMME      IFEQ *ZERO
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 09-C                     END
|    C   99                GOTO E1B00
|    C*
| 10-C           DMME      IFGT 13
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 10-C                     END
|    C   99                GOTO E1B00
|    C*
| 11-C           DMMS      IFGT DMME
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     636499
| 11-C                     END
|    C   99                GOTO E1B00
|    C*************
|    C*版次須輸入
| 12-C           DAU03     IFEQ *ZERO
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 12-C                     END
|    C   99                GOTO E1B00
|    C*****************
|    C*報表代碼須輸入
| 13-C           DAR03     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6699
| 13-C                     END
|    C   99                GOTO E1B00
|    C***************
|    C*驗証報表代碼
|    C                     MOVEL'40'      WAR02
|    C           KEYAR     CHAINAR0                  40
| 14-C           *IN40     IFEQ '0'
|   C                     MOVELAR05      DAR05
| 14*C                     ELSE
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6699
| 14-C                     END
|    C   99                GOTO E1B00
|    C*********************
|    C* GET會計期間起迄日
|    C                     CALL 'GLS006'
|    C                     PARM WAH01     P006I1  2
|    C                     PARM DYEAR     P006I2  40
|    C                     PARM DMMS      P006I3  20
|    C                     PARM 'S'       P006I4  1
|    C           DAH10S    PARM           P006O1  80
|    C                     PARM           P006O2  80
|    C                     PARM           P006O3  1
|    C                     PARM           P006O4  1
|    C*
|    C                     CALL 'P31'
|    C                     PARM DAH10S    P3101I  80
|    C                     PARM AK11      P3102I  1
|    C                     PARM AK09      P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           WAH10S    PARM           P3101O  80
|    C*
|    C                     CALL 'GLS006'
|    C                     PARM WAH01     P006I1  2
|    C                     PARM DYEAR     P006I2  40
|    C                     PARM DMME      P006I3  20
|    C                     PARM 'S'       P006I4  1
|    C                     PARM           P006O1  80
|    C           DAH10E    PARM           P006O2  80
|    C                     PARM           P006O3  1
|    C                     PARM           P006O4  1
|    C*
|    C                     CALL 'P31'
|    C                     PARM DAH10E    P3101I  80
|    C                     PARM AK11      P3102I  1
|    C                     PARM AK09      P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           WAH10E    PARM           P3101O  80
|    C****************
|    C* GET會計年度
|    C                     CALL 'GLS005'
|    C                     PARM WAH01     P005I1  2
|    C                     PARM WAH10S    P005I2  80
|    C                     PARM 'F'       P005I3  1
|    C           DAI02     PARM           P005O1  40
|    C                     PARM           P005O2  20
|    C                     PARM           P005O3  1
|    C                     PARM           P005O4  1
|    C*
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* CHK FUN AUT
| 15-C           $PENV     IFNE '2'
|   C           $INQ      ANDNE'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 15-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* GET成本中心起迄
| 16-C           DAH05     IFNE *BLANK
|   C           W#A10     ANDEQ'1'
|   C                     MOVEL*BLANK    DAH05S
|   C                     MOVEL*BLANK    DAH05E
|   C                     MOVELDAH05     DAH05S
|   C                     MOVELDAH05     DAH05E
| 16*C                     ELSE
|   C                     MOVEL*LOVAL    DAH05S
|   C                     MOVEL*HIVAL    DAH05E
| 16-C                     END
|    C*
04===CSR         E1B00     ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
05===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C* 會計年度
| 01-C           #LIN      IFEQ 8
|   C           #COL      ANDGE39
|   C           #COL      ANDLE41
|   C                     CALL 'GLS007'
|   C                     PARM DAH01     P007I1  2         公司別
|   C           DYEAR     PARM DYEAR     P007I2  30        會計年度
|   C                     PARM DMMS      P007O1  20
| 01-C                     END
|    C* 會計期間起
| 02-C           #LIN      IFEQ 9
|   C           #COL      ANDGE39
|   C           #COL      ANDLE40
|   C                     CALL 'GLS007'
|   C                     PARM DAH01     P007I1  2         公司別
|   C           DYEAR     PARM DYEAR     P007I2  30        會計期間
|   C           DMMS      PARM DMMS      P007O1  20
| 02-C                     END
|    C* 會計期間迄
| 03-C           #LIN      IFEQ 9
|   C           #COL      ANDGE44
|   C           #COL      ANDLE45
|   C                     CALL 'GLS007'
|   C                     PARM DAH01     P007I1  2         公司別
|   C           DYEAR     PARM DYEAR     P007I2  30        會計期間
|   C           DMME      PARM DMME      P007O1  20
| 03-C                     END
|    C* 報表代碼
| 04-C           #LIN      IFEQ 11
|   C           #COL      ANDGE39
|   C           #COL      ANDLE41
|   C                     CALL 'GLI350'
|   C                     PARM DAH01     P350I1  2         公司別
|   C                     PARM '40'      P350I2  2         報表類別
|   C           DAR03     PARM DAR03     P350I3  3         報表代碼
|   C                     PARM           @RTNC   2          FUN KEY
| 04-C                     END
|    C* 印表機
| 05-C           #LIN      IFEQ 17
|   C           #COL      ANDGE39
|   C           #COL      ANDLE40
|   C                     CALL 'P64I'
|   C           $PRTCD    PARM $PRTCD    P64II1  2
| 05-C                     END
|    C*
05===C                     ENDSR
