     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : GLS011                                     *
     A*    PROGRAM NAME :字串處理                                  *
     A*    AUTHOR       : A1034  STEPHANIE                           *
     A*    CREATE DATE  : 1992.11.13                                 *
     A*    UPDATE DATE  :                                            *
     A****************************************************************
     E                    @A01       80  1               原始字串
     E                    @A02       80  1               目的字串
     E*---------------------------------------------------------------*
     C*==============================================================*
     C*                    PARM
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           P011I1 80
     C                     PARM           P011I2  30
     C                     PARM           P011I3  1
     C                     PARM           P011O1 80
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
  02-C           P011I3    CASEQ'1'       R1000            除前置空白
  2-C           P011I3    CASEQ'2'       R2000            向中靠
  2-C           P011I3    CASEQ'3'       R3000            向右靠
  02-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R1000 ....除前置空白
     C*==============================================================*
12===C           R1000     BEGSR
|    C*
|    C                     MOVEAP011I1    @A01
|    C                     MOVE *BLANKS   @A02
|    C*
     C           P011I1    IFEQ *BLANKS
|    C                     MOVE *BLANKS   P011O1
     C                     GOTO E1000
     C                     END
     C*
|    C           1         DO   80        WI      30
|    C           @A01,WI   IFNE *BLANKS
|    C                     Z-ADDWI        WI@     30
|    C                     SETON                     33
|    C                     END
|    C  N33                END
|    C*
     C                     Z-ADD0         I       30
     C           WI@       DO   80        WI@
     C                     ADD  1         I
     C                     MOVE @A01,WI@  @A02,I
     C                     END
     C*
|    C                     MOVEA@A02      P011O1
     C*
     C           E1000     ENDSR
     C*==============================================================*
     C*          R2000 ....將字串向中對齊
     C*==============================================================*
12===C           R2000     BEGSR
|    C*
|    C                     MOVEAP011I1    @A01
|    C                     MOVE *BLANKS   @A02
|    C*
     C           P011I1    IFEQ *BLANKS
|    C                     MOVE *BLANKS   P011O1
     C                     GOTO E2000
     C                     END
     C*
|    C                     SETOF                     33
|    C           1         DO   80        WI      30
|    C           @A01,WI   IFNE *BLANKS
|    C                     Z-ADDWI        WI@     30
|    C                     SETON                     33
|    C                     END
|    C  N33                END
|    C*
|    C                     SETOF                     33
|    C           P011I2    DO   80        WI
|    C           @A01,WI   IFNE *BLANKS
|    C                     Z-ADDWI        WJ@     30
|    C                     SETON                     33
|    C                     END
|    C  N33                END  -1
|    C*
|    C           P011I2    SUB  WJ@       WI
|    C                     ADD  WI@       WI
|    C                     ADD  1         WI
|    C                     DIV  2         WI
|    C*
     C           WI        DO   P011I2    I       30
     C                     MOVE @A01,WI@  @A02,I
     C                     ADD  1         WI@
     C                     END
     C*
|    C                     MOVEA@A02      P011O1
     C*
12===C           E2000     ENDSR
     C*==============================================================*
     C*          R3000 ....向右靠
     C*==============================================================*
12===C           R3000     BEGSR
|    C*
|    C                     MOVEAP011I1    @A01
|    C                     MOVE *BLANKS   @A02
|    C*
     C           P011I1    IFEQ *BLANKS
|    C                     MOVE *BLANKS   P011O1
     C                     GOTO E3000
     C                     END
     C*
|    C           P011I2    DO   80        WI      30
|    C           @A01,WI   IFNE *BLANKS
|    C                     Z-ADDWI        WI@     30
|    C                     SETON                     33
|    C                     END
|    C  N33                END  -1
|    C*
     C                     Z-ADDP011I2    I       30
     C                     SETOF                     33
     C           WI@       DO   80        WI
     C                     MOVE @A01,WI   @A02,I
     C                     SUB  1         I
     C           WI        IFEQ 1
     C           I         OREQ 0
|    C                     SETON                     33
     C                     END
     C  N33                END  -1
     C*
|    C                     MOVEA@A02      P011O1
     C*
     C           E3000     ENDSR
