     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM NAME : GLS913                                     *
     H*    AUTHOR       : A1084  CHARLES                             *
     H*    CREATE DATE  : 81/11/19                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :財務系統                                  *
     H*    SUBSYSTEM    :總帳系統                                  *
     H*    REMARK       :檢核物流點                                *
     F****************************************************************
     FPA#FLF02IF  E           K        DISK
     F            #A0                               KRENAME#F01L
     FPA#APF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     I*
     IS002I1      DS
     I                                        3  22 W#A01
      *物流點
     I                                        3   7 W#A01A
     I*WCHK='1' CALL WINDOW
     I                                       33  33 WCHK
     C*==============================================================*
     C*                    PLIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           S002I1 33
      *傳出選擇物流點
     C                     PARM           S002O1  1
      *傳出說明
     C                     PARM           S002O2 20
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEYME     KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     MOVEL'STORAGE' #A01
     C*挑選物流點
  01-C           WCHK      IFEQ '1'
    C                     CALL 'WDS013'
    C                     PARM           #A01
    C           W#A01A    PARM W#A01A    P130I1  5
  01-C                     END
     C*
     C                     MOVELW#A01A    #A02
     C                     MOVELW#A01A    ME01
     C                     MOVEL*BLANKS   ME02
     C           W#A01A    CHAINPA#FLF02             40
  02-C           *IN40     IFEQ '1'
    C                     MOVE 'N'       S002O1
    C                     MOVE *BLANKS   S002O2
    C                     MOVELW#A01A    S002O2
  02*C                     ELSE
    C                     MOVE 'Y'       S002O1
    C                     MOVE *BLANK    W#A01
    C                     MOVE *BLANKS   S002O2
    C           KEY#A     CHAIN#A0                  41
  03-C           *IN41     IFEQ '0'
    C                     MOVEL#A02      W#A01A
    C                     MOVEL#A03      S002O2
  03*C                     ELSE
    C           KEYME     CHAINME0                  41
  04-C           *IN41     IFEQ '0'
    C                     MOVELME01      W#A01A
    C                     MOVELME04      S002O2
  04-C                     END
  03-C                     END
    C*
  02-C                     END
     C*
     C                     SETON                     LR
