     H*擷取完整中文字
     H*
     E*輸入欄位內容說明
     I*
      *傳入參數
     I            DS
     I                                        1  20 W01
     I                                        1   1 G11
     I                                        2   2 G12
     I                                        3   3 G13
     I                                        4   4 G14
     I                                        5   5 G15
     I                                        6   6 G16
     I                                        7   7 G17
     I                                        8   8 G18
     I                                        9   9 G19
     I                                       10  10 G110
     I                                       11  11 G111
     I                                       12  12 G112
     I                                       13  13 G113
     I                                       14  14 G114
     I                                       15  15 G115
     I                                       16  16 G116
     I                                       17  17 G117
     I                                       18  18 G118
     I                                       19  19 G119
     I                                       20  20 G120
     I            DS
     I                                        1   2 OEOF
     I                                        1   1 OE
     I                                        2   2 OF
     C*==============================================================*
     C*                    PLIST
     C*==============================================================*
     C           *ENTRY    PLIST
      *說明欄
     C                     PARM           G1     20
      *傳出擷取後說明
     C                     PARM           G2     20
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     MOVE ''      OEOF
     C                     MOVELG1        W01
     C                     Z-ADD0         OECNT   20
     C                     Z-ADD0         OFCNT   20
     C           G11       IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G11       IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G12       IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G12       IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G13       IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G13       IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G14       IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G14       IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G15       IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G15       IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G16       IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G16       IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G17       IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G17       IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G18       IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G18       IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G19       IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G19       IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G110      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G110      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G111      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G111      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G112      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G112      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G113      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G113      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G114      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G114      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G115      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G115      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G116      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G116      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G117      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G117      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G118      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G118      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G119      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G119      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G120      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G120      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
1----C           OECNT     IFGT OFCNT
||   C           G120      IFEQ OE
||   C                     MOVEL' '       G120
||   C                     ELSE
||   C           G119      IFEQ OE
||   C                     MOVEL' '       G120
||   C                     MOVEL' '       G119
||   C                     ELSE
||   C           G118      IFEQ OE
||   C                     MOVEL' '       G120
||   C                     MOVEL' '       G119
||   C                     MOVEL' '       G118
||   C                     ELSE
||   C           G117      IFEQ OE
||   C                     MOVELOF        G120
||   C                     ELSE
||   C           G116      IFEQ OE
||   C                     MOVEL' '       G120
||   C                     MOVELOF        G119
||   C                     ELSE
||   C           G115      IFEQ OE
||   C                     MOVELOF        G120
||   C                     ELSE
||   C           G114      IFEQ OE
||   C                     MOVEL' '       G120
||   C                     MOVELOF        G119
||   C                     ELSE
||   C           G113      IFEQ OE
||   C                     MOVELOF        G120
||   C                     ELSE
||   C           G112      IFEQ OE
||   C                     MOVEL' '       G120
||   C                     MOVELOF        G119
||   C                     ELSE
||   C           G111      IFEQ OE
||   C                     MOVELOF        G120
||   C                     ELSE
||   C           G110      IFEQ OE
||   C                     MOVEL' '       G120
||   C                     MOVELOF        G119
||   C                     ELSE
||   C           G19       IFEQ OE
||   C                     MOVELOF        G120
||   C                     ELSE
||   C           G18       IFEQ OE
||   C                     MOVEL' '       G120
||   C                     MOVELOF        G119
||   C                     ELSE
||   C           G17       IFEQ OE
||   C                     MOVELOF        G120
||   C                     ELSE
||   C           G16       IFEQ OE
||   C                     MOVEL' '       G120
||   C                     MOVELOF        G119
||   C                     ELSE
||   C           G15       IFEQ OE
||   C                     MOVELOF        G120
||   C                     ELSE
||   C           G14       IFEQ OE
||   C                     MOVEL' '       G120
||   C                     MOVELOF        G119
||   C                     ELSE
||   C           G13       IFEQ OE
||   C                     MOVELOF        G120
||   C                     ELSE
||   C           G12       IFEQ OE
||   C                     MOVEL' '       G120
||   C                     MOVELOF        G119
||   C                     ELSE
||   C           G11       IFEQ OE
||   C                     MOVELOF        G120
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C*
1----C                     END
     C*
     C                     MOVELW01       G2
     C*
     C                     SETON                     LR
