     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM NAME : GLS915                                     *
     H*    AUTHOR       : A1084  CHARLES                             *
     H*    CREATE DATE  : 81/11/19                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :財務系統                                  *
     H*    SUBSYSTEM    :總帳系統                                  *
     H*    REMARK       :檢核規則代碼代碼                          *
     F****************************************************************
     FCKHDLF96IF  E           K        DISK
     FCKHBLF01IF  E           K        DISK
     I*
     IS002I1      DS
     I                                        1   2 WAK01
     I                                        3  22 W#A01
      *帳戶簡碼
     I                                        3   8 W#A01A
     I*WCHK='1' CALL WINDOW
     I                                       33  33 WCHK
     C*==============================================================*
     C*                    PLIST
     C*==============================================================*
     C           *ENTRY    PLIST
      *公司＋員工代號＋說明
     C                     PARM           S002I1 33
      *傳出選擇員工代號
     C                     PARM           S002O1  1
      *傳出說明
     C                     PARM           S002O2 20
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYHD     KLIST
     C                     KFLD           WAK01
     C                     KFLD           W#A01A
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
  01-C           WCHK      IFEQ '1'
    C                     CALL 'WDS033'
    C                     PARM WAK01     P130I0  2
    C           W#A01A    PARM W#A01A    P130I1  6
     C                     PARM '2'       P130I2  1
  01-C                     END
     C*
     C           KEYHD     CHAINHD0                  40
  02-C           *IN40     IFEQ '1'
    C                     MOVE 'N'       S002O1
    C                     MOVE *BLANKS   S002O2
    C                     MOVELW#A01A    S002O2
  02*C                     ELSE
    C                     MOVE 'Y'       S002O1
    C                     MOVE *BLANK    W#A01
    C                     MOVELHD04      W#A01A
    C                     MOVE *BLANKS   S002O2
     C           HD03      CHAINHB0                  41
     C           *IN41     IFEQ '0'
    C                     MOVELHB03      S002O2
     C                     END
  02-C                     END
     C*
     C                     SETON                     LR
