     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM NAME : GLS912                                     *
     H*    AUTHOR       : A1084  CHARLES                             *
     H*    CREATE DATE  : 81/11/19                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :財務系統                                  *
     H*    SUBSYSTEM    :總帳系統                                  *
     H*    REMARK       :檢核規則代碼代碼                          *
      *==============================================================*
      * MODI CODE |  AUTHOR  |  DATE  | DESCRIPTION
      *--------------------------------------------------------------*
      *  M001     | MICHELLE |02.01.29|摘要欄位，要注意切中文
      *--------------------------------------------------------------*
      *  M002     | MICHELLE |02.07.26|不檢核是否存在檔案中
      *==============================================================*
     F****************************************************************
     FAPUXLF02IF  E           K        DISK
     I*
     IS002I1      DS
     I                                        1   2 WAK01
     I                                        3  22 W#A01
      *促銷案號
     I                                        3  10 W#A01A
     I*WCHK='1' CALL WINDOW
     I                                       33  33 WCHK
     C*==============================================================*
     C*                    PLIST
     C*==============================================================*
     C           *ENTRY    PLIST
      *公司＋員工代號＋說明
     C                     PARM           S002I1 33
      *傳出選擇員工代號
     C                     PARM           S002O1  1
      *傳出說明
     C                     PARM           S002O2 20
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYUX     KLIST
     C                     KFLD           WAK01
     C                     KFLD           W#A01A
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
  01-C           WCHK      IFEQ '1'
    C                     CALL 'APS997'
    C                     PARM WAK01     P130I0  2
    C           W#A01A    PARM W#A01A    P130I1  8
     C                     PARM '2'       P130I2  1
  01-C                     END
     C*
     C           KEYUX     CHAINUX0                  40
  02-C           *IN40     IFEQ '1'
    C                     MOVE 'N'       S002O1
    C                     MOVE *BLANKS   S002O2
    C                     MOVELW#A01A    S002O2
  02*C                     ELSE
    C                     MOVE 'Y'       S002O1
    C                     MOVE *BLANK    W#A01
    C                     MOVELUX02      W#A01A
    C*M001M               MOVELUX16      S002O2
M001AC                     MOVEL*BLANKS   WAH16  20
M001AC                     MOVELUX16      WAH16
M001AC                     CALL 'GLS919'
M001AC                     PARM WAH16     G1     20
M001AC                     PARM           G2     20
M001AC                     MOVELG2        S002O2
  02-C                     END
     C*
     C                     SETON                     LR
