     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM NAME : GLS003                                     *
     H*    AUTHOR       : A1034  STEPHANIE                           *
     H*    CREATE DATE  : 79/11/22                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :財務系統                                  *
     H*    SUBSYSTEM    :總帳系統                                  *
     H*    REMARK       :檢核証券類代碼                            *
     F****************************************************************
     FPT#YPF  IF  E           K        DISK
     I*
     IS003I1      DS
     I                                        3  22 W#Y02
     I                                       23  32 W#Y01
     I                                       33  33 WCHK
     C*==============================================================*
     C*                    PLIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           S003I1 33
     C                     PARM           S003O1  1
     C                     PARM           S003O2 20
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #Y01
     C                     KFLD           #Y02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     MOVELW#Y01     #Y01
     C*挑選証券代號
  01-C           WCHK      IFEQ '1'
    C                     CALL 'PTI121'
    C                     PARM W#Y01     S111I1 10
    C           #Y02      PARM           S111O1 10
    C*****                PARM           S111O2  2
  01-C                     ELSE
     C                     MOVELW#Y02     #Y02
  01-C                     END
     C*
     C           KEY#A     CHAIN#Y0                  40
  02-C           *IN40     IFEQ '1'
    C                     MOVE 'N'       S003O1
    C                     MOVELW#Y02     S003O2
  02*C                     ELSE
    C                     MOVE 'Y'       S003O1
     C                     MOVE *BLANK    W#Y02
     C                     MOVEL#Y02      W#Y02
    C                     MOVEL#Y03      S003O2
  02-C                     END
     C*
     C                     SETON                     LR
