     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM NAME : GLS901                                     *
     H*    AUTHOR       : A1034  STEPHANIE                           *
     H*    CREATE DATE  : 81/11/19                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :財務系統                                  *
     H*    SUBSYSTEM    :總帳系統                                  *
     H*    REMARK       :檢核規則代碼代碼                          *
     F****************************************************************
     FPT#ALF01IF  E           K        DISK
     I*
     IS002I1      DS
     I                                        3  22 W#A01
     I                                        3   8 W#A01A
     I                                       23  32 W#A11
     I                                       23  23 W#A11A
     I                                       33  33 WCHK
     C*==============================================================*
     C*                    PLIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           S002I1 33
     C                     PARM           S002O1  1
     C                     PARM           S002O2 20
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           W#A11A
     C                     KFLD           W#A01A
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*挑選成本中心
  01-C           WCHK      IFEQ '1'
    C                     CALL 'PTI140'
    C           W#A01A    PARM W#A01A    P130I1  6
    C                     PARM           @RTNC   2
  01-C                     END
     C*
     C           KEY#A     CHAIN#A0                  40
  02-C           *IN40     IFEQ '1'
    C           #A10      OREQ '2'
    C                     MOVE 'N'       S002O1
    C                     MOVE *BLANKS   S002O2
    C                     MOVELW#A01A    S002O2
  02*C                     ELSE
    C                     MOVE 'Y'       S002O1
    C                     MOVE *BLANK    W#A01
    C                     MOVEL#A01      W#A01A
    C                     MOVE *BLANKS   S002O2
    C                     MOVEL#A02      S002O2
  02-C                     END
     C*
     C                     SETON                     LR
