     F*================================================================
     F* CODE | AUTHOR |  DATE  | DESCRIPTION
     F*----------------------------------------------------------------
     F* M001 |MICHELLE|02.08.30|變更AMP CODE檔案
     F*----------------------------------------------------------------
     F*================================================================
M001MF*NPNAPF  IF  E           K        DISK
M001MFNPNGPF  IF  E           K        DISK
     I*
     IS002I1      DS
     I                                        3  22 W#A01
      *Ａ＆Ｐ
M001MI*                                       3   5 W#A01A
M001MI                                        3   8 W#A01A
      *傳入參數
     I                                       23  32 WPARM2
     I                                       23  26 YEAR1C
     I                                       28  31 YEAR2C
     I                                       32  32 CHKFLD
     I*WCHK='1' CALL WINDOW
     I                                       33  33 WCHK
     C*==============================================================*
     C*                    PLIST
     C*==============================================================*
     C           *ENTRY    PLIST
      *公司＋產品代號＋說明
     C                     PARM           S002I1 33
      *傳出選擇產品代號
     C                     PARM           S002O1  1
      *傳出說明
     C                     PARM           S002O2 20
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
M002MC*          KEYNA     KLIST
"    C*                    KFLD           $YEAR   40
"    C*                    KFLD           W#A01A
M002MC           KEYNG     KLIST
"    C                     KFLD           W#A01A
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C           CHKFLD    IFNE *BLANK
     C                     Z-ADD0         DYEAR   20
     C           YEAR1C    IFNE *BLANK
     C                     MOVE YEAR1C    DYEAR
     C                     MOVELYEAR1C    $YEAR   40
     C                     END
     C*挑選產品代號
  01-C           WCHK      IFEQ '1'
M002MC*                    CALL 'NPW001'
M002MC                     CALL 'NPW002'
|   C*M002D               PARM DYEAR     PARMW1  30
|   C*M002M     W#A01A    PARM W#A01A    PARMW2  3
M002MC           W#A01A    PARM W#A01A    PARMW2  6
  01-C                     END
     C*
M002MC*          KEYNA     CHAINNA0                  40
M002MC           KEYNG     CHAINNG0                  40
  02-C           *IN40     IFEQ '1'
    C                     MOVE 'N'       S002O1
    C                     MOVE *BLANKS   S002O2
    C                     MOVELW#A01A    S002O2
  02*C                     ELSE
    C                     MOVE 'Y'       S002O1
    C                     MOVE *BLANK    W#A01
    C*M002M               MOVELNA02      W#A01A
M002MC                     MOVELNG02      W#A01A
    C                     MOVE *BLANKS   S002O2
    C*M002M               MOVELNA03      S002O2
M002MC                     MOVELNG02      S002O2
  02-C                     END
     C*
     C           CHKFLD    IFEQ '2'
     C           S002O1    ANDEQ'N'
     C           YEAR2C    ANDNE*BLANK
     C                     MOVELYEAR2C    $YEAR
M002MC*          KEYNA     CHAINNA0                  40
M002MC           KEYNG     CHAINNG0                  40
  02-C           *IN40     IFEQ '1'
    C                     MOVE 'N'       S002O1
    C                     MOVE *BLANKS   S002O2
    C                     MOVELW#A01A    S002O2
  02*C                     ELSE
    C                     MOVE 'Y'       S002O1
    C                     MOVE *BLANK    W#A01
    C*M002M               MOVELNA02      W#A01A
M002MC                     MOVELNG02      W#A01A
    C                     MOVE *BLANKS   S002O2
    C*M002M               MOVELNA03      S002O2
M002MC                     MOVELNG02      S002O2
  02-C                     END
  02-C                     END
     C*
  02-C                     END
     C                     SETON                     LR
