     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM NAME : GLS904                                     *
     H*    AUTHOR       : A1084  CHARLES                             *
     H*    CREATE DATE  : 81/11/19                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :財務系統                                  *
     H*    SUBSYSTEM    :總帳系統                                  *
     H*    REMARK       :檢核客戶代號                              *
     F****************************************************************
     FMTMEPF  IF  E           K        DISK
     I*
     IS002I1      DS
     I                                        3  22 W#A01
      *客戶代號
     I                                        3   7 W#A01A
     I*WCHK='1' CALL WINDOW
     I                                       33  33 WCHK
     C*==============================================================*
     C*                    PLIST
     C*==============================================================*
     C           *ENTRY    PLIST
      *公司＋客戶代號＋說明
     C                     PARM           S002I1 33
      *傳出選擇客戶代號
     C                     PARM           S002O1  1
      *傳出說明
     C                     PARM           S002O2 20
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYMD     KLIST
     C                     KFLD           W#A01A
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*挑選客戶代號
  01-C           WCHK      IFEQ '1'
    C                     CALL 'WDS003'
    C           W#A01A    PARM W#A01A    P130I1  9
  01-C                     END
     C*
     C           KEYMD     CHAINME0                  40
  02-C           *IN40     IFEQ '1'
    C                     MOVE 'N'       S002O1
    C                     MOVE *BLANKS   S002O2
    C                     MOVELW#A01A    S002O2
  02*C                     ELSE
    C                     MOVE 'Y'       S002O1
    C                     MOVE *BLANK    W#A01
    C                     MOVELME01      W#A01A
    C                     MOVE *BLANKS   S002O2
    C                     MOVELME04      S002O2
  02-C                     END
     C*
     C                     SETON                     LR
