     H*擷取完整中文字
     H*
     E*輸入欄位內容說明
     I*
      *傳入參數
     I            DS
     I                                        1  50 W01
     I                                        1   1 G11
     I                                        2   2 G12
     I                                        3   3 G13
     I                                        4   4 G14
     I                                        5   5 G15
     I                                        6   6 G16
     I                                        7   7 G17
     I                                        8   8 G18
     I                                        9   9 G19
     I                                       10  10 G110
     I                                       11  11 G111
     I                                       12  12 G112
     I                                       13  13 G113
     I                                       14  14 G114
     I                                       15  15 G115
     I                                       16  16 G116
     I                                       17  17 G117
     I                                       18  18 G118
     I                                       19  19 G119
     I                                       20  20 G120
     I                                       21  21 G121
     I                                       22  22 G122
     I                                       23  23 G123
     I                                       24  24 G124
     I                                       25  25 G125
     I                                       26  26 G126
     I                                       27  27 G127
     I                                       28  28 G128
     I                                       29  29 G129
     I                                       30  30 G130
     I                                       31  31 G131
     I                                       32  32 G132
     I                                       33  33 G133
     I                                       34  34 G134
     I                                       35  35 G135
     I                                       36  36 G136
     I                                       37  37 G137
     I                                       38  38 G138
     I                                       39  39 G139
     I                                       40  40 G140
     I                                       41  41 G141
     I                                       42  42 G142
     I                                       43  43 G143
     I                                       44  44 G144
     I                                       45  45 G145
     I                                       46  46 G146
     I                                       47  47 G147
     I                                       48  48 G148
     I                                       49  49 G149
     I                                       50  50 G150
     I            DS
     I                                        1   2 OEOF
     I                                        1   1 OE
     I                                        2   2 OF
     C*==============================================================*
     C*                    PLIST
     C*==============================================================*
     C           *ENTRY    PLIST
      *說明欄
     C                     PARM           G1     50
      *傳出擷取後說明
     C                     PARM           G2     50
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     MOVE ''      OEOF
     C                     MOVELG1        W01
     C                     Z-ADD0         OECNT   20
     C                     Z-ADD0         OFCNT   20
     C           G11       IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G11       IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G12       IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G12       IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G13       IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G13       IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G14       IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G14       IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G15       IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G15       IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G16       IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G16       IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G17       IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G17       IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G18       IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G18       IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G19       IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G19       IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G110      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G110      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G111      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G111      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G112      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G112      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G113      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G113      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G114      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G114      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G115      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G115      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G116      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G116      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G117      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G117      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G118      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G118      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G119      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G119      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G120      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G120      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G121      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G121      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G122      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G122      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G123      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G123      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G124      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G124      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G125      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G125      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G126      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G126      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G127      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G127      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G128      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G128      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G129      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G129      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G130      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G130      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G131      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G131      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G132      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G132      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G133      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G133      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G134      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G134      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G135      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G135      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G136      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G136      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G137      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G137      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G138      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G138      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G139      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G139      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G140      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G140      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G141      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G141      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G142      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G142      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G143      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G143      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G144      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G144      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G145      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G145      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G146      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G146      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G147      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G147      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G148      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G148      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G149      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G149      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
     C           G150      IFEQ OE
     C                     ADD  1         OECNT
     C                     ELSE
     C           G150      IFEQ OF
     C                     ADD  1         OFCNT
     C                     END
     C                     END
1----C           OECNT     IFGT OFCNT
||   C           G150      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     ELSE
||   C           G149      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVEL' '       G149
||   C                     ELSE
||   C           G148      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVEL' '       G149
||   C                     MOVEL' '       G148
||   C                     ELSE
||   C           G147      IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G146      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G145      IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G144      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G143      IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G142      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G141      IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G140      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G139      IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G138      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G137      IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G136      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G135      IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G134      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G133      IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G132      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G131      IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G130      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G129      IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G128      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G127      IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G126      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G125      IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G124      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G123      IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G122      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G121      IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G120      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G119      IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G118      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G117      IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G116      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G115      IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G114      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G113      IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G112      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G111      IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G110      IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G19       IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G18       IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G17       IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G16       IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G15       IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G14       IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G13       IFEQ OE
||   C                     MOVELOF        G150
||   C                     ELSE
||   C           G12       IFEQ OE
||   C                     MOVEL' '       G150
||   C                     MOVELOF        G149
||   C                     ELSE
||   C           G11       IFEQ OE
||   C                     MOVELOF        G150
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C                     END
||   C*
1----C                     END
     C*
     C                     MOVELW01       G2
     C*
     C                     SETON                     LR
