     A*%%TS  SD  19921212  094024  TSPGMR      REL-V2R1M1  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CA03(03)
     A          R DSP01
     A*%%TS  SD  19921113  094525  TSPGMR      REL-V2R1M1  5738-PW1
     A                                  3 29'公司別  :'
     A            FLD1           2   B  3 41
     A                                  4 29'會計科目:'
     A            FLD2           8   B  4 41
     A                                  5 29'日期　　:'
     A            FLD3           8  0B  5 41EDTWRD('    /  /  ')
     A                                  6 29'日期型態:'
     A            FLD4           1   B  6 41
     A                                  6 51'S - screen  F-file'
     A                                  7 29'成本中心:'
     A            FLD5           6   B  7 41
     A                                  9 25'-----------------------------------
     A                                      ------------'
     A                                 11 29'未滿期金額:'
     A            FLD6          13  2  11 44EDTCDE(J)
