     H****************************************************************
     A*   人頭馬寰盛洋酒股份有限公司－版權所有    TEL:8773-9099    *
     A*                                                              *
     A*    PROGRAM-ID   : NPA008                                     *
     A*    PROGRAM NAME : 產生新年度預算資料                       *
     A*    AUTHOR       : MICHELLE                                   *
     A*    CREATE DATE  : 2002.02.19                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 產品促銷預算                             *
     F****************************************************************
     FNPNDPF  UF  E           K        DISK                      A
     FPT#BPF  IF  E           K        DISK
     FNPNAPF  IF  E           K        DISK
     FPA#7PF  IF  E           K        DISK
     FPA#ALF10IF  E           K        DISK
     FMTMALF02IF  E           K        DISK
     FNPA007D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     E*                   @A01        5  1               作業權利
     E*---------------------------------------------------------------*
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I*WORK LOCAL DATA AREA
     I                                      501 502 WND01
     I                                      503 506 WND02
     I                                      507 508 WND03
     I                                      509 510 WND04
     I                                      511 512 WND19
     I                                      513 513 WND20
     I            DS
     I                                        1   2 MA11
     I                                        1   1 MA11L
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYND     KLIST                           *SETLL ND0
     C                     KFLD           DND01
     C                     KFLD           DND02
     C                     KFLD           DND03
     C                     KFLD           DND04
     C                     KFLD           DND05
     C                     KFLD           DND19
     C                     KFLD           DND20
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     MOVE 'SC01'    SCID    4
|    C*
     C                     IN   PTDA01
     C*
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
     C*
     C* SC01 FIELD INITIALIZE *--------------------------------------*
     C*                    Z-ADD$C8YMD    DATE
|    C                     Z-ADD1         DOPT
|    C                     MOVEL'RM'      DND01
|    C                     MOVEL*BLANK    DND02
|    C                     MOVEL*BLANK    DND03
|    C                     MOVEL*BLANK    DND04
|    C                     MOVEL*BLANK    DND19
|    C                     MOVEL*BLANK    DND20
|    C*--------------------------------------------------------------*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E1000
| 01-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 03-C           *IN99     IFEQ '0'                        *SCR CHK OK
|   C                     EXSR R1C00                      *拷貝選擇
| 03-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1B00 .... 'SC01' SCREEN CHECK
     C*==============================================================*
04===C           R1B00     BEGSR
|    C*
|    C* DATA CHECK *--------------------------------------------------*
|    C*
     C           DND01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 03-C                     END
|    C   99                GOTO E1B00
     C*
     C           DND01     CHAIN#B0                  40
     C           *IN40     IFEQ '1'
     C           #B12      ORNE '1'
|   C                     MOVEL'UGL0004' ERRID
|   C                     MOVEL'GLMF'    ERRF
|   C                     SETON                     6099
| 03-C                     END
|    C   99                GOTO E1B00
|    C*
| 03-C           DND02     IFEQ *ZERO
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 03-C                     END
|    C   99                GOTO E1B00
     C*
| 03-C           DND04     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 03-C                     END
|    C   99                GOTO E1B00
     C*
| 03-C           DND19     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 03-C                     END
|    C   99                GOTO E1B00
     C*
| 03-C           DND20     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 03-C                     END
|    C   99                GOTO E1B00
     C*
     C                     MOVEL*BLANKS   WMA10   2
     C                     MOVELDND04     WMA10
     C           WMA10     CHAINMA0                  47
     C           *IN47     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
     C                     ELSE
     C           MA11L     IFEQ '1'
     C                     MOVEL'10'      DND03
     C                     ELSE
     C           MA11L     IFEQ '2'
     C                     MOVEL'20'      DND03
     C                     ELSE
     C           MA11L     IFEQ '3'
     C                     MOVEL'30'      DND03
     C                     END
     C                     END
     C                     END
     C                     END
     C   99                GOTO E1B00
     C*
|   C                     MOVEL*BLANKS   W10    10
|   C                     MOVELDND19     W10
|   C           W10       CHAIN#70                  40
| 14-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 14-C                     END
     C   99                GOTO E1B00
|    C**
     C* CHK容量
|    C**
|   C                     MOVEL*BLANKS   W10    10
|   C                     MOVELDND20     W10
|   C           W10       CHAIN#A0                  40
| 14-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 14-C                     END
     C   99                GOTO E1B00
      *
04===C           E1B00     ENDSR
     C*
     C*==============================================================*
     C*          R1C00 ....拷貝選擇
     C*==============================================================*
05===C           R1C00     BEGSR
|    C*
| 01-C           *IN14     IFEQ '1'                        拷貝作業
     C*
|   C           DOPT      CASEQ1         R1C10
|   C           DOPT      CASEQ2         R1C20
| 01*C           DOPT      CASEQ3         R1C30
|   C                     END
     C*
     C           *IN99     IFEQ '0'
|   C                     MOVEL'UPT2142' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
     C                     END
     C*
| 01-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R1C10 ....不存在WRITE,存在　放棄拷貝
     C*==============================================================*
06===C           R1C10     BEGSR
|    C*
     C           DND02     CHAINNA0                  48
     C           *IN48     IFEQ '1'
|   C                     MOVEL'UNP0001' ERRID
|   C                     MOVEL'NPMF'    ERRF
|   C                     SETON                     99
| 14-C                     END
     C   99                GOTO E1C10
     C*
     C           DND02     SETLLNA0
     C           DND02     READENA0                      49
     C           *IN49     DOWEQ'0'
      *
     C           NA04      IFEQ DNA04
     C                     MOVELNA02      DND05   3
     C           KEYND     CHAINND0                  50
     C           *IN50     IFEQ '1'
     C*
|    C                     EXSR R1D00                      拷貝
     C                     WRITEND0
     C                     END
     C                     END
      *
     C           DND02     READENA0                      49
     C                     END
|    C*
06===C           E1C10     ENDSR
     C*==============================================================*
     C*  R1C20 ....不存在WRITE,存在　覆蓋－無須確認
     C*==============================================================*
07===C           R1C20     BEGSR
|    C*
     C           DND02     SETLLNA0
     C           DND02     READENA0                      49
     C           *IN49     DOWEQ'0'
      *
     C           NA04      IFEQ DNA04
     C                     MOVELNA02      DND05   3
     C           KEYND     CHAINND0                  50
     C           *IN50     IFEQ '1'
     C*
|    C                     EXSR R1D00                      拷貝
     C                     WRITEND0
     C                     ELSE
     C                     EXSR R1D00
     C                     UPDATND0
     C                     END
     C                     END
      *
     C           DND02     READENA0                      49
     C                     END
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*  R1C30 ....不存在WRITE,存在　覆蓋－逐筆確認
     C*==============================================================*
07===C           R1C30     BEGSR
|    C*
     C           DND02     SETLLNA0
     C           DND02     READENA0                      49
     C                     MOVE *BLANKS   CALL
     C           *IN49     DOWEQ'0'
     C*
     C           NA04      IFEQ DNA04
     C                     MOVELNA02      DND05   3
     C           KEYND     CHAINND0                  50
     C           *IN50     IFEQ '1'
     C*
|    C                     EXSR R1D00                      拷貝
     C                     WRITEND0
     C                     ELSE
     C                     EXSR R1C31                      逐筆確認
     C                     END
     C                     END
      *
     C           DND02     READENA0                      49
     C                     END
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          R1C31 ....逐筆確認是否拷貝PROCESS
     C*==============================================================*
12===C           R1C31     BEGSR
|    C*
     C           CALL      IFNE 'Y'
     C                     MOVEL' '       COVE
     C                     MOVEL' '       CALL
     C           DND01     CAT  '-'       W3      3
     C                     MOVELDND02     WND02   4
     C           W3        CAT  WND02     W7      7
     C           W7        CAT  '-'       W8      8
     C           W8        CAT  DND03     W10    10
     C           W10       CAT  '-'       W11    11
     C           W11       CAT  DND04     W13    13
     C           W13       CAT  '-'       W14    14
     C           W14       CAT  DND19     W16    16
     C           W16       CAT  '-'       W17    17
     C           W17       CAT  DND20     W18    18
     C           W18       CAT  '-'       W19    19
     C           W19       CAT  DND05     DCAT
|    C                     EXFMTDSPD2
     C           COVE      IFEQ 'Y'
     C                     EXSR R1D00                      拷貝
     C                     UPDATND0
     C                     END
     C                     ELSE                            全部覆蓋
     C                     EXSR R1D00                      無須確認
     C                     UPDATND0
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R1D00 ....拷貝PROCESS
     C*==============================================================*
12===C           R1D00     BEGSR
|    C*
|    C                     MOVELDND01     ND01
|    C                     MOVELDND02     ND02
|    C                     MOVELDND03     ND03
|    C                     MOVELDND04     ND04
|    C                     MOVELDND05     ND05
|    C                     MOVELDND05     ND051
|    C                     Z-ADD0         ND06A
|    C                     Z-ADD0         ND07A
|    C                     Z-ADD0         ND08A
|    C                     Z-ADD0         ND09A
|    C                     Z-ADD0         ND10A
|    C                     Z-ADD0         ND11A
|    C                     Z-ADD0         ND12A
|    C                     Z-ADD0         ND13A
|    C                     Z-ADD0         ND14A
|    C                     Z-ADD0         ND15A
|    C                     Z-ADD0         ND16A
|    C                     Z-ADD0         ND17A
|    C                     Z-ADD0         ND18A
|    C                     Z-ADD0         ND06B
|    C                     Z-ADD0         ND07B
|    C                     Z-ADD0         ND08B
|    C                     Z-ADD0         ND09B
|    C                     Z-ADD0         ND10B
|    C                     Z-ADD0         ND11B
|    C                     Z-ADD0         ND12B
|    C                     Z-ADD0         ND13B
|    C                     Z-ADD0         ND14B
|    C                     Z-ADD0         ND15B
|    C                     Z-ADD0         ND16B
|    C                     Z-ADD0         ND17B
|    C                     Z-ADD0         ND18B
|    C                     MOVELDND19     ND19
|    C                     MOVELDND20     ND20
|    C                     TIME           ND97
|    C                     Z-ADD$A8YMD    ND98
|    C                     MOVEL$USER     ND99
|    C*
12===C                     ENDSR
     C*==============================================================*
