     FNPNDPF  IF  E           K        DISK
     FNPNAPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FPT#BPF  IF  E           K        DISK
     FGLAKPF  IF  E           K        DISK
     FNPI011D CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFLSR1
     E                    ARR     1   1 10               TABLE
     E*檔案預算
     E                    @W01       13 13 2
     E*檔案實績
     E                    @W02       13 13 2
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I*                                     135 135 $ADD
 @   I*                                     136 136 $UPD
 @   I*                                     137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
 @   I*                                     140 140 $RMK02
 @   I*                                     141 141 $RMK03
     I*                                     162 1620$EVR
     I*                                     125 1270$CPY
     I*                                     598 5990$LPRT
     I*                                     501 505 $WRHUS
     I*                                     506 506 $PURID
     I*                                     507 508 $TRNID
     I*                                     509 513 $APAUT
     I*                                     514 521 $#101
     I            DS
     I                                        1 169 @W01
     I                                        1  132ND06B
     I                                       14  262ND07B
     I                                       27  392ND08B
     I                                       40  522ND09B
     I                                       53  652ND10B
     I                                       66  782ND11B
     I                                       79  912ND12B
     I                                       92 1042ND13B
     I                                      105 1172ND14B
     I                                      118 1302ND15B
     I                                      131 1432ND16B
     I                                      144 1562ND17B
     I                                      157 1692ND18B
     I            DS
     I                                        1 169 @W02
     I                                        1  132ND06A
     I                                       14  262ND07A
     I                                       27  392ND08A
     I                                       40  522ND09A
     I                                       53  652ND10A
     I                                       66  782ND11A
     I                                       79  912ND12A
     I                                       92 1042ND13A
     I                                      105 1172ND14A
     I                                      118 1302ND15A
     I                                      131 1432ND16A
     I                                      144 1562ND17A
     I                                      157 1692ND18A
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN1   40
      *SCREEN1 KEY FIELDS
     C           *LIKE     DEFN DBGN11    OBGN11           *START KEY
     C           *LIKE     DEFN DBGN12    OBGN12           *START KEY
     C           *LIKE     DEFN DBGN13    OBGN13           *START KEY
     C           *LIKE     DEFN DBGN14    OBGN14           *START KEY
     C           *LIKE     DEFN DBGN15    OBGN15           *START KEY
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *-------------------SCREEN1 KEY
     C           KEYND1    KLIST
     C                     KFLD           DBGN11
     C                     KFLD           DBGN12
     C                     KFLD           DBGN13
     C                     KFLD           DBGN14
     C                     KFLD           DBGN15
     C           KEYND3    KLIST
      *SCREEN1 FIELDS
     C                     KFLD           ND01
     C                     KFLD           ND02
     C                     KFLD           ND03
     C                     KFLD           ND04
     C                     KFLD           ND05
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEYNA     KLIST
     C                     KFLD           ND02
     C                     KFLD           ND05
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN110                     *INIT SFL
      *
     C                     EXSR RTN120                     *READ NEXT PAGE
     C                     EXSR RTN140                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN25     CASEQ'1'       RTN120
    C                     CAS            RTN170
  02-C                     END
    C*
    C  N03                EXSR RTN140                     *EXFMT
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         DATE    60
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM $EGMDY    S001I2  60
|    C           DATE      PARM           S001O1  60
|    C*
01===C                     ENDSR
      *=========================================================*
      *          RTN110....INITIAL                              *
      *=========================================================*
02===C           RTN110    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD10        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|    C           KEYND1    SETLLND0
|    C*
02===C                     ENDSR
      *=========================================================*
      *          RTN120 .. ROLLUP MAIN ROUTINE
      *=========================================================*
03===C           RTN120    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     99
|   C                     MOVEL'CPF5203' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
|   C                     EXSR RTN130
|   C*          *LOVAL    SETLLND0
| 01-C                     END
|    C*
03===C                     ENDSR
      *=========================================================*
      *          RTN130 .. ADD SUBFILE DATA
      *=========================================================*
04===C           RTN130    BEGSR
|    C*
|    C                     SETOF                     54
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
| 01-C           RRN1      DOWLTDSPRC1
|   C                     READ ND0                      46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C                     EXSR RTN131
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
|   C*          KEYND3    SETGTND0
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN1      DRRN1
|    C                     Z-ADDRRN1      WRRN1
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN131... GET SFL DATA
      *==============================================================*
05===C           RTN131    BEGSR
|    C*
|    C* GET品牌說明
|    C                     MOVE *BLANK    D#A03
| 01-C           ND04      IFEQ '99'
|   C                     MOVELARR,1     D#A03
| 01*C                     ELSE
|   C                     MOVEL'BRAND'   #A01
|   C                     MOVELND04      #A02
|   C           KEY#A     CHAIN#A0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      D#A03
| 02-C                     END
| 01-C                     END
|    C**
|    C* CHK A&P CODE
|    C**
|    C                     MOVE *BLANK    NA03
|    C           KEYNA     CHAINNA0                  40
      *
05===C                     ENDSR
      *==============================================================*
      *          RTN140... EXFMT SFL                                 *
      *==============================================================*
06===C           RTN140    BEGSR
|    C*
| 01-C           RRN1      IFGT *ZEROS
|   C                     SETON                     50
| 01*C                     ELSE
|   C                     SETON                     99
|   C                     MOVEL'UPT2050' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER  PROCESS
      *==============================================================*
07===C           RTN170    BEGSR
|    C*
| 01-C           DBGN11    IFNE OBGN11
|   C           DBGN12    ORNE OBGN12
|   C           DBGN13    ORNE OBGN13
|   C           DBGN14    ORNE OBGN14
|   C           DBGN15    ORNE OBGN15
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN110
|   C                     EXSR RTN120
|   C                     MOVE DBGN11    OBGN11
|   C                     MOVE DBGN12    OBGN12
|   C                     MOVE DBGN13    OBGN13
|   C                     MOVE DBGN14    OBGN14
|   C                     MOVE DBGN15    OBGN15
| 01*C                     ELSE
      *READC SFL
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
|   C           *IN03     ANDEQ'0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN110
|   C                     EXSR RTN120
| 02-C                     END
| 01-C                     END
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
08===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *57 LOOP
|   C           *IN03     ANDEQ'0'
|   C*SETOF FIELDS *IN
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
      *CHECK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN200
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
      *RECHAIN SFL
|   C           RRN1      CHAINSFLSR1               57
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                 5757*NF
|   C*
| 01-C                     END                             *57 END
      *
|    C                     SETOF                     5412
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
09===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           $INQ      IFNE 'Y'
|   C                     SETON                     6099
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     Z-ADDRRN1      DRRN1
| 01-C                     END
|    C*
09===C           END180    ENDSR
      *==============================================================*
      *          RTN200... SCREEN2 MAIN
      *==============================================================*
10===C           RTN200    BEGSR
|    C*CLEAR KEY FILEDS VALUES
|    C                     SETOF                     12
|    C                     EXSR RTN210                     INIT.
      *
|    C                     EXSR RTN240                     EXFMTSFL
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN210... INIT. SCREEN2
      *==============================================================*
10===C           RTN210    BEGSR
|    C*
     C           KEYND3    CHAINND0                  40
|    C* GET 公司
|    C                     MOVE *BLANK    #B02
|    C           ND01      CHAIN#B0                  40
|    C* GET會計年度月數
     C           ND01      CHAINAK0                  40
| 24-C           AK10      IFEQ '1'
     C                     Z-ADD13        MONTH   20
|   C                     SETON                     59
| 24*C                     ELSE
     C                     Z-ADD12        MONTH   20
|   C                     SETOF                     59
| 24-C                     END
|    C*
     C                     Z-ADD0         DTOT1
     C                     Z-ADD0         DTOT2
     C                     Z-ADD1         I       20
     C           I         DOWLTMONTH
     C                     ADD  @W01,I    DTOT1
     C                     ADD  @W02,I    DTOT2
     C                     ADD  1         I
     C                     END
|    C**
|    C* CHK產品組別
|    C**
|    C                     MOVEL*BLANKS   PND03
      *
| 09-C           ND03      IFEQ '10'
|   C                     MOVEL'白蘭地'PND03
| 09*C                     ELSE
| 10-C           ND03      IFEQ '20'
|   C                     MOVEL'威士忌'PND03
| 10*C                     ELSE
| 10-C           ND03      IFEQ '30'
|   C                     MOVEL'葡萄酒'PND03
| 10*C                     ELSE
|   C                     MOVEL'其他　'PND03
| 10-C                     END
| 10-C                     END
| 09-C                     END
      *
|    C*
10===C                     ENDSR
     C*=============================================================*
     C*          RTN240....EXFMT DSPF
     C*=============================================================*
13===C           RTN240    BEGSR
|    C*
|    C*
|    C                     EXFMTDSPD2
|    C                     MOVEA*ALL'0'   *IN,60
     C*
13===C                     ENDSR
**
合併品牌
