     FNPNDPF  IP  E           K        DISK
     FNPNAPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FNPR041BPO   E             39     PRINTER
     E*---------------------------------------------------------------
     E                    ARR1    1   1 30
     E                    ARR2   12  12  3
      *實績
     E                    @W01       13 13 2
      *預算
     E                    @W02       13 13 2
     E*---------------------------------------------------------------*
     IND0
     I                                              ND051 L1
     I                                              ND04  L2
     I                                              ND03  L2
     I*
     I*DATA AREA
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      119 1240$EGMDY
     I                                      138 138 $INQ
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I* SCREEN INPUT FIELD  ++++++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DND01
     I                                      509 5110DYEAR
     I                                      512 5130DMM
     I                                      535 5380$YEAR
     I                                      541 542 DND03S
     I                                      543 544 DND03E
     I                                      545 546 DND04S
     I                                      547 548 DND04E
     I                                      551 5520M
     I            DS
     I                                        1 169 @W01
     I                                        1  132ND06A
     I                                       14  262ND07A
     I                                       27  392ND08A
     I                                       40  522ND09A
     I                                       53  652ND10A
     I                                       66  782ND11A
     I                                       79  912ND12A
     I                                       92 1042ND13A
     I                                      105 1172ND14A
     I                                      118 1302ND15A
     I                                      131 1432ND16A
     I                                      144 1562ND17A
     I                                      157 1692ND18A
     I            DS
     I                                        1 169 @W02
     I                                        1  132ND06B
     I                                       14  262ND07B
     I                                       27  392ND08B
     I                                       40  522ND09B
     I                                       53  652ND10B
     I                                       66  782ND11B
     I                                       79  912ND12B
     I                                       92 1042ND13B
     I                                      105 1172ND14B
     I                                      118 1302ND15B
     I                                      131 1432ND16B
     I                                      144 1562ND17B
     I                                      157 1692ND18B
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN NA02      WNA02
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEYNA     KLIST
     C                     KFLD           $YEAR
     C                     KFLD           WNA02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010
  01*C                     ELSE
  02-C           *INL2     IFEQ '1'
    C                     EXSR RTN010
  02-C                     END
  01-C                     END
     C*
     C                     EXSR RTN100
     C*
     CL1 10                EXSR RTNL1
     CL2 10                EXSR RTNL2
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
     C           DYEAR     ADD  1         DYEAR1
|    C                     Z-ADDDMM       I       20
|    C                     MOVELARR2,M    MONTH
|    C*
|    C                     MOVEL*BLANK    #A03
| 03-C           ND04      IFEQ '99'
|   C                     MOVELARR1,1    #A03
      *
     C           ND03      IFEQ '10'
     C                     MOVE 'BRANDY'  #A03
     C                     ELSE
     C           ND03      IFEQ '20'
     C                     MOVE 'WISKY'   #A03
     C                     ELSE
     C           ND03      IFEQ '30'
     C                     MOVE 'WINE'    #A03
     C                     END
     C                     END
     C                     END
      *
| 03*C                     ELSE
|   C                     MOVEL'BRAND'   #A01
|   C                     MOVELND04      #A02
|   C           KEY#A     CHAIN#A0                  41
| 03-C                     END
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....PD1
      *==============================================================*
02===C           RTN100    BEGSR
|    C                     SETOF                     212223
|    C                     SETOF                     242526
|    C                     SETOF                     2728
|    C*A&P CODE
|    C                     MOVEL*BLANK    NA03
|    C                     MOVELND05      WNA02
|    C           KEYNA     CHAINNA0                  40
|    C*
|    C                     Z-ADD1         X       20
| 01-C           X         DOWLT13
|   C*MONTH BUDGET
| 02-C           X         IFEQ DMM
|   C                     ADD  @W02,X    MBUG
| 02-C                     END
|   C*Y-T-D BUDGET
| 03-C           X         IFLE DMM
|   C                     ADD  @W02,X    YBUG
| 03-C                     END
|   C*BUDGET TOTAL
|   C                     ADD  @W02,X    TBUG
|   C*MONTH ACTUAL
| 04-C           X         IFEQ DMM
|   C                     ADD  @W01,X    MACT
| 04-C                     END
|   C*Y-T-D ACTUAL
| 05-C           X         IFLE DMM
|   C                     ADD  @W01,X    YACT
| 05-C                     END
|   C                     ADD  1         X
| 01-C                     END
|    C*MONTH VAR.
|    C           MACT      SUB  MBUG      MVAR
|    C*Y-T-D VAR.
|    C           YACT      SUB  YBUG      YVAR
|    C*BAL
|    C           TBUG      SUB  YACT      TBAL
      *正負號
| 06-C           TBUG      IFLT 0
|   C                     SETON                     21
| 06-C                     END
| 07-C           MACT      IFLT 0
|   C                     SETON                     22
| 07-C                     END
| 08-C           MBUG      IFLT 0
|   C                     SETON                     23
| 08-C                     END
| 09-C           MVAR      IFLT 0
|   C                     SETON                     24
| 09-C                     END
| 10-C           YACT      IFLT 0
|   C                     SETON                     25
| 10-C                     END
| 11-C           YBUG      IFLT 0
|   C                     SETON                     26
| 11-C                     END
| 12-C           YVAR      IFLT 0
|   C                     SETON                     27
| 12-C                     END
| 13-C           TBAL      IFLT 0
|   C                     SETON                     28
| 13-C                     END
      *
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     ADD  TBUG      T1TBUG
|    C                     ADD  MACT      T1MACT
|    C                     ADD  MBUG      T1MBUG
|    C                     ADD  MVAR      T1MVAR
|    C                     ADD  YACT      T1YACT
|    C                     ADD  YBUG      T1YBUG
|    C                     ADD  YVAR      T1YVAR
|    C                     ADD  TBAL      T1TBAL
|    C                     Z-ADD0         TBUG
|    C                     Z-ADD0         MACT
|    C                     Z-ADD0         MBUG
|    C                     Z-ADD0         MVAR
|    C                     Z-ADD0         YACT
|    C                     Z-ADD0         YBUG
|    C                     Z-ADD0         YVAR
|    C                     Z-ADD0         TBAL
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTNL1 ....PT1
      *==============================================================*
03===C           RTNL1     BEGSR
|    C*
|    C                     SETOF                     212223
|    C                     SETOF                     242526
|    C                     SETOF                     2728
|    C                     MOVELND051     T1ND05
|    C                     MOVE '00'      T1ND05
|    C                     MOVEL*BLANK    NA03
|    C                     MOVELT1ND05    WNA02
|    C                     MOVE '00'      WNA02
|    C           KEYNA     CHAINNA0                  40
      *正負號
| 01-C           T1TBUG    IFLT 0
|   C                     SETON                     21
| 01-C                     END
| 02-C           T1MACT    IFLT 0
|   C                     SETON                     22
| 02-C                     END
| 03-C           T1MBUG    IFLT 0
|   C                     SETON                     23
| 03-C                     END
| 04-C           T1MVAR    IFLT 0
|   C                     SETON                     24
| 04-C                     END
| 05-C           T1YACT    IFLT 0
|   C                     SETON                     25
| 05-C                     END
| 06-C           T1YBUG    IFLT 0
|   C                     SETON                     26
| 06-C                     END
| 07-C           T1YVAR    IFLT 0
|   C                     SETON                     27
| 07-C                     END
| 08-C           T1TBAL    IFLT 0
|   C                     SETON                     28
| 08-C                     END
      *
|    C   39                EXSR RTN900
|    C                     WRITEPT1
|    C                     ADD  T1TBUG    T2TBUG
|    C                     ADD  T1MACT    T2MACT
|    C                     ADD  T1MBUG    T2MBUG
|    C                     ADD  T1MVAR    T2MVAR
|    C                     ADD  T1YACT    T2YACT
|    C                     ADD  T1YBUG    T2YBUG
|    C                     ADD  T1YVAR    T2YVAR
|    C                     ADD  T1TBAL    T2TBAL
|    C                     Z-ADD0         T1TBUG
|    C                     Z-ADD0         T1MACT
|    C                     Z-ADD0         T1MBUG
|    C                     Z-ADD0         T1MVAR
|    C                     Z-ADD0         T1YACT
|    C                     Z-ADD0         T1YBUG
|    C                     Z-ADD0         T1YVAR
|    C                     Z-ADD0         T1TBAL
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNL2 ....PT2
      *==============================================================*
04===C           RTNL2     BEGSR
|    C*
|    C                     SETOF                     212223
|    C                     SETOF                     242526
|    C                     SETOF                     2728
      *正負號
| 01-C           T2TBUG    IFLT 0
|   C                     SETON                     21
| 01-C                     END
| 02-C           T2MACT    IFLT 0
|   C                     SETON                     22
| 02-C                     END
| 03-C           T2MBUG    IFLT 0
|   C                     SETON                     23
| 03-C                     END
| 04-C           T2MVAR    IFLT 0
|   C                     SETON                     24
| 04-C                     END
| 05-C           T2YACT    IFLT 0
|   C                     SETON                     25
| 05-C                     END
| 06-C           T2YBUG    IFLT 0
|   C                     SETON                     26
| 06-C                     END
| 07-C           T2YVAR    IFLT 0
|   C                     SETON                     27
| 07-C                     END
| 08-C           T2TBAL    IFLT 0
|   C                     SETON                     28
| 08-C                     END
      *
|    C   39                EXSR RTN900
|    C                     WRITEPT2
|    C                     Z-ADD0         T2TBUG
|    C                     Z-ADD0         T2MACT
|    C                     Z-ADD0         T2MBUG
|    C                     Z-ADD0         T2MVAR
|    C                     Z-ADD0         T2YACT
|    C                     Z-ADD0         T2YBUG
|    C                     Z-ADD0         T2YVAR
|    C                     Z-ADD0         T2TBAL
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
05===C           RTN900    BEGSR
|    C*
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
06===C           RTNLR     BEGSR
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE9
| 01-C                     END
06===C                     ENDSR
**
MISCELLANEOUS
**
JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC
