     FNPNDPF  IF  E           K        DISK
     FAPUXLF03IF  E           K        DISK
     FGLAWF03 UF  E           K        DISK                      A
     E*---------------------------------------------------------------
     E                    @W02       13 13 2
     I*
     I*DATA AREA
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I* SCREEN INPUT FIELD  ++++++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DND01
     I                                      509 5110DYEAR
     I                                      512 5130DMM
     I                                      535 5380$YEAR
     I                                      541 542 DND03S
     I                                      543 544 DND03E
     I                                      545 546 DND04S
     I                                      547 548 DND04E
     I                                      551 5520M
     I            DS
     I                                        1 169 @W02
     I                                        1  132ND06B
     I                                       14  262ND07B
     I                                       27  392ND08B
     I                                       40  522ND09B
     I                                       53  652ND10B
     I                                       66  782ND11B
     I                                       79  912ND12B
     I                                       92 1042ND13B
     I                                      105 1172ND14B
     I                                      118 1302ND15B
     I                                      131 1432ND16B
     I                                      144 1562ND17B
     I                                      157 1692ND18B
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF0307
     C                     KFLD           WF0301
     C                     KFLD           WF0306
     C                     KFLD           WF0302
     C           KEYUX     KLIST
     C                     KFLD           UX01
     C                     KFLD           UX02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN100
     C                     EXSR RTN300
     C*
     C                     SETON                     LR
      *==============================================================*
      *          RTN100....NPNDPF
      *==============================================================*
01===C           RTN100    BEGSR
|    C                     READ ND0                      42
| 01-C           *IN42     DOWEQ'0'
|   C*A&P CODE
|   C                     MOVE ND04      WF0301
|   C                     MOVELND05      WF0302
|   C                     MOVELND051     WF0306
|   C                     MOVELND03      WF0307
|   C           KEYWF     CHAINGLWF03R              40
|   C*
|   C                     Z-ADD1         X       20
| 02-C           X         DOWLT13
|   C                     ADD  @W02,X    TBUG   132
|   C                     ADD  1         X
| 02-C                     END
| 03-C           *IN40     IFEQ '0'
|   C                     ADD  TBUG      WF0303
|   C                     UPDATGLWF03R
| 03*C                     ELSE
|   C                     Z-ADDTBUG      WF0303
| 04-C           WF0303    IFNE 0
|   C                     WRITEGLWF03R
| 04-C                     END
| 03-C                     END
|   C                     Z-ADD0         TBUG
|   C                     Z-ADD0         @W02
|   C                     READ ND0                      42
| 01-C                     END
01===C                     ENDSR
      *==============================================================*
      *          RTN300....APUXPF
      *==============================================================*
03===C           RTN300    BEGSR
|    C*
|    C                     READ UX0                      42
| 01-C           *IN42     DOWEQ'0'
|   C                     MOVE UX07      WF0301
|   C                     MOVE UX08      WF0302
|   C                     MOVELUX081     WF0306
|   C                     MOVELUX06      WF0307
|   C           KEYWF     CHAINGLWF03R              40
|   C           UX12      SUB  UX13      COMM   132
| 02-C           COMM      IFGT 0
| 03-C           *IN40     IFEQ '0'
|   C                     ADD  COMM      WF0305
|   C                     UPDATGLWF03R
| 03*C                     ELSE
|   C                     Z-ADDCOMM      WF0305
|   C                     Z-ADD0         WF0303
|   C                     Z-ADD0         WF0304
|   C                     WRITEGLWF03R
| 03-C                     END
| 02-C                     END
|   C                     Z-ADD0         COMM
|   C                     READ UX0                      42
| 01-C                     END
03===C                     ENDSR
