     FGLAHLF01IF  E           K        DISK
     F*LAKPF  IF  E           K        DISK
     FMTMALF02IF  E           K        DISK
     FAPUXLF01IF  E           K        DISK
     FNPNAPF  IF  E           K        DISK
     FNPNBPF  IF  E           K        DISK
     FNPNCLF01IF  E           K        DISK
     FGLAWF03 UF  E           K        DISK                      A
     E*---------------------------------------------------------------
     E*---------------------------------------------------------------*
     I*
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     IGLDA01      DS
     I                                        1  16 DA01
     I*
     ILDA        UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I* SCREEN INPUT FIELD  ++++++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DND01
     I                                      509 5110DYEAR
     I                                      512 5130DMM
     I                                      535 5380$YEAR
     I                                      541 542 DND03S
     I                                      543 544 DND03E
     I                                      545 546 DND04S
     I                                      547 548 DND04E
     I                                      551 5520M
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C           *NAMVAR   DEFN           GLDA01
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF0307
     C                     KFLD           WF0301
     C                     KFLD           WF0306
     C                     KFLD           WF0302
     C           KEYNB     KLIST
     C                     KFLD           DND01
     C                     KFLD           AH04
     C           KEYUX     KLIST
     C                     KFLD           DND01
     C                     KFLD           WUX02   8
     C           KEYNA     KLIST
     C                     KFLD           $YEAR
      *A&P CODE
     C                     KFLD           WF0302
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100
     C           *LOVAL    SETLLAH0
     C                     READ AH0                      46
  01-C           *IN46     DOWEQ'0'
      *判斷需存在會計科目NB
    C           KEYNB     SETLLNB0                      40
  02-C           *IN40     IFEQ '1'
      *判斷需存在A&P檔NA
  03-C           AH05A     IFEQ '36'
    C                     MOVELAH05      WF0302
    C                     MOVELAH05      WF0306
  03-C                     END
  04-C           AH06A     IFEQ '36'
    C                     MOVELAH06      WF0302
    C                     MOVELAH06      WF0306
  04-C                     END
  05-C           AH07A     IFEQ '36'
    C                     MOVELAH07      WF0302
    C                     MOVELAH07      WF0306
  05-C                     END
  06-C           AH08A     IFEQ '36'
    C                     MOVELAH08      WF0302
    C                     MOVELAH08      WF0306
  06-C                     END
  07-C           AH09A     IFEQ '36'
    C                     MOVELAH09      WF0302
    C                     MOVELAH09      WF0306
  07-C                     END
    C*CHAIN APUXLF01
  08-C           AH07A     IFEQ '17'
    C                     MOVELAH07      WUX02
    C           KEYUX     CHAINUX0                  41
  09-C           *IN41     IFEQ '0'
    C                     MOVELUX08      WF0302
    C                     MOVELUX08      WF0306
  09-C                     END
  08-C                     END
    C           KEYNA     SETLLNA0                      40
  10-C           *IN40     IFEQ '1'
     C           AH07      OREQ '999'
      *PROCESS FILE
    C                     EXSR R1000
  10-C                     END
  02-C                     END
    C                     READ AH0                      46
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ... NPB021P HEADING INITIAL
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     IN   PTDA01
|    C*
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ... GET DATA TO WORK FILE
     C*==============================================================*
02===C           R1000     BEGSR
      *GET品牌
|    C                     MOVEL*BLANK    WF0301
| 01-C           AH05A     IFEQ '03'
|   C                     MOVELAH05      WF0301
| 01-C                     END
| 02-C           AH06A     IFEQ '03'
|   C                     MOVELAH06      WF0301
| 02-C                     END
| 03-C           AH07A     IFEQ '03'
|   C                     MOVELAH07      WF0301
| 03-C                     END
| 04-C           AH08A     IFEQ '03'
|   C                     MOVELAH08      WF0301
| 04-C                     END
| 05-C           AH09A     IFEQ '03'
|   C                     MOVELAH09      WF0301
| 05-C                     END
      *
| 06-C           AH05A     IFEQ '02'
|   C                     MOVELAH05      WFLD    4
|   C                     MOVE WFLD      WF0301
| 06-C                     END
| 07-C           AH06A     IFEQ '02'
|   C                     MOVELAH06      WF0301
| 07-C                     END
| 08-C           AH07A     IFEQ '02'
|   C                     MOVELAH07      WFLD    4
|   C                     MOVE WFLD      WF0301
| 08-C                     END
| 09-C           AH08A     IFEQ '02'
|   C                     MOVELAH08      WFLD    4
|   C                     MOVE WFLD      WF0301
| 09-C                     END
| 10-C           AH09A     IFEQ '02'
|   C                     MOVELAH09      WFLD    4
|   C                     MOVE WFLD      WF0301
| 10-C                     END
|    C*CHAIN APUXLF01
| 11-C           AH07A     IFEQ '17'
|   C                     MOVELAH07      WUX02
|   C           KEYUX     CHAINUX0                  41
| 12-C           *IN41     IFEQ '0'
|   C                     MOVELUX07      WF0301
| 12-C                     END
| 11-C                     END
|    C*
| 13-C           AH12      IFNE 0
|   C                     Z-ADDAH12      ACT    132
| 13*C                     ELSE
|   C                     Z-SUBAH13      ACT
| 13-C                     END
      *
|    C           WF0301    CHAINNC0                  40
| 14-C           *IN40     IFEQ '0'
      *存在合併品牌中以９９為合併品牌
|   C                     MOVEL'99'      WF0301
|   C                     MOVELNC01      WF0307
| 15-C           WF0307    IFGE DND03S
|   C           WF0307    ANDLEDND03E
|   C           WF0301    ANDGEDND04S
|   C           WF0301    ANDLEDND04E
|   C           KEYWF     CHAINGLWF03R              41
| 16-C           *IN41     IFEQ '0'
|   C                     ADD  ACT       WF0304
|   C                     UPDATGLWF03R
| 16*C                     ELSE
|   C                     Z-ADD0         WF0303
|   C                     Z-ADD0         WF0305
|   C                     Z-ADDACT       WF0304
|   C                     WRITEGLWF03R
| 16-C                     END
| 15-C                     END
      *
| 14*C                     ELSE
      *不存在合併品牌中，產品組別以產品主檔中ＭＡ１１寫入
|   C                     MOVEL'99'      WF0307
|   C                     MOVELAH02      WAH02   9
|   C*用產品主檔之等級一碼當組別
|   C           WF0301    SETLLMA0
|   C           WF0301    READEMA0                      46
| 17-C           *IN46     DOWEQ'0'
| 18-C           MA11      IFNE *BLANK
|   C                     MOVELMA11      WFLD2   1
| 19-C           WFLD2     IFEQ '1'
|   C                     MOVEL'10'      WF0307
| 19-C                     END
| 20-C           WFLD2     IFEQ '2'
|   C                     MOVEL'20'      WF0307
| 20-C                     END
| 21-C           WFLD2     IFEQ '3'
|   C                     MOVEL'30'      WF0307
| 21-C                     END
|   C                     SETON                     46
| 18-C                     END
|   C  N46      WF0301    READEMA0                      46
| 17-C                     END
|   C*
| 22-C           WF0307    IFGE DND03S
|   C           WF0307    ANDLEDND03E
|   C           WF0301    ANDGEDND04S
|   C           WF0301    ANDLEDND04E
|   C           KEYWF     CHAINGLWF03R              41
      *不存在合併品牌中以ＷＮＤ０４原品牌
| 23-C           *IN41     IFEQ '0'
|   C                     ADD  ACT       WF0304
|   C                     UPDATGLWF03R
| 23*C                     ELSE
|   C                     Z-ADD0         WF0303
|   C                     Z-ADD0         WF0305
|   C                     Z-ADDACT       WF0304
|   C                     WRITEGLWF03R
| 23-C                     END
| 22-C                     END
| 14-C                     END
|    C                     Z-ADD0         ACT
      *
02===C                     ENDSR
