      *
      *===============================================================
      * PROGRAM ID : NPR0485
      * PROGRAM DESCRIPTION: GET COMMIT
      * PROGRAM AUTHOR: MICHELLE
      * DESIGNED DATE : 01.12.07
      * UPDATE   DATE :
      *
      *===============================================================
     FNPWF09  UF  E           K        DISK                      A
     FNPWF09L1IF  E           K        DISK
     F            WF09R                             KRENAMEWF09L
     FNPWF08  UF  E           K        DISK
     FNPWF08L1IF  E           K        DISK
     F            WF08R                             KRENAMEWF08L
     FAPUXLF01IF  E           K        DISK
      *---------------------------------------------------------------
     I*
     I*DATA AREA
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I* SCREEN INPUT FIELD  ++++++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DND01
     I                                      509 5110DYEAR
     I                                      512 5130DMM
     I                                      535 5380$YEAR
     I                                      541 542 DND03S
     I                                      543 544 DND03E
     I                                      545 546 DND04S
     I                                      547 548 DND04E
     I                                      551 5520M
      *==============================================================*
     C*                    KLIST
      *==============================================================*
     C           KEYUX     KLIST
     C                     KFLD           DND01
     C                     KFLD           ZUX02   8
      *
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *LOVAL    SETLLWF09L
     C                     READ WF09L                    50
      *
     C           *IN50     DOWEQ'0'
     C                     Z-ADD0         WTOT   132
     C                     MOVELYUX02     ZUX02   8
     C           ZUX02     CHAINWF08R                49
     C           *IN49     DOWEQ'0'
     C                     Z-ADDAH1213    WUX13  132
     C                     ADD  WUX13     WTOT
     C           ZUX02     READEWF08R                    49
     C                     END
     C           YUX12     IFEQ WTOT
     C           ZUX02     CHAINWF09R                43
     C           *IN43     IFEQ '0'
     C                     DELETWF09R
     C                     END
     C           ZUX02     SETLLWF08R
     C           ZUX02     READEWF08R                    48
     C           *IN48     DOWEQ'0'
     C                     DELETWF08R
     C           ZUX02     READEWF08R                    48
     C                     END
     C                     ELSE
     C           WTOT      IFNE 0
     C           ZUX02     CHAINWF09R                42
     C           *IN42     IFEQ '0'
     C                     Z-ADDWTOT      YACT
     C                     UPDATWF09R
     C                     END
     C                     END
     C                     END
     C                     READ WF09L                    50
     C                     END
      *
     C           *LOVAL    SETLLWF08R
     C                     READ WF08R                    47
     C           *IN47     DOWEQ'0'
     C           XUX02     CHAINWF09R                46
     C           *IN46     IFEQ '1'
     C                     MOVELXUX02     ZUX02
     C           KEYUX     CHAINUX0                  44
     C           *IN44     IFEQ '0'
     C           UX06      ANDGEDND03S
     C           UX06      ANDLEDND03E
     C           UX07      ANDGEDND04S
     C           UX07      ANDLEDND04E
     C           UX01      ANDEQDND01
      *
     C           ZUX02     SETLLWF08L
     C           ZUX02     READEWF08L                    45
     C                     Z-ADD0         WFLD
      *
     C           *IN45     DOWEQ'0'
     C                     ADD  AH1213    WFLD   132
     C           ZUX02     READEWF08L                    45
     C                     END
      *
     C                     Z-ADDWFLD      YACT
     C                     Z-ADD0         YUX12
     C                     MOVELZUX02     YUX02
     C                     WRITEWF09R
      *
     C                     END
     C                     END
     C                     READ WF08R                    47
     C                     END
      *
     C                     SETON                     LR
      *==============================================================*
