     H*================================================================
     H* MODI CODE |  AUTHOR  |  DATE  | DESCRIPTION
     H*----------------------------------------------------------------
     H*   M001    | MICHELLE |01.01.19|試飲退回量無特定A&P CODE,
     H*           |          |        |故統一放在999
     H*----------------------------------------------------------------
     H*   M002    | MICHELLE |01.04.13|先把UX12當成COMMIT,再逐一
     H*           |          |        |從總帳有作帳者扣除
     H*----------------------------------------------------------------
     H*   M003    | MICHELLE |01.04.17|將COMMITMENT寫入檔案備查
     H*           |          |        |將作廢單排除
     H*----------------------------------------------------------------
     H*   M004    | MICHELLE |01.06.19|已回轉的促銷傳票，不計算COMMIT
     H*================================================================
     FNPNDPF  IF  E           K        DISK
     FAPUXLF03IF  E           K        DISK
     FGLAHLF12IF  E           K        DISK
     FMTMALF02IF  E           K        DISK
     FPA#5PF  IF  E           K        DISK
     FPA#3PF  IF  E           K        DISK
     FSOSCPF  IF  E           K        DISK
     FSOSDPF  IF  E           K        DISK
M001AFSOSNPF  IF  E           K        DISK
M001AFSOSOPF  IF  E           K        DISK
     FNPWF01  UF  E           K        DISK                      A
M003AFNPWF07L1UF  E           K        DISK                      A
     E*---------------------------------------------------------------
     E                    @W02       13 13 2
     I*
     I*DATA AREA
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I* SCREEN INPUT FIELD  ++++++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DND01
     I                                      509 5110DYEAR
     I                                      512 5130DMM
     I                                      535 5380$YEAR
     I                                      541 542 DND03S
     I                                      543 544 DND03E
     I                                      545 546 DND04S
     I                                      547 548 DND04E
     I                                      551 5580WAH10S
     I                                      561 5680WAH10E
     I            DS
     I                                        1 169 @W02
     I                                        1  132ND06B
     I                                       14  262ND07B
     I                                       27  392ND08B
     I                                       40  522ND09B
     I                                       53  652ND10B
     I                                       66  782ND11B
     I                                       79  912ND12B
     I                                       92 1042ND13B
     I                                      105 1172ND14B
     I                                      118 1302ND15B
     I                                      131 1432ND16B
     I                                      144 1562ND17B
     I                                      157 1692ND18B
     I            DS
     I                                        1   9 SD03
     I                                        3   4 SD03A
     I                                        1   6 SD03B
     I            DS
     I                                        1  20 WUX02
     I                                        1   8 UX02
     I                                        9  20 WUX022
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF0101
     C                     KFLD           WF0102
     C                     KFLD           WF0103
     C                     KFLD           WF0104
     C                     KFLD           WF0105
     C           KEYUX     KLIST
     C                     KFLD           UX01
     C                     KFLD           UX02
     C           KEYAH     KLIST
     C                     KFLD           DND01
     C                     KFLD           WUX02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     MOVELDND01     WF0101
     C                     Z-ADD$YEAR     WF0102
     C                     MOVE *ALL' '   WUX022
     C                     EXSR RTN100                     預算數
     C                     EXSR RTN200                     試飲實績
M001AC                     EXSR RTN400                     試飲收回
     C                     EXSR RTN300                     請款差異
     C*
     C                     SETON                     LR
      *==============================================================*
      *          RTN100....NPNDPF
      *==============================================================*
01===C           RTN100    BEGSR
|    C                     READ ND0                      42
| 01-C           *IN42     DOWEQ'0'
|   C*A&P CODE
|   C                     MOVE ND04      WF0104
|   C                     MOVELND05      WF0105
|   C                     MOVELND051     WF0106
|   C                     MOVELND03      WF0103
|   C           KEYWF     CHAINWF010                40
|   C*
|   C                     Z-ADD1         X       20
| 02-C           X         DOWLT13
|   C                     ADD  @W02,X    TBUG   132
|   C                     ADD  1         X
| 02-C                     END
| 03-C           *IN40     IFEQ '0'
|   C                     ADD  TBUG      WF0110
|   C                     UPDATWF010
| 03*C                     ELSE
|   C                     Z-ADDTBUG      WF0110
| 04-C           WF0110    IFNE 0
|   C                     WRITEWF010
| 04-C                     END
| 03-C                     END
|   C                     Z-ADD0         TBUG
|   C                     Z-ADD0         @W02
|   C                     READ ND0                      42
| 01-C                     END
01===C                     ENDSR
      *==============================================================*
      *          RTN200....SOSCPF
      *==============================================================*
03===C           RTN200    BEGSR
     C                     READ SC0                      45
     C                     SETOF                     66
  01-C           *IN45     DOWEQ'0'
     C           SC10      CHAIN#50                  44
     C           *IN44     IFEQ '0'
     C                     MOVEL#502      WF0105
     C                     MOVEL#502      WF0106
     C                     ELSE
     C                     MOVEL'999'     WF0105
     C                     MOVEL'9'       WF0106
     C                     END
     C           SC02      SETLLSD0
     C           SC02      READESD0                      46
     C           *IN46     DOWEQ'0'
     C           SC04      IFGE '10001'
     C           SC04      ANDLE'19999'
     C           SC04      CHAIN#30                  48
     C  N48                MOVEL#302      WF0104
     C   48                MOVELSD03A     WF0104
     C           WF0104    IFGT DND04E                     品牌在範圍
     C           WF0104    ORLT DND04S
     C                     SETON                     66
     C                     END
     C           WF0104    CHAINMA0                  49
     C           *IN49     IFEQ '0'
     C                     MOVELMA11      WF0103
     C                     ELSE
     C                     MOVE *BLANKS   WF0103
     C                     END
     C           WF0103    IFGT DND03E                     組別在範圍
     C           WF0103    ORLT DND03S
     C                     SETON                     66
     C                     END
     C           *IN66     IFEQ '0'
     C                     Z-ADD0         WF0112
    C           KEYWF     CHAINWF010                40
    C                     EXSR RTN210
     C                     END
  02-C                     END
     C                     SETOF                     66
    C           SC02      READESD0                      46
  02-C                     END
    C*
    C                     READ SC0                      45
  01-C                     END
  01-C                     ENDSR
      *==============================================================*
      *          RTN210....WRITE OR UPDATE NPWF01
      *==============================================================*
01===C           RTN210    BEGSR
|    C*
     C                     Z-ADD0         AMT
     C                     Z-ADD0         TOT
     C                     Z-ADD0         TOT07
     C           SD10      ADD  SD11      AMT    112
     C                     ADD  SD12      AMT
     C           SD04      ADD  SD05      TOT     50
     C           TOT       MULT AMT       TOT07  112
     C                     ADD  TOT07     WF0112
  04*C           *IN40     IFEQ '0'
  |  C           TOT07     IFNE 0
  |  C                     UPDATWF010
  |  C                     END
  04*C                     ELSE
    C                     Z-ADD0         WF0110
    C                     Z-ADD0         WF0111
    C                     Z-ADD0         WF0114
  |  C           TOT07     IFNE 0
  |  C                     WRITEWF010
  |  C                     END
  04*C                     END
     C*
01===C                     ENDSR
      *==============================================================*
      *          RTN300....APUXPF
      *==============================================================*
03===C           RTN300    BEGSR
|    C*
|    C                     READ UX0                      42
| 01-C           *IN42     DOWEQ'0'
M003AC           UX22      IFNE 'V'
|   C                     MOVE UX07      WF0104
|   C                     MOVE UX08      WF0105
|   C                     MOVELUX081     WF0106
|   C                     MOVELUX06      WF0103
M004MC*                    Z-ADDUX12      COMM   132
M004MC                     Z-ADD0         COMM   132
M003AC                     Z-ADD0         WTOT   132
M003AC                     WRITEWF07R
M004AC                     SETON                     39
  |  C           KEYAH     SETLLAH0
M003AC           KEYAH     READEAH0                      50
  |  C           *IN50     DOWEQ'0'
M003AC           AH20      IFNE 'V'
  |  C           AH12      IFGT 0
  |  C                     Z-ADDAH12      WUX13  132
  |  C                     ELSE
  |  C                     Z-SUBAH13      WUX13  132
  |  C                     END
M003AC                     ADD  WUX13     WTOT             作帳總數
M004AC                     SETOF                     39
M003AC                     END
  |  C           KEYAH     READEAH0                      50
  |  C                     END
M003AC           UX12      SUB  WTOT      COMM
M004AC           *IN39     IFEQ '0'
M004AC           WTOT      ANDEQ0
M003AC           KEYUX     CHAINWF07R                49
M003AC           *IN49     IFEQ '0'
M003AC                     DELETWF07R
M003AC                     END
M004AC                     ELSE
M003AC           COMM      IFNE 0
M003AC           KEYUX     CHAINWF07R                49
M003AC           *IN49     IFEQ '0'
M003AC                     Z-ADDWTOT      WACT
M003AC                     UPDATWF07R
M003AC                     END
M003AC                     ELSE
M003AC           COMM      IFEQ 0
M003AC           KEYUX     CHAINWF07R                49
M003AC           *IN49     IFEQ '0'
M003AC                     DELETWF07R
M003AC                     END
M003AC                     END
M003AC                     END
M004AC                     END
     C*M003D     COMM      IFLT 0
     C*M003D               Z-ADD0         COMM
     C*M003D               END
|   C           KEYWF     CHAINWF010                40
| 02-C*M003D     COMM      IFGT 0
| 03-C           *IN40     IFEQ '0'
|   C                     ADD  COMM      WF0114
|   C                     UPDATWF010
| 03*C                     ELSE
|   C                     Z-ADDCOMM      WF0114
|   C                     Z-ADD0         WF0110
|   C                     Z-ADD0         WF0111
|   C                     Z-ADD0         WF0112
|   C                     WRITEWF010
| 03-C                     END
| 02-C*M003D               END
|   C                     Z-ADD0         COMM
M003AC                     END
|   C                     READ UX0                      42
| 01-C                     END
03===C                     ENDSR
      *==============================================================*
M001A *          RTN400....SOSNPF
      *==============================================================*
03===C           RTN400    BEGSR
     C                     READ SN0                      45
     C                     SETOF                     66
  01-C           *IN45     DOWEQ'0'
     C                     MOVEL'999'     WF0105
     C                     MOVEL'9'       WF0106
     C           SN02      SETLLSO0
     C           SN02      READESO0                      46
     C           *IN46     DOWEQ'0'
     C           SN03      IFGE '10001'
     C           SN03      ANDLE'19999'
     C           SN03      CHAIN#30                  48
     C  N48                MOVEL#302      WF0104
     C   48                MOVELSD03A     WF0104
     C           WF0104    IFGT DND04E                     品牌在範圍
     C           WF0104    ORLT DND04S
     C                     SETON                     66
     C                     END
     C           WF0104    CHAINMA0                  49
     C           *IN49     IFEQ '0'
     C                     MOVELMA11      WF0103
     C                     ELSE
     C                     MOVE *BLANKS   WF0103
     C                     END
     C           WF0103    IFGT DND03E                     組別在範圍
     C           WF0103    ORLT DND03S
     C                     SETON                     66
     C                     END
     C           *IN66     IFEQ '0'
     C                     Z-ADD0         WF0112
    C           KEYWF     CHAINWF010                40
    C                     EXSR RTN410
     C                     END
  02-C                     END
     C                     SETOF                     66
    C           SN02      READESO0                      46
  02-C                     END
    C*
    C                     READ SN0                      45
  01-C                     END
  01-C                     ENDSR
      *==============================================================*
M001A *          RTN410....WRITE OR UPDATE NPWF01
      *==============================================================*
01===C           RTN410    BEGSR
|    C*
     C                     Z-ADD0         AMT
     C           SO16      ADD  SO17      AMT    112
     C                     ADD  SO18      AMT
     C                     SUB  AMT       WF0112
  04*C           *IN40     IFEQ '0'
  |  C           AMT       IFNE 0
  |  C                     UPDATWF010
  |  C                     END
  04*C                     ELSE
    C                     Z-ADD0         WF0110
    C                     Z-ADD0         WF0111
    C                     Z-ADD0         WF0114
  |  C           AMT       IFNE 0
  |  C                     WRITEWF010
  |  C                     END
  04*C                     END
     C*
01===C                     ENDSR
      *==============================================================*
