     FGLAHLF12IP  E           K        DISK
     FAPUXLF01IF  E           K        DISK
     FGAWF05  O   E           K        DISK                      A
     FGAWF06  O   E           K        DISK                      A
     FGA#APF  UF  E           K        DISK                      A
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYUX     KLIST
     C                     KFLD           AH01
     C                     KFLD           WAH07
     C           KEY#A     KLIST
     C                     KFLD           AH01
     C                     KFLD           AH02
     C                     KFLD           AH03
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C           KEY#A     CHAIN#A0                  41
     C           *IN41     IFNE '0'
     C           AH20      ANDNE'V'
     C           AH07A     ANDGE'17'
     C           AH07A     ANDLE'36'
     C                     MOVELAH01      #A01
     C                     MOVELAH02      #A02
     C                     Z-ADDAH03      #A03
     C                     WRITE#A0
     C           AH07A     IFEQ '17'
     C                     MOVELAH07      WAH07   8
     C           KEYUX     CHAINUX0                  40
  01-C           *IN40     IFEQ '0'
     C                     Z-ADDAH03      WF0503
     C                     MOVELAH07      WF0507
     C                     MOVELAH07A     WF057A
     C                     Z-ADDAH12      WF0512
     C                     Z-ADDAH13      WF0513
     C                     Z-ADDAH10      WF0510
     C                     MOVELAH02      WF0502
     C                     MOVELAH01      WF0501
    C                     Z-ADDUX05      WF05A1
    C                     MOVELUX07      WF05A2
    C                     MOVELUX08      WF05A3
    C                     Z-ADDUX12      WF05A4
    C                     MOVELUX01      WF05A5
    C                     WRITEWF05R
     C                     ELSE
     C                     Z-ADDAH03      WF0503
     C                     MOVELAH07      WF0507
     C                     Z-ADDAH12      WF0512
     C                     Z-ADDAH13      WF0513
     C                     Z-ADDAH10      WF0510
     C                     MOVE AH02      WF0502
     C                     MOVE AH01      WF0501
     C                     MOVELAH07A     WF057A
    C                     Z-ADD0         WF05A1
    C                     MOVE *BLANKS   WF05A2
    C                     MOVE *BLANKS   WF05A3
    C                     Z-ADD0         WF05A4
    C                     MOVE *BLANKS   WF05A5
    C                     WRITEWF05R
  01-C                     END
  01-C                     ELSE
     C           AH07A     IFEQ '36'
     C                     Z-ADDAH03      WF0603
     C                     MOVELAH07      WF0607
     C                     Z-ADDAH12      WF0612
     C                     Z-ADDAH13      WF0613
     C                     Z-ADDAH10      WF0610
     C                     MOVELAH07A     WF067A
     C                     MOVELAH02      WF0602
     C                     MOVELAH01      WF0601
     C                     MOVELAH06      WF0606
    C                     WRITEWF06R
  01-C                     END
  01-C                     END
  01-C                     END
