     H****************************************************************
     H*                                                              *
     H*    PROGRAM ID   : PCA008                                     *
     H*    PROGRAM NAME : 零用金常用傳票登錄                       *
     H*    AUTHOR       : TINA                                       *
     H*    CREATE DATE  : 1994.02.20                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       : 零用金系統                               *
     F****************************************************************
     FPCCDPF  IF  E           K        DISK
     F*CCEPF  IF  E           K        DISK
     F*LAFPF  IF  E           K        DISK
     FGLAKPF  IF  E           K        DISK
     FPT#BPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FPCA008D CF  E                    WORKSTN      KINFDS DSPFDS
     F                                        RRN   KSFILE SFLSR
     F                                        RRNC  KSFILE SFLSRC
     F                                        RRND  KSFILE SFLSRD
     E*---------------------------------------------------------------*
     E                    @A01        5  1               作業權利
     E*---------------------------------------------------------------*
     E*輸入欄位代碼
     E                    W02         7  2
     E*輸入欄位內容
     E                    W05         4 20
     E* KEEP RRN VALUES／分攤比率#AQ2
     E                    W13        50  3 0 W14     7 4
     E                    W15        50  7 4D
     E*---------------------------------------------------------------*
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      139 139 $RMK01
     I                                      152 161 $USERN
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I*                                     211 2160DYMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C           *NAMVAR   DEFN *LDA      LDA
     C*
     C           *LIKE     DEFN RRND      WRRND
     C           *LIKE     DEFN RRNC      WRRNC
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*          KEYAF     KLIST
     C*                    KFLD           DAN01
     C*                    KFLD           AF02
     C*          KEYAN     KLIST
     C*                    KFLD           DAN01
     C*                    KFLD           DAN02B
     C*          KEYAO     KLIST
     C*                    KFLD           DAN01
     C*                    KFLD           AN02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
  02-C           SCID      CASEQ'SC01'    R1000
    C           SCID      CASEQ'SC02'    R2000
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     IN   PTDA01
|    C*
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $PFMT     P3104I  1
|    C                     PARM $PTYPE    P3105I  1
|    C           DDATE     PARM           P3101O  80
|    C*
|    C*
|    C                     MOVE 'SC01'    SCID    4
|    C* FUN AUT
|    C                     MOVE $ADD      @A01,1
|    C                     MOVE $UPD      @A01,2
|    C                     MOVE $DLT      @A01,4
|    C                     MOVE $INQ      @A01,5
|    C*
|    C* SC01 FIELD INITIALIZE *--------------------------------------*
|    C                     MOVEL*BLANK    DCD01
|    C                     MOVEL*BLANK    #B02
|    C                     MOVEL*BLANK    DCD17
|    C                     MOVEL*BLANK    DCD02S
|    C                     MOVEL*BLANK    DCD02E
|    C                     Z-ADD0         DCD10
|    C*--------------------------------------------------------------*
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'                        *PROMPT
|   C                     EXSR R1E00
|   C                     GOTO E1000
| 02-C                     END
|    C*
|    C                     EXSR R1B00                      *SCR CHK
|    C*
| 03-C           *IN99     IFEQ '0'                        *SCR CHK OK
|   C                     MOVEL'SC02'    SCID
| 03-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1B00 .... 'SC01' SCREEN CHECK
     C*==============================================================*
03===C           R1B00     BEGSR
|    C*
|    C* CHK FUN AUT
| 01-C                     DO   5         WI      30
| 02-C           WI        IFNE 3
|   C           @A01,WI   ANDNE'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 02-C                     END
| 01-C  N99                END
|    C   99                GOTO E1B00
|    C*
|    C* DATA CHECK *--------------------------------------------------*
|    C*
|    C                     MOVE *BLANK    #B02
| 03-C           DCD01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 03-C                     END
|    C   99                GOTO E1B00
|    C**
|    C* CHK 公司別須存在公司檔(PT#BPF)且類別＝１
|    C**
|    C           DCD01     CHAIN#B0                  40
| 04-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 04*C                     ELSE
| 05-C           #B12      IFNE '1'
|   C                     MOVEL'UGL0004' ERRID
|   C                     MOVEL'GLMF'    ERRF
|   C                     SETON                     6099
| 05-C                     END
| 04-C                     END
|    C   99                GOTO E1B00
|    C**
|    C* CHK 公司別須存在總帳控制檔(GLAKPF)
|    C**
|    C           DCD01     CHAINAK0                  40
| 06-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 06-C                     END
|    C   99                GOTO E1B00
|    C**
|    C* CHK 辦事處
|    C**
| 07-C           DCD17     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 07-C                     END
|    C   99                GOTO E1B00
|    C**
|    C**
|    C* CHK 傳票代碼資料區間
|    C**
| 08-C           DCD02S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DCD02S
| 08-C                     END
| 09-C           DCD02E    IFEQ *BLANK
|   C                     MOVE *ALL'9'   DCD02E
| 09-C                     END
|    C*
| 10-C           DCD02S    IFGT DCD02E
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     626399
| 10-C                     END
|    C   99                GOTO E1B00
|    C**
|    C* CHK 登帳日期
|    C**
| 11-C           DCD10     IFNE 0
|   C                     CALL 'P30'
|   C                     PARM DCD10     P3001I  80
|   C                     PARM AK11      P3002I  1
|   C                     PARM AK09      P3003I  1
|   C                     PARM           P3001O  1
| 12-C           P3001O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 12-C                     END
| 11-C                     END
|    C   99                GOTO E1B00
|    C**登帳日不可大於系統日
|    C                     Z-ADD0         DCD10W  80
| 13-C           DCD10     IFNE 0
|   C                     CALL 'P31'
|   C                     PARM DCD10     P3101I  80
|   C                     PARM $PFMT     P3102I  1
|   C                     PARM $PTYPE    P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           DCD10W    PARM           P3101O  80
|   C*
| 14-C           DCD10W    IFGT $A8YMD
|   C                     MOVEL'UPT0120' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 14-C                     END
| 13-C                     END
|    C   99                GOTO E1B00
|    C**
|    C* CHK會計期間資料是否建立
|    C* CALL 'GLS005' GET 本期結帳碼->(CHK權限$RMK01)
|    C**
|    C                     Z-ADD0         P005O1
|    C                     Z-ADD0         P005O2
|    C*
|    C                     CALL 'GLS005'
|    C                     PARM DCD01     P005I1  2
|    C                     PARM DCD10     P005I2  80
|    C                     PARM 'S'       P005I3  1
|    C                     PARM           P005O1  40
|    C                     PARM           P005O2  20
|    C                     PARM           P005O3  1
|    C                     PARM           P005O4  1
| 15-C           P005O1    IFEQ 0
|   C           P005O2    OREQ 0
|   C                     MOVEL'UGL0029' ERRID
|   C                     MOVEL'GLMF'    ERRF
|   C                     SETON                     6499
| 15-C                     END
|    C   99                GOTO E1B00
|    C**
| 16-C           P005O3    IFEQ 'Y'
|   C           $RMK01    ANDNE'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 16-C                     END
|    C   99                GOTO E1B00
|    C*
03===C           E1B00     ENDSR
     C*==============================================================*
     C*          R1C00 ....INIT 'SC02'
     C*==============================================================*
04===C           R1C00     BEGSR
|    C*
|    C                     Z-ADD0         WNO     30        *CA03
|    C                     Z-ADD0         RRND
|    C                     Z-ADD0         RRNC
|    C                     Z-ADD0         WRRND
|    C                     Z-ADD0         WRRNC
|    C*
|    C                     SETON                     52
|    C                     WRITESFLCRD
|    C                     WRITESFLCRC
|    C                     SETOF                     52
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
05===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*傳票代碼1
| 01-C           #LIN      IFEQ 5
|   C           #COL      ANDGE16
|   C           #COL      ANDLE23
|   C                     CALL 'PCI006'
|   C           DCD02S    PARM DCD02S    P310I1  8
|   C                     PARM           @RTNC   2
| 01-C                     END
|    C*
|    C*傳票代碼2
| 02-C           #LIN      IFEQ 5
|   C           #COL      ANDGE28
|   C           #COL      ANDLE35
|   C                     CALL 'PCI006'
|   C           DCD02E    PARM DCD02E    P310I2  8
|   C                     PARM           @RTNC   2
| 02-C                     END
05===C                     ENDSR
     C*==============================================================*
     C*          R2000 .... 'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
06===C           R2000     BEGSR
|    C*
|    C                     EXSR R2A10                      *INIT SFLSR
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           SCID      ANDEQ'SC02'
|   C*
| 02-C           RRN       IFGT 0
|   C                     SETON                     50
| 02*C                     ELSE
|   C                     SETON                     96
| 02-C                     END
|   C*
|   C                     WRITEDSPC2
|   C                     EXFMTSFLCR
|   C                     MOVEA*ALL'0'   *IN,60
|   C*
| 03-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
|   C                     EXSR R2B00                      *SC02 CHK
| 03*C                     ELSE
|   C* *IN12 ON | *IN03 ON
|   C                     MOVEL'SC01'    SCID
| 03-C                     END                             *ENDDO
| 01-C                     END                             *ENDDO
|    C*
06===C           E2000     ENDSR
     C*==============================================================*
     C*          R2A10 ....INIT 'SC02'
     C*==============================================================*
07===C           R2A10     BEGSR
|    C* INIT SCR02
|    C                     Z-ADD0         RRN
|    C                     Z-ADD1         DRRN
|    C                     SETON                     5251
|    C                     WRITESFLCR
|    C                     SETOF                     5253
|    C*
|    C*
|    C*                    SETON                     54    *SFLNXTCHG
|    C           DCD02S    SETLLCD0
|    C                     READ CD0                      44
| 01-C           *IN44     DOWEQ'0'
|   C           CD02      ANDLEDCD02E
|   C                     EXSR R2A30
|   C                     READ CD0                      44
| 01-C                     END
|    C                     SETON                     53
|    C*                    SETOF                     54
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          R2A30 ....MOVE  FILE DATA -> SFL
     C*==============================================================*
08===C           R2A30     BEGSR
|    C*
|    C                     MOVE CD02      SCD02
|    C                     Z-ADDDCD10     SCD10
|    C                     MOVELCD03      DCD03
|    C                     MOVEL*BLANKS   DCA02   9
|    C                     MOVEL*BLANKS   WCA02   9
|    C                     MOVE *BLANK    DCA28
|    C                     ADD  1         RRN
|    C                     WRITESFLSR
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          R2B00 ....'SC02' CHECK
     C*==============================================================*
09===C           R2B00     BEGSR
|    C*
|    C                     SETON                     54
|    C                     READCSFLSR                  5757
| 01-C           *IN57     DOWEQ'0'
|   C           *IN99     ANDEQ'0'
| 02-C           DCA28     IFNE *BLANK
|   C           DCA02     ANDEQ*BLANK
|   C*
|   C                     EXSR R2B10                      *CHK DATE
|   C*
| 03-C           *IN99     IFEQ '0'
|   C                     EXSR R2F00
| 03-C                     END
|   C*
|   C           RRN       CHAINSFLSR                40
|   C                     MOVE WCA02     DCA02
| 02-C                     END
|   C*新增成功
| 04-C           DCA02     IFNE *BLANK
|   C                     SETON                     31
|   C*員工姓名_
|   C           DCA28     CHAINMC0                  42
| 05-C           *IN42     IFEQ '1'
|   C                     MOVEL*BLANKS   MC03
| 05-C                     END
| 04*C                     ELSE
|   C                     SETOF                     31
| 04-C                     END
|   C*
|   C                     UPDATSFLSR
|   C  N99                READCSFLSR                  5757
| 01-C  N03N12             END
|    C*
09===C           E2B00     ENDSR
     C*==============================================================*
     C*          R2B10 ....'SC02' CHECK DATE
     C*==============================================================*
10===C           R2B10     BEGSR
|    C* CHK傳票日期
| 01-C           SCD10     IFEQ 0
|   C           DCA28     ANDNE*BLANK
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 01*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM SCD10     P3001I  80
|   C                     PARM AK11      P3002I  1
|   C                     PARM AK09      P3003I  1
|   C                     PARM           P3001O  1
| 02-C           P3001O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 02-C                     END
| 01-C                     END
|    C   99                GOTO E2B10
|    C**登帳日不可大於系統日
|    C                     Z-ADD0         SCD10W  80
| 03-C           SCD10     IFNE 0
|   C                     CALL 'P31'
|   C                     PARM SCD10     P3101I  80
|   C                     PARM $PFMT     P3102I  1
|   C                     PARM $PTYPE    P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           SCD10W    PARM           P3101O  80
|   C*
| 04-C           SCD10W    IFGT $A8YMD
|   C                     MOVEL'UPT0120' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 04-C                     END
| 03-C                     END
|    C   99                GOTO E2B10
|    C**
|    C* CHK會計期間資料是否建立
|    C* CALL 'GLS005' GET 本期結帳碼->(CHK權限$RMK01)
|    C**
|    C                     Z-ADD0         P005O1
|    C                     Z-ADD0         P005O2
|    C*
|    C                     CALL 'GLS005'
|    C                     PARM DCD01     P005I1  2
|    C                     PARM SCD10     P005I2  80
|    C                     PARM 'S'       P005I3  1
|    C                     PARM           P005O1  40
|    C                     PARM           P005O2  20
|    C                     PARM           P005O3  1
|    C                     PARM           P005O4  1
| 05-C           P005O1    IFEQ 0
|   C           P005O2    OREQ 0
|   C                     MOVEL'UGL0029' ERRID
|   C                     MOVEL'GLMF'    ERRF
|   C                     SETON                     6599
| 05-C                     END
|    C   99                GOTO E2B10
|    C*
| 06-C           P005O3    IFEQ 'Y'
|   C           $RMK01    ANDNE'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 06-C                     END
|    C   99                GOTO E2B10
|    C* CHK申請員工
| 07-C           DCA28     IFNE *BLANKS
|   C           DCA28     CHAINMC0                  46
| 08-C           *IN46     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6699
| 08-C                     END
| 07-C                     END
|    C   99                GOTO E2B10
|    C**
|    C*
10===C           E2B10     ENDSR
     C*==============================================================*
     C*          R2F00 ....修改傳票
     C*==============================================================*
11===C           R2F00     BEGSR
|    C*
|    C* CALL SUB-PROGRAM
|    C                     OUT  LDA
|    C                     CALL 'PCA0081'
|    C                     PARM DCD01     P121I1  2
|    C                     PARM DCD17     P121I2  1
|    C                     PARM SCD02     P121I3  8
|    C                     PARM SCD10     P121I4  70
|    C                     PARM DCA28     P121I5  6
|    C           WCA02     PARM           P121O1  9
|    C*
11===C                     ENDSR
