     FPCB002D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      119 1240$ADMDY
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
      *作帳日期
     I                                      601 6060D05
     I                                      607 6120D06
      *公司別
     I                                      613 614 D01
     I                                      615 616 D02
      *辦事處
     I                                      627 627 D03
     I                                      628 628 D04
      *作帳日期
     I                                      631 6380F01
     I                                      631 6360F01YM
     I                                      639 6460F02
     I                                      639 6440F02YM
     I                                      645 6460F02D
     I                                      648 6490DD
      *試算
     I                                      650 650 DSEL
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN14     PARM *IN14     IN14    1
     C           *IN10     PARM *IN10     IN10    1
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   10                EXSR R0200                      *INIT MSG.
     C  N10                EXSR R0100                      *INIT VALUE
     C*
     C                     MOVEL*BLANK    @PRT    1        *PRINT
  01-C           *IN03     DOUEQ'1'
    C           @PRT      OREQ 'Y'
    C                     EXSR R1000                      *SCRN
  01-C                     END
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===CSR         R0100     BEGSR
|    C                     SETON                     10
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     MOVE *BLANKS   D01
|    C                     MOVE *BLANKS   D02
|    C                     MOVE *BLANKS   D03
|    C                     MOVE *BLANKS   D04
|    C                     Z-ADD*ZEROS    D05
|    C                     Z-ADD*ZEROS    D06
|    C                     MOVE 'A'       DSEL
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ....INITIAL VALUE
     C*==============================================================*
02===CSR         R0200     BEGSR
|    C*
|    C                     SETON                       99  報表格式MESSAGE
|    C*
| 01-C           $EVR      IFEQ 1                          ON-LINE
|   C                     MOVEL'UPT2142' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C*
| 02-C           $EVR      IFEQ 2                          BATCH
|   C                     MOVEL'UPT2111' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|    C*
02===C                     ENDSR
     C*===============================================================*
     C*          R1000  ...SCREEN MAIN PROCESS
     C*===============================================================*
03===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'                        *WINDOW
|   C**********************
|   C*  F4 PROMPT PROCESS *
|   C**********************
|   C                     EXSR RTNF4
|   C                     GOTO E1000
| 02-C                     END
      *
|    C                     EXSR R1B00                      .CHECK      ?
|    C*
| 03-C           *IN99     IFEQ *ZERO
|   C           *IN14     ANDEQ'1'
|   C                     SETON                     28    .執行中
|   C                     WRITEDSPD1
|   C                     SETOF                     28
|   C*
|   C                     OUT  *NAMVAR
|   C                     MOVEL'Y'       @PRT
| 03-C                     END
|    C*
03===C           E1000     ENDSR
     C*===============================================================*
     C*          R1B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
04===C           R1B00     BEGSR
|    C*
|    C*+<<DATA CHECK>>+++++++++++++++++++++++++++++++++++++++++++++++++
      *公司別
| 01-C           D01       IFEQ *BLANKS
|   C                     MOVEL*LOVAL    D01
| 01-C                     END
      *
| 02-C           D02       IFEQ *BLANKS
|   C                     MOVEL*HIVAL    D02
| 02-C                     END
      *
| 03-C           D01       IFGT D02
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     616299
| 03-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
      *辦事處
| 04-C           D03       IFEQ *BLANKS
|   C                     MOVEL*LOVAL    D03
| 04-C                     END
      *
| 05-C           D04       IFEQ *BLANKS
|   C                     MOVEL*HIVAL    D04
| 05-C                     END
      *
| 06-C           D03       IFGT D04
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     636499
| 06-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
      *確認日期
|    C*
| 07-C           D05       IFEQ *ZEROS
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 07*C                     ELSE
|   C*
|   C                     CALL 'P09'
|   C                     PARM D05       P0901I  60
|   C                     PARM           P0911O  1
| 08-C           P0911O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 08-C                     END
| 07-C                     END
|    C   99                GOTO E1B00
|    C*
| 09-C           D06       IFEQ *ZEROS
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6699
| 09*C                     ELSE
|   C*
|   C                     CALL 'P09'
|   C                     PARM D06       P0901I  60
|   C                     PARM           P0911O  1
| 10-C           P0911O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6699
| 10-C                     END
| 09-C                     END
|    C   99                GOTO E1B00
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* 日期格式轉換(SCREEN->FILE)
|    C                     CALL 'P31'
|    C                     PARM D05       P3101I  80
|    C                     PARM '3'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           F01       PARM           P3101O  80
|    C*
|    C                     CALL 'P31'
|    C                     PARM D06       P3101I  80
|    C                     PARM '3'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           F02       PARM           P3101O  80
|    C*
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
| 11-C           F02       IFLT F01
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     656699
| 11-C                     END
|    C   99                GOTO E1B00
|    C*
| 12-C           F02YM     IFNE F01YM
|   C                     MOVEL'URE0080' ERRID
|   C                     MOVEL'REMF'    ERRF
|   C                     SETON                     656699
| 12-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*
|    C*
04===CSR         E1B00     ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
05===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
| 01-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE39
|   C           D#COL     ANDLE40
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 01-C                     END
|    C*
05===C           ENDF4     ENDSR
