     FPCCALF02IF  E           K        DISK
     FGLAKPF  IF  E           K        DISK
     FPT#BPF  IF  E           K        DISK
     FS#SUPF  IF  E           K        DISK
     FPCI002D CF  E                    WORKSTN
     F                                        RRN   KSFILE SFLSR
     E*
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      152 161 $USERN
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I*                                     211 2160DDATE
     I*DEFIND STRAT KEY
     I            DS
     I                                        1  12 @KCAO
     I            DS
     I                                        1  12 @KCAN
     I                                        1   2 DCA01
     I                                        3   3 DCA17
     I                                        4  12 D02S
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*
     C           *LIKE     DEFN RRN       WRRN
     C           *LIKE     DEFN RRN       @DRCD            DSP REC NUM
     C           *LIKE     DEFN RRN       @PRCD            PAGE REC
     C           *LIKE     DEFN DCA02E    D02E
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYSL     KLIST                           *SETLL
     C                     KFLD           DCA01
     C                     KFLD           DCA17
     C                     KFLD           D02S
     C           KEYSG     KLIST                           *SETGT
     C                     KFLD           DCA01
     C                     KFLD           DCA17
     C                     KFLD           CA02
     C           KEY#B     KLIST
     C                     KFLD           DCA01
     C           KEYSU     KLIST
     C                     KFLD           CA26
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
  01-C           *IN03     DOWEQ'0'
    C*
  02-C           SCID      CASEQ'SC01'    R1000
    C           SCID      CASEQ'SC02'    R2000
  02-C                     END
    C*
  01-C                     END
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 --- INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     MOVEL'SC01'    SCID    4
|    C*
|    C                     IN   PTDA01
|    C*
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $PFMT     P3104I  1
|    C                     PARM $PTYPE    P3105I  1
|    C           DDATE     PARM           P3101O  80
|    C*
|    C                     MOVEL*BLANK    DCA01
|    C                     MOVEL*BLANK    DCA17
|    C                     MOVEL*BLANK    DCA02S
|    C                     MOVEL*BLANK    DCA02E
|    C                     MOVEL*BLANK    DCA28S
|    C                     MOVEL*BLANK    DCA28E
|    C                     Z-ADD0         DCA25S
|    C                     Z-ADD0         DCA25E
|    C                     Z-ADD0         DCA10S
|    C                     Z-ADD0         DCA10E
|    C                     Z-ADD0         DCA11S
|    C                     Z-ADD0         DCA11E
|    C                     Z-ADD0         DCA29S
|    C                     Z-ADD0         DCA29E
|    C                     MOVEL*BLANK    DCA26
|    C                     MOVEL'3'       DCA18
|    C                     MOVEL'3'       DCA20
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000  ---SCREEN1 MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
|    C                     EXSR R1100                      *CHECK
|    C*
| 02-C           *IN99     IFEQ '0'
|   C                     MOVEL'SC02'    SCID
| 02-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1100  --- CHECK SCREEN 1
     C*==============================================================*
03===C           R1100     BEGSR
|    C*
| 01-C           DCA01     IFEQ *BLANK                     *公司別
|   C                     SETON                     6099
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01*C                     ELSE
|   C           KEY#B     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     SETON                     6099
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02*C                     ELSE
|   C           KEY#B     CHAINAK0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     SETON                     6099
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C   99                GOTO E1100
|    C*辦事處---------------------------------
| 04-C           DCA17     IFEQ *BLANK
|   C                     SETON                     6199
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 04-C                     END
|    C   99                GOTO E1100
|    C*傳票號碼-------------------------------
| 05-C           DCA02S    IFEQ *BLANK
|   C                     MOVEL*LOVAL    D02S
| 05*C                     ELSE
|   C                     MOVELDCA02S    D02S
| 05-C                     END
| 06-C           DCA02E    IFEQ *BLANK
|   C                     MOVEL*ALL'9'   D02E
|   C                     MOVEL*ALL'9'   DCA02E
| 06*C                     ELSE
|   C                     MOVELDCA02E    D02E
| 06-C                     END
| 07-C           D02S      IFGT D02E
|   C                     SETON                     626399
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 07*C                     ELSE
|   C*KEEP FIRST STRKEY--------
|   C                     MOVEL@KCAN     @KCAO
|   C*
| 07-C                     END
|    C   99                GOTO E1100
|    C*申請員工-------------------------------
| 08-C           DCA28E    IFEQ *BLANK
|   C                     MOVEL*ALL'9'   DCA28E
| 08-C                     END
| 09-C           DCA28S    IFGT DCA28E
|   C                     SETON                     727399
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 09-C                     END
|    C   99                GOTO E1100
|    C*---------------------------------------------------------------
|    C*製票日期--------------------------------
|    C*---------------------------------------------------------------
| 10-C           DCA25S    IFEQ 0
|   C                     Z-ADD0         D25S    80
| 10*C                     ELSE
|   C*日期檢查------
|   C                     Z-ADDDCA25S    W25S    80
|   C                     CALL 'P30'
|   C                     PARM W25S      P3001I  80
|   C                     PARM AK11      P3002I  1
|   C                     PARM AK09      P3003I  1
|   C                     PARM           P3001O  1
|   C*
| 11-C           P3001O    IFNE 'Y'
|   C                     SETON                     6499
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 11*C                     ELSE
|   C*日期轉換-- S->F
|   C                     CALL 'P31'
|   C                     PARM W25S      P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           D25S      PARM           P3101O  80
| 11-C                     END
|   C*
| 10-C                     END
|    C   99                GOTO E1100
|    C*
| 12-C           DCA25E    IFEQ 0
|   C                     Z-ADD*HIVAL    D25E    80
|   C                     CALL 'P31'
|   C                     PARM *HIVAL    P3101I  80
|   C                     PARM '2'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM AK11      P3104I  1
|   C                     PARM AK09      P3105I  1
|   C           DCA25E    PARM           P3101O  80
|   C*
| 12*C                     ELSE
|   C*日期檢查------
|   C                     Z-ADDDCA25E    W25E    80
|   C                     CALL 'P30'
|   C                     PARM W25E      P3001I  80
|   C                     PARM AK11      P3002I  1
|   C                     PARM AK09      P3003I  1
|   C                     PARM           P3001O  1
|   C*
| 13-C           P3001O    IFNE 'Y'
|   C                     SETON                     6599
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 13*C                     ELSE
|   C*日期轉換-- S->F
|   C                     CALL 'P31'
|   C                     PARM W25E      P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           D25E      PARM           P3101O  80
| 13-C                     END
|   C*
| 12-C                     END
|    C   99                GOTO E1100
|    C*製票日期區間之比較-------
| 14-C           D25S      IFGT D25E
|   C                     SETON                     646599
|   C                     MOVEL'UPT0041' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 14-C                     END
|    C   99                GOTO E1100
|    C*---------------------------------------------------------------
|    C*傳票日期--------------------------------
|    C*---------------------------------------------------------------
| 15-C           DCA10S    IFEQ 0
|   C                     Z-ADD0         D10S    80
| 15*C                     ELSE
|   C*日期檢查------
|   C                     Z-ADDDCA10S    W10S    80
|   C                     CALL 'P30'
|   C                     PARM W10S      P3001I  80
|   C                     PARM AK11      P3002I  1
|   C                     PARM AK09      P3003I  1
|   C                     PARM           P3001O  1
|   C*
| 16-C           P3001O    IFNE 'Y'
|   C                     SETON                     6699
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 16*C                     ELSE
|   C*日期轉換-- S->F
|   C                     CALL 'P31'
|   C                     PARM W10S      P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           D10S      PARM           P3101O  80
| 16-C                     END
|   C*
| 15-C                     END
|    C   99                GOTO E1100
|    C*
| 17-C           DCA10E    IFEQ 0
|   C                     Z-ADD*HIVAL    D10E    80
|   C                     CALL 'P31'
|   C                     PARM *HIVAL    P3101I  80
|   C                     PARM '2'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM AK11      P3104I  1
|   C                     PARM AK09      P3105I  1
|   C           DCA10E    PARM           P3101O  80
|   C*
| 17*C                     ELSE
|   C*日期檢查------
|   C                     Z-ADDDCA10E    W10E    80
|   C                     CALL 'P30'
|   C                     PARM W10E      P3001I  80
|   C                     PARM AK11      P3002I  1
|   C                     PARM AK09      P3003I  1
|   C                     PARM           P3001O  1
|   C*
| 18-C           P3001O    IFNE 'Y'
|   C                     SETON                     6799
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 18*C                     ELSE
|   C*日期轉換-- S->F
|   C                     CALL 'P31'
|   C                     PARM W10E      P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           D10E      PARM           P3101O  80
| 18-C                     END
|   C*
| 17-C                     END
|    C   99                GOTO E1100
|    C*製票日期區間之比較-------
| 19-C           D10S      IFGT D10E
|   C                     SETON                     666799
|   C                     MOVEL'UPT0041' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 19-C                     END
|    C   99                GOTO E1100
|    C*---------------------------------------------------------------
|    C*支付日期--------------------------------
|    C*---------------------------------------------------------------
| 20-C           DCA11S    IFEQ 0
|   C                     Z-ADD0         D11S    80
| 20*C                     ELSE
|   C*日期檢查------
|   C                     Z-ADDDCA11S    W11S    80
|   C                     CALL 'P30'
|   C                     PARM W11S      P3001I  80
|   C                     PARM AK11      P3002I  1
|   C                     PARM AK09      P3003I  1
|   C                     PARM           P3001O  1
|   C*
| 21-C           P3001O    IFNE 'Y'
|   C                     SETON                     6899
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 21*C                     ELSE
|   C*日期轉換-- S->F
|   C                     CALL 'P31'
|   C                     PARM W11S      P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           D11S      PARM           P3101O  80
| 21-C                     END
|   C*
| 20-C                     END
|    C   99                GOTO E1100
|    C*
| 22-C           DCA11E    IFEQ 0
|   C                     Z-ADD*HIVAL    D11E    80
|   C                     CALL 'P31'
|   C                     PARM *HIVAL    P3101I  80
|   C                     PARM '2'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM AK11      P3104I  1
|   C                     PARM AK09      P3105I  1
|   C           DCA11E    PARM           P3101O  80
|   C*
| 22*C                     ELSE
|   C*日期檢查------
|   C                     Z-ADDDCA11E    W11E    80
|   C                     CALL 'P30'
|   C                     PARM W11E      P3001I  80
|   C                     PARM AK11      P3002I  1
|   C                     PARM AK09      P3003I  1
|   C                     PARM           P3001O  1
|   C*
| 23-C           P3001O    IFNE 'Y'
|   C                     SETON                     6999
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 23*C                     ELSE
|   C*日期轉換-- S->F
|   C                     CALL 'P31'
|   C                     PARM W11E      P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           D11E      PARM           P3101O  80
| 23-C                     END
|   C*
| 22-C                     END
|    C   99                GOTO E1100
|    C*迴轉日期區間之比較-------
| 24-C           D11S      IFGT D11E
|   C                     SETON                     686999
|   C                     MOVEL'UPT0041' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 24-C                     END
|    C   99                GOTO E1100
|    C*
|    C*---------------------------------------------------------------
|    C*撥補日期--------------------------------
|    C*---------------------------------------------------------------
| 25-C           DCA29S    IFEQ 0
|   C                     Z-ADD0         D29S    80
| 25*C                     ELSE
|   C*日期檢查------
|   C                     Z-ADDDCA29S    W29S    80
|   C                     CALL 'P30'
|   C                     PARM W29S      P3001I  80
|   C                     PARM AK11      P3002I  1
|   C                     PARM AK09      P3003I  1
|   C                     PARM           P3001O  1
|   C*
| 26-C           P3001O    IFNE 'Y'
|   C                     SETON                     7099
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 26*C                     ELSE
|   C*日期轉換-- S->F
|   C                     CALL 'P31'
|   C                     PARM W29S      P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           D29S      PARM           P3101O  80
| 26-C                     END
|   C*
| 25-C                     END
|    C   99                GOTO E1100
|    C*
| 27-C           DCA29E    IFEQ 0
|   C                     Z-ADD*HIVAL    D29E    80
|   C                     CALL 'P31'
|   C                     PARM *HIVAL    P3101I  80
|   C                     PARM '2'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM AK11      P3104I  1
|   C                     PARM AK09      P3105I  1
|   C           DCA29E    PARM           P3101O  80
|   C*
| 27*C                     ELSE
|   C*日期檢查------
|   C                     Z-ADDDCA29E    W29E    80
|   C                     CALL 'P30'
|   C                     PARM W29E      P3001I  80
|   C                     PARM AK11      P3002I  1
|   C                     PARM AK09      P3003I  1
|   C                     PARM           P3001O  1
|   C*
| 28-C           P3001O    IFNE 'Y'
|   C                     SETON                     7199
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 28*C                     ELSE
|   C*日期轉換-- S->F
|   C                     CALL 'P31'
|   C                     PARM W29E      P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           D29E      PARM           P3101O  80
| 28-C                     END
|   C*
| 27-C                     END
|    C   99                GOTO E1100
|    C*迴轉日期區間之比較-------
| 29-C           D29S      IFGT D29E
|   C                     SETON                     707199
|   C                     MOVEL'UPT0041' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 29-C                     END
|    C   99                GOTO E1100
|    C*
| 30-C           DCA17     IFEQ '1'
|   C                     MOVE '台北'  DESC
| 30*C                     ELSE
| 31-C           DCA17     IFEQ '2'
|   C                     MOVE '台中'  DESC
| 31*C                     ELSE
| 32-C           DCA17     IFEQ '3'
|   C                     MOVE '高雄'  DESC
| 32-C                     END
| 31-C                     END
| 30-C                     END
|    C*
03===C           E1100     ENDSR
     C*==============================================================*
     C*          R2000 --- MAIN ROUTINE
     C*==============================================================*
04===C           R2000     BEGSR
|    C                     EXSR R2A00                      .SFL INIT
|    C*
| 01-C           *IN03     DOWEQ'0'
|   C           SCID      ANDEQ'SC02'
|   C                     EXSR R2200                      *SCR PROCESS
| 01-C                     END
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          R2200 ....SCREEN  PROCESS
     C*==============================================================*
05===C           R2200     BEGSR
|    C*
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR
|    C                     MOVEA*ALL'0'   *IN,60
|    C**                   Z-ADD*ZERO     #LIN
|    C**                   Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E2200
| 01-C                     END
|    C*
| 02-C           *IN12     IFEQ '1'                        *PREVIOUS
|   C                     MOVEL'SC01'    SCID
|   C                     GOTO E2200
| 02-C                     END
|    C*
| 03-C           *IN25     IFEQ '1'                        *NEXT PAGE
|   C                     EXSR R2N00
|   C                     GOTO E2200
| 03-C                     END
|    C*
| 04-C           @KCAO     IFNE @KCAN                      *START KEY
|   C                     EXSR R2A00                      *SFL INIT
|   C                     MOVEL@KCAN     @KCAO
|   C                     GOTO E2200
| 04-C                     END
|    C*
|    C                     EXSR R2C00                      *OPTION
|    C*
05===C           E2200     ENDSR
     C*=============================================================*
     C*          R2A00 ....SUBFILE INIT PREPARE
     C*=============================================================*
06===C           R2A00     BEGSR
|    C*
|    C                     Z-ADD0         DRRN
|    C                     Z-ADD0         RRN
|    C                     Z-ADD0         WRRN
|    C                     Z-ADD0         @DRCD            *DSP RCD
|    C                     Z-ADD10        @PRCD            .PAGE SIZE
|    C                     MOVEL'N'       @BOTOM  1        *BOTTOM
|    C*
|    C                     SETON                     52    *SFLCLR
|    C                     WRITESFLCR
|    C                     SETOF                     52
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     SETOF                     5053  *SFLDSP,END
|    C*
|    C**                   EXSR R1A20                      *SFL HEAD
|    C* <<SFL INITIAITAL DATA ADD>>
|    C                     MOVE *BLANK    DOPT
|    C*
|    C           KEYSL     SETLLCA0
|    C                     EXSR R2A10                      *ADD SFL DTA
|    C*
|    C*
| 01-C           RRN       IFGT 0
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     99    *NO DTA
|   C                     MOVEL'UPT2050' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C*
06===C                     ENDSR
     C*=============================================================*
     C*          R2A10 .... ADD SUBFILE DATA
     C*=============================================================*
07===C           R2A10     BEGSR
|    C*
|    C                     ADD  @PRCD     @DRCD
| 01-C           RRN       DOWLT@DRCD
|   C*
|   C                     READ CA0                      46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C*公司別，傳票號碼迄 --------
|   C           CA01      ANDEQDCA01
|   C           CA02      ANDLED02E
|   C                     EXSR R2A11                      *WRITE SFL
| 02*C                     ELSE                            *EOF
|   C                     Z-ADDRRN       @DRCD
|   C                     MOVE 'Y'       @BOTOM
|   C                     SETON                     9653  *SFLEND
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN       WRRN
|    C                     Z-ADDRRN       DRRN
|    C*
07===C                     ENDSR
     C*=============================================================*
     C*          R2A11 .... WRITE SUBFILE DATA
     C*=============================================================*
08===C           R2A11     BEGSR
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*挑選合細部要求的資料-----------------
|    C*製票日期，登帳日期，支付日期，撥補日期--
| 01-C           CA25      IFLT D25S
|   C           CA25      ORGT D25E
|   C           CA10      ORLT D10S
|   C           CA10      ORGT D10E
|   C           CA11      ORLT D11S
|   C           CA11      ORGT D11E
|   C           CA29      ORLT D29S
|   C           CA29      ORGT D29E
|   C           CA17      ORNE DCA17
|   C           CA28      ORLT DCA28S
|   C           CA28      ORGT DCA28E
|   C                     SETON                     99
| 01-C                     END
|    C   99                GOTO E2A11
|    C*製票者-----
| 02-C           DCA26     IFNE *BLANK
|   C           CA26      ANDNEDCA26
|   C                     SETON                     99
| 02-C                     END
|    C   99                GOTO E2A11
|    C*過帳-----
| 03-C           DCA18     IFEQ '1'
|   C           CA18      ANDNE'V'
|   C                     SETON                     99
| 03-C                     END
|    C   99                GOTO E2A11
| 04-C           DCA18     IFEQ '2'
|   C           CA18      ANDNE' '
|   C                     SETON                     99
| 04-C                     END
|    C   99                GOTO E2A11
|    C*作廢-----
| 05-C           DCA20     IFEQ '1'
|   C           CA20      ANDNE'V'
|   C                     SETON                     99
| 05-C                     END
|    C   99                GOTO E2A11
| 06-C           DCA20     IFEQ '2'
|   C           CA20      ANDNE' '
|   C                     SETON                     99
| 06-C                     END
|    C   99                GOTO E2A11
|    C*----------------------------------------------------------------
|    C* << SUBFILE DATA VALUE SET >>
|    C           KEY#B     CHAINAK0                  40
|    C*登帳日期  F->S
|    C                     CALL 'P31'
|    C                     PARM CA10      P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM AK11      P3104I  1
|    C                     PARM AK09      P3105I  1
|    C           DCA10     PARM           P3101O  80
|    C*支付日期  F->S
| 07-C           CA11      IFEQ 0
|   C                     Z-ADD0         DCA11
| 07*C                     ELSE
|   C                     CALL 'P31'
|   C                     PARM CA11      P3101I  80
|   C                     PARM '2'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM AK11      P3104I  1
|   C                     PARM AK09      P3105I  1
|   C           DCA11     PARM           P3101O  80
| 07-C                     END
|    C*撥補日期  F->S
| 08-C           CA11      IFEQ 0
|   C                     Z-ADD0         DCA29
| 08*C                     ELSE
|   C                     CALL 'P31'
|   C                     PARM CA29      P3101I  80
|   C                     PARM '2'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM AK11      P3104I  1
|   C                     PARM AK09      P3105I  1
|   C           DCA29     PARM           P3101O  80
| 08-C                     END
|    C*製票者---------
|    C           KEYSU     CHAINSU0                  40
|    C   40                MOVEL*BLANK    SU02
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*累計金額---------
|    C                     Z-ADD0         DCA12
|    C           KEYSG     SETLLCA0
|    C           KEYSG     READECA0                      44
| 09-C           *IN44     DOWEQ'0'
|   C                     ADD  CA12      DCA12
|   C           KEYSG     READECA0                      44
| 09-C                     END
      *
|    C                     ADD  1         RRN
|    C                     WRITESFLSR
|    C*
|    C* SETGT CA0----
|    C*
|    C           KEYSG     SETGTCA0
|    C*
|    C           E2A11     TAG
|    C                     SETOF                     99
08===C                     ENDSR
     C*=============================================================*
     C*          R1A20 .... SFL HEADING (SFL CONTROL DATA PREPARE)
     C*=============================================================*
09===C**         R1A20     BEGSR
|    C*
|    C*
09===C**                   ENDSR
     C*=============================================================*
     C*          R2C00 ....挑選資料
     C*=============================================================*
10===C           R2C00     BEGSR
|    C*
|    C                     READCSFLSR                  4242
| 01-C           *IN42     DOWEQ'0'
|   C*
| 02-C           DOPT      IFNE *BLANK
|   C* <<CALL SUB-PGM>>++++++++++++++++++++++++++++++++++++++++++++
|   C                     CALL 'PCI001'
|   C                     PARM DCA01     P1F0I1  2
|   C                     PARM CA02      P1F0I2  9
|   C                     PARM           @RTNC   2
|   C*
| 03-C           @RTNC     IFEQ '03'
|   C                     SETON                     03
| 03-C                     END
|   C*
|   C                     Z-ADDRRN       DRRN
|   C                     Z-ADDWRRN      RRN
|   C                     MOVEL*BLANKS   DOPT
|   C                     UPDATSFLSR
| 02-C                     END
|   C*
| 04-C           @RTNC     IFEQ '12'
|   C           @RTNC     OREQ '03'
|   C                     SETON                     42
| 04*C                     ELSE
|   C                     READCSFLSR                  4242
| 04-C                     END
|   C*
| 01-C                     END
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
11===C**         R1E00     BEGSR
|    C*
|    C*          #CSR      DIV  256       #LIN             *LINE
|    C*                    MVR            #COL             *COLUMN
|    C*
|    C* SFL POSITION KEEP-------------------------------------------*
|    C*                    Z-ADD#DRRN     DRRN
|    C*-------------------------------------------------------------*
11===C**                   ENDSR
     C*=============================================================*
     C*          R2N00 ....ROLLUP MAIN ROUTINE
     C*=============================================================*
12===C           R2N00     BEGSR
|    C*
| 01-C           @BOTOM    IFEQ 'Y'                        *EOF
|   C                     SETON                         96*LST PAG
|   C                     Z-ADDRRN       DRRN
| 01*C                     ELSE
|   C                     EXSR R2A10                      *ADD SFL DTA
| 01-C                     END
|    C*
12===C                     ENDSR
     C*==============================================================*
