      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : PCR045                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 02/21/94                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :零用金系統                                   *
      * REMARK       :科目成本中心統計表　　　　                   *
      ****************************************************************
     FPCWF01  IP  E           K        DISK
     FGLAFPF  IF  E           K        DISK
     FPT#BPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FPCR045P O   E             39     PRINTER
     ICA0
     I                                              CA17  L5
     I                                              CA04L L4
     I                                              CA05L L3
     I                                              CA04  L2
     I                                              CA05  L1
     I                                              CA06  L1
     I                                              CA07  L1
     I                                              CA08  L1
     I                                              CA09  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      201 2080$A8YMD
     I                                      501 505 $WRHUS
     I                                      513 513 $WRHTY
     I                                      598 5990$PRTID
     I                                      601 602 DCA01
     I                                      603 603 COMPS
     I                                      604 604 COMPE
     I                                      605 605 DSEL1
     I                                      608 608 DSEL3
     I                                      607 607 COMP
     I                                      611 6180YCA11S
     I                                      621 6280YCA11E
     I                                      631 639 DCA02S
     I                                      641 649 DCA02E
     I                                      651 6560DCA11S
     I                                      661 6660DCA11E
     I                                      671 6760DCA10S
     I                                      681 6860DCA10E
     I            DS
     I                                        1  20 CA06
     I                                        1   6 CA06L
     I                                        7  18 CA06N
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYCA     KLIST
     C                     KFLD           CA01
     C                     KFLD           CA04
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010
    C                     WRITEPH1
    C                     EXSR RTN010
  01*C                     ELSE
  02-C           *INL5     IFEQ '1'
    C                     EXSR RTN010
    C                     WRITEPH1
  02-C                     END
  01-C                     END
     C*
     C                     EXSR RTN100
     C*
     CL1 10                EXSR RTNL0
     CL2 10                SETOF                     30
     CL3 10                EXSR RTNL1
     CL4 10                EXSR RTNL2
     CL5 10                EXSR RTNL3
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*撥補別
|    C                     SETOF                     202122
| 03-C           DSEL1     IFEQ 'A'
|   C                     SETON                     20
| 03*C                     ELSE
| 04-C           DSEL1     IFEQ 'B'
|   C                     SETON                     21
| 04*C                     ELSE
|   C                     SETON                     22
| 04-C                     END
| 03-C                     END
|    C*支付別
|    C                     SETOF                     232425
| 05-C           DSEL3     IFEQ 'A'
|   C                     SETON                     23
| 05*C                     ELSE
| 06-C           DSEL3     IFEQ 'B'
|   C                     SETON                     24
| 06*C                     ELSE
|   C                     SETON                     25
| 06-C                     END
| 05-C                     END
|    C*公司
|    C           CA01      CHAIN#B0                  40
| 07-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   #B02
| 07-C                     END
|    C*辦事處
| 08-C           CA17      IFEQ '1'
|   C                     MOVEL'台北'  TEXT
| 08*C                     ELSE
| 09-C           CA17      IFEQ '2'
|   C                     MOVEL'台中'  TEXT
| 09*C                     ELSE
| 10-C           CA17      IFEQ '3'
|   C                     MOVEL'高雄'  TEXT
| 10*C                     ELSE
|   C                     MOVEL'全部'  TEXT
| 10-C                     END
| 09-C                     END
| 08-C                     END
|    C*
|    C                     SETON                     1031
|    C                     SETOF                     39
|    C*
|    C                     Z-ADD0         T1TOT1
|    C                     Z-ADD0         T0T1
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READ DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*金額
|    C                     ADD  CA12      T0T1
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTNL0
      *==============================================================*
02===C           RTNL0     BEGSR
|    C*
|    C*科目簡稱
|    C           KEYCA     CHAINAF0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   AF03
| 01-C                     END
|    C*員工代號
| 02-C           CA04      IFEQ '610701  '
|   C           CA04      OREQ '6122    '
|   C           CA04      OREQ '610401  '
|   C           CA04      OREQ '610402  '
|   C           CA04      OREQ '611201  '
|   C           CA04      OREQ '611202  '
|   C           CA04      OREQ '613201  '
|   C           CA06L     CHAINMC0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     MOVELMC02      CA06N
| 03-C                     END
| 02-C                     END
|    C*
|    C   39                EXSR RTN900
|   C                     WRITEPD1
|    C*
|    C                     SETON                     3031
|    C                     ADD  T0T1      T1TOT1
|    C                     Z-ADD0         T0T1
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNL1 ....WRITE PT1   SUBTOTAL
      *==============================================================*
04===C           RTNL1     BEGSR
|    C*
|    C   39                EXSR RTN900
| 01-C           T1TOT1    IFNE 0
|   C                     WRITEPT1
| 01-C                     END
|    C*
|    C                     SETOF                     31
|    C                     ADD  T1TOT1    T2TOT1
|    C                     Z-ADD0         T1TOT1
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTNL2 ....WRITE PT2   SUBTOTAL
      *==============================================================*
05===C           RTNL2     BEGSR
|    C*
|    C   39                EXSR RTN900
| 01-C           T2TOT1    IFNE 0
|   C                     WRITEPT2
| 01-C                     END
|    C*
|    C                     SETOF                     3031
|    C                     ADD  T2TOT1    T3TOT1
|    C                     Z-ADD0         T2TOT1
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTNL3 ....WRITE PT1   SUBTOTAL
      *==============================================================*
06===C           RTNL3     BEGSR
|    C   39                EXSR RTN900
|    C*
| 01-C           T3TOT1    IFNE 0
|   C                     WRITEPT3
| 01-C                     END
|    C*
|    C                     SETOF                     30
|    C                     Z-ADD0         T3TOT1
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTNLR  ...WRITE PT2
      *==============================================================*
07===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     MOVE DCA01     CA01
|   C                     MOVE COMP      CA17
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE3
| 01-C                     END
|   C                     WRITEPE2
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
08===C           RTN900    BEGSR
|    C*
|    C*公司
|    C           CA01      CHAIN#B0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   #B02
| 01-C                     END
|    C*辦事處
| 02-C           CA17      IFEQ '1'
|   C                     MOVEL'台北'  TEXT
| 02*C                     ELSE
| 03-C           CA17      IFEQ '2'
|   C                     MOVEL'台中'  TEXT
| 03*C                     ELSE
|   C                     MOVEL'高雄'  TEXT
| 03-C                     END
| 02-C                     END
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     3930
|    C*
08===C                     ENDSR
