     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     H*
     H*    PROGRAM ID   : PCR044
     H*    PROGRAM NAME : 零用金專案明細表
     H*    CREATE DATE  : 1992.12.28
     H*    UPDATE DATE  :
     H****************************************************************
     FGLAAPF  IF  E           K        DISK
     FGLAKPF  IF  E           K        DISK
     FPCR044D CF  E                    WORKSTN      KINFDS DSPFDS
     E*
     E*排序
     E                    W01         5  1 0
     E                    W011        5  1 0D            *SORT
     E*輸入欄位代碼
     E                    W02         5  2
     E                    W21         5  2
     E                    W22         5  2
     E*輸入欄位名稱
     E                    W03         5 20
     E*檢核程式名稱
     E                    W04         5 10
     E*輸入欄位內容－起
     E                    W05         4 20
     E*輸入欄位內容－訖
     E                    W06         4 20
     E*小計碼－螢幕
     E                    W07         5  1
     E*小計碼－ＢＹ排序
     E                    W08         5  1
     E*傳入參數名稱
     E                    W09         7 10
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      103 103 COUSER
     I                                      111 1160$CHYMD
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DCA01
     I                                      503 510 DCA04S
     I                                      511 518 DCA04E
     I                                      519 5250DCA10S
     I                                      526 5320DCA10E
     I                                      533 5400DCA10F
     I                                      541 5480DCA10T
     I                                      549 549 DOP
     I                                      550 550 DSORT
     I**
     I                                      551 560 W02
     I                                      551 552 DCA05A
     I                                      553 554 DCA06A
     I                                      555 556 DCA07A
     I                                      557 558 DCA08A
     I                                      559 560 DCA09A
     I**
     I                                      592 671 W05
     I                                      592 611 DCA05S
     I                                      612 631 DCA06S
     I                                      632 651 DCA07S
     I                                      652 671 DCA08S
     I                                      672 6790DCA09F
     I**
     I                                      680 759 W06
     I                                      680 699 DCA05E
     I                                      700 719 DCA06E
     I                                      720 739 DCA07E
     I                                      740 759 DCA08E
     I                                      760 7670DCA09T
     I**
     I                                      768 7720W01
     I                                      768 7680DS1
     I                                      769 7690DS2
     I                                      770 7700DS3
     I                                      771 7710DS4
     I                                      772 7720DS5
     I**
     I                                      773 777 W08
     I                                      778 778 DL6
     I                                      779 779 DL7
     I                                      852 901 W04
     I**
     I                                      911 920 W21
     I                                      911 912 DCA5AS
     I                                      913 914 DCA6AS
     I                                      915 916 DCA7AS
     I                                      917 918 DCA8AS
     I                                      919 920 DCA9AS
     I                                      921 930 W22
     I                                      921 922 DCA5AE
     I                                      923 924 DCA6AE
     I                                      925 926 DCA7AE
     I                                      927 928 DCA8AE
     I                                      929 930 DCA9AE
      *
     I                                      931 931 DCA17
     I                                      932 932 DCA17S
     I                                      933 933 DCA17E
     I                                      934 942 DCA02S
     I                                      943 951 DCA02E
     I*檢核程式之參數
     ICHKPGM      DS
     I                                        1   2 WAK01
     I                                        3  22 WPARM1
     I                                       23  32 WPARM2
     I                                       33  33 WCHK
     I            DS
     I                                        1   5 W07
     I                                        1   1 DL1
     I                                        2   2 DL2
     I                                        3   3 DL3
     I                                        4   4 DL4
     I                                        5   5 DL5
     I            DS
     I                                        1 100 W03
     I                                        1  20 DAA031
     I                                       21  40 DAA032
     I                                       41  60 DAA033
     I                                       61  80 DAA034
     I                                       81 100 DAA035
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN10     PARM *IN10     IN10    1
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYAA     KLIST
     C                     KFLD           DCA01
     C                     KFLD           W02,WI
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   10                EXSR R0200                      *INIT MSG.
     C  N10                EXSR R0100                      *INIT VALUE
     C*
     C                     MOVEL*BLANK    @PRT    1        *PRINT
     C*
  01-C           *IN03     DOUEQ'1'
    C           @PRT      OREQ 'Y'
    C                     EXSR R1000
  01-C                     END
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===CSR         R0100     BEGSR
|    C*
|    C                     SETON                     1027
|    C*
|    C                     IN   PTDA01
|    C*
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     CALL 'P31'
|    C                     PARM $A8YMD    P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $PFMT     P3104I  1
|    C                     PARM $PTYPE    P3105I  1
|    C           DDATE     PARM           P3101O  80
|    C*
|    C                     MOVE *BLANK    DCA01
|    C                     MOVE *BLANK    DCA04S
|    C                     MOVE *ALL'9'   DCA04E
|    C                     MOVE *BLANK    DCA02S
|    C                     MOVE *ALL'9'   DCA02E
|    C                     Z-ADD0         DCA10S
|    C                     Z-ADD0         DCA10E
|    C                     MOVE '2'       DSORT
|    C                     MOVE *BLANK    W02
|    C                     MOVE *BLANK    W03
|    C                     MOVE *BLANK    W05
|    C                     MOVE *ALL'9'   W06
|    C                     Z-ADD0         DCA09S
|    C                     Z-ADD*ALL'9'   DCA09E
|    C                     Z-ADD1         DS1
|    C                     Z-ADD2         DS2
|    C                     Z-ADD3         DS3
|    C                     Z-ADD4         DS4
|    C                     Z-ADD5         DS5
|    C                     MOVE *BLANK    W07
|    C                     MOVE *BLANK    DL6
|    C                     MOVE *BLANK    DL7
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C                     MOVEL*BLANK    DCA17
| 03-C           COUSER    IFGE '1'
|   C                     MOVELCOUSER    DCA17
| 03-C                     END
|    C                     MOVEL'1'       DOP
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ....INITIAL VALUE
     C*==============================================================*
02===CSR         R0200     BEGSR
|    C*
|    C                     SETON                     2799  報表格式MESSAGE
|    C*
| 01-C           $PENV     IFEQ '0'                        INQUIRY
|   C                     MOVEL'UPT2142' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C*
| 02-C           $PENV     IFEQ '1'                        ON-LINE
|   C                     MOVEL'UPT2140' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|    C*
| 03-C           $PENV     IFEQ '2'                        BATCH
|   C                     MOVEL'UPT2110' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C*
02===C                     ENDSR
     C*===============================================================*
     C*          R1000  ...SCREEN MAIN PROCESS
     C*===============================================================*
03===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
|   C                     EXSR R1E00                      .PROMPT
|   C                     GOTO E1000
| 02-C                     END
|    C*
|    C                     EXSR R1B00                      .CHECK      ?
|    C*
| 03-C           *IN99     IFEQ '0'
|   C           *IN14     ANDEQ'1'
|   C                     SETOF                     27
|   C                     SETON                     28    .執行中
|   C                     WRITEDSPD1
|   C                     SETOF                     28
|   C*
|   C                     OUT  LDA
|   C                     MOVEL'Y'       @PRT
| 03-C                     END
|    C*
03===C           E1000     ENDSR
     C*===============================================================*
     C*          R1B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
04===C           R1B00     BEGSR
|    C*
|    C*+<<DATA CHECK>>+++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
| 01-C           DCA01     IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO E1B00
|    C**
|    C* CHK 公司別須存在總帳控制檔(GLAKPF)
|    C**
|    C           DCA01     CHAINAK0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* GET傳票日期迄值(FILE->SCREEN)
| 03-C           DCA10E    IFEQ 0
|   C           AK12      ANDNE0
|   C                     Z-ADDAK12      P3101I
|   C*
|   C                     CALL 'P31'
|   C                     PARM           P3101I  80
|   C                     PARM '2'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM AK11      P3104I  1
|   C                     PARM AK09      P3105I  1
|   C           DCA10E    PARM           P3101O  80
| 03-C                     END
|    C*
|    C***
|    C* CHK會計科目
|    C***
| 04-C           DCA04S    IFGT DCA04E
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     767799
| 04-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* CHK日期
| 05-C           DCA10S    IFEQ 0
|   C                     Z-ADD0         DCA10F
| 05*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM DCA10S    P3001I  80
|   C                     PARM AK11      P3002I  1
|   C                     PARM AK09      P3003I  1
|   C                     PARM           P3001O  1
| 06-C           P3001O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7899
| 06-C                     END
| 07-C           *IN99     IFEQ '0'
|   C                     CALL 'P31'
|   C                     PARM DCA10S    P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           DCA10F    PARM           P3101O  80
| 07-C                     END
| 05-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* CHK日期
| 08-C           DCA10E    IFEQ 0
|   C                     Z-ADD0         DCA10T
| 08*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM DCA10E    P3001I  80
|   C                     PARM AK11      P3002I  1
|   C                     PARM AK09      P3003I  1
|   C                     PARM           P3001O  1
| 09-C           P3001O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7999
| 09-C                     END
| 10-C           *IN99     IFEQ '0'
|   C                     CALL 'P31'
|   C                     PARM DCA10E    P3101I  80
|   C                     PARM AK11      P3102I  1
|   C                     PARM AK09      P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C           DCA10T    PARM           P3101O  80
| 10-C                     END
| 08-C                     END
|    C   99                GOTO E1B00
|    C****
|    C* CHK日期起迄
| 11-C           DCA10F    IFGT DCA10T
|   C                     MOVEL'UPT0041' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     787999
| 11-C                     END
|    C   99                GOTO E1B00
      *
| 04-C           DCA02S    IFGT DCA02E
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     808199
| 04-C                     END
|    C   99                GOTO E1B00
|    C*
|    C****
|    C* CHK輸入欄位
|    C                     MOVE *BLANK    W03
| 12-C                     DO   5         WI      30
| 13-C           W02,WI    IFEQ *BLANK
|   C                     MOVE *LOVAL    W21,WI
|   C                     MOVE *HIVAL    W22,WI
| 14-C           W07,WI    IFNE *BLANK
|   C                     MOVEL'UPT0011' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C           60        ADD  WI        X       20
|   C                     MOVE '1'       *IN,X
|   C                     SETON                     99
| 14-C                     END
| 15-C           WI        IFNE 5
|   C                     MOVE *LOVAL    W05,WI
|   C                     MOVE *ALL'9'   W06,WI
| 15*C                     ELSE
|   C                     Z-ADD*ZEROS    DCA09S
|   C                     Z-ADD*ALL'9'   DCA09E
| 15-C                     END
| 13*C                     ELSE
|   C                     MOVE W02,WI    W21,WI
|   C                     MOVE W02,WI    W22,WI
|   C           KEYAA     CHAINAA0                  40
| 16-C           *IN40     IFEQ '0'
|   C                     MOVE AA03      W03,WI
|   C                     MOVE AA04      W04,WI
|   C                     MOVE AA05      W09,WI
| 16*C                     ELSE
|   C                     MOVE *BLANK    W03,WI
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C           80        ADD  WI        X       20
|   C                     MOVE '1'       *IN,X
|   C                     SETON                     99
| 16-C                     END
| 13-C                     END
| 12-C  N99                END
|    C   99                GOTO E1B00
|    C*
| 17-C           DCA05S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DCA05S
| 17-C                     END
|    C*
| 18-C           DCA05S    IFGT DCA05E
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     868799
| 18-C                     END
|    C   99                GOTO E1B00
|    C*
| 19-C           DCA06S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DCA06S
| 19-C                     END
|    C*
| 20-C           DCA06S    IFGT DCA06E
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     888999
| 20-C                     END
|    C   99                GOTO E1B00
|    C*
| 21-C           DCA07S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DCA07S
| 21-C                     END
|    C*
| 22-C           DCA07S    IFGT DCA07E
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     909199
| 22-C                     END
|    C   99                GOTO E1B00
|    C*
| 23-C           DCA08S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DCA08S
| 23-C                     END
|    C*
| 24-C           DCA08S    IFGT DCA08E
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     929399
| 24-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*排序不得重覆
| 25-C                     DO   4         WI
|   C           WI        ADD  1         WJ      10
|   C           W01,WI    LOKUPW01,WJ                   30
| 26-C           *IN30     IFEQ '1'
|   C           WJ        ADD  70        IN      20
|   C                     MOVE '1'       *IN,IN
|   C                     SETON                     99
|   C                     MOVEL'UGL0003' ERRID
|   C                     MOVEL'GLMF'    ERRF
| 26-C                     END
| 25-C  N99                END
|    C   99                GOTO E1B00
|    C*
|    C                     MOVEA*BLANKS   W08
| 27-C                     DO   5         WI
|   C                     Z-ADDW01,WI    WJ
|   C                     MOVE W07,WI    W08,WJ
| 27-C                     END
|    C*
|    C                     Z-ADDDCA09S    DCA09F
|    C                     Z-ADDDCA09E    DCA09T
|    C*
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
     C           DCA17     IFEQ *BLANK
     C                     MOVEL*LOVAL    DCA17S
     C                     MOVEL*HIVAL    DCA17E
     C                     ELSE
     C                     MOVELDCA17     DCA17S
     C                     MOVELDCA17     DCA17E
| 27-C                     END
|    C* CHK FUN AUT
| 28-C           $PENV     IFNE '2'
|   C           $INQ      ANDNE'Y'
|   C                     MOVEL'UPT2150' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 28-C                     END
|    C   99                GOTO E1B00
|    C*
04===CSR         E1B00     ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
05===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*輸入欄位１
| 01-C           #LIN      IFEQ 10
|   C           #COL      ANDGE5
|   C           #COL      ANDLE6
|   C                     CALL 'GLI420'
|   C                     PARM DCA01     P420I1  2
|   C           DCA05A    PARM DCA05A    P420I2  2
|   C                     PARM           @RTNC   2
| 01-C                     END
|    C*輸入欄位２
| 02-C           #LIN      IFEQ 11
|   C           #COL      ANDGE5
|   C           #COL      ANDLE6
|   C                     CALL 'GLI420'
|   C                     PARM DCA01     P420I1  2
|   C           DCA06A    PARM DCA06A    P420I2  2
|   C                     PARM           @RTNC   2
| 02-C                     END
|    C*輸入欄位３
| 03-C           #LIN      IFEQ 12
|   C           #COL      ANDGE5
|   C           #COL      ANDLE6
|   C                     CALL 'GLI420'
|   C                     PARM DCA01     P420I1  2
|   C           DCA07A    PARM DCA07A    P420I2  2
|   C                     PARM           @RTNC   2
| 03-C                     END
|    C*輸入欄位４
| 04-C           #LIN      IFEQ 13
|   C           #COL      ANDGE5
|   C           #COL      ANDLE6
|   C                     CALL 'GLI420'
|   C                     PARM DCA01     P420I1  2
|   C           DCA08A    PARM DCA08A    P420I2  2
|   C                     PARM           @RTNC   2
| 04-C                     END
|    C*輸入欄位５
| 05-C           #LIN      IFEQ 14
|   C           #COL      ANDGE5
|   C           #COL      ANDLE6
|   C                     CALL 'GLI420'
|   C                     PARM DCA01     P420I1  2
|   C           DCA09A    PARM DCA09A    P420I2  2
|   C                     PARM           @RTNC   2
| 05-C                     END
|    C*
|    C                     MOVE '1'       WCHK
|    C                     MOVE DCA01     WAK01
|    C*輸入欄位１（起）
| 06-C           #LIN      IFEQ 10
|   C           #COL      ANDGE29
|   C           #COL      ANDLE48
| 07-C           W04,1     IFNE *BLANK
|   C                     MOVE W05,1     WPARM1
|   C                     MOVE W09,1     WPARM2
|   C                     CALL W04,1
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C                     PARM           DESC   20
| 08-C           TORN      IFEQ 'Y'
|   C                     MOVE WPARM1    W05,1
| 08-C                     END
| 07-C                     END
| 06-C                     END
|    C*輸入欄位１（迄）
| 09-C           #LIN      IFEQ 10
|   C           #COL      ANDGE52
|   C           #COL      ANDLE71
| 10-C           W04,1     IFNE *BLANK
|   C                     MOVE W06,1     WPARM1
|   C                     MOVE W09,1     WPARM2
|   C                     CALL W04,1
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C                     PARM           DESC   20
| 11-C           TORN      IFEQ 'Y'
|   C                     MOVE WPARM1    W06,1
| 11-C                     END
| 10-C                     END
| 09-C                     END
|    C*輸入欄位２（起）
| 12-C           #LIN      IFEQ 11
|   C           #COL      ANDGE29
|   C           #COL      ANDLE48
| 13-C           W04,2     IFNE *BLANK
|   C                     MOVE W05,2     WPARM1
|   C                     MOVE W09,2     WPARM2
|   C                     CALL W04,2
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C                     PARM           DESC   20
| 14-C           TORN      IFEQ 'Y'
|   C                     MOVE WPARM1    W05,2
| 14-C                     END
| 13-C                     END
| 12-C                     END
|    C*輸入欄位２（迄）
| 15-C           #LIN      IFEQ 11
|   C           #COL      ANDGE52
|   C           #COL      ANDLE71
| 16-C           W04,2     IFNE *BLANK
|   C                     MOVE W06,2     WPARM1
|   C                     MOVE W09,2     WPARM2
|   C                     CALL W04,2
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C                     PARM           DESC   20
| 17-C           TORN      IFEQ 'Y'
|   C                     MOVE WPARM1    W06,2
| 17-C                     END
| 16-C                     END
| 15-C                     END
|    C*輸入欄位３（起）
| 18-C           #LIN      IFEQ 12
|   C           #COL      ANDGE29
|   C           #COL      ANDLE48
| 19-C           W04,3     IFNE *BLANK
|   C                     MOVE W05,3     WPARM1
|   C                     MOVE W09,3     WPARM2
|   C                     CALL W04,3
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C                     PARM           DESC   20
| 20-C           TORN      IFEQ 'Y'
|   C                     MOVE WPARM1    W05,3
| 20-C                     END
| 19-C                     END
| 18-C                     END
|    C*輸入欄位３（迄）
| 21-C           #LIN      IFEQ 12
|   C           #COL      ANDGE52
|   C           #COL      ANDLE71
| 22-C           W04,3     IFNE *BLANK
|   C                     MOVE W06,3     WPARM1
|   C                     MOVE W09,3     WPARM2
|   C                     CALL W04,3
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C                     PARM           DESC   20
| 23-C           TORN      IFEQ 'Y'
|   C                     MOVE *BLANK    W06,3
|   C                     MOVE WPARM1    W06,3
| 23-C                     END
| 22-C                     END
| 21-C                     END
|    C*輸入欄位４（起）
| 24-C           #LIN      IFEQ 13
|   C           #COL      ANDGE29
|   C           #COL      ANDLE48
| 25-C           W04,4     IFNE *BLANK
|   C                     MOVE W05,4     WPARM1
|   C                     MOVE W09,4     WPARM2
|   C                     CALL W04,4
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C                     PARM           DESC   20
| 26-C           TORN      IFEQ 'Y'
|   C                     MOVE *BLANK    W05,4
|   C                     MOVE WPARM1    W05,4
| 26-C                     END
| 25-C                     END
| 24-C                     END
|    C*輸入欄位４（迄）
| 27-C           #LIN      IFEQ 13
|   C           #COL      ANDGE52
|   C           #COL      ANDLE71
| 28-C           W04,4     IFNE *BLANK
|   C                     MOVE W06,4     WPARM1
|   C                     MOVE W09,4     WPARM2
|   C                     CALL W04,4
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C                     PARM           DESC   20
| 29-C           TORN      IFEQ 'Y'
|   C                     MOVE *BLANK    W06,4
|   C                     MOVE WPARM1    W06,4
| 29-C                     END
| 28-C                     END
| 27-C                     END
|    C*印表機
| 30-C           #LIN      IFEQ 20
|   C           #COL      ANDGE40
|   C           #COL      ANDLE41
|   C                     CALL 'P64I'
|   C           $PRTCD    PARM $PRTCD    P64II1  2
| 30-C                     END
|    C*
05===C                     ENDSR
