     H****************************************************************
     H*    PROGRAM ID   : PCR0441
     H*    PROGRAM NAME : 零用金專案明細表
     H*    CREATE DATE  : 1992.12.30
     H*    UPDATE DATE  :
     H****************************************************************
     FPCCALF01IP  E           K        DISK
     FGLWF17  O   E           K        DISK
     E*
     E*CA05-CA09 WORK FILE
     E                    W01W        5 20
     E*CA05-CA09 PCCAPF
     E                    W01F        5 20
     E*CA05A-CA09A SCREEN
     E                    W02S        5  2
     E*CA05A-CA09A FILE
     E                    W02F        5  2
     E*CA05A-CA09A *LDA
     E                    W02L        5  2
     E*排序 SCREEN
     E                    W03S        5  1 0
     I* A - E = 為螢幕上所輸入之排序
     I           UDS
     I                                      549 549 DOP
     I                                      550 550 DSORT
     I*
     I                                      551 560 W02S
     I                                      551 552 DCA05A
     I                                      553 554 DCA06A
     I                                      555 556 DCA07A
     I                                      557 558 DCA08A
     I                                      559 560 DCA09A
     I*
     I                                      951 960 W02L
     I*
     I                                      768 7720W03S
     I                                      768 7680A
     I                                      769 7690B
     I                                      770 7700C
     I                                      771 7710D
     I                                      772 7720E
     I*
     I                                        1  10 W02F
     I                                        1   2 CA05A
     I                                        3   4 CA06A
     I                                        5   6 CA07A
     I                                        7   8 CA08A
     I                                        9  10 CA09A
     I*
     I                                        1 100 W01F
     I                                        1  20 CA05
     I                                       21  40 CA06
     I                                       41  60 CA07
     I                                       61  80 CA08
     I                                       81 100 WCA09
     I*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C                     MOVE *BLANKS   W01W
     C                     MOVE *BLANKS   W02L
     C*
     C                     MOVE *BLANKS   WCA09
  01-C           CA09      IFNE 0
    C                     CALL 'P56'                      *P56(GET'/')
    C                     PARM CA09      P5601I  80
    C                     PARM           P5601O 10
    C                     MOVELP5601O    WCA09
  01-C                     END
     C*
     C                     Z-ADD1         I       10
     C                     DO   5         I
     C                     Z-ADD1         J       10
     C           W02F,I    LOKUPW02S,J                   30
     C           *IN30     IFEQ '1'
     C                     Z-ADDW03S,J    K       10
     C                     MOVE W01F,I    W01W,K
     C                     MOVE W02F,I    W02L,K
     C                     END
     C                     END
     C*
     C                     MOVE W01W,1    WF1701
     C                     MOVE W01W,2    WF1702
     C                     MOVE W01W,3    WF1703
     C                     MOVE W01W,4    WF1704
     C                     MOVE W01W,5    WF1705
  02-C           DSORT     IFEQ '1'
     C           DOP       IFEQ '1'
    C                     MOVE CA10      WF1706
     C                     ELSE
     C           DOP       IFEQ '2'
    C                     MOVE CA11      WF1706
     C                     ELSE
    C                     MOVE CA29      WF1706
     C                     END
     C                     END
    C                     MOVE CA04      WF1708
  02*C                     ELSE
    C                     MOVE CA04      WF1706
     C           DOP       IFEQ '1'
    C                     MOVE CA10      WF1708
     C                     ELSE
     C           DOP       IFEQ '2'
    C                     MOVE CA11      WF1708
     C                     ELSE
    C                     MOVE CA29      WF1708
     C                     END
     C                     END
  02-C                     END
     C                     MOVE CA02      WF1707
     C                     Z-ADDCA12      WF1709
     C                     Z-ADD0         WF1710
     C                     MOVE CA16      WF1711
     C                     WRITEGLWF17R
     C*
     CLR                   RETRN
