      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : PCR041                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 10/23/93                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :零用金系統                                   *
      * REMARK       :零用金明細表　　　　                         *
      ****************************************************************
     FPCCALF01IP  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FGLAFPF  IF  E           K        DISK
     FPT#BPF  IF  E           K        DISK
     FPCR041APO   E             39     PRINTER
     ICA0
     I                                              CA01  L3
     I                                              CA17  L2
     I                                              CA02  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      201 2080$A8YMD
     I                                      501 505 $WRHUS
     I                                      513 513 $WRHTY
     I                                      598 5990$PRTID
     I*
     I                                      601 602 DCA01
     I                                      603 603 CA17S
     I                                      604 604 CA17E
     I                                      605 605 DSEL1
     I                                      606 606 DSEL2
     I                                      607 607 DCA17
     I                                      611 6180YCA10S
     I                                      621 6280YCA10E
     I                                      631 639 DCA02S
     I                                      641 649 DCA02E
     I                                      651 6560DCA10S
     I                                      661 6660DCA10E
     I                                      671 6760DCA11S
     I                                      681 6860DCA11E
     I                                      720 720 IN20
     I                                      730 735 DCA28S
     I                                      740 745 DCA28E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYCA     KLIST
     C                     KFLD           CA01
     C                     KFLD           CA04
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C                     EXSR RTN100
     C*
     CL1 10                EXSR RTNL1
     CL2 10                EXSR RTNL2
     CL3 10                EXSR RTNL3
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*作業別
| 01-C           DSEL1     IFEQ 'A'
|   C                     MOVE '未撥補'TEXT1
| 01-C                     END
| 02-C           DSEL1     IFEQ 'B'
|   C                     MOVE '已撥補'TEXT1
| 02-C                     END
| 03-C           DSEL1     IFEQ 'C'
|   C                     MOVE '  *ALL  'TEXT1
| 03-C                     END
|    C*含作廢否
| 04-C           DSEL2     IFEQ 'Y'
|   C                     MOVE '含作廢'TEXT2
| 04*C                     ELSE
|   C                     MOVE *BLANK    TEXT2
| 04-C                     END
|    C*公司
|    C           CA01      CHAIN#B0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   #B02
| 05-C                     END
|    C*辦事處
| 06-C           CA17      IFEQ '1'
|   C                     MOVEL'台北'  TEXT
| 06*C                     ELSE
| 07-C           CA17      IFEQ '2'
|   C                     MOVEL'台中'  TEXT
| 07*C                     ELSE
| 08-C           CA17      IFEQ '3'
|   C                     MOVEL'高雄'  TEXT
| 08*C                     ELSE
|   C                     MOVEL'全部'  TEXT
| 08-C                     END
| 07-C                     END
| 06-C                     END
|    C*登帳或支付日期
| 09-C           IN20      IFEQ '0'
|   C                     SETOF                     20
| 09*C                     ELSE
|   C                     SETON                     20
| 09-C                     END
|    C*
|    C                     WRITEPH1
|    C                     SETON                     10
|    C*
|    C                     Z-ADD0         SUM
|    C                     Z-ADD0         SUM1
|    C                     Z-ADD0         SUM2
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READ DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*科目名稱
|    C           KEYCA     CHAINAF0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   AF03
| 01-C                     END
|    C*
|    C*申請人
|    C           CA28      CHAINMC0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   MC02
| 02-C                     END
|    C*
|    C*撥補日期格式轉換
|    C                     CALL 'P31'
|    C                     PARM CA29      P310I1  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '3'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           DCA29     PARM           P3101O  80
|    C*
|    C*支付日期格式轉換
|    C                     CALL 'P31'
|    C                     PARM CA11      P310I1  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '3'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           DCA11     PARM           P3101O  80
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPD1
| 03-C           CA16      IFNE *BLANKS
|   C                     WRITEPD2
| 03-C                     END
|    C                     SETON                     30
|    C*
|    C                     ADD  CA12      SUM
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTNL1 ....WRITE PT1   SUBTOTAL
      *==============================================================*
03===C           RTNL1     BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT1
|    C*
|    C                     SETOF                     30
|    C                     ADD  SUM       SUM1
|    C                     Z-ADD0         SUM
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNL2 ....WRITE PT1   SUBTOTAL
      *==============================================================*
04===C           RTNL2     BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT2
|    C*
|    C  NLR                SETON                     39
|    C                     SETOF                     30
|    C                     ADD  SUM1      SUM2
|    C                     Z-ADD0         SUM1
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTNL3 ....WRITE PT2   SUBTOTAL
      *==============================================================*
05===C           RTNL3     BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT3
|    C*
|    C  NLR                SETON                     39
|    C                     SETOF                     30
|    C                     Z-ADD0         SUM2
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTNLR  ...WRITE PT2
      *==============================================================*
06===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     MOVE DCA01     CA01
|   C  N10                EXSR RTN010
|   C                     WRITEPE3
| 01-C                     END
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPE2
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
07===C           RTN900    BEGSR
|    C*
|    C*公司
|    C           CA01      CHAIN#B0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   #B02
| 01-C                     END
|    C*辦事處
| 02-C           CA17      IFEQ '1'
|   C                     MOVEL'台北'  TEXT
| 02*C                     ELSE
| 03-C           CA17      IFEQ '2'
|   C                     MOVEL'台中'  TEXT
| 03*C                     ELSE
| 04-C           CA17      IFEQ '3'
|   C                     MOVEL'高雄'  TEXT
| 04*C                     ELSE
|   C                     MOVEL'全部'  TEXT
| 04-C                     END
| 03-C                     END
| 02-C                     END
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
07===C                     ENDSR
