     FGLAAPF  IP  E           K        DISK
     FGLAAPF@ O   E           K        DISK
     F            AA0                               KRENAMEAA0@
     C                     MOVE '11'      AA01
     C                     WRITEAA0@                   99
