     FGLAFPF  UP  E           K        DISK
     I            DS
     I                                        1   7 AF21
     I                                        1   1 AF211
     I                                        2   2 AF212
     I                                        3   3 AF213
     I                                        4   4 AF214
     I                                        5   5 AF215
     I                                        6   6 AF216
     I                                        7   7 AF217
     I*
     C           AF11      IFNE *BLANKS
     C                     MOVE '1'       AF211
     C                     END
     C           AF12      IFNE *BLANKS
     C                     MOVE '1'       AF212
     C                     END
     C           AF13      IFNE *BLANKS
     C                     MOVE '1'       AF213
     C                     END
     C           AF14      IFNE *BLANKS
     C                     MOVE '1'       AF214
     C                     END
     C           AF15      IFNE *BLANKS
     C                     MOVE '1'       AF215
     C                     END
     C           AF16      IFNE *BLANKS
     C                     MOVE '1'       AF216
     C                     END
     C           AF17      IFNE *BLANKS
     C                     MOVE '1'       AF217
     C                     END
     C                     UPDATAF0                    99
