     FGLA172F IP  E           K        DISK
     FGLAILF01UF  E           K        DISK
     FGLAFPF  IF  E           K        DISK
     C*===============================================================*
     C*                    KEY LIST
     C*===============================================================*
     C           KEYAI     KLIST
     C                     KFLD           WF01             公司別
     C                     KFLD           WF02             年度
     C                     KFLD           WF03             會計科目
     C                     KFLD           WF04A            欄位代碼－成
     C                     KFLD           WF05A            欄位代碼－對
     C                     KFLD           WF06A            欄位代碼－１
     C                     KFLD           WF07A            欄位代碼－２
     C                     KFLD           WF08A            欄位代碼－日
     C                     KFLD           WF04             成本中心
     C                     KFLD           WF05             對象別
     C                     KFLD           WF06             相關號碼1
     C                     KFLD           WF07             相關號碼2
     C                     KFLD           WF08             日期
     C           KEYAF     KLIST
     C                     KFLD           WF01             公司別
     C                     KFLD           WF03             會計科目
     C*===============================================================*
     C*                    MAIN
     C*===============================================================*
     C           KEYAI     CHAINAI0                  40
     C           *IN40     IFEQ '0'
     C                     Z-ADDWF12A     AI19A            借方交易金額9
     C                     Z-ADDWF12B     AI19B            貸方交易金額9
     C           KEYAF     CHAINAF0                  40
     C           AF06      IFEQ '1'                        借方
     C           WF12A     SUB  WF12B     AI19             科目餘額9
     C                     ELSE
     C           WF12B     SUB  WF12A     AI19             科目餘額9
     C                     ENDIF
     C                     UPDATAI0
     C                     ENDIF
