     A*****************************************************************
     A                                      UNIQUE
     A          R APP0
     A            APP01         10A         COLHDG('±b¸¹')
     A            APP02         10A         COLHDG('±K½X')
     A            APP03         50O         COLHDG('¦WºÙ')
     A          K APP01
