     A*****************************************************************
     A*          紀祇布厨(ARR096F)
     A*****************************************************************
     A                                      REF(RERF)
     A          R WF0
     A            WF01      R               COLHDG('祇布腹絏')
     A                                      REFFLD(SI02)
     A            WF02      R               COLHDG('祇布ら戳')
     A                                      REFFLD(SI21)
     A            WF03      R               COLHDG('祇布肂')
     A                                      REFFLD(SI25)
     A            WF04      R               COLHDG('め腹')
     A                                      REFFLD(SI08)
     A*
     A          K WF01
     A          K WF02
