     A*****************************************************************
     A*          禮盒組拆主檔(IMIMLF2)    KEY=IM05+IM10
     A*****************************************************************
     A          R IM0                       PFILE(IMIMPF)
     A          K IM05
     A**              ('禮盒代號')
     A          K IM10                      DESCEND
     A**              ('組拆日期')
