     A*****************************************************************
     A*          銷售資料檔(KIP019W) KEY= BA01+BA02+BB03
     A*****************************************************************
     A          R WW0
     A*
     A            BA01           8S 0       COLHDG(' 銷售日期 ')
     A            BA02           5A         COLHDG(' 物流點 ')
     A            BA03          12A         COLHDG(' 銷售單號 ')
     A            BA04          11S 2       COLHDG(' 總金額 ')
     A            BA05           1A         COLHDG(' 狀態 ')
     A            BA06           2A         COLHDG(' 單別 ')
     A            BA07         128O         COLHDG(' 備註 ')
     A            BA08           2A         COLHDG(' 試飲原因 ')
     A            BA09          10A         COLHDG(' 確認人員 ')
     A            BA10           1A         COLHDG(' 直客碼')
     A            BA11          15A         COLHDG('VIP碼-電話')
     A            BA12           5A         COLHDG('  VIP碼-分機')
     A            BAXX           8S 0       COLHDG(' 異動日期 ')
     A            BAYY           6S 0       COLHDG(' 異動時間 ')
     A            BAZZ          10A         COLHDG(' 異動人員 ')
     A            BB01          12A         COLHDG(' 銷售單號 ')
     A            BB02           6S 0       COLHDG(' 銷售序號 ')
     A            BB03           9A         COLHDG(' 產品代號 ')
     A            BB04           8S 0       COLHDG(' 銷售數量 ')
     A            BB05           8S 0       COLHDG(' 搭贈數量 ')
     A            BB06           8S 0       COLHDG(' 試飲數量 ')
     A            BB07          11S 2       COLHDG(' 金額 ')
     A            BB08           9S 2       COLHDG('  F.O.B.-UNIT')
     A            BB08A          9S 2       COLHDG('  FHI   -UNIT')
     A            BB08B          9S 2       COLHDG('  DUTY  -UNIT')
     A            BB09           1A         COLHDG(' 狀態 ')
     A            BB10         128O         COLHDG(' 備註 ')
     A            BB11           1A         COLHDG(' 課稅別 ')
     A            BBXX           8S 0       COLHDG(' 異動日期 ')
     A            BBYY           6S 0       COLHDG(' 異動時間 ')
     A            BBZZ          10A         COLHDG(' 異動人員 ')
     A*
     A          K BA01
     A          K BA02
     A          K BB03
