     A*****************************************************************
     A*          客戶基本資料延伸檔           KEY=MJ01
     A*****************************************************************
     A                                      UNIQUE
     A          R MJ0                       PFILE(MTMJPF)
     A          K MJ01
     A          S MJ03                      COMP(EQ 'N')
