     A*****************************************************************
     A*          大戶客戶維護(MTMSPF)   KEY=MS01
     A*****************************************************************
     A                                      REF(RERF)
     A                                      UNIQUE
     A          R MS0
     A*
     A            MS01      R               COLHDG('客戶代號')
     A                                      REFFLD(MD01)
     A            MS02      R               COLHDG('客戶簡稱')
     A                                      REFFLD(ME04)
     A            MS03           2A         COLHDG('大區')
     A            MS04           5A         COLHDG('組別')
     A            MS05      R               COLHDG('員工代號')
     A                                      REFFLD(MC01)
     A            MS06      R               COLHDG('員工姓名')
     A                                      REFFLD(MC02)
     A            MS07           5A         COLHDG('通路')
     A            MS08           7A         COLHDG('通路細分')
     A*
     A            MSXX      R               COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            MSYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            MSZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*
     A          K MS01
