     A*****************************************************************
     A*          發票號碼設定資料檔(POR069LF)KEY=EX01
     A*****************************************************************
     A          R EX0                       PFILE(POR069PF)
     A          K EX01
     A**              ('項目')
