     A*****************************************************************
     A*00A需求單號: 1040892                                         *
     A*00A 2015/10/05 DEREK刪除W0005大榮完稅倉                    *
     A*                    新增W0006合邦                          *
     A*00B需求單號: 1070026                                         *
     A*00B 2018/01/05 DEREK新增W0005特捷完稅倉                    *
     A*00B                 位置：請安排在B1001後方                *
     A*00C需求單號: 1120204                                         *
     A*00C 2023/04/07 KENNY新增物流點: B0021台北忠五門市          *
     A*00D需求單號: 1130064                                         *
     A*00D 2024/02/06 KEVIN新增物流點: W0004,W0009,W0011,W0012,     *
     A*                                  W0013,W0014,W0015,W0016      *
     A*00E需求單號: 1130095                                         *
     A*00E 2024/03/05 DEREK新增物流點: W0001                        *
     H*00F需求單號: 1130114
     H*00F 2024/03/18 DEREK新增顯示物流點庫存: B0001
     A*00G需求單號: 1140009
     A*00G 2025/01/08 CLEMENT新增顯示物流點庫存: W0002,W0003,W0007
     A*                                            W0008,W0010
     A*****************************************************************
     A                                      REF(RERF)
     A          R WF0
     A            WF01      R               COLHDG('產品代號')
     A                                      REFFLD(IA03)
     A            WF02      R               COLHDG('產品簡稱')
     A                                      REFFLD(MA03)
     A            WF03      R               COLHDG('單位成本')
     A                                      REFFLD(MA34)
     A            WF04      R               COLHDG('年終年月')
     A                                      REFFLD(IY15 IMIYPF)
     A            WF05          11S 2       COLHDG('牌價')
     A            B0000     R               COLHDG('B0000')
     A                                      REFFLD(IA06)
 00F+A            B0001     R               COLHDG('B0001')
 00F+A                                      REFFLD(IA06)
     A            B0003     R               COLHDG('B0003')
     A                                      REFFLD(IA06)
     A            B0006     R               COLHDG('B0006')
     A                                      REFFLD(IA06)
     A            B0007     R               COLHDG('B0007')
     A                                      REFFLD(IA06)
     A            B0011     R               COLHDG('B0011')
     A                                      REFFLD(IA06)
     A            B0013     R               COLHDG('B0013')
     A                                      REFFLD(IA06)
     A            B0014     R               COLHDG('B0014')
     A                                      REFFLD(IA06)
     A            B0015     R               COLHDG('B0015')
     A                                      REFFLD(IA06)
     A            B0017     R               COLHDG('B0017')
     A                                      REFFLD(IA06)
     A            B0018     R               COLHDG('B0018')
     A                                      REFFLD(IA06)
     A            B0019     R               COLHDG('B0019')
     A                                      REFFLD(IA06)
 00C+A            B0021     R               COLHDG('B0021')
 00C+A                                      REFFLD(IA06)
     A            B0022     R               COLHDG('B0022')
     A                                      REFFLD(IA06)
     A            B0025     R               COLHDG('B0025')
     A                                      REFFLD(IA06)
     A            B0026     R               COLHDG('B0026')
     A                                      REFFLD(IA06)
     A            B0030     R               COLHDG('B0030')
     A                                      REFFLD(IA06)
     A            B0031     R               COLHDG('B0031')
     A                                      REFFLD(IA06)
     A            B0032     R               COLHDG('B0032')
     A                                      REFFLD(IA06)
     A            B0033     R               COLHDG('B0033')
     A                                      REFFLD(IA06)
     A            B0034     R               COLHDG('B0034')
     A                                      REFFLD(IA06)
     A            B0099     R               COLHDG('B0099')
     A                                      REFFLD(IA06)
     A            B1001     R               COLHDG('B1001')
     A                                      REFFLD(IA06)
 00A-A*           W0005     R               COLHDG('W0005')
 00A-A*                                     REFFLD(IA06)
 00E+A            W0001     R               COLHDG('W0001')
 00E+A                                      REFFLD(IA06)
 00G+A            W0002     R               COLHDG('W0002')
 00G+A                                      REFFLD(IA06)
 00G+A            W0003     R               COLHDG('W0003')
 00G+A                                      REFFLD(IA06)
 00D+A            W0004     R               COLHDG('W0004')
 00D+A                                      REFFLD(IA06)
 00B+A            W0005     R               COLHDG('W0005')
 00B+A                                      REFFLD(IA06)
 00A+A            W0006     R               COLHDG('W0006')
 00A+A                                      REFFLD(IA06)
 00G+A            W0007     R               COLHDG('W0007')
 00G+A                                      REFFLD(IA06)
 00G+A            W0008     R               COLHDG('W0008')
 00G+A                                      REFFLD(IA06)
 00D+A            W0009     R               COLHDG('W0009')
 00D+A                                      REFFLD(IA06)
 00G+A            W0010     R               COLHDG('W0010')
 00G+A                                      REFFLD(IA06)
 00D+A            W0011     R               COLHDG('W0011')
 00D+A                                      REFFLD(IA06)
 00D+A            W0012     R               COLHDG('W0012')
 00D+A                                      REFFLD(IA06)
 00D+A            W0013     R               COLHDG('W0013')
 00D+A                                      REFFLD(IA06)
 00D+A            W0014     R               COLHDG('W0014')
 00D+A                                      REFFLD(IA06)
 00D+A            W0015     R               COLHDG('W0015')
 00D+A                                      REFFLD(IA06)
 00D+A            W0016     R               COLHDG('W0016')
 00D+A                                      REFFLD(IA06)
     A            W9999     R               COLHDG('W9999')
     A                                      REFFLD(IA06)
      *
     A          K WF01
