     A          R F870
     A*
     A            F8700          9A         COLHDG('玻珇腹')
     A            F8701A         9S 0       COLHDG('计秖')
     A            F8701B        13S 0       COLHDG('肂')
     A            F8702A         9S 0       COLHDG('计秖')
     A            F8702B        13S 0       COLHDG('肂')
     A            F8703A         9S 0       COLHDG('计秖')
     A            F8703B        13S 0       COLHDG('肂')
     A            F8704A         9S 0       COLHDG('计秖')
     A            F8704B        13S 0       COLHDG('肂')
     A            F8705A         9S 0       COLHDG('计秖き')
     A            F8705B        13S 0       COLHDG('肂き')
     A            F8706A         9S 0       COLHDG('计秖せ')
     A            F8706B        13S 0       COLHDG('肂せ')
     A            F8707A         9S 0       COLHDG('计秖')
     A            F8707B        13S 0       COLHDG('肂')
     A            F8708A         9S 0       COLHDG('计秖')
     A            F8708B        13S 0       COLHDG('肂')
     A            F8709A         9S 0       COLHDG('计秖')
     A            F8709B        13S 0       COLHDG('肂')
     A            F8710A         9S 0       COLHDG('计秖')
     A            F8710B        13S 0       COLHDG('肂')
     A            F8711A         9S 0       COLHDG('计秖')
     A            F8711B        13S 0       COLHDG('肂')
     A            F8712A         9S 0       COLHDG('计秖')
     A            F8712B        13S 0       COLHDG('肂')
     A            F8713A         7S 0       COLHDG('计秖Ω')
     A            F8713B         7S 0       COLHDG('肂Ω')
     A            F8714          9S 0       COLHDG('畐秖')
     A*
     A          K F8700
