     A*****************************************************************
     A*          客戶銷售目標資料檔(SOFAPF)  KEY=FA01+FA02
     A*****************************************************************
     A                                      REF(RERF)
     A                                      UNIQUE
     A          R FA0
     A*
     A            FA01           4 00       COLHDG('年度')
     A                                      REFFLD(ST02)
     A            FA02      R               COLHDG('客戶代號')
     A                                      REFFLD(MD01)
     A            FA03           9  0       COLHDG('預估銷售金額')
     A*
     A            FAXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(SKXX)
     A            FAYY      R               COLHDG('異動時間')
     A                                      REFFLD(SKYY)
     A            FAZZ      R               COLHDG('異動者　')
     A                                      REFFLD(SKZZ)
     A          K FA01
     A          K FA02
