     A*****************************************************************
     A*          寄賣客戶產品異動報表(SOR170W)
     A*****************************************************************
     A          R WK0
     A            WK01           3S 0       COLHDG('序號')
     A            WK02           8S 0       COLHDG('日期')
     A*
     A          K WK01
