     A          R S60                       PFILE(SOS6PF)
     A*
     A            S601      R               COLHDG('公司別')
     A            S602      R               COLHDG('單據號碼')
     A            S603      R               COLHDG('產品編號')
     A            S604      R               COLHDG('活動客戶代號')
     A            S604A              I      SST(S604 1 5)
     A                                      COLHDG('活動客戶代號')
     A            S604B              I      SST(S604 6 4)
     A                                      COLHDG('活動客戶分店')
     A            S605      R               COLHDG('數量')
     A            S606      R               COLHDG('文字一')
     A            S607      R               COLHDG('文字二')
     A            S608      R               COLHDG('文字三')
     A            S609      R               COLHDG('數字一')
     A            S610      R               COLHDG('數字一')
     A            S611      R               COLHDG('數字一')
     A            S612      R               COLHDG('備註一')
     A            S613      R               COLHDG('備註一')
     A            S614      R               COLHDG('備註一')
     A            S615      R               COLHDG('控制一')
     A            S616      R               COLHDG('控制一')
     A            S617      R               COLHDG('控制一')
     A            S6XX      R               COLHDG('異動日期')
     A            S6YY      R               COLHDG('異動時間')
     A            S6ZZ      R               COLHDG('異動者　')
     A*
     A          K S602
     A          K S603
     A          K S604A
     A          K S604B
