     A*****************************************************************
     A*          銷貨退回主檔(SOSGLF05)  KEY=SG26+SG02
     A*****************************************************************
     A          R SG0                       PFILE(SOSGPF)
     A          K SG26
     A**             ('折讓日期')
     A          K SG02
     A**             ('退貨單號')
