     A*****************************************************************
     A*          發票主檔(SOSILF13)
     A*****************************************************************
     A          R SI0                       PFILE(SOSIPF)
     A          K SI01
     A*公司別
     A          K SI10
     A*訂單編號
     A          K SI11
     A*送貨單號
