     A*****************************************************************
     A*          VIP基本資料重複檔(W1VPPF1)   KEY=VP02
     A*****************************************************************
     A                                      UNIQUE
     A          R W10
     A*
     A            W101           5A         COLHDG('專櫃代號')
     A            W102          15A         COLHDG('電話號碼')
     A            W1021          5A         COLHDG('分機號碼')
     A            W103          42O         COLHDG('姓名')
     A            W1041          2S 0       COLHDG('出生月份')
     A            W1042          2S 0       COLHDG('出生日期')
     A            W105           1A         COLHDG('性別')
     A*                                     M-男
     A*                                     F-女
     A*                                     ''-法人
     A            W106          62O         COLHDG('聯絡地址')
     A            W107          42O         COLHDG('服務單位統一編號')
     A            W108          30A         COLHDG('E-MAIL ADDRESS')
     A            W109           1A         COLHDG('接受活動訊息')
     A*                                     Y-願意
     A*                                     N-不願意
     A            W110           1A         COLHDG('手機簡訊')
     A*                                     V-選擇
     A*                                     ''-不選擇
     A            W111           1A         COLHDG('DM通知')
     A*                                     V-選擇
     A*                                     ''-不選擇
     A            W112           1A         COLHDG('EMAIL通知')
     A*                                     V-選擇
     A*                                     ''-不選擇
     A            W113           1A         COLHDG('電話通知')
     A*                                     V-選擇
     A*                                     ''-不選擇
     A            W114           1A         COLHDG('有效客戶')
     A*                                     A-有效
     A*                                     B-無效
     A*
     A          K W102
     A          K W1021
     A          K W101
     A          K W108
     A          K W105
     A          K W103
     A          K W109
     A          K W110
     A          K W111
     A          K W112
     A          K W113
