     A*****************************************************************
     A*          產品抽成設定主檔(W3EAPF) KEY= EA01
     A*****************************************************************
     A          R EA0                       PFILE(W3EAPF)
     A*
     A          K EA01                      DESCEND
