     A*****************************************************************
     A*          產品抽成設定明細檔(W3EBPF) KEY= EB01+EB02
     A*****************************************************************
     A                                      UNIQUE
     A          R EB0
     A*
     A            EB01           6S 0       COLHDG('年月')
     A            EB02           9A         COLHDG('產品代號')
     A            EB03           4S 2       COLHDG('抽成百分比')
     A*
     A            EBXX           8S 0       COLHDG(' 異動日期 ')
     A            EBYY           6S 0       COLHDG(' 異動時間 ')
     A            EBZZ          10A         COLHDG(' 異動人員 ')
     A*
     A          K EB01
     A          K EB02
