     A*****************************************************************
     A*          單瓶獎金設定主檔(W3ECPF) KEY= EC01
     A*****************************************************************
     A          R EC0                       PFILE(W3ECPF)
     A*
     A          K EC01                      DESCEND
