     A          R WF0
     A*
     A            WF01           9A         COLHDG('產品編號')
     A            WF02           6S 0       COLHDG('完稅庫存量')
