     A          R WF0
     A*
     A            WF01           9A         COLHDG('產品編號')
     A            WF02           5A         COLHDG('物流點代號')
     A            WF03           6S 0       COLHDG('銷貨量')
