     A          R ZSJ0
     A            ZSJ01     R               COLHDG('そ')
     A                                      REFFLD(SJ01 SOSJPF)
     A            ZSJ02A    R               COLHDG('祇布腹絏')
     A                                      REFFLD(SJ02 SOSJPF)
     A            ZSJ02     R               COLHDG('祇布腹絏')
     A                                      REFFLD(SJ02 SOSJPF)
     A            ZSJ11     R               COLHDG('め腹⌒祇布')
     A                                      REFFLD(SJ11 SOSJPF)
     A            ZSJ12     R               COLHDG('だ┍腹⌒祇布')
     A                                      REFFLD(SJ12 SOSJPF)
     A          K ZSJ01
     A          K ZSJ02A
     A          K ZSJ02
