     A                                      UNIQUE
     A          R ZSC0
     A            ZSC01     R               COLHDG('公司別')
     A                                      REFFLD(SC01 SOSCPF)
     A            ZSC02     R               COLHDG('訂單號碼')
     A                                      REFFLD(SC02 SOSCPF)
     A            ZSC29     R               COLHDG('送貨單號')
     A                                      REFFLD(SC29 SOSCPF)
     A            ZSC30     R               COLHDG('發票號碼')
     A                                      REFFLD(SC30 SOSCPF)
     A          K ZSC02
