     A                                      UNIQUE
     A          R ZSE0
     A            ZSE01     R               COLHDG('公司別')
     A                                      REFFLD(SE01 SOSEPF)
     A            ZSE02     R               COLHDG('送貨單號')
     A                                      REFFLD(SE02 SOSEPF)
     A            ZSE29     R               COLHDG('訂單號碼')
     A                                      REFFLD(SE29 SOSEPF)
     A            ZSE30     R               COLHDG('發票號碼')
     A                                      REFFLD(SE30 SOSEPF)
     A          K ZSE02
