     A          R I00
     A            I01           32O         COLHDG('系列名稱')
     A            I02            2A         COLHDG('品牌')
     A            I03           32O         COLHDG('品牌名稱')
     A            I04            7A         COLHDG('產品代號')
